{
  "error": "Expecting value: line 1 column 1 (char 0)",
  "raw": "THE ENFORCEMENT OF SHARI’AH ACT, 1991 CONTETNS 1. Short title, extent and commencement 2. Definition 3. Supremacy of Shari’ah 4. Laws to be interpreted in the light of Shari’ah 5. Observance of Shari’ah by Muslim citizens 6. Teaching of, and training in, Shari’ah etc. 7. Islamization of education 8. Islamization of economy 9. Mass media to promote Islamic values 10. Protection of life, liberty, property, etc. 11. Elimination of bribery and corruption 12. Eradication of obscenity, vulgarity, etc. 13. Eradication of social evils 14. Nizam-i-adl 15. Bait-ul-Mal (Welfare Fund) 16. Protection of the ideology of Pakistan, etc. 17. Safeguard against false imputations, etc. 18. International financial obligations, etc. 19. Fulfillment of existing obligations 20. Rights of women not to be affected 21. Laws to be enacted by Majlis-e-Shoora (Parliament) and Provincial Assembly only 22. Rules THE ENFORCEMENT OF SHARI’AH ACT, 1991 ACT NO. X of 1991 [5th June, 1991] An Act for the enforcement of the Shari’ah WHEREAS sovereignty over the entire Universe belongs to Almighty Allah alone, and the authority to be exercised by the people of Pakistan through their chosen representatives within the limits prescribed by Him is a sacred trust; AND WHEREAS Islam has been declared to be the State religion of Pakistan and it is obligatory for all Muslims to follow the Injunctions of the Holy Quran and Sunnah to regulate and order their lives in complete submission to the Divine law; AND WHEREAS the Objectives Resolution has been incorporated in the Constitution of the Islamic Republic of Pakistan as a substantive part thereof; AND WHEREAS it is one of the fundamental obligations of the Islamic State to protect the honour, life, liberty and the fundamental rights of the citizens as guaranteed under the Constitution and to ensure peace and provide inexpensive and speedy justice to people through an independent Islamic system of justice without any discrimination ; AND WHEREAS Islam enjoins esta",
  "source_file": "administrator0514adf6314402fef39409941c94e967.txt",
  "law_name": "Ah Act, 1991",
  "year": 1991
}