{
  "law_name": "COMSATS Institute of Information Technology Ordinance",
  "year": 2000,
  "chapters": [
    {
      "chapter_title": "Contents",
      "sections": [
        {
          "section_no": "1",
          "section_title": "Short title and commencement",
          "body": "This Ordinance may be called the COMSATS Institute of Information Technology Ordinance, 2000. It shall come into force at once."
        },
        {
          "section_no": "2",
          "section_title": "Definitions",
          "body": "In this Ordinance, unless there is anything repugnant in the subject or context, various definitions are provided for terms such as 'Academic Council', 'Authority', 'Board', 'Chancellor', 'COMSATS', 'Dean', 'Department', 'Director', 'Faculty', 'Institute', 'Patron', 'prescribed', 'Rector', and 'teacher'."
        },
        {
          "section_no": "3",
          "section_title": "Establishment and incorporation of the Institute",
          "body": "There shall be established, in accordance with the provisions of this Ordinance, an Institute to be called the COMSATS Institute of Information Technology consisting of the Patron, the Chancellor, the Board, the Rector, the Directors, and such other officers as may be prescribed."
        },
        {
          "section_no": "4",
          "section_title": "Powers and functions of the Institute",
          "body": "The Institute shall have the powers to provide for instruction and training in computer and information technology, admit and examine students, hold examinations, confer degrees, prescribe courses of studies, demand fees, appoint officers, affiliate educational institutions, manage property, and enter into agreements."
        },
        {
          "section_no": "5",
          "section_title": "Institute open to all classes, etc.",
          "body": "The Institute shall be open to all persons of either sex of whatever religion, race, creed, colour or domicile who are academically qualified for admission to the courses of study offered by the Institute."
        },
        {
          "section_no": "6",
          "section_title": "Teaching and examinations",
          "body": "The academic programmes of the Institute shall be conducted in the prescribed manner, and the degree awarding programmes shall conform to the approved criteria of the University Grants Commission."
        },
        {
          "section_no": "7",
          "section_title": "Authorities of the Institute",
          "body": "The Authorities of the Institute shall include the Academic Council, the Board, the Board of Studies, the Selection Board, and such other Authorities as may be specified by regulations."
        },
        {
          "section_no": "8",
          "section_title": "Officers of the Institute",
          "body": "The officers of the Institute shall include the Patron, the Chancellor, the Rector, Directors, Registrar, and such other persons as may be specified by regulations."
        },
        {
          "section_no": "9",
          "section_title": "Patron",
          "body": "The President of the Islamic Republic of Pakistan shall be the Patron of the Institute and shall preside at the convocation."
        },
        {
          "section_no": "10",
          "section_title": "Visitation",
          "body": "The Patron may cause an inspection or inquiry to be made in respect of any matter connected with the affairs of the Institute."
        },
        {
          "section_no": "11",
          "section_title": "Chancellor",
          "body": "The Minister for Science and Technology shall be the Chancellor of the Institute and may annul proceedings not in accordance with the provisions of this Ordinance."
        },
        {
          "section_no": "12",
          "section_title": "Rector",
          "body": "The Board may appoint the Rector who shall be the principal academic and administrative officer of the Institute."
        },
        {
          "section_no": "13",
          "section_title": "Board of Governors",
          "body": "The general supervision and control of administrative, academic and financial affairs of the Institute shall vest in a Board of Governors consisting of various members including the Executive Director, COMSATS."
        }
      ]
    }
  ],
  "source_file": "administrator8d7192377f97c927f63fc68a280f2e87.txt"
}