{
  "law_name": "CUTTING OF TREES (PROHIBITION) ACT",
  "year": 1992,
  "chapters": [
    {
      "chapter_title": "Contents",
      "sections": [
        {
          "section_no": "1",
          "section_title": "Short title, extent and commencement",
          "body": "This Act may be called the Cutting of Trees (Prohibition) Act, 1992. It extends to the whole of Pakistan and shall come into force at once."
        },
        {
          "section_no": "2",
          "section_title": "Definitions",
          "body": "In this Act, unless there is anything repugnant in the subject or context, ‘authorised officer’ means an officer authorised by a Provincial Government; ‘field’ means a khasra number as defined in the Provincial law relating to land revenue; ‘first zone’ means an area adjacent to and beyond the external frontier of Pakistan extending towards Pakistan to a line at four kilometers measured from the external frontiers of Pakistan; ‘second zone’ means an area adjacent to and beyond the first zone extending towards Pakistan to a line at four kilometers measured from the first zone; and ‘tree’ means a large plant with a self-supporting trunk."
        },
        {
          "section_no": "3",
          "section_title": "Cutting of trees etc. Prohibited",
          "body": "Except as hereinafter provided, no person shall, without the prior written approval of the authorised officer, cut, fell or damage or cause to be cut, felled or damaged any tree growing in the first zone, if the number of remaining trees in any field falls short of the number to be calculated at the rate of fifteen trees per acre; and in the second zone, if the number of remaining trees in any field falls short of the number to be calculated at the rate of ten trees per acre. Nothing contained in sub-section (1) shall apply to a tree growing on land occupied as the site of a town or village or in a dwelling-house, including its curtilage."
        },
        {
          "section_no": "4",
          "section_title": "Penalty",
          "body": "Whoever contravenes the provisions of this Act shall be guilty of an offence punishable with fine which may extend to five thousand rupees, if the contravention relates to the first zone; and with fine which may extend to two thousand and five hundred rupees, if the contravention relates to the second zone."
        },
        {
          "section_no": "5",
          "section_title": "Cognizance of offences",
          "body": "No court shall take cognizance of an offence under this Act, except on a complaint by the authorised officer or the local formation commander of the Pakistan Army."
        },
        {
          "section_no": "6",
          "section_title": "Seizure and confiscation of Property",
          "body": "When any tree has been cut, felled or damaged in contravention of the provisions of this Act or rules made thereunder, such tree together with all tools used in committing any such contravention may be seized by the authorised officer. Every officer seizing any property under this section shall place on such property a mark indicating that the same has been so seized and shall, as soon as may be, make report of such seizure to the Magistrate having jurisdiction to try the offence under this Act. Upon the receipt of any such report, the Magistrate shall, with all convenient despatch, take such measures as may be necessary for the trial of the offender and the disposal of the property according to law. Any tree in respect of which an offence has been committed under this Act and all tools used in committing any such offence shall be liable to confiscation, and such confiscation shall be in addition to any other punishment prescribed for such offence."
        },
        {
          "section_no": "7",
          "section_title": "Power to prevent commission of offences",
          "body": "The authorised officer shall prevent the commission of any offence under this Act and for that purpose may take such measures as may be prescribed by the rules under this Act."
        },
        {
          "section_no": "8",
          "section_title": "Provincial Governments to demarcate zones",
          "body": "The Provincial Governments may, whenever it may deem expedient, cause the zones defined in section 2 to be demarcated and the trees growing in any zone to be enumerated."
        },
        {
          "section_no": "9",
          "section_title": "Power to enter etc.",
          "body": "Any authorised officer or any other person authorized to demarcate the zones and enumerate the trees shall be entitled to enter upon any land, and to survey and land; to make map of any zone; to erect or cause to be erected boundaries marks; and to blaze any tree."
        },
        {
          "section_no": "10",
          "section_title": "Rules",
          "body": "The Provincial Government may make rules for carrying out the purposes of this Act."
        },
        {
          "section_no": "11",
          "section_title": "Repeal",
          "body": "The Cutting of Trees (Prohibition) Act, 1975 (LXXIV of 1975) is hereby repealed."
        }
      ]
    }
  ],
  "source_file": "administrator9d4c986b4fe62903074252ddba5eeca3.txt"
}