{
  "law_name": "Iqbal Academy Ordinance",
  "year": 1962,
  "chapters": [
    {
      "chapter_title": "PRELIMINARY",
      "sections": [
        {
          "section_no": "1",
          "section_title": "Short title, extent and commencement",
          "body": "(1) This Ordinance may be called the Iqbal Academy Ordinance, 1962. (2) It extends to the whole of Pakistan. (3) It shall come into force at once."
        },
        {
          "section_no": "2",
          "section_title": "Definitions",
          "body": "In this Ordinance, unless there is anything repugnant in the subject or context: (a) “Academy” means the Iqbal Academy constituted under section 3; (b) “Act” means the Iqbal Academy Act, 1951 (IV of 1951); (c) “Governing Body” means the Governing Body of the Academy; (d) “Executive Committee” means the Executive Committee of the Academy; (e) “prescribed” means prescribed by rules made under this Ordinance; (f) “President”, “Vice President”, “Treasurer”, “Honorary Members,” “Life-Members” and Members mean the President, Vice President, Treasurer, Honorary Members, Life Members, and Members of the Academy, respectively."
        }
      ]
    },
    {
      "chapter_title": "THE ACADEMY",
      "sections": [
        {
          "section_no": "3",
          "section_title": "The Academy",
          "body": "(1) There shall be constituted, in accordance with the provisions of this Ordinance, an Academy to be called the Iqbal Academy. (2) The Academy shall be a body corporate, having perpetual succession and a common seal, and shall by its name sue and be sued. (3) The Academy shall have power to acquire and hold property, both movable and immovable, to lease, sell or otherwise transfer any movable or immovable property which may have become vested in, or been acquired by, it, and to contract and to do all other things necessary for the purposes of this Ordinance."
        },
        {
          "section_no": "4",
          "section_title": "Composition of the Academy",
          "body": "(1) The Academy shall consist of- (a) the Patron-in-Chief; (b) Patron; (c) the President; (d) the Vice-President; (e) Honorary Members; (f) Life-Members; and (g) Members. (2) Notwithstanding anything contained in sub-section (1), the Academy constituted for the first time without there being any Honorary members or Members shall be deemed to be validly constituted. (3) No Proceedings or decisions of the Academy shall be invalid by reason only of the existence of any vacancy in, or defect in the constitution of, the Academy."
        },
        {
          "section_no": "5",
          "section_title": "Aims and objects of the Academy",
          "body": "The aims and objects of the Academy shall be- (a) to promote the study and understanding of the works of Iqbal; (b) to institute scholarships and Lectureships for furthering the study of the works and teachings of Iqbal; (c) to publish books, pamphlets and periodicals relating to the said study; (d) to award prizes, rewards and donations to authors who, in the opinion of the Academy, have made contributions to the study of the works and teachings of Iqbal, and to enter into contracts with authors in order to carry out the purposes of this Ordinance; (e) to organize lectures, talks, discussions, study groups and conferences on Iqbal and to send delegates to conferences held in foreign countries for the study of Iqbal’s works and teachings, or for any matter to which that study is relevant or by which it may be advanced or profited; (f) to confer in the prescribed manner Fellowships on scholars who, in the opinion of the Academy, have made contributions to the study of the works and teachings of Iqbal; (g) to co-operate with, or grant amalgamation or affiliation to, any other association established for a purpose similar to that of the Academy, whether the purpose of that other association is confined to the works and teachings of Iqbal or not; and (h) to do such other acts and things as may further the aims and objects of the Academy."
        },
        {
          "section_no": "6",
          "section_title": "Affiliation",
          "body": "The Academy shall be affiliated to the Institute of Islamic Research established under the Federal Government’s Notification No. S. R.O. 745 (I)/79, dated the 22nd August, 1979."
        },
        {
          "section_no": "7",
          "section_title": "Headquarters",
          "body": "The Headquarters of the Academy shall be at a place determined by the Federal Government."
        },
        {
          "section_no": "8",
          "section_title": "The Patron-in-Chief",
          "body": "The President of Pakistan shall be the Patron-in-Chief of the Academy."
        },
        {
          "section_no": "9",
          "section_title": "Patrons",
          "body": "(1) Persons who, immediately before the commencement of this Ordinance, were Honorary Patrons or Patrons of the Academy constituted under the Act, shall be deemed to be the Patrons of the Academy. (2) The Governing Body may invite distinguished persons to become Patrons of the Academy."
        },
        {
          "section_no": "10",
          "section_title": "The President",
          "body": "The Minister for Education and Scientific Research, Government of Pakistan, shall be the President of the Academy."
        },
        {
          "section_no": "11",
          "section_title": "The Vice-President",
          "body": "(1) The Vice-President of the Academy shall be nominated by the Federal Government for a period of three years. (2) In the absence of the President, the Vice President shall preside over the meetings of the Academy and the Governing Body."
        },
        {
          "section_no": "12",
          "section_title": "Treasurer",
          "body": "(1) There shall be a Treasurer of the Academy nominated by the Federal Government for a period of three years. (2) The Treasurer shall be responsible for the management of the finances of the Academy and shall maintain proper accounts for submission to the Governing Body."
        },
        {
          "section_no": "13",
          "section_title": "Honorary Members",
          "body": "The Governing Body may, in the prescribed manner, appoint- (a) scholars of outstanding eminence who have made significant contributions to the study of Iqbal, or (b) distinguished persons who have rendered singular service concerning the aims and objects of the Academy, to be Honorary Members of the Academy."
        },
        {
          "section_no": "14",
          "section_title": "Life-Members",
          "body": "(1) Persons who, immediately before the commencement of this Ordinance, were on the rolls of Life-Members of the Academy constituted under the Act, shall be deemed to be the Life-Members of the Academy. (2) Any Member may become a Life-Member on fulfilling the conditions prescribed in this behalf."
        },
        {
          "section_no": "15",
          "section_title": "Members",
          "body": "Persons interested in the study of Iqbal’s works may become Members of the Academy if they are elected thereto in the prescribed manner."
        },
        {
          "section_no": "16",
          "section_title": "Privileges of Membership",
          "body": "Life-Members and Members shall be entitled to the following privileges, namely:- (a) to propose candidates for the honorary membership and membership of the Academy; (b) to use the facilities of the Library of the Academy; (c) to receive the proceedings issued by the Academy, and to purchase such publications of the Academy at such reduced price as may be decided by the Governing Body; (d) to offer papers and communications to be read before the literary meetings of the Academy and to publish papers in the proceedings and journals of the Academy in such manner as may be prescribed; and (e) to elect two members to the Governing Body."
        },
        {
          "section_no": "17",
          "section_title": "Governing Body",
          "body": "(1) The control and administration of the Academy shall vest in a Governing Body consisting of- (a) the President who shall also be the Chairman of the Governing Body; (b) the Vice-President; (c) the Treasurer; (d) the Director, Central Institute of Islamic Research; (e) two persons elected, in the prescribed manner, from amongst the Life-Members or Members; (f) one representative of the Ministry of Education and Scientific Research to be nominated by that Ministry; and (g) five other persons to be nominated by Federal Government. (2) No proceedings or decision, of the Governing Body shall be invalid by reason only of the existence of any vacancy in, or defect in the constitution of, the Governing Body. (3) Members other than ex-officio Members of the Governing Body shall hold office for a period of three years. (4) If any vacancy occurs in the Governing Body during the currency of the term of office of an appointed Member, the appointment of a new Member shall be made by the authority concerned, and the Member so appointed shall hold office for the unexpired portion of the term of office of his predecessor."
        },
        {
          "section_no": "18",
          "section_title": "Powers of the Governing Body",
          "body": "(1) The Governing Body shall have the power- (a) to hold, control and administer the property and funds of the Academy, including funds for specific purposes, and to make contracts on behalf of the Academy; (b) to manage and regulate the finances, accounts and investments of the Academy and to frame rules governing the pay scale, conditions of service and the appointment of the staff of the Academy; (c) to make rules not inconsistent with the provisions of this Ordinance for carrying out the purposes of this Ordinance; and (d) to do all acts that may be necessary for carrying out the aims and objects of the Academy."
        },
        {
          "section_no": "19",
          "section_title": "Executive Committee",
          "body": "(1) There shall be an Executive Committee for managing the day to day affairs of the Academy. (2) The Executive Committee shall consist of the following, namely:- (a) the Vice-President; (b) the representative of the Ministry of Education and Scientific Research on the Governing Body; (c) the Treasurer; and (d) two other persons appointed by the Governing Body from amongst its members. (3) The Director of the Academy shall act as Secretary of the Executive Committee. (4) The powers and functions of the Executive Committee and the manner in which the two members of the Governing Body may be appointed thereon shall be such as may be prescribed."
        },
        {
          "section_no": "20",
          "section_title": "Director",
          "body": "(1) The Director shall be appointed by the Governing Body for such period and on such terms and conditions of service as may be prescribed. (2) The Director shall, under the direction of the Governing Body, prepare programme of the work and research projects of the Academy and shall be responsible for its execution. (3) The Director shall be responsible to the Governing Body for carrying out its decisions and for the proper administration of the office of the Academy."
        },
        {
          "section_no": "21",
          "section_title": "Funds of the Academy",
          "body": "The funds of the Academy shall comprise (a) grants from the Federal Government and the Provincial Governments. (b) Fees from Members; (c) Donations; and (d) Proceeds from the sale of its publications and other sources."
        },
        {
          "section_no": "22",
          "section_title": "Audit",
          "body": "The accounts of the Academy shall be audited annually by a qualified auditor appointed by the Governing Body."
        },
        {
          "section_no": "23",
          "section_title": "Prohibition on the use of name",
          "body": "(1) No person or body of persons shall use the name of the Academy for any purpose other than that of reference to the Academy. (2) Any person or body of persons contravening the provisions of sub-section (1) shall be punishable with imprisonment for a term which may extend to six months, or with fine, or with both."
        },
        {
          "section_no": "24",
          "section_title": "[Omitted]",
          "body": ""
        }
      ]
    }
  ],
  "source_file": "administrator7672c6973dcec2d75c974c66ffd74e90.txt"
}