{
  "law_name": "Islamabad (Preservation of Landscape) Ordinance",
  "year": 1966,
  "chapters": [
    {
      "chapter_title": "Contents",
      "sections": [
        {
          "section_no": "1",
          "section_title": "Short title, extent and commencement",
          "body": "(1) This Ordinance may be called the Islamabad (Preservation of Landscape) Ordinance, 1966. (2) It extends to the Islamabad Capital Territory. (3) It shall come into force at once."
        },
        {
          "section_no": "2",
          "section_title": "Definitions",
          "body": "In this Ordinance, unless there is anything repugnant in the subject or context, (a) “landscape” includes earth, land, clay, rock, boulders, shingles, pebbles and any other substance over the surface of land, and grass, weeds, bushes, hedges, plants, standing trees, undergrowth and all objects of natural beauty visible to the eye; and (b) all other words and expressions have the meaning assigned to them in the Capital Development Authority Ordinance, 1960 (XXIII of 1960)."
        },
        {
          "section_no": "3",
          "section_title": "Operation of other laws",
          "body": "The provisions of this Ordinance and the rules made thereunder shall be in addition to and not in derogation of the provisions of the Capital Development Authority Ordinance, 1960 (XXIII of 1960), and the Pakistan Capital Regulation (M.L. Regulation No. 82), and the rules made thereunder, and shall have effect notwithstanding anything inconsistent therewith contained in any other law for the time being in force."
        },
        {
          "section_no": "4",
          "section_title": "Preservation of landscape",
          "body": "(1) No person shall remove, destroy, damage or alter anything, or commit any other act if such removal, destruction, damage, alteration or act affects or is likely to affect a landscape injuriously. (2) This section shall not apply to anything done by, or at the instance or with the permission of, the Authority."
        },
        {
          "section_no": "5",
          "section_title": "Penalty",
          "body": "Whoever contravenes any provision of this Ordinance or any rules made thereunder, or abets such contravention, shall be punishable with imprisonment for a term which may extend to six months, or with fine which may extend to five thousand rupees, or with both."
        },
        {
          "section_no": "6",
          "section_title": "Power to arrest without warrant",
          "body": "(1) Any police officer, or any officer appointed in this behalf by the Authority, may, without orders from a Magistrate and without a warrant, arrest any person who has contravened or is found contravening any provision of this Ordinance, or against whom reasonable suspicion exists of having been concerned in the commission of any offence punishable under this Ordinance. (2) Every officer making an arrest under this section shall, without unnecessary delay, take or send the person arrested before the Magistrate having jurisdiction in the case, or to the officer in charge of the nearest police-station."
        },
        {
          "section_no": "7",
          "section_title": "Cognizance and compounding of offences",
          "body": "(1) No Court shall take cognizance of any offence punishable under this Ordinance except on a report in writing by the Authority or a person authorised in this behalf by the Authority of the facts constituting such offence. (2) The Authority or the person authorised may, instead of making a report of an offence under sub-section (1), compound such offence for such sum of money as may be determined by the Authority or the person authorised."
        },
        {
          "section_no": "8",
          "section_title": "Offences to be tried summarily",
          "body": "An offence punishable under this Ordinance shall be tried in a summary way in accordance with the provisions of the Code of Criminal Procedure, 1898 (Act V of 1898), relating to summary trials."
        },
        {
          "section_no": "9",
          "section_title": "Certain powers for officers of the Authority",
          "body": "For carrying out the purposes of this Ordinance, the officers of the Authority who may be specified by it in this behalf may- (a) hold enquiry into offences punishable under this Ordinance, and, in the course of such enquiry, receive and record evidence; (b) enter upon any land or in any building for the purpose of any such enquiry; and (c) exercise the powers of a Civil Court to compel the attendance of witnesses and the production of documents and material objects."
        },
        {
          "section_no": "10",
          "section_title": "Requisition of police assistance",
          "body": "Any officer authorised to take any action under this Ordinance may, if he requires police assistance for taking such action, send a requisition to the officer in charge of a police-station who shall, on such requisition, render the assistance required."
        },
        {
          "section_no": "11",
          "section_title": "Certain persons deemed public servants",
          "body": "Any officer of the Authority or other person, while acting or purporting to act under the provisions of this Ordinance, shall be deemed to be a public servant within the meaning of section 21 of the Pakistan Penal Code."
        },
        {
          "section_no": "12",
          "section_title": "Indemnity",
          "body": "No suit or other legal proceeding shall lie against the Authority or any person in respect of anything which is in good faith done or intended to be done under this Ordinance."
        },
        {
          "section_no": "13",
          "section_title": "Bar of Jurisdiction",
          "body": "No Court or other Authority shall call in question anything done or intended to be done under this Ordinance by or at the instance of the Authority."
        },
        {
          "section_no": "14",
          "section_title": "Power to exempt",
          "body": "The Federal Government may, by notification in the official Gazette, exempt any part of the Islamabad Capital Territory or any class of land from the operation of all or any of the provisions of this Ordinance."
        },
        {
          "section_no": "15",
          "section_title": "Power to make rules",
          "body": "The Federal Government may, by notification in the official Gazette, make rules for carrying out the purposes of this Ordinance."
        }
      ]
    }
  ],
  "source_file": "administrator6290b823dce248fd9f5425921042f8bb.txt"
}