{
  "law_name": "Law Commission Ordinance",
  "year": 1979,
  "chapters": [
    {
      "chapter_title": "Contents",
      "sections": [
        {
          "section_no": "1",
          "section_title": "Short title, extent and commencement",
          "body": "(1) This Ordinance may be called the (2) It extends to the whole of Pakistan. (3) It shall come into force at once."
        },
        {
          "section_no": "2",
          "section_title": "Definitions",
          "body": "In this Ordinance, unless there is anything repugnant in the subject or context,― (a) “Chairman” means Chairman of the Commission; (b) “Commission” means the Commission established under section 3; (c) “Fund” means Access to Justice Development Fund established under section 6­A; and (d) “member” means member of the Commission."
        },
        {
          "section_no": "3",
          "section_title": "Composition of Commission",
          "body": "(1) There shall be a Law and Justice Commission of Pakistan consisting of- (a) the Chief Justice of Pakistan who shall be the Chairman, ex­officio; (b) the Chief Justice of the Federal Shariat Court, Member, ex­officio; (c) the Chief Justices of the High Courts, Members, ex­officio; (d) Attorney General for Pakistan, Member, ex­officio; (e) the Secretary, Ministry of Law, Justice and Human Rights, Member, ex­officio; (f) Chairperson for Commission on Women Status, Member, ex­officio; (g) four members, one from each Province, to be appointed by the Federal Government on the recommendation of the Chairman in consultation with the Chief Justice of concerned High Court from amongst the persons who are or have been holders of a judicial or administrative office, eminent lawyers or jurists, persons of repute and integrity from civil society, members of the Council of Islamic Ideology or teachers of law in a university or college. (1A) In addition to the members referred to in subsection (1), the Chairman may, in his discretion, appoint a suitable person or persons as member or members for a specified period to perform specified functions. (3) A member, other than an ex-officio member, shall hold office for a term of three years but shall be eligible for re‑appointment for another term. (4) A member, other than an ex-officio member, may resign his office by writing under his hand addressed to the President."
        },
        {
          "section_no": "4",
          "section_title": "Head Office",
          "body": "The head office of the Commission shall be situated in Islamabad or at such other place as the Federal Government may specify."
        },
        {
          "section_no": "5",
          "section_title": "Secretariat",
          "body": "(1) The Commission shall have a separate Secretariat to be headed by a Secretary, who shall be an officer of the Federal Government not inferior in rank to a Joint Secretary to the Federal Government. (2) The Secretary and other officers and employees of the Commission shall be appointed by the Chairman on such terms and conditions as the Commission may determine. (3) The Commission may, for the purpose of research, engage, for a specified period, as many persons as it considers necessary."
        },
        {
          "section_no": "6",
          "section_title": "Functions of the Commission",
          "body": "(1) The Commission shall study and keep on a continuing systematic basis the statutes and other laws with a view to making recommendations to the Federal Government and the Provincial Governments for the improvement, modernization and reform thereof and, in particular, for‑ (i) making or bringing the laws into accord with the changing needs of the society, consistent with the ideology of Pakistan and the concept of Islamic social justice; (ii) adopting of simple and effective procedure for the administration of laws to ensure substantial, in­expensive and speedy justice; (iii) arranging the codification and unification of laws in order to eliminate multiplicity of laws on the same subject; (iv) removing anomalies in the laws; (v) repealing obsolete or unnecessary provisions in the laws; (vi) simplifying laws for easy comprehension and devising steps to make the society laws‑conscious; (vii) introduction of reforms in the administration of Justice; and (viii) removing inconsistencies between the laws within the legislative competence of Parliament and those within the legislative competence of a Provincial Assembly. (2) The Commission shall take appropriate measures for- (a) developing and augmenting human resources for efficient court administration and case management; (b) coordination of judiciary and executive; and (c) preparing schemes for access to justice, legal aid and protection of human rights. (3) The Commission shall administer and manage the Access to Justice Development Fund. (4) The Commission shall study the present system of legal education and make recommendations to the Federal Government for improving the standard of legal education. (5) The Federal Government, or a Provincial Government may refer to the Commission any matter relevant to its functions for opinion and advice. (6) The Commission may, with the approval of the Federal Government, enter into a Memorandum of Understanding with the Law Commission of any country or, as the case may be, with any legal or human rights body or organization of any country."
        },
        {
          "section_no": "6-A",
          "section_title": "Fund",
          "body": "(1) There shall be established for the purposes of this Ordinance a fund to be called the Access to Justice Development Fund. (2) The Fund shall consist of- (a) an endowment grant of initial amount equivalent to US $24 million by the Federal Government in Installments; (b) other grants and donations made by the Federal Government Provincial Governments or a Local Government; (c) donations and contributions made by the individuals or institutions; and (d) sums raised by the Commission."
        },
        {
          "section_no": "6-B",
          "section_title": "Expenditure to be charged on the Fund",
          "body": "The annual income generated by investment of endowment grant under clause (a) of sub-section (2) of section 6-A shall be utilized for the purposes and to the extent provides as hereunder: (a) 60.3% shall be allocated to the provinces and Islamabad Capital Territory on population basis to be called Judicial Development Fund for improving the capacity and performance of the subordinate courts and providing amenities and facilities to courts and litigants, as may be determined by the respective High Courts; (b) 10% shall be set aside for special projects in the under-developed Provinces and regions; (c) not more than 4.5% on Legal and Judicial Research; (d) not more than 4.5% on the activities of the Federal Judicial Academy not covered by its budgetary allocation; (e) not more than minimum of 13.5% with a cap of 20% for the legal empowerment of the poor and underprivileged persons for provision of legal aid or assistance to have access to Justice, in accordance with the criteria to be laid by the Commission; (f) not more than minimum 4.5% with a cap of 10% to be spent on innovations in or promotion of legal education; (g) 2.7% shall be charged by the Commission for management of the Fund."
        },
        {
          "section_no": "6-C",
          "section_title": "Constitution of Committees",
          "body": "The Commission may constitute committees consisting of one or more of its members, as it thinks fit, and may refer to them any matter relevant to the functions of the Commission for consideration and report."
        },
        {
          "section_no": "6-D",
          "section_title": "Reports",
          "body": "The Commission shall publish an annual report of its activities and such other periodic or special reports requiring legislative or implementation effect as it may consider necessary. The Commission shall submit the reports to the President of Pakistan."
        },
        {
          "section_no": "7",
          "section_title": "Application of Act VI of 1956",
          "body": "The provisions of the Pakistan Commissions of Inquiry Act, 1956 (VI of 1956), shall apply to the Commission as if the Commission were a Commission appointed under that Act to which all the provisions of section 5 thereof applied."
        },
        {
          "section_no": "8",
          "section_title": "Assistance to Commission",
          "body": "All executive authorities in Pakistan shall assist the Commission in the performance of its functions."
        },
        {
          "section_no": "9",
          "section_title": "Power to make rules",
          "body": "(1) The Commission may make rules for carrying out the purposes of this Ordinance. (2) In particular, and without prejudice to the generality of the foregoing provision, such rules may provide for payment to the members of a travelling allowance and daily allowance in respect of journeys performed in connection with the functions of the Commission."
        }
      ]
    }
  ],
  "source_file": "administrator1ffec6691fbc17d3bb65499f38663e59.txt"
}