{
  "error": "Expecting value: line 1 column 1 (char 0)",
  "raw": "THE EMPLOYEES’ OLD-AGE BENEFITS ACT, 1976 CONTENTS CHAPTER I PRELIMINARY SECTIONS: 1. Short title, extent, commencement and application. 2. Definitions. CHAPTER II INSURED PERSONS 3. Compulsory insurance. 4. Administration. 5. Nomination of a body corporate pending establishment of an Institution. 6. Management. 7. Board of Trustees. 8. Powers and functions of the Board of Trustees. 8A. Appointment, powers and functions of Chairman. CHAPTER III CONTRIBUTIONS 9. Rates and assessment. 9A. Contribution by Government. 9B. Contribution by insured person. 10. Records and returns by employers. 11. Registration of establishments, etc. 11A. Cancellation of registration of establishments, etc. 12. Officials of Institution to check employer’s books. 12A. [Omitted]. 13. Increase of unpaid contribution and recovery of contribution etc., as arrear of land revenue. 14. Safeguard of insured person’s right in default of payment of contributions by employer. 15. Refund of Contributions paid erroneously. 16. Extinguishment of claims to contributions. CHAPTER IV FINANCE AND AUDIT 17. Employee’s Old-Age Benefits Fund. 18. Investment and loans. 19. Budget, accounts and audit. 20. Annual Report. 21. CHAPTER V BENEFITS 22. Old age pension. 22A. Old-age grant. 22B. Survivor’s pension. 23. [Invalidity pension]. CHAPTER VI PROVISIONS COMMON TO ALL BENEFITS 24. Calculation of qualifying contribution periods. 25. Benefit claims and payments. 26. Extinguishment of benefits. 27. Suspension of [old-age pension] and [survivor’s pension]. 28. Non-duplication of allowance. 29. [Benefit] not attachable, chargeable or assignable. 30. Repayment of allowance improperly received. 31. Institution’s right to be indemnified in certain cases. 32. Recovery of amounts due. CHAPTERVII DETERMINATION OF QUESTIONS AND CLAIMS 33. Decisions on complaints, questions and disputes. 34. Review of decisions. 35. Appeal to Board. 36. Assessment of invalidity. CHAPTER VIII OFFENCES AND PENALTIES 37. Offences. 38. Prosecutio",
  "source_file": "administratorf3be1ec8d21dfebb9c5d1733f43cffe6.txt",
  "law_name": "Old-Age Benefits Act, 1976",
  "year": 1976
}