{
  "law_name": "Pakistan Atomic Energy Commission Ordinance",
  "year": 1965,
  "chapters": [
    {
      "chapter_title": "PRELIMINARY",
      "sections": [
        {
          "section_no": "1",
          "section_title": "Short title, extent and commencement.",
          "body": "This Ordinance may be called the Pakistan Atomic Energy Commission Ordinance, 1965. It extends to the whole of Pakistan and shall come into force at once."
        },
        {
          "section_no": "2",
          "section_title": "Definitions.",
          "body": "In this Ordinance, unless there is anything repugnant in the subject or context, 'Atomic energy' means the energy or ionizing radiations released in any process which involves transformation of, or reaction between atomic nuclei and includes energy liberated as a result of the fission of special nuclear material or fusion."
        },
        {
          "section_no": "3",
          "section_title": "Establishment of the Commission.",
          "body": "The Federal Government shall establish a Commission to be called the Pakistan Atomic Energy Commission, which shall be a body corporate with perpetual succession and a common seal."
        },
        {
          "section_no": "3A",
          "section_title": "Employment under Commission to be employment under Federal Government.",
          "body": "Every employment under the commission shall be deemed to be employment under the Federal Government for the purposes of the Pakistan Essential Services (Maintenance) Act, 1952."
        },
        {
          "section_no": "3B",
          "section_title": "[Act IV of 2008 not to apply to commission]",
          "body": "Nothing contained in the Industrial Relations Act 2008 shall apply to or in relation to the Commission or any of the officers, advisers and employees appointed by it."
        }
      ]
    },
    {
      "chapter_title": "COMPOSITION AND FUNCTION OF THE COMMISSION",
      "sections": [
        {
          "section_no": "4",
          "section_title": "Composition of the Commission.",
          "body": "The Commission shall consist of the following members to be appointed by the Federal Government: a Chairman, a Finance member, and seven technical members."
        },
        {
          "section_no": "5",
          "section_title": "Term of office of member, etc.",
          "body": "A member of the Commission shall hold office for a period of three years and shall be eligible for re-appointment for further periods not exceeding three years."
        },
        {
          "section_no": "6",
          "section_title": "Functions of the Commission.",
          "body": "The functions of the Commission shall be to do all acts and things necessary for the promotion of the peaceful uses of atomic energy in agriculture, medicine, and industry."
        },
        {
          "section_no": "7",
          "section_title": "Meetings of the Commission, etc.",
          "body": "The Commission shall regulate the procedure for its meetings, which shall be called by the Chairman with at least eight days' notice."
        },
        {
          "section_no": "7A",
          "section_title": "Standing bodies and committees.",
          "body": "The commission may from time to time appoint such standing bodies and committees."
        }
      ]
    },
    {
      "chapter_title": "MISCELLANEOUS",
      "sections": [
        {
          "section_no": "14",
          "section_title": "Cooperation with international organizations, etc.",
          "body": "The Commission shall cooperate with international organizations in matters related to atomic energy."
        },
        {
          "section_no": "15",
          "section_title": "Submission of periodical reports, etc.",
          "body": "The Commission shall submit periodical reports as required."
        },
        {
          "section_no": "16",
          "section_title": "Directives from the Federal Government.",
          "body": "The Commission shall be guided by directives from the Federal Government."
        },
        {
          "section_no": "17",
          "section_title": "Discoveries and inventions to vest in the Commission.",
          "body": "All discoveries and inventions made in the course of the Commission's work shall vest in the Commission."
        },
        {
          "section_no": "18",
          "section_title": "Declaration of fidelity and secrecy.",
          "body": "Members and employees of the Commission shall declare fidelity and secrecy."
        },
        {
          "section_no": "19",
          "section_title": "Power to make rules.",
          "body": "The Commission shall have the power to make rules for the conduct of its business."
        },
        {
          "section_no": "20",
          "section_title": "Power to make regulations.",
          "body": "The Commission shall have the power to make regulations for the implementation of this Ordinance."
        },
        {
          "section_no": "21",
          "section_title": "Continuance of certain rules, etc.",
          "body": "Certain existing rules and regulations shall continue to apply."
        },
        {
          "section_no": "22",
          "section_title": "Winding up.",
          "body": "The process for winding up the Commission shall be as prescribed."
        },
        {
          "section_no": "23",
          "section_title": "Dissolution of Pakistan Atomic Energy Council, etc.",
          "body": "The Pakistan Atomic Energy Council shall be dissolved as per the provisions of this Ordinance."
        }
      ]
    }
  ],
  "source_file": "administrator3d7efadcb67ac48dd8fd78c78cd1c1fb.txt"
}