{
  "law_name": "Pakistan Red Crescent Society Act",
  "year": 1920,
  "chapters": [
    {
      "chapter_title": "Contents",
      "sections": [
        {
          "section_no": "1",
          "section_title": "Short title and extent",
          "body": "(1) This Act may be called the Pakistan Red Crescent Society Act. (2) It extends to all the territories of Pakistan."
        },
        {
          "section_no": "2",
          "section_title": "Constitution of Pakistan Red Crescent Society",
          "body": "There shall be constituted a Society to be known as the Pakistan Red Crescent Society (hereafter called the society). The first members of the Society shall be such persons as were members of the Indian Red Cross Society immediately before the appointed day and are resident in Pakistan."
        },
        {
          "section_no": "3",
          "section_title": "Appointment of Managing Body",
          "body": "(i) Until such time as a Managing Body of the Society is elected under the provisions of sub-section (iv) the Managing Body shall consist of (a) such persons as were members of the Managing Body of the Indian Red Cross Society immediately before the appointed day and are resident in Pakistan; and (b) such other persons not exceeding 30 in number as may be nominated by the President of Pakistan. (ii) The President of Pakistan shall be the President of the Society. (iii) The President of Pakistan may nominate as office bearers of the first Managing Body such persons as he may select for the purpose. (iv) Before the expiry of 6 months from the date of constitution of the first Managing Body a new Managing Body shall be elected by the members of the Society in accordance with the rules made under Section 5."
        },
        {
          "section_no": "4",
          "section_title": "Incorporation",
          "body": "The first members of the Society and all persons who may hereafter become members thereof so long as they continue so to be, are hereby constituted a body corporate under the name of the Pakistan Red Crescent Society, and the said body shall have perpetual succession and a common seal with power to hold and acquire property, moveable and immoveable and shall sue and be sued by the said name."
        },
        {
          "section_no": "5",
          "section_title": "Power to make rules",
          "body": "The Managing Body shall within 6 months of its constitution make rules for the management, control and procedure of the Society."
        },
        {
          "section_no": "6",
          "section_title": "Dissolution and transfer of property of Joint War Committee",
          "body": "The following property shall vest in the Society: (a) All property moveable or immoveable which may be allotted to the Society out of the assets held immediately before the appointed day by the Indian Red Cross Society; and (b) All gifts made to the Society for purposes which are purposes of the Society."
        },
        {
          "section_no": "7",
          "section_title": "Purposes to which funds of Society may be applied",
          "body": "Notwithstanding anything contained in any appeal for subscriptions or gifts to or for the purposes of the Committee, the Managing Body may in its discretion apply either the corpus of the income or any part of such corpus or income of any property vested in it for the relief of sickness, suffering or distress caused by the operation of war in Pakistan or in any other country in which Expeditionary Forces from Pakistan may, from time to time, be employed."
        },
        {
          "section_no": "8",
          "section_title": "Constitution of Branch Committees",
          "body": "All Branch Committees of the Indian Red Cross Society which immediately before the appointed day had their headquarters at any place which has thereafter been included in Pakistan, shall be deemed to have been constituted under this Act."
        },
        {
          "section_no": "9",
          "section_title": "Affiliation of other Societies",
          "body": "The Managing Body may also affiliate to the Society any other society or body having all or any of the objects and purposes referred to in section 7."
        },
        {
          "section_no": "10",
          "section_title": "Decision of Managing Body as to purposes final",
          "body": "The Managing Body shall have authority to determine in all cases what matters properly fall within the scope of clause (b) of section 7, and its decision in all such matters shall be binding on all Branch Committees and affiliated societies or bodies."
        },
        {
          "section_no": "11",
          "section_title": "Receipt and use of gifts",
          "body": "The Managing Body may also receive and hold gifts of whatsoever description either for the general purposes of the Society or for any particular purpose for which the corpus or income of the property vested in it may be applied."
        },
        {
          "section_no": "12",
          "section_title": "Powers of Branch Committees",
          "body": "Subject to the provisions of rules made under section 5, each Branch Committee shall have all power to regulate its own procedure and constitution, to receive gifts and expend all monies received by it for its purposes."
        }
      ]
    }
  ],
  "source_file": "administrator6e2025e398d01c93f5db47a234468c5c.txt"
}