{
  "error": "Expecting value: line 1 column 1 (char 0)",
  "raw": "THE DEKKHAN AGRICULTURISTS’ RELIEF ACT, 1879 CONTENTS CHAPTER I PRELIMINARY 1. Short title. Commencement Local extent 2. Construction 2A. [Repealed.] CHAPTER II OF THE HEARING OF CERTAIN SUITS BY SUBORDINATE JUDGES 3. Application of this Chapter 4. Certain suits to be instituted in Courts of first class Subordinate Judges. 5. Subordinate Judges not to act as Judges of Small Cause Courts. 6. Jurisdiction of Subordinate Judge and Small Cause Court 7. Summons to be for final disposal of suit Court to examine defendant as witness 8. [Repealed.] 9. [Repealed.] 10. No appeal to lie CHAPTER III OF SUITS AND OTHER PROCEEDINGS TO WHICH AGRICULTURISTS ARE PARTIES 10A. Power of Court to determine nature of transactions and to admit evidence of an oral agreement or statement 11. Agriculturists to be sued where they reside 12. History of transactions with agriculturist-debtor to be investigated 13. Mode of taking account 13A. In certain cases rent may be charged in lieu of profits 14-15. [Repealed.] 15A. Mortgagor entitled to decree for redemption through time fixed by mortgage has not arrived or debt has not been paid 15AA. Power of Court to name some future date for payment by the mortgagor 15B. Power to order payment by instalments in case of decree for redemption, foreclosure or sale 15C. Power to order payment by instalments in suits for possession of mortgaged property 15D. Mortgagor may sue for account 16. Agriculturist-debtors may sue for accounts Amount of debts in such cases to be determined according to foregoing provisions 17. Decree under section 16 may provide for payment by instalments. Execution of decrees under this section 18. Payment into Court in cases under section 16 19. [Repealed] 20. Power to fix instalments in execution 21. Arrest and imprisonment in execution of decree for money abolished 22. Immoveable property exempted from attachment and sale unless specifically pledged 22A. Power of Collector to set aside sale 23. Chapter not to apply to Village Mun",
  "source_file": "administrator09e29cb08a9a7e554129b256e81b89fb.txt",
  "law_name": "Relief Act, 1879",
  "year": 1879
}