{
  "error": "Expecting value: line 1 column 1 (char 0)",
  "raw": "THE WORKMEN'S COMPENSATION ACT, 1923 CONTENTS CHAPTER I PRELIMINARY 1. Short title, extent and commencement. 2. Definitions. CHAPTER II WORKMAN'S COMPENSATIOON 3. Employer's liability for compensation. 4. Amount of compensation. 5. Method of calculating wages. 6. Review. 7. Commutation of half-monthly payments. 8. Distribution of compensation. 9. Compensation not to be assigned, attached or charged. 10. Notice and claim. 10A. Power to require from employers statements regarding fatal accidents. 10B. Reports of fatal accidents. 10C. Officers authorised may refer cases for payment of compensation. 10D. Fixation of abstracts of the act or rules at the entrance of the premises 11. Medical examination. 12. Contracting. 13. Remedies of employer against stranger. 14. Insolvency of employer. 15. Special provisions relating to masters and seamen. 16. Returns as to compensation. 17. Contracting out. 18. Proof of age. 18A. Penalties. CHAPTER III COMMISSIONERS 19. Reference to Commissioners. 20. Appointment of Commissioners. 21. Venue of proceedings and transfer. 22. Form of application. 22A. Power of Commissioner to require further deposit in cases of fatal accident. 23. Powers and procedure of Commissioners. 24. Appearance of parties. 25. Method of recording evidence. 26. Costs. 27. Power to submit cases. 28. Registration of agreements. 29. Effect of failure to register agreement. 30. Appeals. 30A. Withholding of certain payments pending decision of appeal. 31. Recovery. CHAPTER IV RULES 32. Power of the Provincial Government to make rules 33. [Repealed.] 34. Publication of rules. 35. Rules to give effect to arrangements with other countries for the transfer of money paid as compensation. THE WORKMEN’S COMPENSATION ACT, 1923 1ACT No. VIII OF 1923 [5th March, 1923] An Act to provide for the payment by certain classes of employers to their workmen of compensation for injury by accident. WHEREAS it is expedient to provide for the payment by certain classes of employers to their ",
  "source_file": "administratorc0a301ae45df31b6a4b3828a5cd57fde.txt",
  "law_name": "S Compensation Act, 1923",
  "year": 1923
}