{
  "error": "Expecting value: line 1 column 1 (char 0)",
  "raw": "THE AUDITOR GENERAL’S (FUNCTIONS, POWERS, TERMS AND CONDITIONS OF SERVICE) ORDINANCE, 2001 CONTENTS 1 Short title, extent and commencement. 2 Definitions. 3 Salary, pension etc. 4 Term of office. 5 Resignation. 6 Leave. 7 Auditor-General to certify accounts. 8 Provisions relating to Audit. 9 Audit of receipts and expenditure of holders of authorities substantially financed by loans and grants. 10 Auditor-General to give information and undertake studies, etc. 11 Functions of Auditor-General in the case of grants or loans given to other authorities or bodies. 12 Audit of receipts of Federation or of Provinces or of districts. 13 Audit on accounts of stores and stock. 14 Powers of Auditor-General in connection with audit of accounts. 15 Audit of companies and corporations established in the public sector. 16 Audit of accounts of certain authorities or bodies. 17 Power to dispense with detailed audit. 18 Delegation of powers. 19 Budgetary provisions. 20 Power to amend the Schedule. 21 Power to make rules. 22 Power to make regulations. 23 Repeal. The Schedule THE AUDITOR GENERAL’S (FUNCTIONS, POWERS, TERMS AND CONDITIONS OF SERVICE) ORDINANCE, 2001 ORDINANCE No. XXIII OF 2001 [17th May, 2001] An Ordinance to determine the terms and conditions of service, the term of office and the powers and functions of the Auditor-General of Pakistan WHEREAS it is expedient to determine, the terms and conditions of service, the term of office and the powers and functions of the Auditor General of Pakistan and for matters connected therewith or incidental thereto; AND WHEREAS the National Assembly and the Senate stand suspended in pursuance of the Proclamation of Emergency of the fourteenth day of October, 1999, and the Provisional Constitution Order No. 1 of. 1999; AND WHEREAS the President is satisfied that circumstances exist which render it necessary to take immediate action; NOW, THEREFORE, in pursuance of the Proclamation of Emergency of the fourteenth day of October, 1999, and t",
  "source_file": "administratord2a43e2e40d8af8e23fd95cba332137b.txt",
  "law_name": "S (Functions, Powers, Terms and Conditions of Service) Ordinance, 2001",
  "year": 2001
}