{
  "law_name": "Sindh Revenue Jurisdiction Act",
  "year": 1876,
  "chapters": [
    {
      "chapter_title": "Contents",
      "sections": [
        {
          "section_no": "1",
          "section_title": "Short Title and extent",
          "body": "This Act may be called the Sindh Revenue Jurisdiction Act, 1876. It extends to Sindh and the Karachi Division, but not so as to affect any of the provisions of Act XXIII of 1871."
        },
        {
          "section_no": "2",
          "section_title": "Repeal",
          "body": "Repealed by the Amending Act, 1891 (XII of 1891)."
        },
        {
          "section_no": "3",
          "section_title": "Interpretation-clause",
          "body": "In this Act unless there be something repugnant in the subject or context, 'land' includes the sites of villages, towns and cities; it also includes trees, growing crops and grass, fruit upon, and juice in, trees, rights-of-way, ferries, fisheries and all other benefits to arise out of land."
        },
        {
          "section_no": "4",
          "section_title": "Bar of certain suits",
          "body": "Subject to the exceptions hereinafter appearing no Civil Court shall exercise jurisdiction as to any of the following matters: claims against the Government relating to lands held under treaty or to lands granted or held as saranjam, or on other political tenure."
        },
        {
          "section_no": "5",
          "section_title": "Saving of certain suits",
          "body": "Claims regarding boundaries fixed under Bombay Act No. I of 1865, or any other law for the time being in force, or to set aside any order passed by a competent officer under any such law with regard to boundary marks."
        },
        {
          "section_no": "6",
          "section_title": "Bar of certain suits against Revenue-officers",
          "body": "No Civil Court shall entertain any suit against Revenue-officers in respect of any act done or purporting to be done in the discharge of their duties."
        },
        {
          "section_no": "7",
          "section_title": "Punishment or prosecution of Revenue-officers no bar to civil remedies",
          "body": "The punishment or prosecution of Revenue-officers shall not bar any civil remedies available to the aggrieved parties."
        },
        {
          "section_no": "11",
          "section_title": "Suits not to be entertained unless plaintiff has exhausted right of appeal",
          "body": "No suit shall be entertained unless the plaintiff has exhausted his right of appeal."
        },
        {
          "section_no": "12",
          "section_title": "Power of Government to refer questions for decision of High Court",
          "body": "The Government may refer any question for the decision of the High Court."
        },
        {
          "section_no": "13",
          "section_title": "Power of Civil Judge to refer questions of jurisdiction to High Court",
          "body": "A Civil Judge may refer questions of jurisdiction to the High Court."
        },
        {
          "section_no": "14",
          "section_title": "Composition of Bench",
          "body": "The composition of the Bench for hearing cases shall be determined by the High Court."
        },
        {
          "section_no": "16",
          "section_title": "Privileges of Government in suits defended by it",
          "body": "The Government shall have certain privileges in suits defended by it."
        }
      ]
    }
  ],
  "source_file": "administrator65be5a67a90779e2f64b6bea8a1368d6.txt"
}