{
  "error": "Expecting value: line 1 column 1 (char 0)",
  "raw": "TELEGRAPH ACT, 1885 CONTENTS PART I PRELIMINARY 1. Short title, local extent and commencement 2. [Repealed] 3. Definitions PART II PRIVILEGESAND POWERS OF THE GOVERNMENT 4. Exclusive privilege in respect of telegraphs, and power to grant licenses 5. Power for Government to take possession of licensed telegraphs and to order interception of messages 6. Power to establish telegraph on land of Railway Company 7. Power to make rules for the conduct of telegraphs 7A. Recovery of dues in respect of telegraph, etc. 8. Revocation of licenses 9. Government not responsible for loss or damage PART III POWERS TO PLACE TELEGRAPH LINES AND POSTS 10. Power for telegraph authority to place and maintain telegraph lines and posts. 11. Power to enter on property in order to repair or remove telegraph lines or posts. 12. Power for local authority to give permission under section 10, clause (c), subject to conditions 13. Power for local authority to require removal or alteration of telegraph line or post 14. Power to alter position of gas or water pipes or drains 15. Disputes between telegraph authority and local authority 17. Removal or alteration of telegraph line or post on property other than that of a local authority 18. Removal of trees interrupting telegraphic communication 19. Telegraph lines and posts placed before the passing of this Act 19A. Person exercising legal right likely to damage telegraph or interfere with telegraphic communication to give notice 19B. Power to confer upon licensee powers of telegraph authority under this 20. Establishing, maintaining or working unauthorized telegraph 20A. Breach of condition of license 21. Using unauthorized telegraphs 22. Opposing establishment of telegraphs on railway land 23. Intrusion into signal-room, trespass in telegraph Office or obstruction 24. Unlawfully attempting to learn contents of messages 25. Intentionally damaging or tampering with telegraphs 25A. Injury to or interference with a telegraph line or post 25B. Theft of ",
  "source_file": "administratorac6862547a10cdfd7dc5f630b8f32fc3.txt",
  "law_name": "Telegraph Act, 1885",
  "year": 1885
}