{
  "law_name": "THE POPULATION WELFARE PLANNING PROGRAMME (APPOINTMENT AND TERMINATION OF SERVICE) ORDINANCE",
  "year": 1981,
  "chapters": [
    {
      "chapter_title": "Contents",
      "sections": [
        {
          "section_no": "1",
          "section_title": "Short title, application and commencement",
          "body": "(1) This Ordinance may be called the Population Welfare Planning Programme (Appointment and Termination of Service) Ordinance, 1981. (2) It applies to all employees of the Council and the Boards including persons on deputation with the Council or a Board. (3) It shall come into force at once."
        },
        {
          "section_no": "2",
          "section_title": "Definitions",
          "body": "In this Ordinance, unless there is anything repugnant in the subject or context, (a) 'appointing authority' means the President or an officer authorised by him in this behalf (b) 'Board' means the Family Planning Board constituted under the Government of the Punjab, Services, General Administration and Information Department, Notification No. S.O.G-II-9-19/65, dated the 15th May, 1971, the Government of Sind, Services and General Administration and Information Department, Notification No. S.O.I. 295/70, dated the 22nd December, 1970 the Government of Baluchistan, Education, Health, Local Government, Social Welfare and Labour Department, Notification No.15/2/70-Health, dated the 15th December, 1970, or the Government of the North-West Frontier Province, Health, Education, Social Welfare Department, Notification No. 18/H&SW/70, dated the 23rd November, 1970, as the case may be; (c) 'Commission' means the Federal Public Service Commission; (d) 'Council' means the Pakistan Family Planning Council Constituted under the Government of Pakistan, Health Division, Resolution No.F.1-2/64-PPC, dated the 30th June, 1965, and later called as Population Council vide Population Division Resolution No. F-2-66/77-Co-ord., dated 24th September, 1978, as amended from time to time; (e) 'Departmental Selection Committee' means a Committee constituted for the purpose of making selection for appointment to posts in the Population Programme under the Population Division; (f) 'Employee' means an employee of the Council or a Board appointed on temporary or ad hoc basis in the Population Programme on or after the 30th April, 1977, and paid from the Pakistan Family Planning Council Fund or the Provincial Population Planning Board Fund; (g) 'Population Programme' means the Population Planning Programme referred to in the former Population Planning Division Resolution No. F.10-1/65-PPC, dated the 12th March, 1973; and (h) 'Prescribed' means prescribed by rules made under this Ordinance."
        },
        {
          "section_no": "3",
          "section_title": "Appointment",
          "body": "(1) The appointing authority may appoint an employee to a post in the Population Programme under the Population Division on the recommendations of the Commission or, as the case may be, the Departmental Selection Committee, in accordance with section 4. (2) The employees appointed under sub-section (1) shall be deemed to be civil servants within the meaning of the Civil Servants Act, 1973 (LXXI of 1973)."
        },
        {
          "section_no": "4",
          "section_title": "Procedure for appointment",
          "body": "(1) Notwithstanding anything contained in the Federal Public Service Commission Ordinance, 1977 (XLV of 1977) and the rules made thereunder or the Civil Servants Act, 1973, (LXXI of 1973) and the rules made thereunder, the appointing authority may refer the case of any employee, in the case of a person holding post in Grade 16 or above to the Commission and, in any other case, to the Departmental Selection Committee. (2) The Commission or, as the case may be, the Departmental Selection Committee shall, on receipt of such reference in respect of an employee, test the employee and make a report to the appointing authority, as to whether he is fit to hold the post to which he was appointed, and if not, whether he is fit to hold any other post in an equivalent Grade, commensurate with his qualifications and experience."
        },
        {
          "section_no": "5",
          "section_title": "Only employees to be appointed",
          "body": "For appointment to the posts under the Population Programme, only the employee and persons on deputation with the Council or a Board shall be eligible provided they possess such qualifications and experience as may be prescribed: Provided that, if suitable employees and such persons are not available, the posts which remain unfilled after taking action under section 4 may be filled subsequently in accordance with the procedure laid down in or under the Civil Servants Act, 1973 (LXXI of 1973)."
        },
        {
          "section_no": "6",
          "section_title": "Termination of service",
          "body": "Notwithstanding anything contained in his terms and conditions of service, the services of an employee who is not selected for appointment under section 3 or cannot be appointed for want of a vacancy may be terminated by the appointing authority from such date as the appointing authority may in the public interest direct."
        },
        {
          "section_no": "7",
          "section_title": "Terminal benefits",
          "body": "On termination of service under section 6, an employee shall be entitled to such benefits as may be prescribed."
        },
        {
          "section_no": "8",
          "section_title": "Seniority",
          "body": "(1) Seniority of persons appointed under section 3 shall be determined in a Grade from the date of appointment to that Grade in the Council or, as the case may be, the Board. (2) Those appointed on the same date shall take seniority according to their date of birth."
        },
        {
          "section_no": "9",
          "section_title": "Other service matters",
          "body": "Except as otherwise provided in this Ordinance, the terms and conditions of service of persons appointed under section 3 shall be governed by the Civil Servants Act, 1973 (LXXI of 1973) and the rules made or deemed to have been made thereunder."
        },
        {
          "section_no": "10",
          "section_title": "Ordinance to over-ride other laws, etc.",
          "body": "This Ordinance shall have effect, notwithstanding anything contained in any other law for the time being in force or in any judgment, decree or order of any court."
        },
        {
          "section_no": "11",
          "section_title": "Power to make rules",
          "body": "The Federal Government may, by notification in the official Gazette, make rules for carrying out the purposes of this Ordinance."
        }
      ]
    }
  ],
  "source_file": "administrator8e89d7c42dd9194d3a74a43f12c8fe8e.txt"
}