{
  "error": "Expecting value: line 1 column 1 (char 0)",
  "raw": "THE FACTORIES ACT, 1934 CONTENTS CHAPTER I PRELIMINARY 1. Short title, extent and commencement 2. Definitions 3. References to time of day 4. Seasonal factories 5. Power to apply provisions applicable to factories to certain other places 6. Power to declare departments to be separate factories 7. Power to exempt on a change in the factory 7A. Exemption from certain provisions of the Act 8. Power to exempt during public emergency 9. Notice to Inspector before commencement of work CHAPTER II THE INSPECTING STAFF 10. Inspectors 11. Powers of Inspector 12. Certifying surgeons CHAPTER III HEALTH AND SAFETY 13. Cleanliness 14. Disposal of wastes and effluents 15. Ventilation and temperature 16. Dust and fume 17. Artificial humidification 18. Overcrowding 19. Lighting 20. Drinking water 21. Latrines and urinals 22. Spittoons 23. Precaution against contagious or infectious disease 23A. Compulsory vaccination and inoculation 24. Power to make rules for the provision of canteens 24A. Welfare Officer 25. Precautions in case of fire 26. Fencing of machinery 27. Work on or near machinery in motion 28. Employment of young persons on dangerous machines 29. Striking gear and devices for cutting off power 30. Self-acting machines 31. Casing of new machinery 32. Prohibition of employment of women and children near cotton openers 33. Cranes and other lifting machinery 33A. Hoists and lifts 33B. Revolving machinery 33C. Pressure plant 33D. Floors, stairs and means of access 33E. Pits, sumps, opening in floors, etc. 33F. Excessive weights 33G. Protection of eyes 33H. Powers to require specifications of defective parts or tests of stability 33I. Safety of building, machinery and manufacturing process 33J. Power to make rules to supplement this Chapter 33K. Precautions against dangerous fumes 33L. Explosive or inflammable dust, gas, etc. 33M. Power to exclude children 33N. Notice of certain accident 33P. Appeals 33Q. Additional power to make health and safety rules relating to shelters du",
  "source_file": "administratorf38efe0a6e760531f05b4a29ba4ba215.txt",
  "law_name": "The Factories Act, 1934",
  "year": 1934
}