{
  "error": "Expecting value: line 1 column 1 (char 0)",
  "raw": "THE GUARDIANS AND WARDS ACT, 1890 CONTENTS CHAPTER I PRELIMINARY 1. Title, extent and commencement. 2. [Repealed.] 3. Saving of jurisdiction of Courts of Wards and Chartered High Courts. 4. Definitions. 4A. Power to confer jurisdiction on subordinate judicial officers and to transfer proceedings to such officers. CHAPTER II APPOINTMENT AND DECLARATION OF GUARDIANS 5. [Omitted.] 6. Saving of power to appoint in other cases. 7. Power of the Court to make order as to guardianship. 8. Persons entitled to apply for order. 9. Court having jurisdiction to entertain application. 10. Form of application. 11. Procedure on admission of application. 12. Power to make interlocutory order of production of minor and interim protection of person and property. 13. Hearing of evidence before making of order. 14. Simultaneous proceedings in different Court. 15. Appointment or declaration of several guardians. 16. Appointment or declaration of guardian for property beyond jurisdiction of the Court. 17. Matters to be considered by the Court in appointing guardian. 18. Appointment or declaration of Collector in virtue of office. 19. Guardian not to be appointed by the Court in certain cases. CHAPTER III DUTIES, RIGHTS AND LIABILITIES OF GUARDIANS 20. Fiduciary relation of guardian to ward. 21. Capacity of minors to act as guardians. 22. Remuneration of guardian. 23. Control of Collector as guardian. Guardian of the person Guardian of the Person 24. Duties of Guardian of the Person. 25. Title of guardian to custody of ward. Guardian of the Property 26. Removal of ward from jurisdiction. Guardian of the property 27. Duties of Guardian of Property. 28. Powers of testamentary guardian. 29. Limitation of powers of guardian of property appointed or declared by the Court. 30. Voidability of transfers made in contravention of section 28 or section 29. 31. Practice with respect to permitting transfers under section 29. 32. Variation of powers of guardian of property appointed or declared by the C",
  "source_file": "administratord265c726d2d564a9377ed7a8e04708ae.txt",
  "law_name": "The Guardians and Wards Act, 1890",
  "year": 1890
}