{
  "error": "Expecting value: line 1 column 1 (char 0)",
  "raw": "THE PROVIDENT FUNDS ACT, 1925 CONTENTS 1. Short title, extent and commencement. 2. Definitions. 3. Protection of compulsory deposits. 4. Provisions regarding repayments. 5. Rights of nominees. 6. Power to make deductions. 7. Protection for acts done in good faith. 8. Power to apply the act to the provident Funds. 9. Savings as to estates of soldiers. 10. Repeals. THE SCHEDULE THE PROVIDENT FUNDS ACT, 1925 1ACT No. XIX OF 1925 [27th August, 1925] An Act to amend and consolidate the law relating to Government and other Provident Funds WHEREAS it is expedient to amend and consolidate the law relating to Government and other Provident Funds; It is hereby enacted as follows; 1. Short title, extent and commencement.⸻(1) This Act may be called the Provident Funds Act, 1925. 2[(2) It extends to the whole of Pakistan.] (3) It shall come into force on such date 3as the 4[Federal Government] may, by notification in the 5[official Gazette], appoint. 2. Definitions. ⸻In this Act, unless there is anything repugnant in the subject or context, (a) “compulsory deposit” means a subscription to, or deposit in, a Provident Fund which, under the rules of the Fund, is not, until the happening of some specified contingency, repayable on demand otherwise than for the purpose of the Payment of Premia in respect of a policy of life insurance 6[or the payment of subscriptions or premia in respect of a family pension fund], and includes any contribution 7[* * *] and any interest or increment which has accrued under the rules of the Fund on any such subscription, deposit or contribution, and also any such subscription, deposit, contribution, interest or increment remaining to the credit of the subscriber or depositor after the happening of any such contingency; (b) “contribution” means any amount credited in a Provident Fund, by 8[any authority administering the Fund], by way of addition to, 9[a subscription to, or deposit or balance at the credit of an individual account in], the Fund; and “co",
  "source_file": "administratord058f1585ed54ef81974349bcf705d53.txt",
  "law_name": "The Provident Funds Act, 1925",
  "year": 1925
}