{
  "error": "Expecting value: line 1 column 1 (char 0)",
  "raw": "Updated till 3.8.2022 THE PAKISTAN COINAGE ACT, 1906 CONTENTS SECTIONS: PRELIMINARY 1. Short title and extent. 2. Definitions. 3. Power to establish and abolish Mints. 4. [Repealed.] 5. [Repealed.] COINAGE 6. Denominations, dimensions, designs and composition of coins. 7. Standard weight and remedy. 8-9. [Substituted by section 7.] 10 to 12. [Repealed.] 13. Coins when a legal tender. 14. [Substituted by section 13.] 15. [Repealed.] 15A. Power to call in coin. 15AA. Decimal coinage. DECIMAL COINAGE 15B. [Omitted.] DIMINISHED, DEFACED AND COUNTERFEIT COINS 16. Power to certain persons to cut diminished or defaced silver coins. 17. Procedure in regard to coin cut under section 16 (a). 18. Procedure in regard to coin cut under section 16 (b). 19. Procedure in regard to coin which is liable to be cut under both clause (a) and clause (b) of section 16. 20. Power to certain persons to cut counterfeit or fraudulently defaced coin and procedure in regard to coin so cut. SUPPLEMENTAL PROVISIONS 21. Power to make rules. 22. Bar of suits. 23. Saving of making of other coins at Mints. 24. [Repealed.] THE SCHEDULE. [Repealed.] THE PAKISTAN COINAGE ACT, 1906 1ACT No. III OF 1906 [2nd March, 1906] An Act to consolidate and amend the law relating to Coinage and the Mint. WHEREAS it is expedient to consolidate and amend the law relating to Coinage and the Mint; It is hereby enacted as follows :- PRELIMINARY 2[1. Short title and extent. (1) This Act may be called the Pakistan Coinage Act. (2) It extends to the whole of Pakistan.] 2. Definitions. In this Act, unless there is anything repugnant in the subject or context, (a) “deface”, with its grammatical variations and cognate expressions, includes clipping, filing, stamping or such other alteration of the surface or shape of a coin as is readily distinguishable from the effects of reasonable wear ; (b) “the Mint” includes the Mints now existing and any which may hereafter be established ; (c) “prescribed” includes prescribed by a rule",
  "source_file": "administrator7185aead954fdba01af9221ce6d9e3f8.txt",
  "law_name": "The Pakistan Coinage Act, 1906",
  "year": 1906
}