{
  "law_name": "THE FEDERAL INVESTIGATION AGENCY ACT",
  "year": 1974,
  "chapters": [
    {
      "chapter_title": "Contents",
      "sections": [
        {
          "section_no": "1",
          "section_title": "Short title, extent and commencement",
          "body": "(1) This Act may be called the Federal Investigation Agency Act, 1974. (2) It extends to the whole of Pakistan and also applies to all citizens of Pakistan and public servants, wherever they may be. (3) It shall come into force at once."
        },
        {
          "section_no": "2",
          "section_title": "Definitions",
          "body": "In this Act, unless there is anything repugnant in the subject or context, (a) “Agency” means the Federal Investigation Agency constituted under section 3; (b) “Code” means the Code of Criminal Procedure, 1898 (Act V of 1898); (c) “Director-General” means the Director-General of the Agency; (d) “Provincial Police” means the Police constituted by a Provincial Government under the Police Act, 1861 (V of 1861); (e) “public servant” means a public servant as defined in section 21 of the Pakistan Penal Code (Act XLV of 1860), and includes an employee of any corporation or other body or organization set up, controlled or administered by, or under the authority of, the Federal Government; (f) “Special Police” means the Pakistan Special Police Establishment constituted under the Pakistan Special Police Establishment Ordinance, 1948 (VIII of 1948); (g) “specified persons” means the persons who were appointed to posts in or under a Provincial Police in pursuance of Article 3 of the Special Police and Provincial Police (Amalgamation) Order, 1962 (P. O. No. 1 of 1962); and (h) “rules” means rules made under this Act."
        },
        {
          "section_no": "3",
          "section_title": "Constitution of the Agency",
          "body": "(1) Notwithstanding anything contained in any other law for the time being in force, the Federal Government may constitute an Agency to be called the Federal Investigation Agency for inquiry into, and investigation of, the offences specified in the Schedule, including an attempt or conspiracy to commit, and abetment of, any such offence. (2) The Agency shall consist of a Director General to be appointed by the Federal Government and such number of other officers as the Federal Government may, from time to time, appoint to be members of the Agency."
        },
        {
          "section_no": "4",
          "section_title": "Superintendence and administration of the Agency",
          "body": "(1) The superintendence of the Agency shall vest in the Federal Government. (2) The administration of the Agency shall vest in the Director-General who shall exercise in respect of the Agency such of the powers of an Inspector-General of Police under the Police Act, 1861 (V of 1861), as may be prescribed by rules."
        },
        {
          "section_no": "5",
          "section_title": "Powers of the members of the Agency",
          "body": "(1) Subject to any order which the Federal Government may make in this behalf, the members of the Agency shall, for the purpose of an inquiry or investigation under this Act, have throughout Pakistan such powers, including powers relating to search, arrest of persons and seizure of property, and such duties, privileges and liabilities as the officers of a Provincial Police have in relation to the investigation of offences under the Code or any other law for the time being in force. (2) Subject to rules, if any, a member of the Agency not below the rank of a Sub-Inspector may, for the purposes of any inquiry or investigation under this Act, exercise any of the powers of an officer-in-charge of a police-station in any area in which he is for the time being and, when so exercising such powers, shall be deemed to be an officer-in-charge of a police-station discharging his functions as such within the limits of his station. (3) Without prejudice to the generality of the provisions of sub-section (1) and sub-section (2), any member of the Agency not below the rank of a Sub-Inspector authorized by the Director-General in this behalf may arrest without warrant any person who has committed, or against whom a reasonable suspicion exists that he has committed, any of the offences referred to in sub-section (1) of section 3. (4) For the purpose of the exercise by the members of the Agency of the powers of an officer in charge of a police-station, “Police-station” includes any place declared, generally or specially, by the Federal Government to be a police-station within the meaning of the Code. (5) If, in the opinion of a member of the Agency conducting an investigation, any property which is the subject-matter of the investigation is likely to be removed, transferred or otherwise disposed of before an order of the appropriate authority for its seizure is obtained, such member may, by order in writing, direct the owner or any person who is, for the time being, in possession thereof not to remove, transfer or otherwise dispose of such property in any manner except with the previous permission of that member and such order shall be subject to any order made by the Court having jurisdiction in the matter. (6) Any contravention of an order made under sub-section (5) shall be punishable with rigorous imprisonment for a term which may extend to one year, or with fine, or with both."
        },
        {
          "section_no": "6",
          "section_title": "Power to amend the Schedule",
          "body": "The Federal Government may, by notification in the official Gazette, amend the Schedule so as to add any entry thereto or modify or omit any entry therein."
        },
        {
          "section_no": "7",
          "section_title": "Delegation of powers",
          "body": "The Director-General may, by order in writing, direct that all or any of his powers under this Act or the rules shall, subject to such conditions, if any, as may be specified in the order, be exercisable also by any member of the Agency so specified."
        },
        {
          "section_no": "8",
          "section_title": "Indemnity",
          "body": "No suit, prosecution or other legal proceeding shall lie against the Federal Government, any member of the Agency or any other person exercising any power or performing any function under this Act or the rules for anything which is in good faith done or intended to be done under this Act or the rules."
        },
        {
          "section_no": "9",
          "section_title": "Power to make rules",
          "body": "(1) The Federal Government may, by notification in the official Gazette, make rules for carrying out the purposes of this Act. (2) In particular and without prejudice to the generality of the foregoing power, such rules may provide for all or any of the following matters, namely: (a) the terms and conditions of service of the Director-General and other members of the Agency and the qualifications for recruitment to various posts; (b) the powers and functions of the members of the Agency in relation to the conduct of inquiries and investigations; (c) the nature and extent of the assistance which the Agency may provide to Provincial investigating agencies; (d) the powers of the Inspector-General of Police under the Police Act, 1861 (V of 1861), which shall be exercisable by the Director-General; and (e) the manner in which rewards may be given to the members of the Agency or of the public for rendering commendable services."
        },
        {
          "section_no": "10",
          "section_title": "Repeal",
          "body": "(1) The Pakistan Special Police Establishment Ordinance, 1948, (VIII of 1948), and the Special Police and Provincial Police (Amalgamation) Order, 1962 (P. O. No.1 of 1962), are hereby repealed. (2) Upon the repeal of the said Ordinance, (a) all persons who were members of the Special Police immediately before such repeal, including the specified persons, shall stand transferred to the Agency and shall, subject to sub-section (5), be entitled to the same terms and conditions to which they were entitled immediately before such repeal; and (b) any inquiry or investigation pending with the Special Police immediately before such repeal shall continue to be conducted by the Agency. (3) Notwithstanding the repeal of the said Order, but subject to sub-section (4), every specified person shall continue to be appointed in or under the provincial Police in or under which he was holding a post immediately before the commencement of this Act. (4) On the recommendation of the Director-General, and with the concurrence of the Provincial Government concerned, the Federal Government may direct that such of the specified persons referred to in sub-section (3) as may, within thirty days of the commencement of this Act, express their willingness to serve in or under the Agency shall be appointed to posts in or under the Agency. (5) A specified person referred to in clause (a) of sub-section (2), and a person in respect of whom a direction is issued under sub-section (4) shall, upon the repeal of the said Ordinance or, as the case may be, the issue of such direction, cease to hold a post in or under the Provincial Police concerned and shall be entitled to the same terms and conditions of service to which he was entitled immediately before such repeal or the issue of such direction."
        }
      ]
    }
  ],
  "source_file": "administratordfe187919a2c974a87c531b9e0acd032.txt"
}