{
  "error": "Expecting value: line 1 column 1 (char 0)",
  "raw": "THE ESSO UNDERTAKINGS (VESTING) ACT, 1976. [ CONTENTS 1. Short title, extent and commencement 2. Definitions 3. Act to override other laws 4. Vesting of Esso undertakings 5. Vesting in a Government Company 6. Contracts 7. Lease 8. Re-organization of Government Company 9. Payment 10. Provisions relating to officers and other employees of Esso undertakings 11. Provident Fund 12. Delivery of possession of vested property 13. Penalty 14. Offences by companies 15. Protection of action taken in good faith 16. Cognizance of offences 17. Savings 18. Removal of doubts 19. Power to make rules 20. Power to remove difficulties 21. Repeal THE ESSO UNDERTAKINGS (VESTING) ACT, 1976. 1Act No. LXXIX OF 1976 [27th December, 1976] An Act to provide for vesting in the Federal Government of certain undertakings of Esso Eastern Inc. in Pakistan. WHEREAS it is expedient to provide for vesting in the Federal Government of certain undertakings of Esso Eastern Inc. in Pakistan and for matters connected therewith or ancillary thereto; AND WHEREAS Esso Eastern Inc., a foreign company, has approached the Federal Government for vesting of certain of its undertakings in Pakistan in the Federal Government; AND WHEREAS the scope of such vesting and the amount and manner of the payment to be made to Esso Eastern Inc. for such undertakings has been agreed upon between the Federal Government and Esso Eastern Inc.; It is hereby enacted as follows:- 1. Short title, extent and commencement.-(1) This Act may be called the Esso Undertakings (Vesting) Act, 1976. (2) It extends to the whole of Pakistan. (3) It shall come into force at once. 2. Definitions.- In this Act, unless there is anything repugnant in the subject or context,- (a) “commencing day” means the day on which this Act comes into force; (b) “Government company'' means a company directly or indirectly owned or controlled by the Federal Government in which the Esso undertakings are vested by notification under sub-section (1) of section 5; (c) “",
  "source_file": "administrator5c3cd0bcd9f780556ff2ea2ec2ca3140.txt",
  "law_name": "The Esso Undertakings (Vesting) Act, 1976",
  "year": 1976
}