{
  "law_name": "THE FOREIGNERS ACT",
  "year": 1946,
  "chapters": [
    {
      "chapter_title": "Foreigners Act, 1946",
      "sections": [
        {
          "section_no": "1",
          "section_title": "Short title and extent",
          "body": "(1) This Act may be called the Foreigners Act, 1946. (2) It extends to the whole of Pakistan."
        },
        {
          "section_no": "2",
          "section_title": "Definitions",
          "body": "In this Act- (a) 'foreigner' means a person who is not a citizen of Pakistan; (b) 'prescribed' means prescribed by orders made under this Act; (c) 'specified' means specified by direction of a prescribed authority."
        },
        {
          "section_no": "3",
          "section_title": "Power to make orders",
          "body": "(1) The Federal Government may by order make provision, either generally or with respect to all foreigners or with respect to any particular foreigner or any prescribed class or description of foreigner, for prohibiting, regulating or restricting the entry of foreigners into Pakistan or their departure therefrom or their presence or continued presence therein."
        },
        {
          "section_no": "4",
          "section_title": "Internees",
          "body": "(1) Any foreigner in respect of whom there is in force any order made under clause (g) of sub-section (2) of section 3, directing that he be detained or confined, shall be detained or confined in such place and manner and subject to such condition as to maintenance, discipline and the punishment of offences and breaches of discipline as the Federal Government may from time to time determine."
        },
        {
          "section_no": "5",
          "section_title": "Change of name",
          "body": "(1) No foreigner who was in Pakistan on the date on which this Act came into force shall, while in Pakistan after that date, assume or use or purport to assume or use for any purpose any name other than that by which he was ordinarily known immediately before the said date."
        },
        {
          "section_no": "6",
          "section_title": "Obligations of masters of vessels, etc.",
          "body": "(1) The master of any vessel landing or embarking at a port in Pakistan, passengers coming to or going from that port by sea and the pilot of any aircraft landing or embarking at any place in Pakistan, passengers coming to or going from that place by air, shall furnish to such person and in such manner as may be prescribed a return giving the prescribed particulars with respect to any passengers or members of the crew, who are foreigners."
        },
        {
          "section_no": "7",
          "section_title": "Obligation of hotel keepers and others to furnish particulars",
          "body": ""
        },
        {
          "section_no": "8",
          "section_title": "Determination of nationality",
          "body": ""
        },
        {
          "section_no": "9",
          "section_title": "Burden of proof",
          "body": ""
        },
        {
          "section_no": "10",
          "section_title": "Power to exempt from application of Act",
          "body": ""
        },
        {
          "section_no": "11",
          "section_title": "Power to give effect to orders, directions, etc.",
          "body": ""
        },
        {
          "section_no": "12",
          "section_title": "Power to delegate authority",
          "body": ""
        },
        {
          "section_no": "13",
          "section_title": "Attempts, etc., to contravene the provisions of this Act, etc.",
          "body": ""
        },
        {
          "section_no": "13A",
          "section_title": "Prohibition of assisting illegal entry",
          "body": ""
        },
        {
          "section_no": "13B",
          "section_title": "Prohibition to employ an illegal entrant",
          "body": ""
        },
        {
          "section_no": "14",
          "section_title": "Penalties",
          "body": ""
        },
        {
          "section_no": "14A",
          "section_title": "Restriction on release on bail",
          "body": ""
        },
        {
          "section_no": "14B",
          "section_title": "Deportation pending trial or undergoing sentence of imprisonment",
          "body": ""
        },
        {
          "section_no": "14C",
          "section_title": "Custody pending deportation",
          "body": ""
        },
        {
          "section_no": "14D",
          "section_title": "Registration of illegal immigrants",
          "body": ""
        },
        {
          "section_no": "15",
          "section_title": "Protection to persons acting under this Act",
          "body": ""
        },
        {
          "section_no": "16",
          "section_title": "Application of other laws not barred",
          "body": ""
        },
        {
          "section_no": "17",
          "section_title": "Repeal",
          "body": ""
        }
      ]
    }
  ],
  "source_file": "administrator8922590399098ddfed00a6db56f2f91b.txt"
}