{
  "law_name": "THE PAKISTAN INSTITUTE OF INTERNATIONAL AFFAIRS (ADMINISTRATION) ORDINANCE",
  "year": 1980,
  "chapters": [
    {
      "chapter_title": "Contents",
      "sections": [
        {
          "section_no": "1",
          "section_title": "Short title and commencement",
          "body": "(1) This Ordinance may be called the Pakistan Institute of International Affairs (Administration) Ordinance, 1980. (2) It shall come into force at once."
        },
        {
          "section_no": "2",
          "section_title": "Definitions",
          "body": "In this Ordinance, unless there is anything repugnant in the subject or context, (a) “Administrator” means the Administrator appointed under section 5; (b) “Institute” means the Pakistan Institute of International Affairs registered under the Societies Registration Act, (XXI 1860); and (c) “Managing Committee” means the Managing Committee set up under section 5."
        },
        {
          "section_no": "3",
          "section_title": "Ordinance to override other laws",
          "body": "This Ordinance shall have effect notwithstanding anything contained in the Societies Registration Act, (XXI 1860), or any other law for the time being in force."
        },
        {
          "section_no": "4",
          "section_title": "Dissolution of Council of the Institute, etc.",
          "body": "On the commencement of this Ordinance, (a) the Council of the Institute shall stand dissolved; (b) any person exercising or having the right to exercise immediately before the commencement of this Ordinance any power or function in relation to the Institute shall cease to exercise or to have the right to exercise such power or function; (c) the administration of the affairs of the Institute shall vest in the Administrator; (d) all assets, rights, powers, authorities and privileges, all property movable and immovable, cash and bank balances, reserves funds, investments, and all other interests and rights in, or arising out of, such property, of the Institute shall stand transferred to, and vest in, the Administrator; (e) all debts and liabilities incurred, all obligations undertaken, all contracts entered into, and all agreements made by or with the Institute, shall stand transferred to, and be deemed to have been incurred, undertaken, entered into or made, by or with, the Administrator; (f) any sum payable to, or recoverable by, the Institute shall be deemed to be payable to, or recoverable by, the Administrator; and (g) all suits and other legal proceedings instituted by or against the Institute before such commencement shall be deemed to have been instituted by or against the Administrator and may be continued or proceeded with accordingly."
        },
        {
          "section_no": "5",
          "section_title": "Appointment of Administrator and Managing Committee, etc.",
          "body": "(1) The Federal Government shall appoint an Administrator for the administration of the affairs of the Institute. (2) To aid and advise the Administrator in the performance of his functions, the Federal Government shall constitute a Managing Committee consisting of such persons as it may appoint to be members thereof. (3) The Administrator shall, subject to any direction issued by the Federal Government, be competent to exercise all such powers and perform all such functions as may be necessary for the efficient administration of the affairs of the Institute. (4) The Administrator shall be a Corporation sole and may sue or be sued in his corporate name. (5) The Administrator and a member of the Managing Committee shall hold office during the pleasure of the Federal Government. (6) Neither the Administrator nor a member of the Managing Committee shall be personally liable in respect of any debt or liability incurred, obligation, undertaken, contract entered into, or agreement made, by the Institute."
        },
        {
          "section_no": "6",
          "section_title": "Future Management of the Institute",
          "body": "Within six months of the commencement of this Ordinance, the Administrator shall, in consultation with the Managing Committee, prepare and submit to the Federal Government detailed proposals as to- (a) the future organizational set up of the Institute; (b) financial and administrative measures designed to make the Institute a viable proposition; and (c) the recovery of the arrears and dues of the Institute."
        },
        {
          "section_no": "7",
          "section_title": "Continuance in service of employees",
          "body": "Unless the Administrator otherwise directs in any particular case, all the employees of the Institute in employment immediately before the commencement of this Ordinance shall continue in their respective employments on the same terms and conditions as were applicable to them immediately before such commencement."
        },
        {
          "section_no": "8",
          "section_title": "Bar of jurisdiction",
          "body": "No court shall grant any injunction or make any order or entertain any proceedings in relation to anything in good faith done or intended to be done under this Ordinance."
        },
        {
          "section_no": "9",
          "section_title": "Indemnity",
          "body": "No suit or other legal proceeding shall lie against the Federal Government or the Administrator or any other person in respect of anything in good faith done or intended to be done under this Ordinance."
        },
        {
          "section_no": "10",
          "section_title": "Power to make rules",
          "body": "The Federal Government may make rules for carrying out the purposes of this Ordinance."
        },
        {
          "section_no": "11",
          "section_title": "Removal of difficulties",
          "body": "If any difficulty arises in giving effect to any provision of this Ordinance, the Federal Government may make such order, not consistent with the provisions of this Ordinance, as may appear to it to be necessary for the purpose of removing the difficulty."
        }
      ]
    }
  ],
  "source_file": "administratorc81ef5362bee2815d083a885428b4b77.txt"
}