{
  "law_name": "THE NON-PERFORMING ASSETS AND REHABILITATION OF INDUSTRIAL UNDERTAKINGS (LEGAL PROCEEDINGS) ORDINANCE",
  "year": 2000,
  "chapters": [
    {
      "chapter_title": "Contents",
      "sections": [
        {
          "section_no": "1",
          "section_title": "Short Title, extent and commencement",
          "body": "(1) This Ordinance may be called the Non-performing Assets and Rehabilitation of Industrial Undertakings (Legal Proceedings) Ordinance, 2000. (2) It extends to the whole of Pakistan. (3) It shall come into force at once."
        },
        {
          "section_no": "2",
          "section_title": "Definitions",
          "body": "(1) In this Ordinance, unless there is anything repugnant in the subject or context, various definitions are provided including terms like 'chief Executive', 'CIRC Ordinance', 'Corporation', 'industrial undertaking', 'financial asset', 'financial institution', 'non-performing asset', 'obligor', 'registered interest', 'rules', and 'Schedule'. (2) All other terms and expressions used but not defined in this Ordinance shall have the meanings assigned to them in the CIRC Ordinance."
        },
        {
          "section_no": "3",
          "section_title": "Ordinance to override other laws",
          "body": "The provisions of this Ordinance shall have effect notwithstanding anything contained in any other law for the time being in force."
        },
        {
          "section_no": "4",
          "section_title": "Jurisdiction of High Court",
          "body": "(1) Notwithstanding anything contained in any other law for the time being in force and subject to provisions of this Ordinance, the High Court of a Province within its territorial jurisdiction shall exercise exclusive civil and criminal jurisdiction to adjudicate and decide all claims, legal proceedings, cases for recovery of non-performing asset, outstanding amount against obligor and matters related to, arising from or in connection with the CIRC Ordinance. (2) It is hereby declared for removal of doubt that subject to the provisions of this Ordinance, a High Court and any other Court of Tribunal shall continue to exercise jurisdiction as before under various laws. (3) For the purposes of this Ordinance there shall be one or more Benches in the High Court consisting of one or more Judges to adjudicate the cases under this Ordinance."
        },
        {
          "section_no": "5",
          "section_title": "Procedure and Power of High Court",
          "body": "Subject to the provisions of this Ordinance, the High Court under this Ordinance shall follow the procedure as provided in the Code of Civil Procedure, 1908 and have all the powers, including passing of decree and its execution, as vested in the Civil Court under the Code of Civil Procedure."
        },
        {
          "section_no": "6",
          "section_title": "Transfer of Pending proceedings and institution of new cases",
          "body": "(1) All such legal proceedings, suits, applications and cases pertaining to the obligor in relation to the non-performing assets and the collateral related thereto in which the Corporation has acquired all rights, title, interests, benefits and privileges of a financial under the CIRC Ordinance shall stand transferred to the High Court having jurisdiction under this Ordinance."
        },
        {
          "section_no": "7",
          "section_title": "Institution of suits etc, by the Corporation",
          "body": ""
        },
        {
          "section_no": "8",
          "section_title": "Trial of cases",
          "body": ""
        },
        {
          "section_no": "9",
          "section_title": "Procedure of Verification Committee to apply to proceedings not transferred or instituted under this Ordinance",
          "body": ""
        },
        {
          "section_no": "10",
          "section_title": "Execution of decree, and sale of assets of the obligor",
          "body": ""
        },
        {
          "section_no": "11",
          "section_title": "Sale of Assets in Winding up Proceedings by the High Court",
          "body": ""
        },
        {
          "section_no": "12",
          "section_title": "Outstanding liability and entitlement of obligor",
          "body": ""
        },
        {
          "section_no": "13",
          "section_title": "Inter Creditor matters",
          "body": ""
        },
        {
          "section_no": "14",
          "section_title": "Provisions relating to certain offences",
          "body": ""
        },
        {
          "section_no": "15",
          "section_title": "Transfer of Non-performing assets",
          "body": ""
        },
        {
          "section_no": "16",
          "section_title": "Cognizance of offences",
          "body": ""
        },
        {
          "section_no": "17",
          "section_title": "Non-functioning assets",
          "body": ""
        },
        {
          "section_no": "18",
          "section_title": "Appeal",
          "body": ""
        },
        {
          "section_no": "19",
          "section_title": "Progressive application",
          "body": ""
        },
        {
          "section_no": "20",
          "section_title": "Rules",
          "body": ""
        },
        {
          "section_no": "21",
          "section_title": "Removal of difficulties",
          "body": ""
        }
      ]
    }
  ],
  "source_file": "administrator03c531e7f7d81cd4c6261f24b42be93a.txt"
}