{
  "error": "Expecting value: line 1 column 1 (char 0)",
  "raw": "THE PAKISTAN NURSING COUNCIL ACT, 1973 CONTENTS 1. Short title, extent and commencement. 2. Definitions. 2A. Purpose of Pakistan Nursing and Midwifery Council. 3. Establishment of the Council. 3A. Powers of the Council. 4. Term of office of members. 5. Casual vacancies. 6. Vacancy etc., not to invalidate proceedings. 7. Meetings of Council. 8. President and Vice-President. 9. Executive Committee. 9A. The President. 9B. The Vice-President. 9C. Office of the Council 9D. Secretary. 9E. Finance Director. 9F. Appointment of other Personnel. 9G. Functions of Council. 10. Officers and Supportive Staff of the Council. AS FOR AS POSSIBLE AMENDED ACCORDING TO GAZETTE 11. Nursing Examination Board. 12. Recognition of institutions or authority conducting educational course or programs. 13. Recognition of foreign qualification. 14. Certification of certain persons as possessed of recognized qualification. 15. Effect of recognition. 16. Institutions to furnish information required by Council. 17. Inspection of institution. 18. Withdrawal of recognition. 18A. Maintenance of Data Base. 19. Maintenance of the register. 20. Procedure for registration. 21. Removal of name from the register. 22. Disqualification for registration. 23. Prohibition of employment of unregistered nurses, etc. 24. Penalty for certain offences. 25. Annual report. 26. Power to make regulations. 26A. Powers to make Rules. 27. Repeal and saving. THE PAKISTAN NURSING COUNCIL ACT, 1973. 1ACT NO. XXVI OF 1973 [9th February, 1973] An Act to amend and consolidate the laws relating to registration and training of nurses, midwives and health visitors. WHEREAS it is expedient to amend and consolidate the laws relating to registration and training of nurses, midwives and health visitors and to provide for matters ancillary thereto; It is hereby enacted as follows:- 1. Short title, extent and commencement.-(1) This Act may be called the Pakistan Nursing Council Act, 1973. (2) It extends to the whole of Pakistan. (3) It sh",
  "source_file": "administratorc3238b262f5df9c1e7091d296bc29993.txt",
  "law_name": "The Pakistan Nursing Council Act, 1973",
  "year": 1973
}