{
  "law_name": "THE DOCK WORKERS (REGULATION OF EMPLOYMENT) ACT",
  "year": 1974,
  "chapters": [
    {
      "chapter_title": "Contents",
      "sections": [
        {
          "section_no": "1",
          "section_title": "Short title, extent and commencement",
          "body": "(1) This Act may be called the Dock Workers (Regulation of Employment) Act, 1974. (2) It extends to the whole of Pakistan. (3) It shall come into force at once."
        },
        {
          "section_no": "2",
          "section_title": "Definitions",
          "body": "In this Act, unless there is anything repugnant in the subject or context,- (a) “cargo” means goods and merchandise carried or to be carried on a ship or other vessel; (b) “dock worker” means a person employed or to be employed in any port on loading or unloading of ships or other vessels or on work in connection therewith; (c) “employer” in relation to a dock worker, means the person by whom a dock worker is employed or is to be employed; and (d) “scheme” means a scheme made under this Act."
        },
        {
          "section_no": "3",
          "section_title": "Power to make scheme",
          "body": "(1) The Federal Government may, by notification in the official Gazette, make a scheme for the registration of dock workers with a view to ensuring greater regularity of employment and for efficient and economic turn-round of ships and vessels. (2) In particular and without prejudice to the generality of the foregoing power, such scheme may provide for- (a) the application of the scheme to such classes of dock workers and employers as may be specified therein; (b) defining the obligations of dock workers and employers subject to the fulfilment of which the scheme may apply to them and the circumstances in which the scheme shall cease to apply to any dock workers or employers; (c) regulating the recruitment and entry of dock workers into the scheme and their registration including the preparation and maintenance of registers, the removal, either temporarily or permanently, of names from the register and the imposition of fees for registration; (d) regulating the employment and conduct of dock workers and the terms and conditions of such employment, including rates of remuneration, hours of work and conditions as to holidays and pay in respect thereof and safeguarding the rights, privileges and interests of dock workers under the scheme; (e) securing that, in respect of periods during which employment or full employment is not available for dock workers to whom the scheme applies and who are available for work, such workers will, subject to the conditions of the scheme, receive a minimum pay; (f) managing the property and funds created for the benefit of dock workers; (g) prohibiting, restricting or otherwise controlling the employment of dock workers to whom the scheme does not apply; (h) the training and welfare of dock workers in so far as satisfactory provision thereof does not exist apart from the scheme; (i) health and safety measures in places where dock workers are employed in so far as satisfactory provision therefor does not exist apart from the scheme; (j) the manner in which, and the person by whom, the cost of operating the scheme is to be defrayed; (k) constituting, whether as a body corporate or otherwise, the authority to be responsible for the administration of the scheme; and (l) such incidental and supplementary matters as may be necessary or expedient for the purpose of the scheme. (3) A scheme shall apply to such port or group of ports as the Federal Government may, by notification in the official Gazette, specify in this behalf. (4) A scheme may further provide that a contravention of any provision thereof shall be punishable with imprisonment for such term as may be specified but in no case exceeding six months in respect of a first contravention or one year in respect of any subsequent contravention, or with fine which may extend to such amount as may be specified but in no case exceeding two thousand five hundred rupees in respect of a first contravention or five thousand rupees in respect of any subsequent contravention, or with both imprisonment and fine as aforesaid."
        },
        {
          "section_no": "4",
          "section_title": "[Omitted]",
          "body": ""
        },
        {
          "section_no": "5",
          "section_title": "Funds to be handed over to Federal Government, etc.",
          "body": "(1) Notwithstanding anything to the contrary contained in any other law or in any memorandum of settlement or award, all funds created for the benefit of the dock workers in any manner whatsoever and under the control or management of any person, board or organisation or committee shall, immediately on the commencement of this Act, be transferred, alongwith all records and accounts, to the Federal Government or to such other body as the Federal Government may, by notification in the official Gazette, specify in this behalf. (2) The person or persons in control or management of any such fund shall not, after the commencement of this Act, spend any amount of such fund and shall be personally liable to make good any amount so spent. (3) Whoever contravenes the provisions of sub-section (1) or sub-section (2) shall, without prejudice to any action that may be taken against him under this Act, be punishable with imprisonment for a term which may extend to two years, or with fine which may extend to five thousand rupees, or with both."
        },
        {
          "section_no": "6",
          "section_title": "Recovery of money due",
          "body": "Any money due from any person, board, organisation or committee under sub-section (1) or sub-section (2) of section 5 shall be recoverable as an arrear of land revenue on the request of the body nominated by the Federal Government under the said sub-section (1)."
        },
        {
          "section_no": "7",
          "section_title": "Cognizance of offences",
          "body": "(1) No court shall take cognizance of any offence punishable under this Act or of any abetment thereof except on a report in writing of the facts constituting such offence or abetment made by an Inspector or a person specially authorised in this behalf by the Federal Government. (2) Notwithstanding anything contained in the Code of Criminal Procedure, 1898 (Act V of 1898), an offence punishable under this Act or an abetment thereof shall be triable only by a Magistrate of the first class."
        },
        {
          "section_no": "8",
          "section_title": "Act to over-ride other laws",
          "body": "The provisions of this Act and any scheme prepared thereunder shall have effect notwithstanding anything to the contrary contained in any other law for the time being in force."
        },
        {
          "section_no": "9",
          "section_title": "Repeal",
          "body": "The Dock Workers (Regulation of Employment) Ordinance, 1973 (XXVIII of 1973), is hereby repealed."
        }
      ]
    }
  ],
  "source_file": "administratorb9c98a0e2872fb69256d9220ad031781.txt"
}