{
  "law_name": "THE EVACUEE TRUST PROPERTIES (MANAGEMENT AND DISPOSAL) ACT",
  "year": 1975,
  "chapters": [
    {
      "chapter_title": "Contents",
      "sections": [
        {
          "section_no": "1",
          "section_title": "Short title, extent and commencement",
          "body": "(1) This Act may be called the Evacuee Trust Properties (Management and Disposal) Act, 1975. (2) It extends to the whole of Pakistan. (3) It shall come into force at once and shall be deemed to have taken effect on the first day of July, 1974."
        },
        {
          "section_no": "2",
          "section_title": "Definitions",
          "body": "(1) In this Act, unless there is anything repugnant in the subject or context, various definitions are provided including 'Act', 'Board', 'Chairman', 'evacuee trust property', and others."
        },
        {
          "section_no": "3",
          "section_title": "Constitution of the Board",
          "body": "(1) The Federal Government shall constitute a Board, to be known as the Evacuee Trust Property Board, for the management and disposal of evacuee trust property."
        },
        {
          "section_no": "4",
          "section_title": "Functions of the Board",
          "body": "(1) The general supervision and control of all evacuee trust property shall, subject to any directions that may be given by the Federal Government, vest in the Board."
        },
        {
          "section_no": "5",
          "section_title": "Meetings of the Board",
          "body": "(1) The Board shall regulate the procedure for its meetings."
        },
        {
          "section_no": "6",
          "section_title": "Vesting of evacuee trust property",
          "body": "All evacuee trust property shall vest in the Federal Government."
        },
        {
          "section_no": "7",
          "section_title": "Trust Pool",
          "body": "For the purposes of management, maintenance and disposal of evacuee trust property a Trust Pool shall be constituted."
        },
        {
          "section_no": "8",
          "section_title": "Declaration of Property as evacuee trust property",
          "body": "(1) If a question arises whether an evacuee property is attached to a charitable, religious or educational trust or institution or not, it shall be decided by the Chairman."
        },
        {
          "section_no": "9",
          "section_title": "Exemption of Property in Trust Pool from process",
          "body": "No evacuee trust property shall be liable to be proceeded against for any claim in any manner whatsoever."
        },
        {
          "section_no": "10",
          "section_title": "Validation of certain transfers",
          "body": "(1) An immovable evacuee trust property, if situated in a rural area and utilised bona fide under any Act prior to June, 1964, for allotment against the satisfaction of verified claims."
        }
      ]
    }
  ],
  "source_file": "administrator9d6044552dddd25e9550942e2163e5da.txt"
}