{
  "law_name": "THE FOREIGN PRIVATE INVESTMENT (PROMOTION AND PROTECTION) ACT",
  "year": 1976,
  "chapters": [
    {
      "chapter_title": "Contents",
      "sections": [
        {
          "section_no": "1",
          "section_title": "Short title, commencement and application",
          "body": "(1) This Act may be called the Foreign Private Investment (Promotion and Protection) Act, 1976. (2) It shall come into force at once. (3) It shall apply to all industrial undertakings in Pakistan having foreign private investment established with the approval of the Federal Government after the first day of September, 1954: Provided that nothing in this Act shall be in derogation of any facilities or protection specifically sanctioned by the Federal Government to foreign private investment in the case of a particular industrial undertaking or a class of industrial undertakings or such facilities or protection as may be available to foreign private investment under a bilateral investment treaty."
        },
        {
          "section_no": "2",
          "section_title": "Definitions",
          "body": "(1) In this Act, unless there is anything repugnant in the subject or context,- (a) “foreign capital” means investment made by a foreigner or by a person who, being a citizen of Pakistan, is also the citizen of any other country in an industrial undertaking in Pakistan- (i) in the form of foreign exchange, imported machinery and equipment, or (ii) in any other form which the Federal Government may approve for the purpose; (b) “foreign private investment” means investment in foreign capital by a person who is not a citizen of Pakistan or who, being a citizen of Pakistan, is also the citizen of any other country or by a company incorporated outside Pakistan, but does not include investment by a foreign Government or agency of foreign Government; (c) “industrial undertaking” means an industry, undertaking or establishment engaged in the production, distribution or processing of any goods, the providing of services specified in this behalf by the Federal Government or the development and extraction of such mineral resources and products as may be specified in this behalf by the Federal Government but, for the purpose of investment by a person who, being a citizen of Pakistan, is also the citizen of any other country, does not include an undertaking or establishment engaged in providing banking or insurance services. (2) Words and expressions used but not defined in this Act shall have the same meanings as in the Companies Act, 1913 (VII of 1913)."
        },
        {
          "section_no": "3",
          "section_title": "Field for foreign private investment",
          "body": "The Federal Government may consistent with the national interest, for the promotion of foreign private investment, authorise such investment in any industrial undertaking- (a) which does not exist in Pakistan and the establishment whereof in the opinion of the Federal Government, is desirable; or (b) which is not being carried on in Pakistan on a scale adequate to the economic and social needs of the country; or (c) which will contribute to- (i) the development of capital, technical and managerial resources of Pakistan; (ii) the discovery, mobilisation or better utilization of the national resources; (iii) the strengthening of the balance of payments of Pakistan; (iv) increasing employment opportunities in Pakistan; or (v) the economic development of the country in any other manner."
        },
        {
          "section_no": "4",
          "section_title": "Approval of Foreign Private Investment",
          "body": "Any sanction granted by the Federal Government for investment in an industrial undertaking shall be subject to the following conditions and to such other conditions as the Federal Government may specify, namely:- When the foreign private investment is by a person who, being a citizen of Pakistan, is also the citizen of any other country, he shall deposit the entire amount of repatriable foreign investment in a foreign exchange account in Pakistan for its subsequent use for the purchase of machinery and other fixed assets of the undertaking."
        },
        {
          "section_no": "5",
          "section_title": "Protection of agreements",
          "body": "(1) Where the Federal Government considers it necessary in the public interest to take over the management of an industrial undertaking having foreign private investment or to acquire the ownership of the shares of citizens of Pakistan in the capital of such industrial undertaking, any agreement approved by the Federal Government relating to such undertakings entered into between a foreign investor or creditor and any person in Pakistan shall not be affected by such taking over or acquisition. (2) Foreign capital or foreign private investment in an industrial undertaking shall not be acquired except under due process of law which provides for adequate compensation therefor to be settled in the currency of the country of origin of the capital or investment and specifies the principles on and the manner in which compensation is to be determined and given."
        },
        {
          "section_no": "6",
          "section_title": "Repatriation facilities",
          "body": "Subject to the provisions of the Foreign Exchange Regulation Act, 1947 (VII 1947). (a) a foreign investor in an industrial undertaking established after the 1st day of September, 1954, and approved by the Federal Government, may at any time repatriate in the currency of the country from which the investment originated- (i) foreign private investment to the extent of original investment; (ii) profits earned on such investment; and (iii) any additional amount resulting from the reinvested profits or appreciation of capital investment; and (b) a creditor of an industrial undertaking referred to in clause (a) may repatriate foreign currency loans approved by the Federal Government and interest thereon in accordance with the terms and conditions of the said loan: Provided that nothing in this section shall affect the terms of the permission to make such investment granted to a foreign investor before the commencement of this Act."
        },
        {
          "section_no": "7",
          "section_title": "Remittances by foreign employees",
          "body": "Foreign nationals employed with the approval of the Federal Government in any industrial undertaking having foreign private investment may make remittances for the maintenance of their dependents in accordance with the rules, regulations or orders issued by the Federal Government or the State Bank of Pakistan."
        },
        {
          "section_no": "8",
          "section_title": "Tax concession and avoidance of double taxation",
          "body": "(1) The Federal Government may allow such concessions to industrial undertakings having foreign private investment as may be admissible under any law for the time being in force. (2) Foreign private investment shall not be subject to other or more burdensome taxes on income than those applicable to investment made in similar circumstances by citizens of Pakistan. (3) Foreign private investment shall be allowed all the tax concessions which may be admissible on the basis of any agreement for avoidance of double taxation which the Government of Pakistan may have entered into with the Government of the country of origin of such investment."
        },
        {
          "section_no": "9",
          "section_title": "Equal treatment",
          "body": "Industrial undertakings having foreign private investment shall be accorded the same treatment as is accorded to similar industrial undertakings having no such investment in the application of laws, rules and regulations relating to importation and exportation of goods."
        },
        {
          "section_no": "10",
          "section_title": "Removal of difficulties",
          "body": "If any difficulty arises in giving effect to any provisions of this Act, the Federal Government may make such order, not inconsistent with the provisions of this Act, as may appear to it to be necessary for the purpose of removing the difficulty: Provided that no such power shall be exercised after the expiry of one year from the commencement of this Act."
        },
        {
          "section_no": "11",
          "section_title": "Power to make rules",
          "body": "The Federal Government may, by notification in the official Gazette, make rules for carrying out the purposes of this Act, and such rules may, among other matters, provide for the employment of Pakistani and foreign nationals in industrial undertakings having foreign private investment."
        },
        {
          "section_no": "12",
          "section_title": "Repeal",
          "body": "[Repeal]. Omitted by the Federal Laws (Revision and Declaration) Ordinance, 1981 (XXVII of 1981), s. 3 and Sch., II."
        }
      ]
    }
  ],
  "source_file": "administratoree5b868df2638762a408c9a3535684a6.txt"
}