{
  "law_name": "THE RAILWAYS (TRANSPORT OF GOODS) ACT",
  "year": 1947,
  "chapters": [
    {
      "chapter_title": "Contents",
      "sections": [
        {
          "section_no": "1",
          "section_title": "Short title, extent, commencement and duration.",
          "body": "(1) This Act may be called the Railways (Transport of Goods) Act, 1947. (2) It extends to the whole of Pakistan. (3) It shall come into force on the 25th day of March 1947, and shall remain in force for thirty-one years only."
        },
        {
          "section_no": "2",
          "section_title": "Interpretation.",
          "body": "(1) In this Act, (b) 'grains and pulses' means bajree, barley, beans, black gram, chowlee seeds, chuni, dry cow-peas, dhall, gram parched gram, horse gram Indian corn jowari, kara mony, khesari, moong, mussoor, mutt, oats, oorid, paddy, peas, raggi, rajgeera, rice (including beaten or pounded rice), common sago, sun-dried tapioca, toor and wheat; (c) 'railway administration' has the meaning assigned to it in the Railways Act, 1890 (IX of 1890). (2) For the purposes of this Act the transport of goods shall be deemed to be sponsored only if such transport (a) is required on the written demand of, or (b) is in accordance with any programme of transport drawn up in writing by, or (c) is certified in this behalf on the consignment note relating to the goods by the Federal Government, a Provincial Government or the Government of an Acceding State, or any person authorised in writing in this behalf by any such Government as aforesaid."
        },
        {
          "section_no": "3",
          "section_title": "Power to give directions in regard to the transport of goods by railways.",
          "body": "The Federal Government or any person authorised in this behalf by the Federal Government by notification in the official Gazette may, by general or special order, direct any railway administration (a) to give, subject to such conditions or restrictions as the Federal Government or the person so authorised may impose, special facilities or preference for the transport of the goods specified in the second column of the Schedule, on compliance with the conditions, if any set out in the corresponding entry in the third column thereof, or (b) to refuse to carry such goods or classes of goods as may be specified in the order, either absolutely or between places so specified."
        },
        {
          "section_no": "4",
          "section_title": "Directions to be complied with.",
          "body": "Notwithstanding anything to the contrary contained in the Railways Act, 1890 (IX of 1890), every railway administration shall be bound to comply with any direction given to it under section 3."
        },
        {
          "section_no": "5",
          "section_title": "Protection of action taken.",
          "body": "No suit or other legal proceedings shall lie against the State or any railway administration or any person for any damage caused or likely to be caused in consequence of any direction issued under section 3 or of the compliance of any railway administration therewith, nor shall any railway administration have any liability, whether under the Railways Act, 1890 (IX of 1890), or otherwise, by reason only of its compliance with any such direction."
        },
        {
          "section_no": "6",
          "section_title": "Power to amend Schedule.",
          "body": "The Federal Government may from time to time by notification in the official Gazette amend the Schedule so as to include therein goods of other descriptions or exclude therefrom goods of any description or vary in respect of any description of goods the conditions set out in the third column of the Schedule and thereupon the Schedule shall have effect as if it had been so enacted."
        }
      ]
    }
  ],
  "source_file": "administrator96adf8fa0f924275586ee1a77b062568.txt"
}