{
  "law_name": "THE NATIONAL HIGHWAY AUTHORITY ACT",
  "year": 1991,
  "chapters": [
    {
      "chapter_title": "PRELIMINARY",
      "sections": [
        {
          "section_no": "1",
          "section_title": "Short title, extent and commencement",
          "body": "(1) This Act may be called the National Highway Authority Act, 1991. (2) It extends to the whole of Pakistan. (3) It shall come into force at once."
        },
        {
          "section_no": "2",
          "section_title": "Definitions",
          "body": "In this Act, unless there is anything repugnant in the subject or context, (a) “Auditor General” means the Auditor General of Pakistan; (b) “Authority” means the National Highway Authority established under section 3; (c) “Board” means the Executive Board of the Authority; (ca) “CDWP” means the Central Development Working Party; (d) “chief executive officer” means the chief executive officer of the Authority; (e) “Council” means the National Highway Council; (ea) “ECNEC” means the Executive Committee of the National Economic Council; (eb) “executive member” means a member of the Board; (f) “member” means member of the Council; (fa) “motorway” means a fully controlled access road designed and built for high speed mobility of motor traffic ensuring international safety standards; (g) “National Highway” means a highway primarily designed for inter-provincial or cross-border connectivity; (h) “Chairman” means Chairman of the Council; (i) “Regulations” means regulations framed under this Act; (j) “Right of Way” (ROW) means the land acquired for the purpose of construction of a National Highway; (k) “road” means a road including land within the right of way; (l) “rules” means rules made under this Act; (la) “Schedule” means the Schedule to this Act; (lb) “SOE Act” means the State-Owned Enterprises (Governance and Operations) Act, 2023; (m) “strategic road” means a road having strategic importance or defense requirements."
        }
      ]
    },
    {
      "chapter_title": "ESTABLISHMENT AND MANAGEMENT OF THE AUTHORITY",
      "sections": [
        {
          "section_no": "3",
          "section_title": "Establishment of National Highway Authority",
          "body": "(1) As from the commencement of this Act there shall be established for carrying out the purposes of this Act, an Authority to be known as the National Highway Authority. (2) The Authority shall be a body corporate having perpetual succession and a common seal with power to acquire, hold and dispose of property, and may by its name sue and be sued. (3) The headquarters of the Authority shall be at Islamabad."
        },
        {
          "section_no": "4",
          "section_title": "Purpose and functions of Authority",
          "body": "The purpose and functions of the Authority shall be to plan, promote, organise and implement programmes for construction, development operation, repairs and maintenance of national highways, motorways and strategic roads."
        },
        {
          "section_no": "5",
          "section_title": "National Highway Council",
          "body": "(1) There stands established the National Highway Council consisting of various members including independent members appointed by the Federal Government. (2) The Federal Government may, by notification in the official Gazette, increase or decrease the number of members of the Council. (3) The general policy direction of the Authority shall vest in the Council."
        },
        {
          "section_no": "6",
          "section_title": "Powers and function of the Council",
          "body": "(1) The Council shall exercise its powers and perform its functions in accordance with the provisions of this Act. (2) The Council shall approve five years’ plans, annual maintenance plans, and lay down national policies and guidelines."
        },
        {
          "section_no": "7",
          "section_title": "Executive Board",
          "body": "(1) The Council shall be assisted by an Executive Board consisting of various members including the chief executive officer. (2) The chief executive officer shall be responsible for the management of the Authority."
        }
      ]
    },
    {
      "chapter_title": "POWERS AND DUTIES OF THE AUTHORITY",
      "sections": [
        {
          "section_no": "10",
          "section_title": "The power of the Authority",
          "body": "The Authority shall have the power to carry out its functions as specified in this Act."
        },
        {
          "section_no": "11",
          "section_title": "Plans and schemes",
          "body": "The Authority shall prepare plans and schemes for the development of national highways."
        },
        {
          "section_no": "12",
          "section_title": "Powers to eject unauthorized occupants",
          "body": "The Authority shall have the power to eject unauthorized occupants from the land acquired for national highways."
        }
      ]
    },
    {
      "chapter_title": "ESTABLISHMENT",
      "sections": [
        {
          "section_no": "13",
          "section_title": "Appointment of officers, servants etc.",
          "body": "The Authority shall appoint officers and servants as necessary for the performance of its functions."
        },
        {
          "section_no": "14",
          "section_title": "Recruitment and condition of service",
          "body": "The Authority shall determine the recruitment and conditions of service for its officers and servants."
        },
        {
          "section_no": "15",
          "section_title": "Chief Executive Officer, etc., to be deemed to be public servants",
          "body": "The Chief Executive Officer and other officers shall be deemed to be public servants."
        },
        {
          "section_no": "16",
          "section_title": "Delegation of powers to Chief Executive Officer, etc.",
          "body": "The Authority may delegate powers to the Chief Executive Officer and other officers."
        },
        {
          "section_no": "17",
          "section_title": "Industrial Relations Ordinance, 1969 (XXIII of 1969), not to apply",
          "body": "The provisions of the Industrial Relations Ordinance shall not apply to the Authority."
        },
        {
          "section_no": "18",
          "section_title": "Persons serving National Highways Board",
          "body": "Persons serving on the National Highways Board shall be governed by the provisions of this Act."
        },
        {
          "section_no": "19",
          "section_title": "Authority to be local authority",
          "body": "The Authority shall be deemed to be a local authority for the purposes of this Act."
        }
      ]
    },
    {
      "chapter_title": "REPORTS AND STATEMENTS",
      "sections": [
        {
          "section_no": "20",
          "section_title": "Submission of yearly reports and returns, etc.",
          "body": "The Authority shall submit yearly reports and returns as required."
        }
      ]
    },
    {
      "chapter_title": "FINANCE",
      "sections": [
        {
          "section_no": "21",
          "section_title": "National Highway Authority Fund",
          "body": "The Authority shall establish a fund for its financial operations."
        },
        {
          "section_no": "22",
          "section_title": "Maintenance of accounts",
          "body": "The Authority shall maintain proper accounts of its financial transactions."
        },
        {
          "section_no": "23",
          "section_title": "Annual statement of accounts",
          "body": "The Authority shall prepare an annual statement of accounts."
        },
        {
          "section_no": "24",
          "section_title": "Audit",
          "body": "The accounts of the Authority shall be audited as per the applicable laws."
        }
      ]
    },
    {
      "chapter_title": "MISCELLANEOUS",
      "sections": [
        {
          "section_no": "25",
          "section_title": "Recovery of arrears due as arrears of land revenues",
          "body": "The Authority shall have the power to recover arrears due as arrears of land revenues."
        },
        {
          "section_no": "26",
          "section_title": "Land acquisition",
          "body": "The Authority shall have the power to acquire land for its purposes."
        },
        {
          "section_no": "27",
          "section_title": "Transfer of rights and liabilities",
          "body": "The Authority may transfer rights and liabilities as necessary."
        },
        {
          "section_no": "28",
          "section_title": "Authentication of orders and other instruments of the Authority",
          "body": "Orders and instruments of the Authority shall be authenticated as per the provisions of this Act."
        },
        {
          "section_no": "29",
          "section_title": "Power to enter",
          "body": "The Authority shall have the power to enter land for its functions."
        },
        {
          "section_no": "30",
          "section_title": "Indemnity, etc.",
          "body": "The Authority and its members shall be indemnified for actions taken in good faith."
        },
        {
          "section_no": "31",
          "section_title": "Rules",
          "body": "The Authority may make rules for the implementation of this Act."
        },
        {
          "section_no": "32",
          "section_title": "Regulations",
          "body": "The Authority may make regulations for the implementation of this Act."
        },
        {
          "section_no": "33",
          "section_title": "Removal of difficulties",
          "body": "The Authority may take measures to remove difficulties in the implementation of this Act."
        }
      ]
    }
  ],
  "source_file": "administrator1cbd99cb7f8f339e9c392ec37738953f.txt"
}