{
  "error": "Expecting value: line 1 column 1 (char 0)",
  "raw": "THE BOARD OF INVESTMENT ORDINANCE, 2001 CONTENTS CHAPTER. I PRELIMINARY 1. Short title, extent and commencement 2. Definitions CHAPTER. I ESTABLISHMENT OF THE BOARD OF INVESTMENT 3. Establishment of the Board of Investment 4. Chairman 5. Secretary 6. Non-official members 7. Meetings of the Board 8. Validity of proceedings 9. Functions of BOI 10. Directive of the Federal Government 10A. Establishment of a Special Investment Facilitation Council 10B. Scope of work of the Special Investment Facilitation Council 10C. Functions of the Special Investment Facilitation Council 10D. Formation of Committees 10E. Power to issue directions 10F. Power to relax or exempt from regulatory compliance 10G. Immunity 10H. Overriding effect 10I. Power to make rules 10J. Removal of difficulties CHAPTER. III FINANCE AND ACCOUNTS 11. Grants 12. Fund 13. Budget and accounts 14. Annual Report CHAPTER. IV PROVINCIAL INVESTMENT COMMITTEES 15. Provincial Investment Committees CHAPTER. V MISCELLANEOUS 16. Delegation of powers 17. Recruitment etc 18. Members, officers, staff, etc. deemed to be public servants 19. Assistance from other agencies 20. Indemnity 21. Transfer of employees and assets 22. Committees 23. Power to make rules 24. Power to make regulations 25. Removal of difficulties THE BOARD OF INVESTMENT ORDINANCE, 2001 ORDINANCE No. XV OF 2001 [22nd March, 2001] An Ordinance to provide for the establishment of the Board of Investment as an apex agency to promote, encourage and facilitate both local and foreign investment WHEREAS it is expedient to provide for the establishment of Board of Investment to promote, encourage and facilitate local and foreign investment, and for matters connected therewith and ancillary thereto; AND WHEREAS the National Assembly and the Senate stand suspended in pursuance of the Proclamation of Emergency of the fourteenth day of October, 1999, and the Provisional Constitution Order No. l of 1999; AND WHEREAS the President is satisfied that circumstances exist ",
  "source_file": "administrator0ec3cfea1b3f330a93b185f57df04634.txt",
  "law_name": "The Board of Investment Ordinance, 2001",
  "year": 2001
}