{
  "law_name": "THE IDENTIFICATION OF PRISONERS ACT",
  "year": 1920,
  "chapters": [
    {
      "chapter_title": "Identification of Prisoners",
      "sections": [
        {
          "section_no": "1",
          "section_title": "Short title and extent",
          "body": "(1) This Act may be called the Identification of Prisoners Act, 1920; and (2) It extends to the whole of Pakistan."
        },
        {
          "section_no": "2",
          "section_title": "Definitions",
          "body": "In this Act, unless there is anything repugnant in the subject or context, (a) 'measurements' include finger impressions and foot-print impressions; (b) 'police officer' means an officer-in-charge of a police-station, a police officer making an investigation under Chapter XIV of the Code of Criminal Procedure, 1898 (V of 1898), or any other police officer not below the rank of sub-inspector; and (c) 'prescribed' means prescribed by rules made under this Act."
        },
        {
          "section_no": "3",
          "section_title": "Taking of measurements, etc., of convicted persons",
          "body": "Every person who has been (a) convicted of any offence punishable with rigorous imprisonment for a term of one year or upwards, or of any offence which would render him liable to enhanced punishment on a subsequent conviction, or (b) ordered to give security for his good behavior under section 118 of the Code of Criminal Procedure, 1898 (V of 1898), shall, if so required, allow his measurements and photograph to be taken by a police officer in the prescribed manner."
        },
        {
          "section_no": "4",
          "section_title": "Taking of measurements, etc., of non-convicted persons",
          "body": "Any person who has been arrested in connection with an offence punishable with rigorous imprisonment for a term of one year or upwards shall, if so required by a police officer, allow his measurements to be taken in the prescribed manner."
        },
        {
          "section_no": "5",
          "section_title": "Power of Magistrate to order a person to be measured or photographed",
          "body": "If a Magistrate is satisfied that, for the purposes of any investigation or proceeding under the Code of Criminal Procedure, 1898 (V of 1898), it is expedient to direct any person to allow his measurements or photograph to be taken, he may make an order to that effect, and in that case the person to whom the order relates shall be produced or shall attend at the time and place specified in the order and shall allow his measurements or photograph to be taken, as the case may be, by a police officer: Provided, that no order shall be made directing any person to be photographed except by a Magistrate of the first class: Provided further, that no order shall be made under this section unless the person has at some time been arrested in connection with such investigation or proceeding."
        },
        {
          "section_no": "6",
          "section_title": "Resistance to the taking of measurements, etc.",
          "body": "(1) If any person who under this Act is required to allow his measurements or photograph to be taken resists or refuses to allow the taking of the same, it shall be lawful to use all means necessary to secure the taking thereof. (2) Resistance to or refusal to allow the taking of measurements or photographs under this Act shall be deemed to be an offence under section 186 of the Pakistan Penal Code (XLV of 1860)."
        },
        {
          "section_no": "7",
          "section_title": "Destruction of photographs and records of measurements, etc., on acquittal",
          "body": "Where any person who, not having been previously convicted of an offence punishable with rigorous imprisonment for a term of one year or upwards, has had his measurements taken or has been photographed in accordance with the provisions of this Act is released without trial or discharged or acquitted by any Court, all measurements and all photographs (both negatives and copies) so taken shall, unless the Court or (in a case where such person is released without trial) the District Magistrate or Sub-Divisional Officer for reasons to be recorded in writing otherwise directs, be destroyed or made over to him."
        },
        {
          "section_no": "8",
          "section_title": "Power to make rules",
          "body": "(1) The Provincial Government may make rules for the purpose of carrying into effect the provisions of this Act. (2) In particular and without prejudice to the generality of the foregoing provisions, such rules may provide for (a) restrictions on the taking of photographs of persons under section 5; (b) the places at which measurements and photographs may be taken; (c) the nature of the measurements that may be taken; (d) the method in which any class or classes of measurements shall be taken; (e) the dress to be worn by a person when being photographed under section 3; and (f) the preservation, safe custody, destruction and disposal of records of measurements and photographs."
        },
        {
          "section_no": "9",
          "section_title": "Bar of suits",
          "body": "No suit or other proceeding shall lie against any person for anything done, or intended to be done, in good faith under this Act or under any rule made thereunder."
        }
      ]
    }
  ],
  "source_file": "administrator0449eaff2b216ed0348847b7647bb565.txt"
}