{
  "law_name": "THE NATURAL GAS (DEVELOPMENT SURCHARGE) ORDINANCE",
  "year": 1967,
  "chapters": [
    {
      "chapter_title": "Contents",
      "sections": [
        {
          "section_no": "1",
          "section_title": "Short title, extent and commencement",
          "body": "This Ordinance may be called the Natural Gas (Development Surcharge) Ordinance, 1967. It extends to the whole of Pakistan. It shall come into force at once."
        },
        {
          "section_no": "2",
          "section_title": "Definitions",
          "body": "In this Ordinance unless there is anything repugnant in the subject or context, 'company' means a company specified in the Schedule; 'development surcharge' means the surcharge payable under section 3; 'differential margin' means the amount by which the fixed sale price exceeds the prescribed price; 'fixed sale price' means such sale price and tariff, not exceeding forty rupees per deca cubic metre, as the Federal Government may, from time to time, by notification in the official Gazette, declare to be the fixed sale price for the purposes of this Ordinance; 'natural gas' means gas obtained from bore holes and wells consisting primarily of hydrocarbons; 'prescribed price' means such sale price and tariff as the Federal Government may, in accordance with the Natural Gas Rules, 1960, by notification in the official Gazette, declare, in respect of any period, whether before or after the commencement of this Ordinance to be the prescribed price for the purpose of this Ordinance."
        },
        {
          "section_no": "3",
          "section_title": "Levy of Development Surcharge",
          "body": "Every company shall collect and pay to the Federal Government a development surcharge equal to the differential margin in respect of natural gas sold by it after thirty-first day of May, 1964. The development surcharge in respect of natural gas sold before the commencement of this Ordinance shall be paid within such time after such commencement as may be specified by the Federal Government or any officer authorised by it in this behalf. An amount at the rate of fifteen per cent per annum shall be payable in addition to the amount due under sub-section (1) or under sub-section (2), if the amount is not paid within the time specified for such payment."
        },
        {
          "section_no": "4",
          "section_title": "Allowance to be made for Development Surcharge for purposes of Income-Tax",
          "body": "The amount paid by a company as development surcharge shall be an expenditure for which allowance is to be made under section 20 of the Income Tax Ordinance, 2001 in computing the profits or gains of that company."
        },
        {
          "section_no": "5",
          "section_title": "Maximum Sale Price",
          "body": "No company shall sell or offer for sale natural gas at a price higher than the fixed sale price. Where any company contravenes the provisions of sub-section (1), every director, manager, secretary or other officer who was in charge of, and was responsible to, the company for the conduct of its business or for the management of its sales at the time the contravention was committed, shall, unless he proves that the contravention was committed without his knowledge or that he exercised all due diligence to prevent such contravention, be guilty of an offence punishable with imprisonment for a term which may extend to three years, or with fine, or with both."
        },
        {
          "section_no": "6",
          "section_title": "Cognizance of offence",
          "body": "No court shall take cognizance of an offence under this Ordinance save on a complaint in writing made by or under the authority of the Federal Government."
        },
        {
          "section_no": "7",
          "section_title": "Power to make rules",
          "body": "The Federal Government may, by notification in the official Gazette, make rules for carrying out the purposes of this Ordinance. In particular and without prejudice to the generality of the foregoing power, such rules may provide for the manner and time of payment of development surcharge; and any other matter for which provision is, in the opinion of the Federal Government, necessary for carrying into effect the provisions of this Ordinance."
        },
        {
          "section_no": "8",
          "section_title": "Power to amend Schedule",
          "body": "The Federal Government may, by notification in the official Gazette, make such amendments and modifications in the Schedule as it thinks fit."
        }
      ]
    }
  ],
  "source_file": "administratorfd6d3aeaf486058588ab550ea5475652.txt"
}