{
  "law_name": "THE PAKISTAN RAILWAYS POLICE ACT",
  "year": 1977,
  "chapters": [
    {
      "chapter_title": "CHAPTER I",
      "sections": [
        {
          "section_no": "1",
          "section_title": "Short title, extent, application and commencement",
          "body": "(1) This Act may be called the Pakistan Railways Police Act, 1977. (2) It extends to the whole of Pakistan. (3) It shall apply to all members and officers of the Pakistan Railways Police wherever they may be. (4) It shall come into force at once."
        },
        {
          "section_no": "2",
          "section_title": "Definitions",
          "body": "In this Act, unless there is anything repugnant in the subject or context, (a) ‘Chief Executive’ means a person appointed by the Federal Government to manage the Pakistan Railways, by whatever name called; (b) ‘Code’ means the Code of Criminal Procedure, 1898 (Act V of 1898). (c) ‘competent authority’ means any officer or authority designated as such by the Federal Government; (d) ‘Inspector-General’ means the Inspector-General of the Pakistan Railways police or any person for the time being performing the duties of the Inspector-General; (e) ‘member’ means a person, other than an officer, who is appointed to the Pakistan Railways Police and has signed an affirmation in the form set out in the First Schedule; (f) ‘offence’ means an offence punishable under this Act or under any other law for the time being in force; (g) ‘officer’ means a person who is so appointed to the Pakistan Railways Police and has signed an affirmation in the form set out in the First Schedule; (h) ‘Officer-in-Charge of Railway Police Station’ means any person appointed as such by the competent authority and includes, when the officer-in-charge of the Railway Police Station is absent from the station-house or is unable by reason of illness or any other cause to perform his duties, the member present at the station-house who is next in rank to such officer and is above the rank of a constable; (i) ‘Provincial Police’ means the police constituted by a Provincial Government under the Police Act, 1861 (V of 1861). (j) ‘Railway’ means railway as defined in the Railways Act, 1890 (IX of 1890) including rolling stock as defined in the said Act, but excluding (i) such lines of rail as lie outside the territorial limits notified under section 3; and (ii) such fixed installations as lie outside the territorial limits notified under section 3 and are classified by the Federal Government as key points; (ja) “railway employee” means railway employee as defined in the Railway Regulatory Authority Ordinance, 2002 (of 2002); (k) ‘regulations’ means regulations made under this Act; and (l) ‘rules’ means rules made under this Act."
        }
      ]
    },
    {
      "chapter_title": "CHAPTER II",
      "sections": [
        {
          "section_no": "3",
          "section_title": "Power to constitute, control and maintain the Pakistan Railways Police and its functions",
          "body": "(1) Notwithstanding anything contained in any other law for the time being in force, the Federal Government may constitute, control and maintain a force to be called the Pakistan Railways Police for performing, within such territorial limits as the Federal Government may, by notification in the official Gazette, specify the following functions, namely: (a) preventing loss to Railway property and property consigned to the Railways and prevention of offences in respect thereof; (b) ensuring proper conduct of persons on the Railways; (c) general maintenance of law and order on the Railways and taking cognizance of offences committed on them; (d) to render all possible assistance to passengers and railway employees; (e) to protect travellers from injury to person or property; (f) to keep Railway platforms and other Railway premises clear of idlers and beggars and to keep a lookout for suspicious persons, smugglers and persons travelling with arms without a licence or in contravention of rules, regulations or orders for the time being in force; (g) to search empty carriages for property left behind by passengers and to take possession of such property for due disposal under the law; (h) to control and regulate movement and parking of hackney carriages and mechanically propelled vehicles at Railway Stations and to enforce the regulations of the Railway authorities with regard to them; (i) to bring to the notice of the appropriate Railway authorities any contravention, breach or violation of any law of which the Pakistan Railways Police cannot itself take cognizance; and (j) such other functions connected with the purposes of this Act as the Federal Government may, by notification in the official Gazette, require the Pakistan Railways Police to perform. (2) Without prejudice to the powers conferred on it by or under this Act, the Federal Government may, in relation to the Pakistan Railways Police exercise all powers which, under the Police Act, 1861 (V of 1861) and the Code, are exercisable by a Provincial Government in relation to the Provincial Police."
        },
        {
          "section_no": "4",
          "section_title": "Constitution superintendence and administration of the Pakistan Railways Police",
          "body": "(1) The Pakistan Railways Police shall be constituted in such manner as may be prescribed by rules. (2) The head of the Pakistan Railways Police shall be an Inspector-General who shall administer it in accordance with the provisions of this Act and the rules and regulations, and such orders and instructions as may be made or issued by the Federal Government from time to time. (3) The Inspector-General shall exercise his powers and perform his functions under the general supervision of the Chief Executive."
        },
        {
          "section_no": "5",
          "section_title": "Transfer of Provincial Railway Police and Railway Watch and Ward to the Pakistan Railways Police",
          "body": "(1) Notwithstanding anything contained in any other law for the time being in force or any contract, agreement or any condition of service, (a) all persons holding any rank or post, not above the rank or post of Superintendent, in or under the Railway Police of any Province; and (b) all persons holding any rank or post in the Railway Watch and Ward; shall, subject to such conditions as may be laid down by the Federal Government, stand transferred and appointed to such corresponding ranks or posts in or under the Pakistan Railways Police as may be notified by the Federal Government. (2) If, at any time, the Federal Government considers that the services of any person referred to in clause (a) of sub-section (1) are no longer needed by the Pakistan Railways Police, the Federal Government may, by order in writing, revert such person to the Police of the Province, to which he belonged immediately before the commencement of this Act."
        },
        {
          "section_no": "6",
          "section_title": "Ordinance No. XXIII of 1969 not to apply to the Pakistan Railways Police",
          "body": "Nothing contained in the Industrial Relations Ordinance, 1969 (XXIII of 1969), shall apply to, or in relation to, the Pakistan Railways Police."
        },
        {
          "section_no": "7",
          "section_title": "Appointment of officers of the Pakistan Railways Police",
          "body": "For the purposes of this Act, the Federal Government may, by notification in the official Gazette, appoint any person to be (a) the Inspector-General of the Pakistan Railways Police; (b) a Deputy Inspector-General of the Pakistan Railways Police; (c) a Superintendent of the Pakistan Railways Police; and (d) an officer with any other designation."
        },
        {
          "section_no": "8",
          "section_title": "Appointment of members and ministerial staff",
          "body": "(1) The Inspector-General, or an officer to whom the power is delegated by the Inspector-General, may appoint members and ministerial staff and determine the duties to be performed by them. (2) Appointments under sub-section (1) shall be made by direct recruitment or promotion or transfer from any other force or any department of the Federal Government or a Provincial Government in such manner as may be prescribed by rules. (3) The officers and members and ministerial staff shall receive such pay, pension, allowances and other remuneration, and shall enjoy such other privileges, as may be prescribed by rules. (4) Every officer and member, other than the Inspector-General, shall receive a certificate in the form set out in the Second Schedule under the seal of the Inspector-General or such other officer as the Inspector-General may authorise in this behalf and, by virtue of holding such certificate, he shall be vested with the powers, functions and privileges of an officer or member, as the case may be. (5) Any person who ceases, for any reason, to be an officer or member shall forthwith surrender the certificate referred to in subsection (4) to any officer authorised by the Inspector-General in this behalf, together with the uniform and equipment, if any, issued to him. (6) Officers and members of the Pakistan Railways Police shall wear such uniforms as may be prescribed by regulations."
        },
        {
          "section_no": "9",
          "section_title": "Powers of officers and members of the Pakistan Railways Police",
          "body": "(1) The Inspector-General shall exercise the powers of an Inspector-General of Police under the Police Act, 1861 (V of 1861). (2) The Inspector-General shall, in respect of the officers, members and ministerial staff, have all the powers conferred on him by or under this Act. (3) An officer or member shall, in respect of Railway, (a) for the purpose of inquiry, investigation, arrest, trial and prosecution, exercise all the powers conferred on an officer or member of Police under the Police Act, 1861 (V of 1861), and the Code, the Railways Act, 1890 (IX of 1890), this Act and the rules and regulations; (b) use such arms, ammunition and equipment as may be authorised by the Inspector-General, for the purposes of this Act; and (c) for the purpose of arresting without warrant any person whom he is authorised by law to arrest and who is attempting to escape, or has escaped, immediately after the commission of an offence, have the power to pursue such person into any place in Pakistan. (4) Officers superior in rank to an officer-in-charge of a Railway Police Station may exercise the same powers, throughout the local areas or jurisdictions to which they are appointed, as may be exercised by such officer within the limits of his station or jurisdiction."
        }
      ]
    },
    {
      "chapter_title": "CHAPTER IV",
      "sections": [
        {
          "section_no": "10",
          "section_title": "Appointment of Magistrates and Public Prosecutors",
          "body": ""
        }
      ]
    },
    {
      "chapter_title": "CHAPTER V",
      "sections": [
        {
          "section_no": "11",
          "section_title": "Liabilities of officers and members",
          "body": ""
        },
        {
          "section_no": "12",
          "section_title": "Indemnity",
          "body": ""
        }
      ]
    },
    {
      "chapter_title": "CHAPTER VI",
      "sections": [
        {
          "section_no": "13",
          "section_title": "Public servant",
          "body": ""
        },
        {
          "section_no": "14",
          "section_title": "Assets and liabilities",
          "body": ""
        },
        {
          "section_no": "15",
          "section_title": "Delegation of powers by the Federal Government",
          "body": ""
        },
        {
          "section_no": "16",
          "section_title": "Delegation of powers by the Inspector-General",
          "body": ""
        },
        {
          "section_no": "17",
          "section_title": "Power to make rules",
          "body": ""
        },
        {
          "section_no": "18",
          "section_title": "Power to make regulations",
          "body": ""
        },
        {
          "section_no": "19",
          "section_title": "Transitional provision",
          "body": ""
        },
        {
          "section_no": "20",
          "section_title": "Repeal",
          "body": ""
        }
      ]
    }
  ],
  "source_file": "administratore6916bf7f32ce375570aff0b6d343786.txt"
}