{
  "law_name": "THE PAKISTAN NAVAL ACADEMY (AWARD OF DEGREES) ORDINANCE",
  "year": 1965,
  "chapters": [
    {
      "chapter_title": "Contents",
      "sections": [
        {
          "section_no": "1",
          "section_title": "Short title extend and commencement",
          "body": "(1) This Ordinance may be called the Pakistan Naval Academy (Award of Degrees) Ordinance, 1965. (2) It shall come into force at once."
        },
        {
          "section_no": "2",
          "section_title": "Definitions",
          "body": "In this Ordinance, unless there is anything repugnant in the subject or context,-- (a) “Cadet-entry Officer” means a person appointed as a cadet in any branch of the Pakistan Navy, and includes any such person promoted to the rank of midshipman or acting sub-lieutenant, while still undergoing the prescribed course; (b) “prescribed course” means a course of training prescribed by regulations made under this Ordinance."
        },
        {
          "section_no": "3",
          "section_title": "Conferment of degrees on Cadet-entry Officers",
          "body": "The Pakistan Naval Academy shall have the power to confer the degree of the Bachelor of Science or Bachelor of Arts, abbreviation whereof shall be B.Sc (N.A) or B.A (N.A.), respectively, and four years Bachelor of Studies in Naval and Management Sciences), on any Cadet-entry Officer on his successful completion of the prescribed course in the Pakistan Naval Academy appropriate to his branch."
        },
        {
          "section_no": "3A",
          "section_title": "Conferment of degrees on others",
          "body": "The Pakistan Naval Academy shall also have the power to confer the degrees referred to in section 3 on any officer of a foreign government on his successfully completing the prescribed course in that Academy."
        },
        {
          "section_no": "4",
          "section_title": "Power to make Regulations",
          "body": "The Pakistan Naval Academy may, with the previous approval in writing of the Federal Government, make regulations for carrying out the purposes of this Ordinance."
        }
      ]
    }
  ],
  "source_file": "administratorc04aa67560932d925c97aff042760b51.txt"
}