{
  "law_name": "THE INTERNATIONAL DEVELOPMENT ASSOCIATION ORDINANCE",
  "year": 1960,
  "chapters": [
    {
      "chapter_title": "International Development Association Ordinance, 1960",
      "sections": [
        {
          "section_no": "1",
          "section_title": "Short title, extent and commencement",
          "body": "(1) This Ordinance may be called the International Development Association Ordinance, 1960. (2) It extends to the whole of Pakistan. (3) It shall come into force on such date as the Federal Government may, by notification in the official Gazette, appoint."
        },
        {
          "section_no": "2",
          "section_title": "Definitions",
          "body": "In this Ordinance, unless there is anything repugnant in the subject or context, (a) 'Agreement' means any Agreement which may be signed and accepted on behalf of the Government of Pakistan in pursuance of the Articles of Agreement approved by the Executive Directors of the Bank on the twenty-sixth day of January, 1960, providing for the establishment and operation of an international body to be called the International Development Association; (b) 'Association' means the International Development Association; and (c) 'member' means a member of the Association."
        },
        {
          "section_no": "3",
          "section_title": "Financial provisions",
          "body": "(1) There shall be paid out of the Federal Consolidated Fund all such sums as may be required for the purpose of making payments on behalf of the Government of Pakistan under section 2 (a) of Article II and section 1 (a) of Article III of the Agreement. (2) Any sums received by the Government of Pakistan from the Association in pursuance of the Agreement shall be paid into the Federal Consolidated Fund. (3) The Federal Government may, if it thinks fit so to do, create and issue to the International Development Association, in such form as it thinks fit, any such non-interest bearing and non-negotiable notes or other obligations as are provided for by paragraph (e) of section 2 of Article II of the Agreement."
        },
        {
          "section_no": "4",
          "section_title": "State Bank to be depository for this Association",
          "body": "The State Bank of Pakistan shall be the depository of the Pakistan currency holdings or other assets of the Association."
        },
        {
          "section_no": "5",
          "section_title": "Certain provisions of Agreement to have force of law",
          "body": "Notwithstanding anything to the contrary contained in any other law, the provisions of Article VIII of the Agreement set out in the Schedule shall have the force of law in Pakistan: Provided that nothing in section 9 thereof shall be construed as (a) entitling the Association to import into Pakistan goods free of any duty of customs without any restriction on their subsequent sale therein, or (b) conferring on the Association any exemption from duties or taxes which form part of the price of goods sold or which are in fact no more than charges for services rendered."
        }
      ]
    }
  ],
  "source_file": "administratore4c4cbbff677c804a406277d0f1bc239.txt"
}