{
  "error": "Expecting value: line 1 column 1 (char 0)",
  "raw": "THE KARACHI RENT RESTRICTION ACT, 1953 CONTENTS 1. Short title, extent and commencement 2. Definitions 4. Rent Controller to fix fair rent 5. Re-determination of fair rent when improvements made 6. Repairs by tenant 7. Restriction on raising rent 8. Increase of rent on account of payment of rates excepted 9. Fine, premium, Pagri or Mithai not to be charged for grant, renewal or continuance of tenancy 10. Eviction of tenant 11. Easement not to be disturbed 12. Controller may determine fair rent in certain cases 13. Punishment for contravention of the provisions of section 11 14. Review 15. Appeals and revision 16. [Omitted] 17. [Omitted] 18. Execution of orders 19. Controller may require information to be furnished and summon witnesses 20. Use of force in certain cases 21. Control of Provincial Government 22. Bar of jurisdiction 23. Cognizance of offence 24. Act does not permit increase of rent if not otherwise permissible 25. Validation of appointments and Acts 26. Effect of provisions inconsistent with other enactments 27. Rules 28. Savings 29. Repeal THE KARACHI RENT RESTRICTION ACT, 1953 1ACT NO. VIII OF 1953 [15th April, 1953] An Act to make certain provisions regarding accommodation, whether residential or non-residential furnished or unfurnished, in the 2[Karachi Division]. WHEREAS it is expedient to make certain provisions regarding accommodation, whether residential or non-residential, furnished or unfurnished, in the 2[Karachi Division], and in particular to provide for controlling the rents chargeable for such accommodation and for preventing eviction in certain cases ; It is hereby enacted as follows: 1. Short title, extent and commencement. (1) This Act may be called the Karachi Rent Restriction Act, 1953. (2) It extends to the 2[Karachi Division]. (3) It shall come into Force at once. 2. Definitions. In this Act, unless there is anything repugnant in the subject or context, 3[(1) “Controller” means a judicial officer who is appointed by the Provincial G",
  "source_file": "administrator43948dd87dbd8f689bcb2d1583247464.txt",
  "law_name": "The Karachi Rent Restriction Act, 1953",
  "year": 1953
}