{
  "law_name": "THE AIRCRAFT (REMOVAL OF DANGER TO SAFETY) ORDINANCE",
  "year": 1965,
  "chapters": [
    {
      "chapter_title": "Contents",
      "sections": [
        {
          "section_no": "1",
          "section_title": "Short title, extent and commencement",
          "body": "(1) This Ordinance may be called the Aircraft (Removal of Danger to Safety) Ordinance, 1965. (2) It extends to the whole of Pakistan. (3) It shall come into force at once."
        },
        {
          "section_no": "2",
          "section_title": "Definitions",
          "body": "In this Ordinance, unless there is anything repugnant in the subject or context, (a) “airfield” means all airports, aerodromes or runways of Civil Aviation Authority, Pakistan Army, Pakistan Navy, Pakistan Air Force and including landing areas approved by the Director-General, Civil Aviation Authority; (b) “specified area” means the area lying within a radius of seven nautical miles (13 kilometers) from the landing or take off ends of the runway and five nautical miles (9.25 kilometers) from both the shoulders of the entire length of the runway from either end of a runway of an airfield."
        },
        {
          "section_no": "3",
          "section_title": "Measures to avoid attraction of birds",
          "body": "(1) The Federal Government may by order require the owner or the person in possession or having the management or control of any tannery, slaughter-house, cattle-yard, fish-drying area, refuse-dump or other place within a specified area which attracts birds to take within such period as may be specified in the order such measures for avoiding attraction of birds which may endanger the safety of aircraft as may be so specified including closure of the source of such danger. (2) Any person affected by an order under sub-section (1) may, within thirty days following the order, make an application to the Federal Government for a review of the order on the ground that the measures directed to be taken are not necessary or that alternative measures described in the application would be equally effective for avoiding attraction of birds. (3) The Federal Government may, after considering the application made under sub-section (2) and giving the applicant an opportunity of being heard, modify, cancel or confirm the order made under sub-section (1)."
        },
        {
          "section_no": "4",
          "section_title": "Non-compliance with order under section 3",
          "body": "Where an order made under sub-section (1) of section 3 is not complied with, the Federal Government may, by notification in the official Gazette, prohibit the use of, or the carrying on of any trade or occupation in, the tannery, slaughter-house, cattle-yard, fish-drying area, refuse-dump or other place with respect to which the order was made."
        },
        {
          "section_no": "5",
          "section_title": "Restriction on construction or extension of tannery, etc.",
          "body": "Within a specified area, no tannery, slaughter-house or cattle-yard shall be constructed, established or extended and no place shall be used for fish-drying or as a refuse-dump or for carrying on any trade or occupation which attracts birds except with the prior permission in writing of the Federal Government and in accordance with the terms and conditions, if any, on which the permission is granted."
        },
        {
          "section_no": "6",
          "section_title": "Power of entry in premises, etc.",
          "body": "Any person authorised in this behalf by the Federal Government may at any time between sunrise and sunset enter and inspect any tannery, slaughter-house, cattle-yard or fish drying area or any premises or land used as a refuse-dump or for carrying on any trade or occupation which may attract birds, for the purpose of ascertaining the extent of danger to the safety of aircraft caused by the attraction of birds and seeing whether the provisions of this Ordinance and any order or notification made or issued thereunder have been complied with."
        },
        {
          "section_no": "7",
          "section_title": "Penalty",
          "body": "Whoever fails to comply with or contravenes any of the provisions of this Ordinance or any order, direction or notification issued or made thereunder, or wilfully obstructs any person in doing any of the acts authorised by this Ordinance shall be punishable with imprisonment for a term which may extend to six months, or with fine which may extend to ten thousand rupees, or with both, and in the case of a continuing offence, with an additional fine which may extend to five hundred rupees for every day after the first during which the offence continues."
        },
        {
          "section_no": "8",
          "section_title": "Powers to try an offence",
          "body": "No court inferior to that of a Magistrate of the first class shall try an offence punishable under this Ordinance."
        },
        {
          "section_no": "9",
          "section_title": "Indemnity",
          "body": "(1) No order made, notification issued or proceeding taken under this Ordinance shall be called in question in any court. (2) No suit, prosecution or other legal proceeding shall lie against any person for anything which is in good faith done or intended to be done under this Ordinance."
        },
        {
          "section_no": "10",
          "section_title": "Power to make rules",
          "body": "The Federal Government may, by notification in the official Gazette, make rules for carrying out the purposes of this Ordinance."
        }
      ]
    }
  ],
  "source_file": "administrator7b9ba189592bdcc7c1eca569244e6bab.txt"
}