{
  "law_name": "THE POISONS ACT",
  "year": 1919,
  "chapters": [
    {
      "chapter_title": "Contents",
      "sections": [
        {
          "section_no": "1",
          "section_title": "Short title and extent",
          "body": "(1) This Act may be called the Poisons Act, 1919. (2) It extends to the whole of Pakistan."
        },
        {
          "section_no": "2",
          "section_title": "Power of the Provincial Government to regulate possession for sale and sale of any poison",
          "body": "(1) The Provincial Government may by rule regulate within the whole or any part of the territories under its administration the possession for sale and the sale, whether wholesale or retail, of any specified poison. (2) In particular, such rules may provide for various aspects including the grant of licences, classes of persons to whom licences may be granted, maximum quantity of poison sold, maintenance of registers, safe custody, and inspection."
        },
        {
          "section_no": "3",
          "section_title": "Power to prohibit importation into Pakistan of any poison except under licence",
          "body": "The Federal Government may, by notification in the official Gazette, prohibit, except under and in accordance with the conditions of a licence, the importation into Pakistan of any specified poison."
        },
        {
          "section_no": "4",
          "section_title": "Power to regulate possession of any poison in certain areas",
          "body": "(1) The Provincial Government may by rule regulate the possession of any specified poison in any local area where its use for committing murder or mischief appears frequent. (2) Breach of such rules may be punishable with imprisonment or fine."
        },
        {
          "section_no": "5",
          "section_title": "Presumption as to specified poisons",
          "body": "Any substance specified as a poison in a rule made or notification issued under this Act shall be deemed to be a poison for the purposes of this Act."
        },
        {
          "section_no": "6",
          "section_title": "Penalty for unlawful importation, etc.",
          "body": "(1) Whoever commits a breach of any rule made under section 2, imports without a licence any poison, or breaks any condition of a licence shall be punishable with imprisonment or fine. (2) Any poison in respect of which an offence has been committed shall be liable to confiscation."
        },
        {
          "section_no": "7",
          "section_title": "Power to issue search warrants",
          "body": "(1) The District Magistrate and the Sub-divisional Magistrate may issue a warrant for the search of any place where they suspect poison is possessed or sold in contravention of this Act. (2) The person to whom the warrant is directed may enter and search the place."
        },
        {
          "section_no": "8",
          "section_title": "Rules",
          "body": "(1) The Provincial Government may make rules to carry out the purposes of this Act. (2) All rules made shall be published in the official Gazette and shall have effect as if enacted in this Act."
        },
        {
          "section_no": "9",
          "section_title": "Savings",
          "body": "(1) Nothing in this Act shall interfere with anything done in good faith by a medical or veterinary practitioner. (2) The Provincial Government may declare that provisions of this Act shall not apply to certain articles or classes of articles."
        },
        {
          "section_no": "10",
          "section_title": "[Repeal]",
          "body": "Rep. by the Repealing Act. 1927 (XII of 1927)."
        }
      ]
    }
  ],
  "source_file": "administrator126e90f09560824ba1b1d42194599446.txt"
}