{
  "error": "Expecting value: line 1 column 1 (char 0)",
  "raw": "THE IMPORTS AND EXPORTS (CONTROL) ACT, 1950 CONTENTS SECTIONS: 1. Short title, extent, commencement and duration 2. Definitions 3. Powers to prohibit or restrict imports and exports 4. Continuance of existing orders 4A. Prohibition to sell or purchase import licence 4B. Prohibition regarding sale and transfer of goods by industrial consumer 5. Penalty 5A. [Repealed] 5B. [Repealed] 5C. [Repealed] 6. Cognizance of offences 7. Savings 8. Power to make rules 9. [Repealed] THE IMPORTS AND EXPORTS (CONTROL) ACT, 1950 *ACT No. XXXIX of 1950 [19th April, 1950] An Act to continue 1[* * *] powers to prohibit or control imports and exports. WHEREAS it is expedient to continue 2[* * *] powers to prohibit, restrict or otherwise control imports into and exports from Pakistan; It is hereby enacted as follows: 1. Short title, extent, commencement and duration. (1) This Act may be called the Imports and Exports (Control) Act, 1950. 3[(2) It extends to the whole of Pakistan.] (3) It shall come into force immediately 4[* * *]. 2. Definitions. In this Act (a) “Chief Controller” means the officer appointed by the 5[Federal Government] to perform the duties of Chief Controller of Imports and Exports under this Act; 6[(b) “Collector of Customs” means an officer appointed as such under section 7[(3)] of the Customs Act, 1969 (IV of 1969); and] (c) “import” and “export” mean respectively bringing into, and taking out of, the 8[Pakistan] 9[* * *] by sea, land or air. *This Act and Rules made thereunder, has been applied by Regulation No. I of 1968, to those of the Tribal Areas to which it does not already apply. The Act has been applied to (i) Baluchistan, subject to certain modifications, with effect on and from the 19th April, 1950 see Gaz. of P.,1953, Pt. I. p. 90; (ii) The Federated Areas of Baluchistan, see ibid., p. 152; and The Act has been extended to (i) the Leased Areas of Baluchistan, see the Leased Areas (Laws) Order, 1950 (G. G. O. 3 of 1950); and (ii) the Baluchistan States Uni",
  "source_file": "administrator084fe1e8bb9f566b2f0023574816a68f.txt",
  "law_name": "The Imports and Exports (Control) Act, 1950",
  "year": 1950
}