{
  "law_name": "THE PAKISTAN COAST GUARDS ACT",
  "year": 1973,
  "chapters": [
    {
      "chapter_title": "PRELIMINARY",
      "sections": [
        {
          "section_no": "1",
          "section_title": "Short title, application and commencement",
          "body": "(1) This Act may be called the Pakistan Coast Guards Act, 1973. (2) It shall apply to all members of the Pakistan Coast Guards wherever they may be serving. (3) It shall come into force at once."
        },
        {
          "section_no": "2",
          "section_title": "Interpretation",
          "body": "In this Act, unless there is anything repugnant in the subject or context, various definitions are provided for terms such as 'Coastal area', 'Commandant', 'Custody', 'Deputy Director General', 'Director General', 'Force', 'Junior Commissioned Officer', 'Member of the Force', 'Officer', 'Prescribed', and 'Superior Officer'."
        },
        {
          "section_no": "3",
          "section_title": "Powers to constitute and maintain the force and its functions",
          "body": "The Federal Government may constitute and maintain a Force to be called the Pakistan Coast Guards for performing functions such as prevention of smuggling, illegal immigration, stopping enemy agents, and supplementing defense in war."
        },
        {
          "section_no": "4",
          "section_title": "Appointment of officers of Force",
          "body": "The Federal Government may appoint any member of any of the Defence Services of Pakistan to be Director General, Deputy Director General, Commandant, and other Commissioned Officers."
        },
        {
          "section_no": "5",
          "section_title": "Appointment of subordinate and ministerial staff",
          "body": "(1) The Director General or a person authorized may appoint junior commissioned officers, subordinate and ministerial staff. (2) Appointments shall be made by direct recruitment or promotion. (3) The recruiting roll and affirmation shall be read out in the presence of a Commandant. (4) The affirmation shall be repeated by the person making it."
        },
        {
          "section_no": "6",
          "section_title": "Superintendence, command, control and administration of the Force",
          "body": "The Force shall be commanded and administered by the Director General under the superintendence and control of the Federal Government."
        },
        {
          "section_no": "7",
          "section_title": "Pay, pension, etc., of officers and members",
          "body": "The officers and members of the Force shall receive pay, pension, and other remuneration as prescribed."
        },
        {
          "section_no": "8",
          "section_title": "Members to be subject to Pakistan Army Act, 1952",
          "body": "(1) Every officer and member of the Force shall be subject to the Pakistan Army Act, 1952. (2) The Director General shall have powers conferred by the Act on an officer empowered to convene a general court martial."
        },
        {
          "section_no": "9",
          "section_title": "Consequence of sentence of imprisonment",
          "body": "A member of the Force sentenced to imprisonment for not less than ninety days shall be deemed to have been dismissed from the Force."
        },
        {
          "section_no": "10",
          "section_title": "Suspension",
          "body": "Any officer or junior commissioned officer may suspend a member of the Force for misconduct."
        },
        {
          "section_no": "11",
          "section_title": "Place of imprisonment",
          "body": "A member sentenced to imprisonment may be confined in a quarterguard or other suitable place as determined by the Director General."
        },
        {
          "section_no": "12",
          "section_title": "Capture of deserters",
          "body": "(1) The Commandant shall inform civil authorities of any desertion. (2) Police officers may arrest without warrant any deserter."
        },
        {
          "section_no": "13",
          "section_title": "Appeal and revision",
          "body": "(1) A person aggrieved may appeal within thirty days of an order. (2) A person aggrieved by the Director General's order may apply for revision within thirty days."
        }
      ]
    },
    {
      "chapter_title": "",
      "sections": [
        {
          "section_no": "14",
          "section_title": "Powers of the officers of the Force",
          "body": "(1) Officers and members shall perform customs functions and exercise powers under the Customs Act, 1969. (2) They shall also exercise powers conferred on police officers under the Police Act, 1861."
        },
        {
          "section_no": "15",
          "section_title": "Disposal of goods seized by members of the Force",
          "body": "All goods seized shall be dealt with according to the Customs Act, 1969."
        }
      ]
    },
    {
      "chapter_title": "",
      "sections": [
        {
          "section_no": "16",
          "section_title": "Placing of Force under command of Chief of Staff, Pakistan Army",
          "body": "(1) The Federal Government may place the Force under the command of the Chief of Staff of the Pakistan Army. (2) The Force remains subject to this Act."
        },
        {
          "section_no": "17",
          "section_title": "Indemnity",
          "body": "No legal proceeding shall lie against any person for actions done in good faith under this Act."
        },
        {
          "section_no": "18",
          "section_title": "Power to make rules and regulations",
          "body": "(1) The Federal Government may make rules regulating functions and powers. (2) The Director General may make regulations consistent with this Act."
        },
        {
          "section_no": "19",
          "section_title": "[Omitted]",
          "body": ""
        }
      ]
    }
  ],
  "source_file": "administrator9eb9167a64e55d690c7b0334cf1a9502.txt"
}