{
  "law_name": "The Limitation Act",
  "year": 1908,
  "chapters": [
    {
      "chapter_title": "Part I Preliminary",
      "sections": [
        {
          "section_no": "1",
          "section_title": "Short title, extent and commencement",
          "body": "This Act may be called the Limitation Act, 1908. It extends to the whole of Pakistan. This section and section 31 shall come into force at once. The rest of this Act shall come into force on the first day of January, 1909."
        },
        {
          "section_no": "2",
          "section_title": "Definitions",
          "body": "In this Act, unless there is anything repugnant in the subject or context, 'applicant' includes any person from or through whom an applicant derives his right to apply; 'bill of exchange' has the same meaning as in section 5 of the Negotiable Instruments Act, 1881, and includes a hundi and a cheque; 'bond' includes any instrument whereby a person obliges himself to pay money to another on condition that the obligation shall be void if a specified act is performed, or is not performed, as the case may be; 'defendant' includes any person from or through whom a defendant derives his liability to be sued; 'easement' includes a right not arising from contract, by which one person is entitled to remove and appropriate for his own profit any part of the soil belonging to another or anything growing in, or attached to or subsisting upon, the land of another; 'foreign country' means any country other than Pakistan; 'good faith': nothing shall be deemed to be done in good faith which is not done with due care and attention; 'plaintiff' includes any person from or through whom a plaintiff derives his right to sue; 'suit' does not include an appeal or an application; and 'trustee' does not include a benamidar, a mortgagee remaining in possession after the mortgage has been satisfied, or a wrong-doer in possession without title."
        }
      ]
    },
    {
      "chapter_title": "Part II Limitation of Suits, Appeals and Applications",
      "sections": [
        {
          "section_no": "3",
          "section_title": "Dismissal of suits, etc., instituted, etc., after period of limitation",
          "body": "Subject to the provisions contained in sections 4 to 25 (inclusive), every suit instituted, appeal preferred, and application made, after the period of limitation prescribed therefore by the first schedule shall be dismissed, although limitation has not been set up as a defence."
        },
        {
          "section_no": "4",
          "section_title": "Where Court is closed when period expires",
          "body": "Where the period of limitation prescribed for any suit, appeal or application expires on a day when the Court is closed, the suit, appeal or application may be instituted, preferred or made on the day that the Court re-opens."
        },
        {
          "section_no": "5",
          "section_title": "Extension of period in certain cases",
          "body": "Any appeal or application for a revision or a review of judgment or for leave to appeal or any other application to which this section may be made applicable by or under any enactment for the time being in force may be admitted after the period of limitation prescribed therefor, when the appellant or applicant satisfies the Court that he had sufficient cause for not preferring the appeal or making the application within such period."
        },
        {
          "section_no": "6",
          "section_title": "Legal disability",
          "body": "Where a person entitled to institute a suit or make an application for the execution of a decree is, at the time from which the period of limitation is to be reckoned, a minor, or insane, or an idiot, he may institute the suit or make the application within the same period after the disability has ceased, as would otherwise have been allowed from the time prescribed therefore in the third column of the first schedule."
        },
        {
          "section_no": "7",
          "section_title": "Disability of one of several plaintiffs or applicants",
          "body": "Where one of several persons jointly entitled to institute a suit or make an application for the execution of a decree is under any such disability, and a discharge can be given without the concurrence of such person, time will run against them all."
        },
        {
          "section_no": "8",
          "section_title": "Special exceptions",
          "body": "Nothing in section 6 or in section 7 applies to suits to enforce rights of pre-emption, or shall be deemed to extend, for more than three years from the cessation of the disability or the death of the person affected thereby, the period within which any suit must be instituted or application made."
        }
      ]
    },
    {
      "chapter_title": "Part III Computation of Period of Limitation",
      "sections": [
        {
          "section_no": "12",
          "section_title": "Exclusion of time in legal proceedings",
          "body": "Exclusion of time in legal proceedings."
        },
        {
          "section_no": "13",
          "section_title": "Exclusion of time of defendants, absence from Pakistan and certain other territories",
          "body": "Exclusion of time of defendants, absence from Pakistan and certain other territories."
        },
        {
          "section_no": "14",
          "section_title": "Exclusion of time of proceeding bona fide in Court without jurisdiction",
          "body": "Exclusion of time of proceeding bona fide in Court without jurisdiction."
        },
        {
          "section_no": "15",
          "section_title": "Exclusion of time during which proceedings are suspended",
          "body": "Exclusion of time during which proceedings are suspended."
        },
        {
          "section_no": "16",
          "section_title": "Exclusion of time during which proceedings to set aside execution-sale are pending",
          "body": "Exclusion of time during which proceedings to set aside execution-sale are pending."
        },
        {
          "section_no": "17",
          "section_title": "Effect of death before right to sue accrues",
          "body": "Effect of death before right to sue accrues."
        },
        {
          "section_no": "18",
          "section_title": "Effect of fraud",
          "body": "Effect of fraud."
        },
        {
          "section_no": "19",
          "section_title": "Effect of acknowledgment in writing",
          "body": "Effect of acknowledgment in writing."
        },
        {
          "section_no": "20",
          "section_title": "Effect of payment on account of debt or of interest on legacy. Effect of receipt of produce of mortgaged land",
          "body": "Effect of payment on account of debt or of interest on legacy. Effect of receipt of produce of mortgaged land."
        },
        {
          "section_no": "21",
          "section_title": "Agent of person under disability Acknowledgement or payment by one of several joint contractors, etc",
          "body": "Agent of person under disability Acknowledgement or payment by one of several joint contractors, etc."
        },
        {
          "section_no": "22",
          "section_title": "Effect of substituting or adding new plaintiff or defendant",
          "body": "Effect of substituting or adding new plaintiff or defendant."
        },
        {
          "section_no": "23",
          "section_title": "Continuing breaches and wrongs",
          "body": "Continuing breaches and wrongs."
        },
        {
          "section_no": "24",
          "section_title": "Suit for compensation for act not actionable without special Damage",
          "body": "Suit for compensation for act not actionable without special Damage."
        },
        {
          "section_no": "25",
          "section_title": "Computation of time mentioned in instruments",
          "body": "Computation of time mentioned in instruments."
        }
      ]
    },
    {
      "chapter_title": "Part IV Acquisition of Ownership by Possession",
      "sections": [
        {
          "section_no": "26",
          "section_title": "Acquisition of right to easements",
          "body": "Acquisition of right to easements."
        },
        {
          "section_no": "27",
          "section_title": "Exclusion in favour of reversioner of servient tenement",
          "body": "Exclusion in favour of reversioner of servient tenement."
        },
        {
          "section_no": "28",
          "section_title": "Extinguishment of right to property",
          "body": "Extinguishment of right to property."
        }
      ]
    },
    {
      "chapter_title": "Part V Saving and Repeals",
      "sections": [
        {
          "section_no": "29",
          "section_title": "Savings",
          "body": "Savings."
        },
        {
          "section_no": "30",
          "section_title": "[Repealed.]",
          "body": "[Repealed.]"
        }
      ]
    }
  ],
  "source_file": "administrator3294e35255f255ea96b3356091fb4844.txt"
}