{
  "error": "Expecting value: line 1 column 1 (char 0)",
  "raw": "THE WASTE LANDS (CLAIMS) ACT, 1863 CONTENTS PREAMBLE 1. Provision for enquiry in claims to land, or objections to sale of same. 2. Procedure in such cases. Notification of conditions. 3. Postponement of sale pending enquiry, to allow claimant to contest rejection of claim. 4. Sale to be stopped if claim appear to be established, but may afterwards be proceeded with. 5. Delivery to claimant of copy of order of rejection or of sale. Order when final. Report to Board. Decision of Board. Certification to Court. Notice to Claimant. Decision with final. 6. Power to order suit to try claim admitted by Collector. 7. Special Court for trying claims. Power of members. Exclusion of officer making original enquiry. 8. Notice of constitution of Special Courts. Claims not cognizable in other Courts. 9. Special Court where held. 10. Plaintiff and defendant in suit under section 5. Appearance. Proviso. Plaintiff and defendant in suits under section 6. 11. Regulation of proceedings. 12. Procedure before hearing. Procuring attendance of witnesses. Power to require attendance of claimant. 13. Procedure on hearing. 14. No appeal or revision. 15. Reference of question of law, etc., to High Court, etc. When reference obligatory. 16. Court may proceed notwithstanding reference. But not make final order. 17. Records of cases where to be deposited. 18. Limitation as to claims to land sold or dealt with. Provision for such claims if preferred within time. 19. If claim established, possession not to be given, but compensation. 20. When land sold not absolutely, or not sold, but otherwise dealt with. 21. Award under two last sections to be in full satisfaction. 22. Government not barred from awarding compensation for land absolutely sold, though claim be not preferred in time. 23. Compensation for land sold. subject to condition, if claim proved, though not preferred in time. 23A. Exercise of power of the Provincial Government by the Board of Revenue or the Financial Commissioner. 24. [Replead",
  "source_file": "administrator4b50fb9f2a0417cc9afd65b75e8c292e.txt",
  "law_name": "The Waste Lands (Claims) Act, 1863",
  "year": 1863
}