{
  "law_name": "The Specific Relief Act",
  "year": 1877,
  "chapters": [
    {
      "chapter_title": "Preliminary",
      "sections": [
        {
          "section_no": "1",
          "section_title": "Short title. Local extent. Commencement.",
          "body": "This Act may be called the Specific Relief Act, 1877. It extends to the whole of Pakistan and shall come into force on the first day of May, 1877."
        },
        {
          "section_no": "2",
          "section_title": "[Repealed.]",
          "body": "Rep. by the Amending Act, 1891 (XII of 1891)."
        },
        {
          "section_no": "3",
          "section_title": "Interpretation-clause.",
          "body": "In this Act, unless there be something repugnant in the subject or context, 'obligation' includes every duty enforceable by law; 'trust' includes every species of express, implied, or constructive fiduciary ownership; 'trustee' includes every person holding, expressly, by implication, or constructively, a fiduciary character."
        },
        {
          "section_no": "4",
          "section_title": "Savings.",
          "body": "Except where it is herein otherwise expressly enacted, nothing in this Act shall be deemed to give any right to relief in respect of any agreement which is not a contract."
        },
        {
          "section_no": "5",
          "section_title": "Specific relief how given.",
          "body": "Specific relief is given by taking possession of certain property and delivering it to a claimant; by ordering a party to do the very act which he is under an obligation to do; by preventing a party from doing that which he is under an obligation not to do; by determining and declaring the rights of parties otherwise than by an award of compensation; or by appointing a receiver."
        },
        {
          "section_no": "6",
          "section_title": "Preventive relief.",
          "body": "Specific relief granted under clause (c) of section 5 is called preventive relief."
        },
        {
          "section_no": "7",
          "section_title": "Relief not granted to enforce penal law.",
          "body": "Specific relief cannot be granted for the mere purpose of enforcing a penal law."
        }
      ]
    },
    {
      "chapter_title": "Of Specific Relief",
      "sections": [
        {
          "section_no": "8",
          "section_title": "Recovery of specific immoveable property.",
          "body": "A person entitled to the possession of specific immoveable property may recover it in the manner prescribed by the Code of Civil Procedure."
        },
        {
          "section_no": "9",
          "section_title": "Suit by person dispossessed of immoveable property.",
          "body": "If any person is dispossessed without his consent of immoveable property otherwise than in due course of law, he or any person claiming through him may, by suit, recover possession thereof, notwithstanding any other title that may be set up in such suit."
        },
        {
          "section_no": "10",
          "section_title": "Recovery of specific moveable property.",
          "body": "A person entitled to the possession of specific moveable property may recover the same in the manner prescribed by the Code of Civil Procedure."
        },
        {
          "section_no": "11",
          "section_title": "Liability of person in possession, not as owner, to deliver to person entitled to immediate possession.",
          "body": "A trustee may sue under this section for the possession of property to the beneficial interest in which the person for whom he is trustee is entitled."
        }
      ]
    },
    {
      "chapter_title": "Of the Specific Performance of Contracts",
      "sections": [
        {
          "section_no": "12",
          "section_title": "Cases in which specific performance enforceable.",
          "body": "Specific performance of a contract may be enforced in certain cases as provided in this Act."
        },
        {
          "section_no": "13",
          "section_title": "Contract of which the subject has partially ceased to exist.",
          "body": "Specific performance may be enforced even if the subject of the contract has partially ceased to exist."
        },
        {
          "section_no": "14",
          "section_title": "Specific performance of part of contract where part unperformed is small.",
          "body": "Specific performance may be enforced for a part of the contract where the part unperformed is small."
        },
        {
          "section_no": "15",
          "section_title": "Specific performance of part of contract where part unperformed is large.",
          "body": "Specific performance may be enforced for a part of the contract where the part unperformed is large."
        },
        {
          "section_no": "16",
          "section_title": "Specific performance of independent part of contract.",
          "body": "Specific performance may be enforced for an independent part of the contract."
        },
        {
          "section_no": "17",
          "section_title": "Bar in other cases of specific performance of part of contract.",
          "body": "There are bars in other cases of specific performance of part of contract."
        },
        {
          "section_no": "18",
          "section_title": "Purchaser's rights against vendor with imperfect title.",
          "body": "Purchasers have rights against vendors with imperfect title."
        },
        {
          "section_no": "19",
          "section_title": "Power to award compensation in certain cases.",
          "body": "The court has the power to award compensation in certain cases."
        },
        {
          "section_no": "20",
          "section_title": "Liquidation of damages not a bar to specific performance.",
          "body": "Liquidation of damages is not a bar to specific performance."
        },
        {
          "section_no": "21",
          "section_title": "Contracts not specifically enforceable.",
          "body": "Certain contracts are not specifically enforceable."
        },
        {
          "section_no": "22",
          "section_title": "Discretion as to decreeing specific performance.",
          "body": "The court has discretion as to decreeing specific performance."
        },
        {
          "section_no": "23",
          "section_title": "Who may obtain specific performance.",
          "body": "Certain persons may obtain specific performance."
        },
        {
          "section_no": "24",
          "section_title": "Personal bars to the relief.",
          "body": "There are personal bars to the relief."
        },
        {
          "section_no": "25",
          "section_title": "Contracts to sell property by one who has no title, or who is a voluntary settler.",
          "body": "Contracts to sell property by one who has no title, or who is a voluntary settler are not enforceable."
        },
        {
          "section_no": "26",
          "section_title": "Non-enforcement except with variation.",
          "body": "Certain contracts cannot be enforced except with variation."
        },
        {
          "section_no": "27",
          "section_title": "Relief against parties and persons claiming under them by subsequent title.",
          "body": "Relief may be granted against parties and persons claiming under them by subsequent title."
        },
        {
          "section_no": "27 (A)",
          "section_title": "Specific performance in case of part performance of contract to lease.",
          "body": "Specific performance may be granted in case of part performance of contract to lease."
        },
        {
          "section_no": "28",
          "section_title": "What parties cannot be compelled to perform.",
          "body": "Certain parties cannot be compelled to perform."
        },
        {
          "section_no": "29",
          "section_title": "Bar of suit for breach after dismissal.",
          "body": "There is a bar of suit for breach after dismissal."
        },
        {
          "section_no": "30",
          "section_title": "Application of preceding sections to awards and testamentary directions to execute settlements.",
          "body": "The preceding sections apply to awards and testamentary directions to execute settlements."
        }
      ]
    },
    {
      "chapter_title": "Of the Rectification of Instruments",
      "sections": [
        {
          "section_no": "31",
          "section_title": "When instrument may be rectified.",
          "body": "An instrument may be rectified under certain conditions."
        },
        {
          "section_no": "32",
          "section_title": "Presumption as to intent of parties.",
          "body": "There is a presumption as to the intent of parties in the rectification of instruments."
        },
        {
          "section_no": "33",
          "section_title": "Principles of rectification.",
          "body": "Certain principles govern the rectification of instruments."
        },
        {
          "section_no": "34",
          "section_title": "Specific enforcement of rectified contract.",
          "body": "Specific enforcement may be granted for a rectified contract."
        }
      ]
    },
    {
      "chapter_title": "Of the Recission of Contracts",
      "sections": [
        {
          "section_no": "35",
          "section_title": "When rescission may be adjudged.",
          "body": "Rescission may be adjudged under certain conditions."
        },
        {
          "section_no": "36",
          "section_title": "Rescission for mistake.",
          "body": "Rescission may be granted for mistake."
        },
        {
          "section_no": "37",
          "section_title": "Alternative prayer for rescission in suit for specific performance.",
          "body": "An alternative prayer for rescission may be made in a suit for specific performance."
        },
        {
          "section_no": "38",
          "section_title": "Court may require party rescinding to do equity.",
          "body": "The court may require a party rescinding to do equity."
        }
      ]
    },
    {
      "chapter_title": "Of the Cancellation of Instruments",
      "sections": [
        {
          "section_no": "39",
          "section_title": "When cancellation may be ordered.",
          "body": "Cancellation may be ordered under certain conditions."
        },
        {
          "section_no": "40",
          "section_title": "What instruments may be partially cancelled.",
          "body": "Certain instruments may be partially cancelled."
        },
        {
          "section_no": "41",
          "section_title": "Power to require party for whom instrument is cancelled to make compensation.",
          "body": "The court has the power to require a party for whom an instrument is cancelled to make compensation."
        }
      ]
    },
    {
      "chapter_title": "Of Declaratory Decrees",
      "sections": [
        {
          "section_no": "42",
          "section_title": "Discretion of Court as to declaration of status or right.",
          "body": "The court has discretion as to declaration of status or right."
        },
        {
          "section_no": "43",
          "section_title": "Effect of declaration.",
          "body": "There are effects of declaration."
        }
      ]
    },
    {
      "chapter_title": "Of the Appointment of Receivers",
      "sections": [
        {
          "section_no": "44",
          "section_title": "Appointment of receivers discretionary.",
          "body": "The appointment of receivers is discretionary."
        }
      ]
    },
    {
      "chapter_title": "Of the Enforcement of Public Duties",
      "sections": [
        {
          "section_no": "45 to 51",
          "section_title": "[Omitted.]",
          "body": "Sections 45 to 51 are omitted."
        }
      ]
    },
    {
      "chapter_title": "Of Preventive Relief",
      "sections": [
        {
          "section_no": "52",
          "section_title": "Preventive relief how granted.",
          "body": "Preventive relief is granted under certain conditions."
        },
        {
          "section_no": "53",
          "section_title": "Temporary injunctions. Perpetual injunctions.",
          "body": "Temporary and perpetual injunctions are defined."
        }
      ]
    },
    {
      "chapter_title": "Of Perpetual Injunctions",
      "sections": [
        {
          "section_no": "54",
          "section_title": "Perpetual injunctions when granted.",
          "body": "Perpetual injunctions may be granted under certain conditions."
        },
        {
          "section_no": "55",
          "section_title": "Mandatory injunction.",
          "body": "Mandatory injunctions are defined."
        },
        {
          "section_no": "56",
          "section_title": "Injunction when refused.",
          "body": "Injunctions may be refused under certain conditions."
        },
        {
          "section_no": "57",
          "section_title": "Injunction to perform negative agreement.",
          "body": "Injunctions may be granted to perform negative agreements."
        }
      ]
    }
  ],
  "source_file": "administratorf257754bbb3c6863d879492bc8cd8f6e.txt"
}