{
  "error": "Expecting value: line 1 column 1 (char 0)",
  "raw": "THE TEA (CONTROL OF PRICES, DISTRIBUTION AND MOVEMENT) ORDINANCE, 1960 CONTENTS 1. Short title extent and commencement 2. Definitions 3. Registration of dealers 4. Power to refuse suspended or cancel registration 5. Forward transaction banned 6. Restrictions on dealings in tea 7. Duty to declare possession of excess stocks 8. Fixation of prices 9. Fixation of quantities of tea to be held by approved dealers etc., 10. Restrictions on possession and sale of tea where maximum is fixed under section 9 11. Power to order sale 12. Restrictions on movements of tea 13. Information to be furnished by importers 14. Disposal of imports 15. Declaration of godowns, store-houses and ware-houses 16. Information to be furnished by blenders 17. Maintenance of records, etc. 18. Marking of process and exhibition of price lists 19. Cash memorandum to be given in certain cases 20. Refusal to sell 21. Offences and penalties 22. Attempts and abetments 23. Offences by corporations 24. False statements 25. Cognizance of offences 26. Power to try offences summarily 27. Special provisions regarding fines 28. Presumption as to orders 29. Protection of action taken in goods faith 30. Delegation of powers 31. Ordinance not to apply to Government transactions. 32. Power to make rules 33. Power to exempt. 34. Ordinance in addition to Other Laws, etc. THE TEA (CONTROL OF PRICES, DISTRIBUTION AND MOVEMENT) ORDINANCE, 1960 ORDINANCE No. XXVIII OF 1960 [6th July, 1960] An Ordinance to provide for special measures for the control of prices, distribution and movement of tea. WHEREAS it is expedient to provide for special measures for the control of prices, distribution and movement of tea; Now, THEREFORE, in pursuance of the Proclamation of the seventh day of October, 1958, and in exercise of all powers enabling him in that behalf, the President is pleased to make and promulgate the following Ordinance:- 1. Short title extent and commencement. (1) This Ordinance may be called the Tea (Control of Prices,",
  "source_file": "administratore129e87e37f831d84f6c7718744a2488.txt",
  "law_name": "The Tea (Control of Prices, Distribution and Movement) Ordinance, 1960",
  "year": 1960
}