{
  "error": "Expecting value: line 1 column 1 (char 0)",
  "raw": "Updated till 3.8.2022 ISLAMABAD CONSUMERS PROTECTION ACT, 1995 CONTENT SECTIONS: 1. Short title, extent and commencement. 2. Definitions. 3. The Council. 4. Meetings of the Council. 5. Objects and functions of the Council. 6. Authority. 7. Prohibition of false advertisement etc. 8. Procedure for disposal of the complaints. 8A. Power to try summarily. 9. Penalties. 10. Appeal. 11. Immunity of the Council, etc. 12. Rules. ISLAMABAD CONSUMERS PROTECTION ACT, 1995 ACT NO. III OF 1995 An Act to provide for promotion and protection of the interest of consumers WHEREAS sit is expedient to provide for promotion and protection of the interests of consumers and for matters connected therewith and incidental thereto ; It is hereby enacted as follows :- 1. Short title, extent and commencement.-(1) This Act may be called the Islamabad Consumers Protection Act, 1995. (2) It extends to the Islamabad Capital Territory. (3) It shall come into force at once. 2. Definitions. In this Act, unless there is anything repugnant in the subject or context,- (a) “Authority” means the Court of Sessions, Islamabad; (b) “complaint” means- (i) a consumer; (ii) a consumer’s association; and (iii) the Federal Government, Chief Commissioner, Islamabad Capital Territory, Capital Development Authority, or any person or agency authorized by the aforesaid on their behalf to file complaint before the Authority; (c) “consumer” means any person who- (i) buys goods for a consideration which has been paid or partly paid and partly promised to be paid or under any system of deferred payment or hire purchase and includes any user of such goods but does not include a person who obtains such goods for re-sale or for any commercial purpose; or (ii) hires any goods or services for a consideration which has been paid or promised or partly paid and partly promised or under any system of deferred payment and includes any beneficiary of such services. (d) “Council” means the Consumers’ Protection Council, Islamabad; es",
  "source_file": "administratorbc4daf1cd281f7808ceb417c316f18ea.txt",
  "law_name": "The Islamabad Consumers Protection Act, 1995",
  "year": 1995
}