{
  "law_name": "THE INSPECTION AGENCIES (REGISTRATION AND REGULATION) ORDINANCE",
  "year": 1981,
  "chapters": [
    {
      "chapter_title": "Contents",
      "sections": [
        {
          "section_no": "1",
          "section_title": "Short title, extent and commencement",
          "body": "(1) This Ordinance may be called the , 1981. (2) It extends to the whole of Pakistan. (3) It shall come into force on such date as the Federal Government may, by notification in the official Gazette, appoint."
        },
        {
          "section_no": "2",
          "section_title": "Definitions",
          "body": "In this Ordinance, unless there is anything repugnant in the subject or context, (a) “Authority” means the Authority appointed under section 3; (b) “buyer”, in relation to goods exported out of Pakistan, means a person, company or organisation outside Pakistan who or which has agreed to purchase and import any goods from Pakistan, and, in relation to goods imported into Pakistan, a person, company or organisation in Pakistan registered under the Order; (c) “certificate of inspection” means a certificate issued after inspection in the prescribed manner; (d) “Council” means the Pakistan Pre-shipment Inspection Council constituted under section 4; (e) “inspection”, in relation to any goods, means the process of determining by scientific methods of sampling, analysis and testing whether a batch or lot of goods conforms to- (a) a standard specification applicable to that class of goods laid down by or under any law, or (b) specifications stipulated in the contract of sale provided it does not come in conflict with the specification laid down by or under any law, or (c) a sample or samples of that class of goods agreed upon between the seller and the buyer and bearing their signature, initials or any other distinguishing marks; (f) “Order” means the Registration (Importers and Exporters) Order, 1952, made under section 3 of the Imports and Exports (Control) Act, 1950 (XXXIX of 1950); (g) “prescribed” means prescribed by rules; (h) “registration” means registration under this Ordinance and “registered” shall be construed accordingly; (i) “rules” means rules made under this Ordinance; and (j) “seller”, in relation to goods exported out of Pakistan, means an exporter registered under the Order, and, in relation to goods imported into Pakistan, a person, company or organization supplying goods from outside Pakistan."
        },
        {
          "section_no": "3",
          "section_title": "Appointment of Authority",
          "body": "The Federal Government may, by notification in the official Gazette, appoint an Authority for the purpose of registering companies."
        },
        {
          "section_no": "4",
          "section_title": "Constitution of the Council, etc.",
          "body": "(1) The Federal Government may, by notification in the official Gazette, constitute a Council to be known as the Pakistan Pre-shipment Inspection Council consisting of such number of members as the Federal Government may determine. (2) The Council shall render to the Authority such technical assistance in relation to the execution of the provisions of this Ordinance as may be required of it."
        },
        {
          "section_no": "5",
          "section_title": "Prohibition of inspection by an unregistered firm",
          "body": "No company, organisation or institution, including a foreign company, hereinafter referred to as company, which has not been registered with the authority, shall carry on the business of inspection or issue a certificate of inspection."
        },
        {
          "section_no": "6",
          "section_title": "Registration of companies, etc.",
          "body": "(1) Every company carrying on the business of inspection at the commencement of this Ordinance shall, within three months of such commencement, and every company desiring to commence such business after such commencement shall, before commencing business, apply to the Authority for registration on payment of such fee as may be prescribed. (2) No company shall be registered unless it conforms to the prescribed conditions of registration."
        },
        {
          "section_no": "7",
          "section_title": "Penalties",
          "body": "Whoever contravenes the provisions of section 5 shall be punishable with imprisonment for a term which may extend to three years, or with fine, or with both."
        },
        {
          "section_no": "8",
          "section_title": "Provisions of the Ordinance and the rules to override other enactments",
          "body": "(1) The provisions of this Ordinance and the rules shall have effect in relation to goods exported out of, or imported into, Pakistan notwithstanding any provisions relating to quality control or buyer’s acceptance inspection prior to the export of such goods contained in any other law for the time being in force or in any instrument having effect by virtue of any such law. (2) All contracts embodying specification of goods signed before the commencement of this Ordinance shall remain valid and shall be fulfilled as such. (3) If the rules are amended so as to make any changes in the standard specification of any goods, the changes so made shall not affect the contracts made in accordance with the standard specifications existing prior to the changes."
        },
        {
          "section_no": "9",
          "section_title": "Delegation of powers",
          "body": "The Federal Government may, by notification in the official Gazette, direct that any power exercisable by it under this Ordinance or the rules shall, in relation to such matters and subject to such conditions, if any, as may be specified in the notification, be exercisable also by the Council or such officer or organisation subordinate to it as may be specified in the notification."
        },
        {
          "section_no": "10",
          "section_title": "Power to make rules",
          "body": "(1) The Federal Government may, by notification in the official Gazette, make rules for carrying out the purposes of this Ordinance. (2) In particular and without prejudice to the generality of the foregoing power, such rules may provide for- (a) the procedure of applying for registration; (b) the conditions of registration; (c) the fee to be charged for registration; (d) an appellate authority to hear appeal against refusal to register a company; (e) the procedure of meetings of the Council; (f) the method of consultation with the Council; (g) any other matter which is to be or may be prescribed. (3) The power to make rules conferred by this section shall, except on the first occasion of the exercise thereof, be subject to the condition of consultation with the Council."
        }
      ]
    }
  ],
  "source_file": "administrator85acedee0a8673dde8368f2216ab2880.txt"
}