{
  "error": "Expecting value: line 1 column 1 (char 0)",
  "raw": "THE ABANDONED PROPERTIES (MANAGEMENT) ACT, 1975 CONTENTS 1. Short title, extent and commencement 2. Definitions 3. Vesting of abandoned property in Government 4. Board of Trustees 5. Appointment of Administrator and Deputy Administrators 6. Holding of abandoned property and its surrender, etc. 7. Power of Administrator to take possession of abandoned property 8. Payment to Administrator 9. Recovery of damages for unauthorised possession 10. Exemption from legal process 11. Publication of list of abandoned property 12. Prohibition of transfers of property generally 13. Confirmation of transfers by specified persons 14. Claims by interested persons 15. Appeal and revision 16. Powers and duties of the Administrator generally 17. Evaluation of abandoned property 18. Expenditure by Administrator how to be recouped 19. Maintenance of accounts by Administrator 20. Powers of Board and Administrator when holding an inquiry, etc. 21. Recovery of arrears 22. Penalty and procedure 23. Bar of jurisdiction 24. Indemnity 25. Delegation of powers 26. Officers end servants 27. Act to override other laws 28. Power to exempt 29. Power of Federal Government to take action with regard to abandoned property 30. Power to make rules 31. [Omitted] THE ABANDONED PROPERTIES (MANAGEMENT) ACT, 1975 ACT No. XX OF 1975 [12th February, 1975] An Act provide for the 1[* * *] management of certain properties WHEREAS it is expedient to provide for the 1[* * *] management of certain properties, and for matters connected therewith ; AND WHEREAS the Proclamation of Emergency referred to in Article 280 of the Constitution is still in force; It is hereby enacted as follows:- 1. Short title, extent and commencement.-(1) This act may be called the Abandoned Properties (1[* * *] Management) Act, 1975. (2) It extends to the whole of Pakistan. (3) It shall come into force at once. 2. Definitions.-In this Act, unless there is anything repugnant in the subject or context,- (a) “abandoned property” means any prope",
  "source_file": "administratorc1450a7f4f2b3b5b93d09aca3418aa92.txt",
  "law_name": "The Abandoned Properties (Management) Act, 1975",
  "year": 1975
}