{
  "law_name": "THE PETROLEUM PRODUCTS PETROLEUM LEVY AND CLIMATE SUPPORT LEVY ORDINANCE",
  "year": 1961,
  "chapters": [
    {
      "chapter_title": "Contents",
      "sections": [
        {
          "section_no": "1",
          "section_title": "Short title, extent and commencement",
          "body": "(1) This Ordinance may be called the Petroleum Products (Petroleum Levy and Climate Support Levy) Ordinance, 1961. (2) It extends to the whole of Pakistan. (3) It shall come into force at once, and shall be deemed to have taken effect on the first day of August, 1959."
        },
        {
          "section_no": "2",
          "section_title": "Definitions",
          "body": "In this Ordinance, unless there is anything repugnant the subject or context, (1) “Company” means a company specified in the Second Schedule and includes a person engaged in the manufacturing, refining or reclaiming of lubricating oil from used lubricating oil; (1A) “depot” includes the premises set apart for manufacturing, refining or reclaiming lubricating oil from used lubricating oil in any manner; (4) “fixed sale price” means such ex-refinery sale price or, as the case may be, ex-installation, ex-retail outlet or ex-depot sale price as the Federal Government, by notification in the official Gazette; or a company specified in the Second Schedule and authorised by the Federal Government, in respect of any petroleum product specified in the First Schedule, through electronic and press media, may declare to be the fixed sale price."
        },
        {
          "section_no": "3",
          "section_title": "Power to grant exemption from payment, authorise refund and procedure for collection and refund of Petroleum Levy and Climate Support Levy",
          "body": "(1) Every company, refinery and licensee shall pay to the Federal Government, a petroleum levy and climate support levy on petroleum products at such rates as may respectively be notified by the Federal Government in the official Gazette, from time to time. (2) Nothing in sub-section (1) shall apply to a petroleum product produced by a refinery or, as the case may be, purchased by a company, for export."
        },
        {
          "section_no": "4",
          "section_title": "Maximum sale price",
          "body": "(1) Notwithstanding anything contained in any other law, no company shall sell ex-refinery, ex-installation, ex-retail outlet or ex-depot any petroleum product at a price higher than the fixed sale price."
        },
        {
          "section_no": "5",
          "section_title": "Allowance to be made for Petroleum Levy and Climate Support Levy for purposes of income tax",
          "body": "Notwithstanding anything contained in any other law, the amount of the Petroleum Levy and Climate Support Levy paid by a company under section 3 shall be an expenditure for which allowance is to be made in computing profits or gains under Income Tax Ordinance, 2001."
        },
        {
          "section_no": "6",
          "section_title": "Power to make rules",
          "body": "(1) The Federal Government may, by notification in the official Gazette, make rules for carrying out the purposes of this Ordinance."
        },
        {
          "section_no": "7",
          "section_title": "Power to amend Schedules",
          "body": "The Federal Government may, from time to time, by notification in the official Gazette, make such amendments and modifications in the Schedules as it thinks fit."
        },
        {
          "section_no": "8",
          "section_title": "Delegation of powers",
          "body": "The Federal Government may, by notification in the official Gazette, direct that all or any of its powers under this Ordinance or the rules made thereunder shall, in such circumstances and under such conditions, if any, as may be specified in the direction, be exercised also by an officer or authority subordinate to the Federal Government."
        },
        {
          "section_no": "9",
          "section_title": "Validation",
          "body": "Notwithstanding anything contained in any law, rules or judgment of a Court, the petroleum development levy levied and collected from a company during the period from the 1st day of March, 2010, shall be deemed to have been validly and lawfully levied and collected and shall not be refunded."
        }
      ]
    }
  ],
  "source_file": "administrator1bc3ad732b91e47508abf826f2840d15.txt"
}