{
  "law_name": "THE SOLDIERS (LITIGATION) ACT",
  "year": 1925,
  "chapters": [
    {
      "chapter_title": "Contents",
      "sections": [
        {
          "section_no": "1",
          "section_title": "Short title, extent and commencement",
          "body": "(1) This Act may be called the Soldiers (Litigation) Act, 1925. (2) It extends to the whole of Pakistan. (3) It shall come into force on the first day of April, 1925."
        },
        {
          "section_no": "2",
          "section_title": "Definitions",
          "body": "In this Act, unless there is anything repugnant in the subject or context, (a) 'Court' means a Civil or Revenue Court; (b) 'soldier' means any person subject to the Pakistan Army Act, 1952, or the Pakistan Air Force Act, 1953; (c) 'prescribed' means prescribed by rules made under this Act; and (d) 'proceeding' includes any suit, appeal or application."
        },
        {
          "section_no": "3",
          "section_title": "Circumstances in which a soldier shall be deemed to be serving under special conditions",
          "body": "For the purposes of this Act, a soldier shall be deemed to be or, as the case may be, to have been serving under special conditions when he is or has been serving under war conditions, or overseas, or at any place in Kashmir or the Northern Areas."
        },
        {
          "section_no": "4",
          "section_title": "Particulars to be furnished in plaints applications or appeals to Court",
          "body": "If any person presenting any plaint, application or appeal to any Court has reason to believe that any adverse party is a soldier who is serving under special conditions, he shall state the fact in his plaint, application or appeal."
        },
        {
          "section_no": "5",
          "section_title": "Power of Collector to intervene in case of un-represented soldier",
          "body": "If any Collector has reason to believe that any soldier, who ordinarily resides or has property in his district and who is a party to any proceeding pending before any Court, is unable to appear therein, the Collector may certify the facts in the prescribed manner to the Court."
        },
        {
          "section_no": "6",
          "section_title": "Notice to be given in case of unrepresented soldier",
          "body": "If a Collector has certified under section 5, or if the Court has reason to believe, that a soldier, who is a party to any proceeding pending before it, is unable to appear therein, and if the soldier is not represented by any person duly authorised to appear, plead or act on his behalf, the Court shall suspend the proceeding and shall give notice thereof in the prescribed manner to the prescribed authority."
        },
        {
          "section_no": "7",
          "section_title": "Postponement of proceedings",
          "body": "If, on receipt of a notice under section 6, the prescribed authority certifies in the prescribed manner to the Court in which the proceeding is pending that the soldier in respect of whom the notice was given is serving under special conditions, and that a postponement of the proceeding in respect of the soldier is necessary in the interests of justice, the Court shall thereupon postpone the proceeding in respect of the soldier for the prescribed period."
        },
        {
          "section_no": "8",
          "section_title": "Court may proceed when no certificate received",
          "body": "If, after issue of a notice under section 6, the prescribed authority either certifies that the soldier is not serving under special conditions or that such postponement is not necessary, or fails to certify, the Court may, if it thinks fit, continue the proceeding."
        },
        {
          "section_no": "9",
          "section_title": "Postponement of proceedings against soldier on leave",
          "body": "When any document purporting to be signed by the Commanding Officer of a soldier who is a party to any proceeding is produced by or on behalf of the soldier before the Court, the proceeding in respect of such soldier may be postponed in the manner provided in section 7."
        },
        {
          "section_no": "10",
          "section_title": "Power to set aside decrees and orders passed against a soldier serving under war or special conditions",
          "body": "In any proceeding before a Court in which a decree or order has been passed against any soldier whilst he was serving under any special conditions, the soldier or, if he is deceased, his legal representatives may apply to the Court to set aside such decree or order."
        },
        {
          "section_no": "11",
          "section_title": "Modification of law of limitation where soldier or his legal representatives is a party",
          "body": "In any case where a soldier or his legal representatives is a party to any proceeding, the law of limitation shall be modified in accordance with the provisions of this Act."
        },
        {
          "section_no": "12",
          "section_title": "Power of Court to refer questions to prescribed authorities",
          "body": "The Court may refer any question arising in any proceeding to the prescribed authority for its opinion."
        },
        {
          "section_no": "13",
          "section_title": "Rule making power",
          "body": "The Government may make rules for carrying out the purposes of this Act."
        },
        {
          "section_no": "14",
          "section_title": "Power to apply the provisions of the Act to other persons in the service of the State",
          "body": "The provisions of this Act may be applied to other persons in the service of the State as prescribed."
        },
        {
          "section_no": "14A",
          "section_title": "[Omitted]",
          "body": ""
        },
        {
          "section_no": "15",
          "section_title": "[Repeal]",
          "body": ""
        }
      ]
    }
  ],
  "source_file": "administratorafb9b89337efce3e80e62931379c9939.txt"
}