{
  "law_name": "THE MILITARY COLLEGE OF ENGINEERING, RISALPUR (DEGREE) ORDINANCE",
  "year": 1962,
  "chapters": [
    {
      "chapter_title": "Contents",
      "sections": [
        {
          "section_no": "1",
          "section_title": "Short title and commencement",
          "body": "(1) This Ordinance may be called the Military College of Engineering, Risalpur (Degree) Ordinance, 1962. (2) It shall come into force at once."
        },
        {
          "section_no": "2",
          "section_title": "Definitions",
          "body": "In this Ordinance, unless there is anything repugnant in the subject or context, (1) ‘Academic Board’ means the Academic Board of the College; (2) ‘College’ means the Military College of Engineering, Risalpur; (3) ‘Commandant’ means the Commandant of the College; (4) ‘Controlling Authority’ means the Controlling Authority of the College."
        },
        {
          "section_no": "3",
          "section_title": "Constitution and powers of the College",
          "body": "(1) The College shall consist of the Controlling Authority, the Commandant and the Academic Board. (2) Subject to rules made under this Ordinance, the College shall have the powers: (a) to provide for instruction in Civil Engineering and allied subjects; (b) to hold examinations and confer the Degree of Bachelor of Civil Engineering on persons who have pursued a regular course of study in the College and have passed the final examination of the College, whether before or after the commencement of this Ordinance; (c) to co-operate with Universities and other authorities in such manner and for such purposes as may be necessary; (d) to institute professorships, readerships or lecturerships and to create any other teaching or administrative posts required by the College and to make appointments thereto; (e) to institute and award fellowships, scholarships bursaries, medals and other awards in accordance with the prescribed conditions; (f) to establish teaching departments and to make such arrangements for their maintenance, management and administration as it may consider necessary; (g) to supervise and control the residence and discipline of the students of the College and to make arrangements for the promotion of their health and general welfare; (h) to organize exhibitions and such other functions as may be beneficial to the students; and (i) to do such other acts and things as may be necessary for the furtherance of the objects of the College as an examining and teaching body."
        },
        {
          "section_no": "4",
          "section_title": "Controlling Authority",
          "body": "(1) The Engineer-in-Chief of the Pakistan Army shall be the Controlling Authority of the College. (2) Subject to the provisions of this Ordinance and the rules made thereunder, the Controlling Authority shall have such powers and duties as the Federal Government may determine."
        },
        {
          "section_no": "5",
          "section_title": "Commandant",
          "body": "(1) There shall be a Commandant of the College who shall be appointed by the Controlling Authority on such terms and conditions as it may determine. (2) Subject to provisions of this Ordinance and the rules and regulations made thereunder, the Commandant shall have such powers and duties as the Controlling Authority may determine."
        },
        {
          "section_no": "6",
          "section_title": "Academic Board",
          "body": "There shall be an Academic Board consisting of (a) the Commandant who shall be the Chairman of the Academic Board; (b) the Professors and Assistant Professors of the College; and (c) such other persons as may be appointed by the Controlling Authority."
        },
        {
          "section_no": "7",
          "section_title": "Functions of Academic Board",
          "body": "The functions of the Academic Board shall be (a) to advise the Controlling Authority on all academic matters; (b) to make arrangements for the proper teaching and conduct of examinations and the promotion of academic life in the College; (c) to propose to the Controlling Authority schemes for the constitution of teaching departments in the College; (d) to prescribe, subject to the approval of the Controlling Authority, the course of studies, the syllabi and the outlines of texts for the Degree examination in Civil Engineering."
        },
        {
          "section_no": "8",
          "section_title": "Power to make rules",
          "body": "The Federal Government may, by notification in the official Gazette, make rules for the purpose of carrying into effect the provisions of this Ordinance."
        },
        {
          "section_no": "9",
          "section_title": "Regulations",
          "body": "The Controlling Authority may with the previous approval of the Federal Government make regulations, not inconsistent with the rules, to carry out the purposes of this Ordinance."
        },
        {
          "section_no": "10",
          "section_title": "Interpretation by Federal Government",
          "body": "If any question arises regarding interpretation of any provisions of this Ordinance or of any rules or regulations made thereunder, the matter shall be referred by the Controlling Authority to the Federal Government whose decision thereon shall be final."
        },
        {
          "section_no": "11",
          "section_title": "Waiver of defect in the constitution of Academic Board",
          "body": "No act or proceeding of any Authority or other body of the College shall be invalid merely on the ground of the existence of any vacancy in, or any defect in the constitution of the Academic Board."
        },
        {
          "section_no": "12",
          "section_title": "Bar of Jurisdiction",
          "body": "No order made under this Ordinance or the rules or regulations made thereunder shall be called in question in any court, and no suit, prosecution or other legal proceedings shall lie against any person for anything in good faith done or intended to be done under this Ordinance or the rules or regulations."
        },
        {
          "section_no": "13",
          "section_title": "Power to remove difficulties",
          "body": "The Federal Government may for the purpose of removing any difficulties in first giving effect to the provisions of this Ordinance, particularly in relation to the constitution or re-constitution of any authority, make such order as it may deem necessary or expedient."
        }
      ]
    }
  ],
  "source_file": "administrator26dfa37379a318e57bfc8c46e3f5a00b.txt"
}