{
  "error": "Expecting value: line 1 column 1 (char 0)",
  "raw": "THE NATURALIZATION ACT, 1926 CONTENTS 1. Short title, extent and commencement 2. Definitions 3. Grant of certificate of naturalization 4. Contents and form of application 5. Grant of certificate 6. Oath of allegiance 7. Effect of grant of certificate and taking of oath 8. Revocation of certificate 9. Effect of revocation of certificate 10. Declaration of alienage 11. Inquires 12. Oaths and affidavits 13. Power to make rule 14. Limitation to the grant of naturalization under this Act 14A. [Omitted] 14B. Application to certificates granted before partition 14C. Validation of certain certificates 15. [Repealed] The Schedule [Repealed] THE NATURALIZATION ACT, 1926 ACT No. VII OF 1926 [26th February, 1926] An Act to consolidate and amend the law relating to the naturalization in 1[Pakistan] of aliens resident therein. WHEREAS it is expedient to consolidate and amend the law relating to the naturalization in 1[Pakistan] of aliens resident therein; It is hereby enacted as follows: 1. Short title, extent and commencement.⸻(1) This Act may be called the 2[*] Naturalization Act, 1926. 1[(2) It extends to the whole of Pakistan.] (3) It shall come into force on such date as the 3[Federal Government] may, by notification in the 4[official Gazette], appoint. 2. Definitions.⸻In this Act, unless there is anything repugnant in the subject or context,⸻ (a) 5[* * * * * *] (b) “certificate of naturalization” means a certificate of naturalization granted under this Act; and 1[(c) “minor” means, notwithstanding anything in the Majority Act, 1875 (IX of 1875), any person who has not completed his age of twenty-one years.] 3. Grant of certificate of naturalization. (1) 4[The 6[Director General, Immigration and Passports]] may grant a certificate of naturalization to any person who makes an application in this behalf and satisfies 4[the 6[Director General, Immigration and Passports]] 1Subs. by Act No. XXIII of 1951, ss. 2, 3 and 4. 2Omitted by the Adaptation of Central Acts and Ordinances O",
  "source_file": "administrator82667a82a20c35d5ee1e97ad66e230f4.txt",
  "law_name": "The Naturalization Act, 1926",
  "year": 1926
}