{
  "law_name": "The Agricultural Produce Cess Act",
  "year": 1940,
  "chapters": [
    {
      "chapter_title": "Contents",
      "sections": [
        {
          "section_no": "1",
          "section_title": "Short title and extent",
          "body": "(1) This Act may be called the Agricultural Produce Cess Act, 1940. (2) It extends to the whole of Pakistan."
        },
        {
          "section_no": "2",
          "section_title": "Definitions",
          "body": "Omitted"
        },
        {
          "section_no": "3",
          "section_title": "Imposition of cess",
          "body": "(1) A customs duty at the rate of one-half of one per cent. ad valorem shall be levied on all articles included in the Schedule which are exported from Pakistan: Provided that the said duty shall not be levied on articles proved to the satisfaction of the Collector not to have been produced in Pakistan: Provided further that the Federal Government may, by notification in the Official Gazette, vary the rate at which customs duty shall be levied. (2) The Federal Government may, by notification in the official Gazette, fix for the purposes of levying the said duty tariff values of any articles included in the Schedule, and may alter any tariff values for the time being in force."
        },
        {
          "section_no": "4",
          "section_title": "Power to exclude articles from Schedule",
          "body": "The Federal Government may, by notification in the official Gazette, direct that any article specified in the Schedule shall cease to be subject to the duty imposed by section 3, and thereupon, so long as the notification remains in force, that article shall be deemed not to be included in the Schedule."
        },
        {
          "section_no": "5",
          "section_title": "Refund of, and exemption from, cess",
          "body": "The Federal Board of Revenue may make rules providing, on such conditions as may be specified in the rules, for- (a) the refund of duty levied where articles are exported by land and subsequently imported into Pakistan, and (b) the export by land, without payment of the duty of articles, which are subsequently to be imported into Pakistan."
        },
        {
          "section_no": "10",
          "section_title": "Power to make rules",
          "body": "(1) The Federal Government may, after previous publication, make rules for the purpose of carrying into effect the provisions of this Act. (2) In particular and without prejudice to the generality of the foregoing power, such rules may provide for all or any of the following matters."
        },
        {
          "section_no": "12",
          "section_title": "Rules and regulations to be published",
          "body": "All rules made under section 10 shall be published in the official Gazette."
        }
      ]
    }
  ],
  "source_file": "administratorde527088a6cc7f384f4beebfc32ab87e.txt"
}