{
  "error": "Expecting value: line 1 column 1 (char 0)",
  "raw": "THE LAND REFORMS ACT, 1977 CONTENTS CHAPTER I PRELIMINARY 1. Short title, extent and commencement. 2. Definitions. CHAPTER II RESTRICTION ON OWNERSHIP AND POSSESSION OF LAND 3. Limits on individual holding. 4. Choice and exchange of land. 5. Partitioning of joint holdings and undivided Shamilat. 6. Certain transfers void. CHAPTER III OBTAINING OF DECLARATIONS, VESTING OF LANDS IN GOVERNMENT 7. Declarations. 8. Certain restrictions on cutting of trees and dismantling or removal of permanent installations or structures. 9. Vesting in Government of excess land. 10. Permanent installations and structures. CHAPTER IV COMPENSATION 11. Compensation for land. 12. Compensation for permanent installations, structures and buildings. 13. Payment of compensation. 14. Transfer of encumbrance or charge. CHAPTER V UTILIZATION OF SURRENDERED LAND 15. Diposal of surrendered land. 16. Conditions for grant of land. 17. Utilization of land. CHAPTER VI LAND COMMISSIONS 18. Functions of federal land commission. 19. Powers and functions of a provincial land commission. 20. Power to set up organizations, etc. 21. Power of make rules. 22. Delegation of powers. 23. Reconstitution of a commission. 24. Power to review. 25. Abatement of pending proceedings. 26. Removal of doubt. 27. Powers the Federal Government. CHAPTER VII BAR OF JURISDICTION AND INDEMNITY 28. Bar of jurisdiction. 29. Indemnity. CHAPTER VIII MISCELLANEOUS 30. Act to override other laws, etc. 31. Power to exempt. 32. Removal of difficulties. CHAPTER IX PUNISHMENT AND PROCEDURE 33. Offences and penalties. 34. Cognizance of offence. 35. Repeal. THE LAND REFORMS ACT, 1977 ACT No. II OF l977 [9th January, 1977] An Act to provide for further land reforms WHEREAS it is in the supreme national interest to bring about a more equitable distribution of wealth by carrying out further land reforms; AND WHEREAS clause (i) of Article 253 of the Constitution of the Islamic Republic of Pakistan provides that Parliament may by law prescribe the",
  "source_file": "administrator9610e0eae93f5de34c9af5d6adf5d7c7.txt",
  "law_name": "The Land Reforms Act, 1977",
  "year": 1977
}