{
  "error": "Expecting value: line 1 column 1 (char 0)",
  "raw": "THE HYDROGENATED VEGETABLE OIL INDUSTRY (CONTROL AND DEVELOPMENT) ACT, 1973 CONTENTS 1. Short title, extent and commencement. 2. Definitions. 3. Omitted. 4. Act to override other laws. 5. Power to take over management or acquire shares of business of an establishment. 5A. Transfer of shares and proprietary interests. 6. Appointment of Managing Directors. 6A. Constitution of Board of Directors, etc. 7. Board of Management. 8. Functions of Boards. 9. Funds of the Board. 10. Officers, etc, of the Board. 11. Adoption of balance sheet. 12. Regulations. 13. Delegation of powers, etc. 14. Acquisitions of shares. 15. Reorganisation of establishment. 16. Continuation in service. 17. Prohibition to obstruct. 18. Debtor. 19. Creditor. 20 Power to revoke contract, etc. 21. Right of shareholders. 22. Continuance in service of employees on transfer to a Corporation. 23. General effect of vesting of establishment. 24. Duty to deliver possession of property and documents relating thereto. 25. Provident, superannuation and other like funds. 26. Minimum return. 27. Bar of jurisdiction. 28. Indemnity. 29. Penalties. 30. Composite enterprises and organisations. 31. Saving. 32. Power to make rules. 33. Removal of difficulties. 34. Repeal. THE SCHEDULE. THE HYDROGENATED VEGETABLE OIL INDUSTRY (CONTROL AND DEVELOPMENT) ACT, 1973. 1ACT NO. LXV OF 1973 [15th September 1973] An Act to regulate the operation and future development of the hydrogenated vegetable oil industry. WHEREAS it is expedient to make provision to regulate the operation and future development of the hydrogenated vegetable oil industry, so as to maintain at reasonable prices, supplies essential to the life of the community while safeguarding the interests of the small investors in the industry and to provide for matters connected therewith or incidental thereto; AND WHEREAS paragraph (b) of clause (1) of Article 253 of the Constitution provides that Parliament may by law declare that any trade, business, industry or servic",
  "source_file": "administrator2fa5dc41b7e0669fb72e58fd50787218.txt",
  "law_name": "The Hydrogenated Vegetable Oil Industry (Control and Development) Act, 1973",
  "year": 1973
}