{
  "error": "Expecting value: line 1 column 1 (char 0)",
  "raw": "THE ZAKAT AND USHR ORDINANCE, 1980 CONTENTS CHAPTER-I PRELIMINARY 1. Short title, extent, application and commencement. 2. Definitions. CHAPTER-II ZAKAT 3. Charge and Collection of Zakat. 4. Secretary of information. CHAPTER-III USHR 5. Charge and collection of Ushr. 6. Mode of assessment and collection of Ushr. CHAPTER-IV ZAKAT FUNDS 7. Establishment of Zakat Funds. 8. Utilization of Zakat Funds. 9. Disbursement from Zakat Funds. 10. Accounts. 11. Audit. CHAPTER-V ORGANIZATION AND ADMINISTRATION 12. Central Zakat Council. 13. Administrator-General. 14. Provincial Zakat Council. 15. Chief Administrator. 16. District Zakat and Ushr Committee. 17. Tehsil, Taluqa or Sub-divisional Zakat and Ushr Committee or Town Zakat and Ushr committee. 18. Local Zakat and Ushr Committee. 19. Vacancy etc., not to invalidate acts or proceedings. 19A. Members of Council and other Committees to be Muslims. 20. Person to preside at meetings in the absence of Chairman. 21. Power of supersession and removal. 21-A. Vote of no confidence. 22. Administrative orginazation. 23. Certain persons to be public servants. CHAPTER-VI MISCELLANEOUS 24. Exemption. 25. Certain tax concessions. 26. Power to make rules. 27. Power to call for information and issue directions. 28. Indemnity and bar of jurisdiction. 29. Removal of difficulties. 29A. Dissolution and reconstitution of Committees. 30. Repeal. FIRST SCHEDULE SECOND SCHEDULE THE ZAKAT AND USHR ORDINANCE, 1980 1ORDINANCE No.XVIII OF 1980 [20th June, 1980] An Ordinance to make provisions relating to the assessment collection and disbursement of Zakat and Ushr WHEREAS it is necessary to make provisions relating to the assessment, collection and disbursement of Zakat and Ushr and matters connected therewith or incidental thereto; AND WHEREAS Pakistan, Being an Islamic State, must provide for the implementation of Islamic precepts; AND WHEREAS the Constitution of the Islamic Republic of Pakistan lays down that the Muslims of Pakistan shall be enabled t",
  "source_file": "administratorfd19eec0a97080f151dac2a8406dea88.txt",
  "law_name": "The Zakat and Ushr Ordinance, 1980",
  "year": 1980
}