{
  "error": "Expecting value: line 1 column 1 (char 0)",
  "raw": "THE CANTONMENTS (HOUSE-ACCOMMODATION) ACT, 1923 CONTENTS CHAPTER I PRELIMINARY 1. Short title, extent and commencement 2. Definitions CHAPTER II APPLICATION OF ACT 3. Cantonments or parts of cantonments in which Act to be operative 4. Saving of written instruments CHAPTER III APPROPRIATION OF HOUSES 5. Liability of houses to appropriation 6. Conditions on which houses may be appropriated 7. Procedure for taking house on lease 8. [Repealed] 9. Sanction to be obtained before a house is occupied as a hospital, etc. 10. Houses not to be appropriated in certain cases 11. Time to be allowed for giving possession of house 12. Surrender of house when to be enforced 13. [Omitted] 14. Provision where house is held on long lease by a tenant 15. Power for owner to refer to Civil Court on question of rent 16. Power for owner to refer to Civil Court on question of repairs 17. Power to have repairs executed and recover cost 18. Notice to be given of devolution of interest in house in cantonment CHAPTER IV PROCEDURE IN REFERENCES 19. Jurisdiction in references 20. Procedure and powers of the Court 21. Restriction of scope of inquiry CHAPTER V APPEALS 29. Appeal to High Court 30. Appeal to Officer Commanding the District 31. Petition of appeal 32. Order in appeal final 33. Suspension of action pending appeal CHAPTER VI SUPPLEMENTAL PROVISIONS 34. Service of notice and requisitions 34A. Computation of periods of limitation 35. Power for Federal Government to make rules 36. Further provisions respecting rules 37. Inapplicability of section 556 of the Code of Criminal Procedure, 1898, to trials of offences 38. Protection to persons acting under Act 39. [Repealed] THE SHEDULE. [REPEALED] THE CANTONMENTS (HOUSE-ACCOMMODATION) ACT, 1923 ACT NO. VI OF 1923 [5th March, 1923] An Act further to amend and to consolidate the law relating to the provision of house- accommodation for military officers in cantonments. WHEREAS it is expedient further to amend and to consolidate the law relating to ",
  "source_file": "administratore177c1bbaa6f138ba8fb1100bd6872f1.txt",
  "law_name": "The Cantonments (House-Accommodation) Act, 1923",
  "year": 1923
}