{
  "law_name": "THE CIVIL AVIATION ORDINANCE",
  "year": 1960,
  "chapters": [
    {
      "chapter_title": "Contents",
      "sections": [
        {
          "section_no": "1",
          "section_title": "Short title, extent and application",
          "body": "(1) This Ordinance may be called the Civil Aviation Ordinance, 1960. (2) It extends to the whole of Pakistan, and applies to all citizens of Pakistan and persons on any aircraft registered in Pakistan, wherever such citizens or persons may be, and to all persons on any aircraft while in Pakistan, and to all persons carrying on any business relating to or connected with, the purposes of this Ordinance."
        },
        {
          "section_no": "2",
          "section_title": "Definitions",
          "body": "In this Ordinance, unless there is anything repugnant in the subject or context, various definitions are provided for terms such as 'aerodrome', 'aircraft', 'airport', 'air transport service', 'commercial flying', 'export', 'import', 'landing area', 'prescribed', 'purposes of civil aviation', and 'rules'."
        },
        {
          "section_no": "3",
          "section_title": "Power to exempt, etc.",
          "body": "The Federal Government may, by notification in the official Gazette, either exempt from all or any of the provisions of this Ordinance any aircraft or class of aircraft, and any person or class of persons, or may direct that all or any of such provisions shall apply to any aircraft or person subject to such modifications or conditions as may be specified in the notification."
        },
        {
          "section_no": "4",
          "section_title": "Power to make rules to implement certain International Conventions",
          "body": "The Federal Government may, by notification in the official Gazette, make such rules as appear to it to be necessary for carrying out the provisions of various international conventions related to civil aviation."
        },
        {
          "section_no": "5",
          "section_title": "Power to make rules generally",
          "body": "The Federal Government may, by notification in the official Gazette, make rules for carrying out the purposes of this Ordinance, including regulations for air transport services, licensing, inspection, and control of aircraft and aerodromes."
        },
        {
          "section_no": "6",
          "section_title": "Power to make orders in times of war or emergency",
          "body": "The Federal Government may make orders in times of war or emergency as necessary."
        },
        {
          "section_no": "6A",
          "section_title": "Powers of the Federal Government to prohibit or regulate construction of buildings, planting of trees, etc.",
          "body": "The Federal Government has the power to prohibit or regulate the construction of buildings, planting of trees, and other activities that may affect aviation safety."
        },
        {
          "section_no": "6B",
          "section_title": "Payment of Compensation",
          "body": "Provisions regarding the payment of compensation for any actions taken under the powers granted in this Ordinance."
        },
        {
          "section_no": "6C",
          "section_title": "Arbitrator to have certain powers of Civil Court",
          "body": "An arbitrator appointed under this Ordinance shall have certain powers similar to those of a Civil Court."
        },
        {
          "section_no": "6D",
          "section_title": "Penalty for failure to comply with direction issued under section 6A",
          "body": "Penalties for non-compliance with directions issued under section 6A."
        },
        {
          "section_no": "7",
          "section_title": "Power to make rules for investigation of accidents [Repealed]",
          "body": "This section has been repealed."
        },
        {
          "section_no": "8",
          "section_title": "Power to detain aircraft",
          "body": "The Federal Government has the power to detain aircraft under certain conditions."
        },
        {
          "section_no": "9",
          "section_title": "Power to make rules for protecting public health",
          "body": "The Federal Government may make rules to protect public health in relation to civil aviation."
        },
        {
          "section_no": "10",
          "section_title": "Emergency powers for protection public health",
          "body": "Emergency powers may be exercised for the protection of public health."
        },
        {
          "section_no": "11",
          "section_title": "Penalty for flying so as to cause danger",
          "body": "Penalties for flying in a manner that causes danger to persons or property."
        },
        {
          "section_no": "12",
          "section_title": "Wreck and salvage",
          "body": "Provisions regarding wreck and salvage operations related to aircraft."
        },
        {
          "section_no": "13",
          "section_title": "Use of patent",
          "body": "Regulations regarding the use of patents in relation to civil aviation."
        },
        {
          "section_no": "14",
          "section_title": "Powers to apply customs procedure [Repealed]",
          "body": "This section has been repealed."
        },
        {
          "section_no": "15",
          "section_title": "Provisions relating to rules.",
          "body": "Provisions regarding the formulation and implementation of rules under this Ordinance."
        },
        {
          "section_no": "15A",
          "section_title": "Delegation of powers",
          "body": "Provisions regarding the delegation of powers granted under this Ordinance."
        },
        {
          "section_no": "16",
          "section_title": "Penalty for abetment of offences and attempted offences",
          "body": "Penalties for abetting offences and attempted offences under this Ordinance."
        },
        {
          "section_no": "17",
          "section_title": "Power of court to order forfeiture",
          "body": "The court has the power to order the forfeiture of aircraft or other property under certain conditions."
        },
        {
          "section_no": "18",
          "section_title": "Bar to certain suits",
          "body": "Provisions regarding the barring of certain legal suits related to civil aviation."
        },
        {
          "section_no": "19",
          "section_title": "Protection of acts done in good faith",
          "body": "Protection is granted for acts done in good faith under this Ordinance."
        },
        {
          "section_no": "20",
          "section_title": "Repeal [Repealed]",
          "body": "This section has been repealed."
        }
      ]
    }
  ],
  "source_file": "administratorb60fe60d8c74ce862aafd15e48a035af.txt"
}