{
  "law_name": "The Geneva Convention Implementing Act",
  "year": 1936,
  "chapters": [
    {
      "chapter_title": "Contents",
      "sections": [
        {
          "section_no": "1",
          "section_title": "Short title and extent",
          "body": "This Act may be called the Geneva Convention Implementing Act, 1936. It extends to the whole of Pakistan."
        },
        {
          "section_no": "2",
          "section_title": "Prohibition of use of emblems “Red Cross”, “Red Crescent”, etc.",
          "body": "No person other than a person entitled thereto under the Geneva Convention shall use, or in any manner exhibit, whether for the purpose of trade or business or for any other purpose or object whatsoever, the emblem or the designation “Red Cross”, “Red Crescent”, “Red Lion and Sun” or “Sun” or any sign of designation constituting an imitation thereof, irrespective of the date of the adoption of any such emblems or designation by such person: Provided that the emblem “Red Cross” may, with the permission in writing of the Society, be used in time of peace to identify vehicles used as ambulances or to mark the position of aid stations set up exclusively for giving free medical treatment to the wounded or sick."
        },
        {
          "section_no": "3",
          "section_title": "Prohibition of use of emblem of white cross on red ground or imitations thereof",
          "body": "No person shall use for the purposes of his trade or business the heraldic emblem of the white cross on a red ground, being the federal colours of Switzerland, or any sign constituting a colourable imitation of that heraldic emblem."
        },
        {
          "section_no": "4",
          "section_title": "Penalty",
          "body": "Any person contravening the provisions of section 2 or section 3 shall be punishable with fine which may extend to fifty rupees, and when such contravention is committed by a company, association or body of individuals, then, without prejudice to the liability of such company, association or body, every member thereof who is knowingly a party to the contravention shall be liable to the like penalty."
        },
        {
          "section_no": "5",
          "section_title": "Previous sanction for prosecution",
          "body": "No criminal Court shall take cognizance of any offence punishable under this Act except with the previous sanction of the Federal Government."
        },
        {
          "section_no": "6",
          "section_title": "Omitted",
          "body": ""
        }
      ]
    }
  ],
  "source_file": "administratorf18236573886117d6da46c29f913eba2.txt"
}