{
  "law_name": "THE CLAIMS FOR MAINTENANCE (RECOVERY ABROAD) ORDINANCE",
  "year": 1959,
  "chapters": [
    {
      "chapter_title": "Contents",
      "sections": [
        {
          "section_no": "1",
          "section_title": "Short title and commencement",
          "body": "(1) This Ordinance may be called the Claims for Maintenance (Recovery Abroad) Ordinance, 1959. (2) It shall come into force at once."
        },
        {
          "section_no": "2",
          "section_title": "Definitions",
          "body": "In this Ordinance, unless there is anything repugnant in the subject or context, (a) “Article” means an article of the Convention; (b) “Contracting Party” means Pakistan, and any other state whose instrument of ratification or accession is deposited under Article 13 and which is notified by the Federal Government in the official Gazette to be a contracting Party; (c) “Convention” means the United Nations Convention on the Recovery Abroad of Maintenance; and (d) “Transmitting Agency” and “Receiving Agency” for a Contracting Part shall mean respectively the judicial or administrative authority and the public or private body designated under Article 2 to be the Transmitting Agency or the Receiving Agency, as the case may be, and notified as such by the Federal Government in the official Gazette."
        },
        {
          "section_no": "3",
          "section_title": "Publication of information",
          "body": "The Federal Government shall, from time to time, publish in the official Gazette any information received by it from the Secretary-General of the United Nations in pursuance of Article 19."
        },
        {
          "section_no": "4",
          "section_title": "The Convention to have the force of law in Pakistan",
          "body": "(1) Notwithstanding anything to the contrary contained in any other law, the provisions of the Convention set out in Schedule shall have the force of law in Pakistan. (2) The Federal Government may amend the Schedule in conformity with such amendments as may, from time to time, be made in the Convention."
        },
        {
          "section_no": "5",
          "section_title": "Power to make rules",
          "body": "The Federal Government may make rules for carrying out the purposes of this Ordinance."
        }
      ]
    },
    {
      "chapter_title": "The Schedule (See section 4)",
      "sections": [
        {
          "section_no": "Article 1",
          "section_title": "SCOPE OF THE CONVENTION",
          "body": "1. The purpose of this Convention is to facilitate the recovery of maintenance to which person, hereinafter referred to as claimant, who is in the territory of one of the Contracting Parties, claims to be entitled from another person, hereinafter referred to as respondent, who is subject to the jurisdiction of another Contracting Party. This purpose shall be effected through the offices of agencies which will hereinafter be referred to as Transmitting and Receiving Agencies. 2. The remedies provided for in this Convention are in addition to, and not in substitution for, any remedies available under municipal or international law."
        },
        {
          "section_no": "Article 2",
          "section_title": "DESIGNATION OF AGENCIES",
          "body": "1. Each Contracting Party shall, at the time when the instrument of ratification or accession is deposited, designate one or more judicial or administrative authorities which shall act in its territory as Transmitting Agencies. 2. Each Contracting Party shall, at the time when the instrument of ratification or accession is deposited, designate a public or private body which shall act in its territory as Receiving Agency. 3. Each Contracting Party shall promptly communicate to the Secretary-General of the United Nations the designations made under paragraphs 1 and 2 and any changes made in respect thereof. 4. Transmitting and Receiving Agencies may communicate directly with Transmitting and Receiving Agencies of other Contracting Parties."
        },
        {
          "section_no": "Article 3",
          "section_title": "APPLICATION TO TRANSMITTING AGENCY",
          "body": "1. Where a claimant is in the territory of one Contracting Party, hereinafter referred to as the State of the claimant, and the respondent is subject to the jurisdiction of another Contracting Party, hereinafter referred to as the State of the respondent, the claimant may make application to a Transmitting Agency in the State of the claimant for the recovery of maintenance from the respondent. 2. Each Contracting Party shall inform the Secretary-General as to the evidence, normally required under the law of the State of the Receiving Agency for the proof of maintenance claims, of the manner in which such evidence should be submitted and of other requirements to be compiled with under such law. 3. The application shall be accompanied by all relevant documents, including, where necessary, a power of attorney authorizing the Receiving Agency to act, or to appoint some other person to act, on behalf of the claimant. It shall also be accompanied by a photograph of the claimant and, where available, a photograph of the respondent. 4. The Transmitting Agency shall take all reasonable steps to ensure that the requirements of the law of the State of the Receiving Agency are complied with; and, subject to the requirements of such law, the application shall include: (a) the full name, address, date of birth, nationality, and occupation of the claimant, and the name and address of any legal representative of the claimant; (b) the full name of the respondent, and, so far as known to the claimant, his addresses during the preceding five years, date of birth, nationality, and occupation; (c) particulars of the grounds upon which the claim is based and of the relief sought, and any other relevant information such as the financial and family circumstances of the claimant and the respondent."
        },
        {
          "section_no": "Article 4",
          "section_title": "TRANSMISSION OF DOCUMENTS",
          "body": "1. The Transmitting Agency shall transmit the documents to the Receiving Agency of the State of the respondent, unless satisfied that the application is not made in good faith. 2. Before transmitting such documents, the Transmitting Agency shall satisfy itself that they are regular as to form, in accordance with the law of the State of the claimant. 3. The Transmitting Agency may express to the Receiving Agency an opinion as to the merits of the case and may recommend that free legal aid and exemption from costs be given to the claimant."
        },
        {
          "section_no": "Article 5",
          "section_title": "TRANSMISSION OF JUDGEMENTS AND OTHER JUDICIAL ACTS",
          "body": "1. The Transmitting Agency shall, at the request of the claimant, transmit, under the provisions of article 4, any order, final or provisional, and any other judicial act, obtained by the claimant for the payment of maintenance in a competent tribunal of any of the Contracting Parties, and, where necessary and possible, the record of the proceedings in which such order was made. 2. The orders and judicial acts referred to in the preceding paragraph may be transmitted in substitution for or in addition to the documents mentioned in article 3. 3. Proceedings under article 6 may include, in accordance with the law of the State of the respondent, exequatur or registration proceedings or an action based upon the act transmitted under paragraph 1."
        },
        {
          "section_no": "Article 6",
          "section_title": "FUNCTIONS OF THE RECEIVING AGENCY",
          "body": "1. The Receiving Agency shall, subject always to the authority given by the claimant, take, on behalf of the claimant, all appropriate steps for the recovery of maintenance, including the settlement of the claim and, where necessary, the Institution and prosecution of an action for maintenance and the execution of any order or other judicial act for the payment of maintenance. 2. The Receiving Agency shall keep the Transmitting Agency currently informed. If it is unable to act, it shall inform the Transmitting Agency of its reasons and return the documents. 3. Notwithstanding anything in this Convention, the law applicable in the determination of all questions arising in any such action proceedings shall be the law of the State of the respondent, including its private international law."
        },
        {
          "section_no": "Article 7",
          "section_title": "LETTERS OF REQUEST",
          "body": "If provisions is made for letters of request in the laws for the two Contracting Parties concerned, the following rules shall apply: (a) A tribunal hearing an action for maintenance may address letters of request for further evidence, documentary or otherwise, either to the competent tribunal of the other Contracting Party or to any other authority or institution designated by the other Contracting Party in whose territory the request is to be executed. (b) In order that the parties may attend or be represented, the requested authority shall give notice of the date on which and the place at which the proceedings requested are to take place to the Receiving Agency and the Transmitting Agency concerned, and to the respondent. (c) Letters of request shall be executed with all convenient speed; in the event of such letters of request not being executed within four months from the receipt of the letters by the requested authority, the reasons for such non-execution or for such delay shall be communicated to the requesting authority. (d) The execution of letters of request shall not give rise to reimbursement of fees or costs of any kind whatsoever. (e) Execution of letters of request may only be refused: (1) If the authenticity of the letters is not established; (2) If the Contracting Party in whose territory the letters are to be executed deems that its sovereignty or safety would be compromised thereby."
        },
        {
          "section_no": "Article 8",
          "section_title": "VARIATION OF ORDERS",
          "body": "The provisions of this Convention apply also to applications for the variation of maintenance orders."
        },
        {
          "section_no": "Article 9",
          "section_title": "EXEMPTIONS AND FACILITIES",
          "body": "1. In proceedings under this Convention, claimants shall be accorded equal treatment and the same exemptions in the payment of costs and charges as are given to residents or national of the State where the proceedings are pending. 2. Claimants shall not be required, because of their status as aliens or non-residents, to furnish any bond or make any payment or deposit as security for costs or otherwise. 3. Transmitting and Receiving Agencies shall not charge any fees in respect of services rendered under this Convention."
        },
        {
          "section_no": "Article 10",
          "section_title": "TRANSFER OF FUNDS",
          "body": "A Contracting Party, under whose law the transfer of funds abroad is restricted, shall accord the highest priority to the transfer of funds payable as maintenance or to cover expenses in respect of proceedings under this Convention."
        },
        {
          "section_no": "Article 11",
          "section_title": "FEDERAL STATE CLAUSE",
          "body": "In the case of a Federal or non-unitary State, the following provisions shall apply:"
        }
      ]
    }
  ],
  "source_file": "administratorce8e5467178e4ff59ec8ba8d8b92f939.txt"
}