{
  "law_name": "THE PAKISTAN HOTELS AND RESTAURANTS ACT",
  "year": 1976,
  "chapters": [
    {
      "chapter_title": "Contents",
      "sections": [
        {
          "section_no": "1",
          "section_title": "Short title, extent, application and commencement",
          "body": "(1) This Act may be called the Pakistan Hotels and Restaurants Act, 1976. (2) It extends to the whole of Pakistan. (3) It shall apply to all the hotels and restaurants in Pakistan. (4) It shall come into force at once."
        },
        {
          "section_no": "2",
          "section_title": "Definitions",
          "body": "In this Act, unless there is anything repugnant in the subject or context, (a) 'apprentice' means any person who has contracted with a hotel or a restaurant to perform the stipulated apprenticeship in such hotel or restaurant; (b) 'Committee' means the committee set up by the Federal Government under section 4; (c) 'Controller' means a Controller appointed under section 3 and includes a Deputy Controller and an Assistant Controller and such other person as may be authorised by the Federal Government by notification in the official Gazette to perform all or any of the functions of the Controller; (d) 'customer' means a person availing facilities offered in a restaurant on monetary consideration; (e) 'fair rates' means the rates fixed under section 10 and includes revised rates; (f) 'guest' means a person who is in possession or enjoyment of accommodation provided to him in a hotel on monetary consideration; (g) 'hotel' means a lodging, or boarding and lodging, establishment with a minimum of ten lettable bed rooms, provided for tourists on monetary consideration, which conforms to any of the prescribed minimum criteria, but does not include (i) a home or hostel which is exclusively or mainly used for the aged or invalid persons or students and is run by or under the control of a charitable or educational institution; or (ii) any rest house, hostel or circuit house exclusively meant for visiting Government officials or officials of other organisations, though run on a commercial basis; (h) 'manager' means the person in charge of the management of a hotel or a restaurant; (i) 'owner' means the person who holds title to a hotel or restaurant and is entitled to receive the whole or any part of the earnings received from a guest or customer on account of accommodation or services provided in the hotel or restaurant, and includes a keeper or assignee for the time being discharging the responsibility of the owner in respect of such hotel or restaurant; (j) 'prescribed' means prescribed by rules made under this Act; (k) 'public rooms' means rooms in a hotel which are meant for the common use of all guests; (l) 'restaurant' means a public eating house providing standard and variety of cuisines on monetary consideration to tourists which conforms to the minimum prescribed criteria; (m) 'service' means any service provided in a hotel or a restaurant; and (n) 'tourist' means a person, whether a citizen of Pakistan or not, who stays over-night or more as a guest in a hotel at a place other than his normal place of residence."
        },
        {
          "section_no": "3",
          "section_title": "Appointment of Controller, Deputy Controllers and Assistant Controllers",
          "body": "(1) The Federal Government may, by notification in the official Gazette, appoint a person to be the Controller for the purposes of this Act and such number of Deputy Controllers and Assistant Controllers as may be necessary for the performance and discharge of such functions and duties as may be assigned to them by or under this Act and may, by general or special order provide for the distribution or allocation of work to be performed by them. (2) Subject to the provisions of this Act, the Controller shall perform his functions and discharge his duties under the general supervision and control of the Federal Government. (3) Subject to the provisions of this Act and of such orders as may from time to time be made by the Federal Government in this behalf, the Deputy Controllers and Assistant Controllers shall perform their functions and discharge their duties under the general supervision and control of the Controller."
        },
        {
          "section_no": "4",
          "section_title": "Setting up of Advisory Committee",
          "body": "As soon as may be after the commencement of this Act, the Federal Government may set up a Hotels and Restaurants Committee, consisting of as many members as the Federal Government may determine, to aid and advise the Federal Government in relation to such matters relating to the administration of this Act as may be prescribed."
        },
        {
          "section_no": "5",
          "section_title": "Registration of hotels and restaurants",
          "body": "(1) The owner of every hotel and restaurant shall, within a period of two months from the commencement of this Act, or from the opening of the hotel or restaurant, or from the date on which this Act becomes applicable to such hotel or restaurant, whichever is later, apply to the Controller for registration of his hotel or restaurant and for determination of fair rates in relation thereto and, in the case of a hotel, also for its classification, on payment of such fee as may be prescribed. (2) No hotel or restaurant shall be registered, unless (a) it conforms to the prescribed standard of health, hygiene and comfort, provided that the Controller may allow provisional registration subject to such conditions as he may deem fit and, for good and sufficient reasons, modify, alter or withdraw any such condition at any time; (b) it furnishes at its expense certificates of medical fitness from a Medical Officer of the civil hospital of the area in respect of its staff in such form as may be prescribed; (c) its building is structurally safe and adequately protected against fire or an accident arising out of electricity or gas and safety of the tourists is ensured. (3) The Controller, or an officer authorised by him in this behalf, or a member of the committee may, at any time, inspect the premises of a hotel or restaurant, call for any information, plan or data in respect of any matter concerning such hotel or restaurant or, at the cost of the owner, carry out, or require the owner to carry out, test of any articles or appliances or foodstuff."
        },
        {
          "section_no": "6",
          "section_title": "Classification of hotels",
          "body": "Subject to such general or particular directions as the Federal Government may issue, the Controller shall, according to the prescribed minimum criteria, by notification in the official Gazette, classify hotels, according to the star classification system, as (a) one star hotels, being hotels which conform to the prescribed minimum criteria of hotels of that class, but do not conform to the prescribed minimum criteria of a higher star class hotel; (b) two star hotels, being hotels which conform to the prescribed minimum criteria of hotels of that class, but do not conform to the prescribed minimum criteria of a higher star class hotel; (c) three star hotels, being hotels which conform to the prescribed minimum criteria of hotels of that class, but do not conform to the prescribed minimum criteria of a higher star class hotels; (d) four star hotels, being hotels which conform to the prescribed minimum criteria of hotels of that class, but do not conform to the prescribed minimum criteria of a higher star class hotel; and (e) five star hotels, being hotels which conform to the prescribed minimum criteria of hotels of that class."
        },
        {
          "section_no": "7",
          "section_title": "Issue of licence",
          "body": "(1) Every owner shall, after registration of his hotel or restaurant under section 5, obtain a licence from the Controller on payment of such fee as may be prescribed. (2) No owner shall carry on his business or, in the case of a hotel, use the classification star sign, without first getting the hotel or restaurant registered and obtaining a licence under this Act. (3) A licence granted under this section shall, unless sooner suspended or cancelled, remain in force for a period of one year from the date of issue and may thereafter be renewed for a period of one year at a time on payment of the prescribed fee: Provided that if an application for renewal of a licence is made before the expiry of the period of its validity, the licence shall continue in force until orders are passed on such application."
        },
        {
          "section_no": "8",
          "section_title": "Refusal and cancellation of registration and license",
          "body": "(1) The Controller may refuse to register a hotel or restaurant if it does not conform to the minimum prescribed criteria. (2) The registration and licence of a hotel or restaurant may be cancelled or suspended, or the star classification of a hotel may be lowered, if (a) its owner is declared insolvent by a competent court; (b) its business is wholly or partly discontinued or suspended without the approval of the Controller, except where such suspension or discontinuance is for the purposes of making repairs, improvements, renovations or expansion or, in the case of seasonal business, is for the period of the slack season, and the fact of such suspension or discontinuance in each case has been duly reported to the Controller in advance; (c) its owner or any person acting on his behalf contravenes any of the provisions of this Act or the rules or orders made thereunder; (d) it ceases to conform to the requirements of registration under section 5 or, in the case of a hotel, to the prescribed minimum criteria for the class assigned to it; or (e) its owner fails to enter the names and other particulars of guests in the prescribed register."
        },
        {
          "section_no": "9",
          "section_title": "Obligation of the transferee, etc., of a hotel and restaurant",
          "body": "Where a hotel or restaurant registered and licensed under this Act is transferred or assigned to, or devolves upon, any person, it shall be incumbent upon that person to report, within one month of its taking effect, to the Controller the fact of such transfer, assignment or devolution and obtain a fresh licence under this Act."
        },
        {
          "section_no": "10",
          "section_title": "Controller to fix fair rates",
          "body": "(1) The Controller may fix fair rates to be charged for board, lodging and other service provided in a hotel at such amount as, having regard to the prescribed principles governing fair rates and the classification of hotels, he deems just."
        }
      ]
    }
  ],
  "source_file": "administrator7e8503f55fcb6200206e3b84213fad48.txt"
}