{
  "law_name": "THE ISLAMABAD CLUB (ADMINISTRATION) ORDINANCE",
  "year": 1978,
  "chapters": [
    {
      "chapter_title": "Contents",
      "sections": [
        {
          "section_no": "1",
          "section_title": "Short title and commencement",
          "body": "(1) This Ordinance may be called the Islamabad Club (Administration) Ordinance, 1978. (2) It shall come into force on such day as the Federal Government may, by notification in the official Gazette, appoint."
        },
        {
          "section_no": "2",
          "section_title": "Definitions",
          "body": "In this Ordinance, unless there is anything repugnant in the subject or context,- (a) “Administrator” means the Administrator appointed under section 5; (b) “Company” means the company registered under the Companies Act, 1913 (VII of 1913), under the name of the Islamabad Club; (c) “Islamabad Club” means the club set up by the company and generally known by that name; and (d) “Managing Committee” means the Managing Committee set up under section 5."
        },
        {
          "section_no": "3",
          "section_title": "Ordinance to override other laws",
          "body": "This Ordinance shall have effect notwithstanding anything contained in the Companies Act, 1913 (VII of 1913), or any other law for the time being in force."
        },
        {
          "section_no": "4",
          "section_title": "Dissolution of Company etc.",
          "body": "(a) the Company shall stand dissolved; (b) any person exercising or having the right to exercise immediately before such commencement any power or function in relation to the Islamabad Club shall cease to exercise or to have the right to exercise such power or function; (c) the administration of the affairs of the Islamabad Club shall vest in the Administrator; (d) all assets, rights, powers, authorities and privileges, all property, movable and immovable, cash and bank balances, reserve funds, investments and all other interests and rights in, or arising out of, such property, of the Company shall stand transferred to, and vest in, the Administrator; (e) all debts and liabilities incurred, all obligations undertaken, all contracts entered into, and all agreements made by or with the Company, shall stand transferred to, and be deemed to have been incurred, undertaken, entered into or made, by or with, the Administrator; (f) any sum payable to, or recoverable by, the Company shall be deemed to be payable to, or recoverable by, the Administrator; and (g) all suits and other legal proceedings instituted by or against the Company before such commencement shall be deemed to have been instituted by or against the Administrator and may be continued or proceeded with accordingly."
        },
        {
          "section_no": "5",
          "section_title": "Patron",
          "body": "The President of Pakistan shall be the Patron of the Islamabad Club."
        },
        {
          "section_no": "6",
          "section_title": "Administrator",
          "body": "(1) The Federal Government shall appoint an officer of Government drawing pay in a grade not lower than grade 21 in the National Pay Scales to be the Administrator of the Islamabad Club in addition to his duties as such officer. (2) Unless the Federal Government otherwise directs, the Administrator shall hold office for a period of two years and shall be eligible for reappointment. (3) The Administrator may, by writing under his hand addressed to the Federal Government, resign his office. (4) The Administrator shall, subject to any direction issued by the Federal Government, be competent to exercise and perform all such powers and functions as may be necessary for the efficient administration of the affairs of the Islamabad Club."
        },
        {
          "section_no": "6A",
          "section_title": "Managing Committee",
          "body": "(1) To aid and advise the Administrator in the performance of his functions, the Federal Government shall constitute a Managing Committee consisting of- (a) five members, being Service Members of the Islamabad Club, to be nominated by the Federal Government; (b) three members, being members of the Islamabad Club other than Service Members, to be nominated by the Federal Government; and (c) one member, being a member of the diplomatic corps in Islamabad, to be nominated by the doyen of that corps. (2) Unless the Federal Government otherwise directs in the case of a member referred to in clause (a) or clause (b) of sub-section (1), a member of the Managing Committee shall hold office for a period of two years and shall be eligible for re-nomination. (3) A member of the Managing Committee may, by writing under his hand addressed to the Federal Government, resign his office."
        },
        {
          "section_no": "7",
          "section_title": "Continuance in service employees",
          "body": "Unless the Administrator otherwise directs in any particular case, all the employees of the Company in employment immediately before the commencement of the Ordinance shall continue in their respective employments on the same terms and conditions as were applicable to them immediately before such commencement."
        },
        {
          "section_no": "8",
          "section_title": "Bar of jurisdiction",
          "body": "No court shall grant any injunction or make any order or entertain any proceedings in relation to anything in good faith done or intended to be done under this Ordinance."
        },
        {
          "section_no": "9",
          "section_title": "Indemnity",
          "body": "No suit or other legal proceeding shall lie against the Federal Government or the Administrator or any other person in respect of anything in good faith done or intended to be done under this Ordinance."
        },
        {
          "section_no": "10",
          "section_title": "Power to make rules",
          "body": "The Federal Government may make rules for carrying out the purposes of this Ordinance."
        },
        {
          "section_no": "11",
          "section_title": "Removal of difficulties",
          "body": "If any difficulty arises in giving effect to any provision of this Ordinance, the Federal Government may make such order, not inconsistent with the provisions of this Ordinance, as may appear to it to be necessary for the purpose of removing the difficulty."
        }
      ]
    }
  ],
  "source_file": "administrator8c9829cb13f1a7b73c993d248fc3ab61.txt"
}