{
  "law_name": "THE PAKISTAN MADRASAH EDUCATION (ESTABLISHMENT AND AFFILIATION OF MODEL DINI MADARIS) BOARD ORDINANCE",
  "year": 2001,
  "chapters": [
    {
      "chapter_title": "Contents",
      "sections": [
        {
          "section_no": "1",
          "section_title": "Short title, extent and commencement",
          "body": "(1) This Ordinance, may be called the Pakistan Madrasah Education (Establishment and Affiliation of Model Dini Madaris) Board Ordinance, 2001. (2) It extends to the whole Pakistan. (3) It shall come into force on such date as the Federal Government may, by notification in the official Gazette, specify in this behalf and different dates may be so specified for different areas."
        },
        {
          "section_no": "2",
          "section_title": "Definitions",
          "body": "In this Ordinance, unless there is anything repugnant in the subject or context, various definitions are provided for terms such as 'Academic council', 'affiliated dini madaris', 'Board', 'Controlling Authority', 'Dini Madaris', 'Federal Government', 'general education system', 'member', 'Model Madrassah or Model Darul-Uloom', 'Nazim or Sadr', 'prescribed', 'qualifications', 'regulations', 'rules', 'students', and 'syllabii'."
        },
        {
          "section_no": "3",
          "section_title": "Establishment of the Board",
          "body": "(1) As soon as may be after the commencement of this Ordinance, the Federal Government shall, by notification in the official Gazette, establish a Board to be known as the Pakistan Madrassah Education Board. (2) The Board shall be a body corporate having perpetual succession and a common seal with power, subject to the provisions of this Ordinance, to acquire, hold and dispose of property both moveable and immovable, and may, by the said name, sue and be sued. (3) The headquarters of the Board shall be at Islamabad. (4) The Board may establish its regional offices as and where it considers necessary."
        },
        {
          "section_no": "4",
          "section_title": "Composition of the Board",
          "body": "(1) The Board shall consist of the following members, to be appointed by the Federal Government: (i) An educationist of eminence Chairman (ii) Sadr or nazim of a wafaq or tanzim or rabitah to be appointed by the Federal Government in consultation with the Chairman. Vice/Chairman (iii) an educationist having experience in administrative matters. Secretary (iv) Secretary, Ministry of Education or his nominee not below the rank of a Joint Secretary. Member (v) Secretary, Ministry of Religious Affairs or his nominee not below the rank of a Joint Secretary. Member (vi) Secretary, Ministry of Science and Technology or his nominee not below the rank of a Joint Secretary. Member (vii) Chairman, University Grants Commission or a Member nominated by him. Member (viii) two Ulema who are or have been members of the Council of Islamic Ideology to be nominated by the Chairman. Members (ix) Director General, Dawa Academy, International Islamic University. (x) one Professor who is also a head of the Department of Islamic Studies in a University. (xi) Provincial Education Secretaries of all the four Provinces. Members (xii) one President or Nazim of Wifaqs Members (xiii) one President or Nazim of Tanzim Member (xiv) one President or Nazim of Rabita Member (xv) Chairman, Inter-Board Co-ordination Committee (IBCC) Member (xvi) two representatives of the Ministry of Science and Technology Members."
        },
        {
          "section_no": "5",
          "section_title": "Powers and functions of the Board",
          "body": "(1) The Board shall have powers to perform such functions and exercise such powers as are necessary or conducive to implement and achieve the purposes of this Ordinance. (2) Subject to the provisions of this Ordinance and with due regard to the autonomy of a Wifaq or Tanzeem or Rabita, the Board shall have the following powers and functions to perform: (a) to establish such model madaris and model darul ulooms in which the Islamic Education is the main component and includes courses and curricula of the general education system as may be prescribed; (b) to regulate and approve conditions for affiliation of such existing madaris as have duly been recommended by the Academic Council; (c) to approve the curricula, courses of study and conditions for holding of examinations in the model dini madaris keeping in view the recommendations of the Academic Council; (d) to organize teachers training programmes for the teachers of the model dini madaris and dar-ul-ulooms in various social sciences and religious courses; (e) to grant affiliation and to lay down the regulations and to approve conditions for affiliation of existing madaris; (f) to suggest ways and means to bridge the existing gulf between the general education system and the madaris by revising and improving the curricula of Madaris and general education programs; (g) to approve the curricula, courses of study and the conditions for holding of examinations in the Dini Madaris on recommendations of the Academic Council; (h) to appoint such officers and staff as it may consider necessary for the performance of its functions and define their duties and lay down conditions of service; (i) to promote co-operation and co-ordination amongst existing Dini Madaris and their organizations; (j) to approve equivalence of degrees, diplomas, sanads or certificates where curricula includes subjects of the general education system; (k) to promote curricular and extra curricula activities in Model Dini Madaris and Model Darul Ulooms; (l) to inspect or arrange for inspection of a Model Dini Madrasah or Model Darul Uloom with a view to improve the performance of such Madrasah or the Darul Uloom; (m) to institute and award scholarships, medals and prizes subject to such conditions as may be prescribed; (n) to assist in the development of libraries of Dini Madaris; (o) to approve the Annual Budget; (p) to advise the Government in matters pertaining to model Dini Madaris; (q) to prescribe minimum conditions for admission of candidates to the examinations conducted by the Board and to print all educational material necessary for improving the standard of education; (r) to regulate and decide all administrative matters including creation and abolition of posts under the Board; (s) to enter into or carry out or cancel any contract to administer, invest buy or sell any moveable or immoveable property and assets; (t) to spend or incur expenditure as may be necessary for carrying out purposes of this Ordinance; (u) the Board may delegate any of its functions and powers to any member or officer of the Board or a committee or a sub-committee appointed by it (v) to hear complaints, conduct enquiries and inspections and direct or recommend measures for the improvement of any dini madaris established by or affiliated to the Board; and (w) to exercise inter alia all powers as given in this Ordinance and to perform all other acts necessary for carrying out the purposes of this Ordinance."
        },
        {
          "section_no": "6",
          "section_title": "Visitation",
          "body": "The Board may cause an inspection or inquiry to be made in respect of any matter connected with the affairs of a Model Dini Madarsah or a Model Darul Uloom and shall from time to time appoint such persons as it may deem fit for the purposes of carrying out such inspection or inquiry and to submit its report to the Board."
        },
        {
          "section_no": "7",
          "section_title": "Meetings of the Board",
          "body": "(1) The meetings of the Board shall be called by the Chairman on such date, time and place as he may decide: Provided that not more than six months shall intervene between the two meetings of the Board and at least eight days written notice sent by registered post or courier shall be given to the members specifying the agenda, date, time and place of the meeting. (2) The Chairman or, in his absence the Vice-Chairman, shall preside over the meetings of the Board. (3) One half of the total members of the Board shall constitute a quorum for the meeting of the Board."
        }
      ]
    }
  ],
  "source_file": "administrator6e52f905186798fc3b84a947447d222e.txt"
}