{
  "error": "Expecting value: line 1 column 1 (char 0)",
  "raw": "THE PAKISTAN INSTITUTE OF ENGINEERING AND APPLIED SCIENCES ORDINANCE, 2000 CONTENTS 1. Short title and commencement 2. Definition 3. Establishment of the Institute 4. Powers of the Institute 5. Officers of the Institute 6. Chancellor 7. Rector 8. Pro-Rector 9. Board of Governors 10. Powers and functions of the Board 11. Meetings of the Boards 12. Delegation of Powers 13. Committees 14. Academic and Administrative employees 15. Fund of the Institute 16. Audit and accounts 17. Declaration of fidelity and secrecy 18. Institute open to all classes, creeds etc. 19. Discoveries and inventions to vest in the Institute 20. Budget 21. Indemnity 22. Transfer of assets and liabilities etc. 23. Removal of difficulties etc. 24. Power to make rules THE PAKISTAN INSTITUTE OF ENGINEERING AND APPLIED SCIENCES ORDINANCE, 2000 ORDINANCE No. X of 2000 [22nd March, 2000] An Ordinance to confer on the Pakistan Institute of Engineering and Applied Sciences, Islamabad, the power to award degrees WHEREAS it is expedient to confer on the Pakistan Institute of Engineering and Applied Sciences, Islamabad, the power to award degrees and to provide for matters connected there with or ancillary thereto; AND WHEREAS the National Assembly and the Senate stand suspended in pursuance of the Proclamation of Emergency of the Fourteenth day of October, 1999, and the Provisional Constitution Order No. 1 as amended; AND WHEREAS the President is satisfied that circumstances exist which render it necessary to take immediate action; NOW, THEREFORE, in pursuance of Proclamation of the fourteenth day of October, 1999, and Provisional Constitution Order No. 1 of 1999, as amended, as well as Order No. 9 of 1999, and in exercise of all powers enabling him in that behalf, the President of the Islamic Republic of Pakistan is pleased to make and promulgate the following Ordinance:― 1. Short title and commencement: (1) This Ordinance may be called the Pakistan Institute of Engineering and Applied Sciences Ordinance, ",
  "source_file": "administrator5041ac28656c3fb28458b9dea67d7702.txt",
  "law_name": "The Pakistan Institute of Engineering and Applied Sciences Ordinance, 2000",
  "year": 2000
}