{
  "law_name": "THE DECORATIONS ACT",
  "year": 1975,
  "chapters": [
    {
      "chapter_title": "Contents",
      "sections": [
        {
          "section_no": "1",
          "section_title": "Short title and commencement",
          "body": "(1) This Act may be called the Decorations Act, 1975. (2) It shall come into force at once and shall be deemed to have taken effect on the fourteenth day of August, 1973."
        },
        {
          "section_no": "2",
          "section_title": "Definitions",
          "body": "In this Act, unless there is anything repugnant in the subject or context, (a) \"academic distinction\" includes (i) research, achievement or performance in medicine, science, engineering, technology, philosophy, history, literature or the arts; (ii) invention of national importance; (b) \"decorations\" means any Title, Honour, Award, Order, Medal, Bar, Clasp or Commendation instituted or created under section 3, and includes the decorations enumerated in the Schedule; (c) \"gallantry\" includes an act of bravery, heroism, courage and rendering of dedicated services with selfless devotion in human rights and public service; (d) \"meritorious service in the Armed Forces\" means service rendered by the members of the Armed Forces in Peace or War or Emergency or in relation to any national historic occasion which is worthy of decoration."
        },
        {
          "section_no": "3",
          "section_title": "Institution or creation of decorations",
          "body": "(1) The President may, by warrant, institute, or create, from time to time any decorations in recognition of gallantry, meritorious service in the Armed Forces, academic distinction or distinction in the field of sports or nursing and prescribe the conditions under which a decoration may be awarded, conferred, withdrawn, forfeited or annulled, or may be restored after its withdrawal, forfeiture or annulment. (2) The President may also award decoration posthumously and the monetary reward, if any, attached to the decoration shall be paid to the next of kin of the person to whom the decoration is awarded. (3) No decoration shall be awarded, conferred, withdrawn, forfeited or annulled, and no decoration which has been withdrawn, forfeited or annulled shall be restored, except with the personal approval of the President. (4) Every award, conferment, withdrawal, forfeiture, annulment and restoration of a decoration shall be published in the official Gazette."
        },
        {
          "section_no": "4",
          "section_title": "Continuance of existing decorations and their Warrants of Institution and statutes",
          "body": "(1) All the decorations enumerated in the Schedule and the Warrants of institution and statutes, rules, regulations and instructions pertaining thereto, which were in force immediately before the commencement of this Act, shall continue to be in force until altered, repealed or amended by the President. (2) The President may, by order, amend the Schedule so as to include therein or exclude therefrom any decoration. (3) Notwithstanding anything contained in sub-section (1), the President may, at any time, withdraw, forfeit or annul any decoration awarded to, or conferred on, any person, and upon such withdrawal, forfeiture or annulment of any decoration, the person concerned shall cease to have any right or privilege appertaining thereto; but the President may restore any such decoration after its withdrawal, forfeiture or annulment."
        },
        {
          "section_no": "5",
          "section_title": "Restriction on creation, conferment or acceptance of decorations",
          "body": "(1) Subject to the provisions of this Act, no person or authority in Pakistan shall institute or create, or confer on any person, any Title, Honour, Award, Order, Medal, Bar, Clasp or Commendation of the nature of a decoration or which is an imitation of any decoration. (2) No citizen of Pakistan and no person in the service of Pakistan shall accept any title, honour or decoration from any foreign State or sovereign except with the approval of the Federal Government. (3) No person to whom a decoration has not been awarded or on whom a decoration has not been conferred, and no person whose decoration has been withdrawn, forfeited or annulled, shall use or cause to be used with his name any words or letters representing that the decoration has been awarded to, or conferred on, him."
        },
        {
          "section_no": "6",
          "section_title": "Penalty and procedure",
          "body": "(1) Whoever contravenes the provisions of section 5 shall be punished with fine which may extend to twenty thousand rupees. (2) A person convicted under this section for accepting any decoration from a foreign State or sovereign shall be deemed to have been deprived of such decoration. (3) No prosecution for an offence punishable under this Act shall be instituted except with the previous sanction of the Federal Government. (4) No Court inferior to a Court of Session shall try an offence punishable under this Act."
        },
        {
          "section_no": "7",
          "section_title": "Repeal",
          "body": "Omitted by the Federal Laws (Revision and Declaration) Ordinance, 1981 (XXVII of 1981), s.3 and Sch.,II."
        }
      ]
    }
  ],
  "source_file": "administratorf9c206847eda2ca44c51fb160c99bb31.txt"
}