{
  "law_name": "The Delimitation of Constituencies Act",
  "year": 1974,
  "chapters": [
    {
      "chapter_title": "Contents",
      "sections": [
        {
          "section_no": "1",
          "section_title": "Short title, and commencement.",
          "body": "This Act, may be called the Delimitation of Constituencies Act, 1974. It shall come into force at once."
        },
        {
          "section_no": "2",
          "section_title": "Definitions.",
          "body": "In this Act, unless there is anything repugnant in the subject or context: (a) 'Article' means Article of the constitution of the Islamic Republic of Pakistan; (b) 'Commission' means the Election Commission constituted under Article 218; (ba) 'local government' means a local government established under a Federal or a Provincial law relating to local government; (bb) 'local government law' means a Federal or a Provincial law relating to local government; (bc) 'council' means a local council as defined in the respective Federal or Provincial local government laws; (c) 'population' means the population in accordance with the last preceding census officially published; and (d) all words and expressions used but not defined in this Act shall have the same meaning as in the Constitution."
        },
        {
          "section_no": "3",
          "section_title": "Commission to delimit constituencies.",
          "body": "The Commission shall delimit territorial constituencies for elections to the National Assembly and to each Provincial Assembly in accordance with the provisions of the Constitution and this Act."
        },
        {
          "section_no": "4",
          "section_title": "Procedure of commission.",
          "body": "Subject to the provisions of this section, the Commission shall regulate its own procedure. If, upon any matter requiring the decision of the Commission, there is difference of opinion amongst its members, the opinion of the majority shall prevail."
        },
        {
          "section_no": "5",
          "section_title": "Delegation of powers, etc.",
          "body": "The Commission may authorize three or more of its members, acting together, to exercise and perform all or any of its powers and functions under this Act."
        },
        {
          "section_no": "6",
          "section_title": "Assistance to the commission.",
          "body": "The Commission may require any person or authority to perform such functions or render such assistance for the purposes of this Act as it may direct."
        },
        {
          "section_no": "7",
          "section_title": "Allocation of seats in the National Assembly.",
          "body": "On the basis of population, the seats in the National Assembly for each Province, the Federally Administered Tribal Areas and the Federal Capital are allocated as set out in the table below."
        },
        {
          "section_no": "8",
          "section_title": "Delimitation of constituencies.",
          "body": "For the purposes of election to the National Assembly, the Commission shall divide each Province into as many separate territorial constituencies as the number of general seats allocated to that Province."
        },
        {
          "section_no": "9",
          "section_title": "Principles of delimitation.",
          "body": "All constituencies for general seats shall, as far as practicable, be delimited having regard to the distribution of population in geographically compact areas."
        },
        {
          "section_no": "10",
          "section_title": "Reports of Commission and list of Constituencies.",
          "body": "For the purpose of delimiting constituencies, the Commission may receive and consider representations, hold inquiries, summon witnesses and record evidence."
        },
        {
          "section_no": "10A",
          "section_title": "Power of commission to make amendment, alteration or modification in the final list of constituencies.",
          "body": "Notwithstanding anything contained in this Act, the Commission may, at any time, of its own motion, make such amendments, alterations or modifications in the final list of constituencies published under sub-section (3), or in the areas included in a constituency, as it thinks, necessary."
        },
        {
          "section_no": "10B",
          "section_title": "Removal of difficulties.",
          "body": "If any difficulty arises in giving effect to any of the provisions of this Act the President may make such provision for the removal of the difficulty as he may deem fit."
        },
        {
          "section_no": "11",
          "section_title": "Bar of jurisdiction.",
          "body": "The validity of the delimitation of any constituency, or of any proceedings taken or anything done by or under the authority of the Commission, under this Act shall not be called in question in any court."
        }
      ]
    }
  ],
  "source_file": "administrator7958b24daa9f9348f35af1991d819398.txt"
}