{
  "error": "Expecting value: line 1 column 1 (char 0)",
  "raw": "THE MUSSALMAN WAKF ACT, 1923 CONTENTS PRELIMINARY 1. Short tittle, extent and commencements 2. Definitions STATEMENTS OF PARTICULARS 3. Obligation to furnish particulars relating to wakf 4. Publication of particulars and requisition of further particulars STATEMENT OF ACCOUNTS, AND AUDIT 5. Statement of accounts 6. Audit of accounts GENERAL PROVISIONS 7. Mutwalli entitled to pay cost of audit, etc., from wakf funds 8. Verification. 9. Inspection and copies PENALTY 10. Penalties RULES 11. Power to make rules 12. Savings 13. Exemption THE MUSSALMAN WAKF ACT, 1923 ACT NO. XLII OF 1923 [5th August, 1923] An Act to make provision for the better management of wakf property and for ensuring the keeping and publication of proper accounts in respect of such properties. WHEREAS it is expedient to make provision for the better management of wakf property and for ensuring the keeping and publication of proper accounts in respect of such properties ; It is hereby enacted as follows :- PRELIMINARY 1. Short tittle, extent and commencements. (1) This Act may be called the Mussalman Wakf Act, 1923 ; 1[(2) It extends to the whole of Pakistan.] (3) This section shall come into force at once ; and (4) The 2[Provincial Government] may, by notification in the 2[official Gazette], direct that the remaining provisions of this Act, or any of them which it may specify, shall come into force in the Province, or any specified part thereof on such date as it may appoint in this behalf. 2. Definitions.- In this Act, unless there is anything repugnant in the subject or context. (a) “benefit” does not include any benefit which a mutwalli is entitled to claim solely by reason of his being such mutwalli ; (b) “Court” means the Court of the District Judge or, within the limits of the ordinary original civil jurisdiction of a High Court, such Court, subordinate to the High Court, as the 2[Provincial Government] may, by notification in the 2[official Gazette], designate in this behalf ; (c) “mutwalli” ",
  "source_file": "administratorc10ab0da7e4f71ac662b72b4c05f8d87.txt",
  "law_name": "The Mussalman Wakf Act, 1923",
  "year": 1923
}