{
  "law_name": "THE ISLAMABAD CAPITAL TERRITORY SHOPS, BUSINESS AND INDUSTRIAL ESTABLISHMENTS (SECURITY) ORDINANCE",
  "year": 2000,
  "chapters": [
    {
      "chapter_title": "Contents",
      "sections": [
        {
          "section_no": "1",
          "section_title": "Short title, extent and commencement",
          "body": "(1) This Ordinance may be called the Islamabad Capital Territory Shops, Business and Industrial Establishments (Security) Ordinance, 2000. (2) It extends to the whole of Islamabad Capital Territory. (3) It shall come into force at once."
        },
        {
          "section_no": "2",
          "section_title": "Definitions",
          "body": "In this Ordinance,- (a) “establishment” includes- (i) any bank, money changer or financial institution; and (ii) any office, firm, company, institution, industrial unit, undertaking, shop or premises used for undertaking any business, trade, manufacture, calling, service, employment or occupation; and (b) “Government” means the Federal Government."
        },
        {
          "section_no": "3",
          "section_title": "Security of Establishment",
          "body": "The Government may by order, published in the official Gazette, provide for the regulation and enforcement of measures for the security of the property and persons connected with any establishment."
        },
        {
          "section_no": "4",
          "section_title": "Penalties",
          "body": "If any person contravenes any order made under this Ordinance he shall be punished with imprisonment for a term which may extend to one month or with fine which may extend to fifteen thousand rupees, or with both."
        },
        {
          "section_no": "5",
          "section_title": "Power to make rules",
          "body": "The Government may, by notification in the official Gazette, make rules for carrying out the purposes of this Ordinance."
        }
      ]
    }
  ],
  "source_file": "administratorfc99040b8c95fa97c584d07cfbdccbdf.txt"
}