{
  "law_name": "THE NATIONAL COMMISSION FOR HUMAN DEVELOPMENT ORDINANCE",
  "year": 2002,
  "chapters": [
    {
      "chapter_title": "PRELIMINARY",
      "sections": [
        {
          "section_no": "1",
          "section_title": "Short title, extent and commencement",
          "body": "(1) This Ordinance may be called the National Commission for Human Development Ordinance, 2002. (2) It extends to the whole of Pakistan. (3) It shall come into force at once."
        },
        {
          "section_no": "2",
          "section_title": "Definitions",
          "body": "In this Ordinance, unless there is anything repugnant in the subject or context, (a) “Chairman” means the Chairman of the Commission; (b) “Commission” means the National Commission for Human Development establishment under section 3; (c) “Director-General” means the principal staff officer and in-charge of general Administration of the Commission; (d) “Fund” means the Pakistan Human Development Fund registered under the companies Ordinance 1984 (XLVII of 1984); (e) “Member” means a member of the Commission; (f) “Prescribed” means prescribed by rules made under this Ordinance; (g) “President” means President of the Islamic Republic of Pakistan; (h) “Regulations” means the regulations made under this Ordinance; (i) “Rules” means the rules made under this Ordinance; and (j) “staff' means the members of staff of the Commission and includes persons on deputation or employed on contract."
        }
      ]
    },
    {
      "chapter_title": "NATIONAL COMMISSION FOR HUMAN DEVELOPMENT",
      "sections": [
        {
          "section_no": "3",
          "section_title": "Establishment of the Commission",
          "body": "(1) There shall be established a National Commission for Human Development for carrying out the purposes of this Ordinance. (2) The Commission shall be a body corporate having perpetual succession and a common seal with powers, subject to the provisions of this Ordinance, to enter into agreements, contracts, acquire and hold property, both moveable and immovable, and to sue and be sued in its name. (3) The President shall be the Patron-in-Chief of the Commission. (4) The Commission shall comprise the Chairman, to be appointed by the President, and five Members, including a representative of Ministry of Finance, to be appointed by the President on the recommendation of the Chairman: Provided that Provincial representation and gender equality will be ensured amongst the Members. (5) The main office of the Commission shall be at Islamabad and the Commission may set-up sub-offices at such place or places as it may deem necessary. (6) The Commission shall be an autonomous body of the Cabinet Division, Government of Pakistan."
        },
        {
          "section_no": "4",
          "section_title": "Chairman of the Commission",
          "body": "(1) The Chairman shall be an eminent professional of known integrity, reputation, competence, and expertise in the social sector. (2) The Chairman shall hold office for a period of five years. (3) The Chairman may resign his office by writing under his hand addressed to the President. (4) The Chairman shall be the Chief Executive Officer of the Commission."
        },
        {
          "section_no": "5",
          "section_title": "Members of the Commission",
          "body": "(1) The Members of the commission shall be professionals of known integrity and experience in the social sector. (2) A Member shall hold office during the pleasure of the President. (3) A Member may resign his office by writing in his hand addressed to the Chairman. (4) The business of the Commission shall be conducted as prescribed."
        },
        {
          "section_no": "6",
          "section_title": "Terms and conditions of office of Chairman and Members",
          "body": "The terms and conditions of the Chairman and Members and their remuneration and privileges shall be such as may be determined by the President."
        },
        {
          "section_no": "7",
          "section_title": "Functions of the Commission",
          "body": "The functions of the Commission shall be to (a) formulate, approve manage, promote, enhance, implement, execute monitor and organize its support programmes and projects for assistance of the line Ministries, Departments and agencies concerned, inter alia, for- (i) capacity building, training, and enhancement of competency of Governmental functionaries and line departments, and non-governmental organizations working in the social sectors, especially under District Governments; (ii) literacy and non-formal basic education programmes supported by skills training programmes for income generating activities; (iii) programmes to assist in universal primary education; (iv) programmes to assist in primary health-care; (v) programmes to assist in alleviation of poverty; (vi) national volunteer programme to assist in the social sectors. (b) undertake research, studies and surveys to assess the needs and requirements of an area for extending scope of its activities and disseminate information in respect thereof; (c) keep informed the Federal Government and respective Provincial Governments and their District Administration of its programme and projects being carried out by it in performance of its functions; (d) global resource mobilization including finances, intellectual expertise and talent to assist in the social sectors; and (e) perform such other functions as may be incidental or ancillary to the execution of its programmes and projects."
        },
        {
          "section_no": "8",
          "section_title": "Policy Guidelines",
          "body": "(1) The Commission may for the implementation and execution of its programmes and projects pursuant to its aims and objectives, issue Policy Guidelines for the Commission. (2) Without prejudice to the generality of the provisions of sub-section (1), the Policy Guidelines shall lay down parameters for:- (a) alleviation of poverty; (b) non-formal basic education and promotion of literacy; (c) primary health care; (d) sustainable livelihood; and (e) capacity building, training, and enhancement of competency of Governmental agencies and non-government organizations working in the social sector, especially under District Governments. (3) The advice of the Advisory Council shall be given due consideration by the Commission."
        },
        {
          "section_no": "9",
          "section_title": "Advisory Council",
          "body": "(1) There shall be an Advisory Council of the Commission consisting of- (a) the Chairman who shall act as its Convener; (b) representatives from civil society, community based organizations and such other persons as are approved by the Commission; (c) one representative each of :- (i) the Ministry of Education, Government of Pakistan; (ii) the Ministry of Health, Government of Pakistan; (iii) the Ministry of Finance, Government of Pakistan; (iv) Ministry of Environment, Local Government and Rural Development Government of Pakistan; (v) the Government of Balochistan, Government of North West Frontier Province, Government of Sindh, and Government of the Punjab; (vi) States and Frontier Regions Division, Government of Pakistan; (vii) the Ministry of Women Development, Social Welfare and Special Education; Government of Pakistan; (viii) Planning Commission; (ix) National Reconstruction Bureau of Pakistan. (2) The functions of the Advisory Council shall be- (a) to render assistance and advice in improvement of the Policy Guidelines of the Commission; and (b) to make recommendations for augmenting financial resources of the Commission. (3) The Advisory Council shall meet at least once in every quarter and may hold its meetings as and when necessary. (4) The Advisory Council may invite any technical expert or person possessing specialized knowledge on related subjects for assistance in performance of its functions. (5) The Advisory Council shall make rules of procedure and conduct of its business."
        },
        {
          "section_no": "10",
          "section_title": "Director General",
          "body": "(1) The Chairman may appoint, as prescribed, a person of known integrity, and experience in the field of administration and management as Director General, who shall be the principal staff officer of the commission. (2) The Director General shall be responsible for- (a) the administration and day to day business of the Commission; (b) the execution of all orders and directions given by the Chairman; (c) the preparation of periodical reports, for submission to the President by the Chairman; (d) coordinate the monitoring of the work for the Commission down to the level of each district and tehsil; and (e) any other duty or assignment given by the Chairman. (3) In addition to the responsibilities specified in sub-section (1) the Chairman may assign any other function or assignment to the Director General. (4) The Director General shall be entitled to such remuneration and privileges as the Commission may determine. (5) The Director General may resign his office in writing addressed to the Chairman."
        },
        {
          "section_no": "11",
          "section_title": "Committees of the Commission",
          "body": "(1) The Commission may, for carrying out its functions, constitute such committees as may be considered appropriate by the Commission. (2) The membership of a Committee and conduct of business thereof shall be such as may be prescribed."
        },
        {
          "section_no": "12",
          "section_title": "Remuneration of officers and staff of the Commission",
          "body": "(1) The Commission shall, by regulations, determine the terms and conditions of, including salaries, allowances and other benefits for officers and staff commensurate with the economic condition of the country and compatible with other such organizations, including private sector. (2) The regulations referred to in sub-section (1) shall include the procedure it inquires and disciplinary action to be taken in result thereof against any employee of the Commission Provided that any person in the service of Pakistan employed in the Commission whether on deputation or on transfer, shall be governed by the service rules and regulations applicable to him before his appointment in the Commission."
        },
        {
          "section_no": "13",
          "section_title": "Employment of advisors, consultants, etc.",
          "body": "(1) Subject to subsection (1) of section 12 and sub-section (2), the Commission may appoint any professional, adviser, consultant, expert or such other person as may be considered necessary for performance of its functions. (2) The appointment of the persons referred to in sub-section (1) shall be made in accordance with the requirements of the Policy Guidelines of the Commission: Provided that the terms and conditions of appointment of such persons, including tenure, shall be determined by the Commission."
        },
        {
          "section_no": "14",
          "section_title": "The Budget of the Commission, etc.",
          "body": "(1) The budget of the Commission shall be met out of the Fund for the implementation and execution of the programmes and projects of the Commission and fulfillment of its objectives. (2) The Director General with the approval of the Chairman shall prepare and submit the annual plan of the budget of the Commission to the Fund."
        }
      ]
    }
  ],
  "source_file": "administrator47c9f207b96177e21ada8ef85bed1e8f.txt"
}