{
  "law_name": "THE PAKISTAN CIVIL AVIATION AUTHORITY ORDINANCE",
  "year": 1982,
  "chapters": [
    {
      "chapter_title": "Contents",
      "sections": [
        {
          "section_no": "1",
          "section_title": "Short title, extent and commencement",
          "body": "(1) This Ordinance may be called the Pakistan Civil Aviation Authority Ordinance, 1982. (2) It extends to the whole of Pakistan. (3) It shall come into force at once."
        },
        {
          "section_no": "2",
          "section_title": "Definitions",
          "body": "In this Ordinance, unless there is anything repugnant in the subject or context, (i) 'aerodrome' means any area of land or water designed, equipped, set apart or commonly used or intended to be used, either wholly or in part, for affording facilities for the landing and departure of aircraft, and includes all buildings, sheds, vessels and other structures and roads thereon or appertaining thereto; (ii) 'airport' means an aerodrome at which facilities have, in the opinion of the Federal Government, been sufficiently developed to be of importance to civil aviation; (iii) 'Authority' means the Civil Aviation Authority established under section 3; (iv) 'Board' means the Board referred to in section 7; (v) 'Chairman' means the Chairman of the Board; (vi) 'Director-General' means the Director-General of the Authority; (vii) 'licence' means the certificate of competency which a licence-holder is required by the law of the country granting the licence to hold connection with his licence; and (viii) 'member' means a member of the Board."
        },
        {
          "section_no": "3",
          "section_title": "Establishment of the Authority",
          "body": "(1) As soon as may be after the commencement of this Ordinance, the Federal Government shall, by notification in the official Gazette, establish an authority to be known as the Civil Aviation Authority for carrying out the purposes of this Ordinance. (2) The Authority shall be a body corporate, having perpetual succession and a common seal with power, subject to the provisions of this Ordinance, to acquire and hold property, both movable and immovable, and shall sue and be sued by the name assigned to it by sub-section (1)."
        },
        {
          "section_no": "4",
          "section_title": "Power of the Federal Government to issue directives",
          "body": "The Federal Government may, as and when it considers necessary, issue directives to the Authority on matters of policy, and such directives shall be binding on the Authority, and if a question arises whether any matter is a matter of policy or not; the decision of the Federal Government shall be final."
        },
        {
          "section_no": "5",
          "section_title": "Powers and functions of the Authority",
          "body": "(1) The Authority shall be responsible for the regulation and control of civil aviation activities in the country. (2) The Authority shall from time to time prepare for the approval of the Federal Government five-year plans for the development of infrastructure for the promotion of safe, efficient, adequate, economical and properly coordinated civil air transport service and control and regulate civil aviation activities in Pakistan. (3) The Authority shall frame schemes in respect of (i) provision of civil airports and aerodromes in the country; (ii) provision of air traffic services to aircraft; (iii) provision of navigational services to aircraft; (iv) provision of communication services at the civil airports and aerodromes in the country; (v) provision of aeronautical and flight inspection services to all aircraft registered in Pakistan; (vi) provision of search and rescue services; (vii) provision of crash, fire and rescue services at all airports and aerodromes to aircraft in need; (viii) management of estates at airports and aerodromes; and (ix) any other matter facilitating the achievement of the objects of this Ordinance."
        },
        {
          "section_no": "6",
          "section_title": "Control of air transport and aviation services",
          "body": "(1) Subject to the provisions of any other law for the time being in force, the Authority shall have control over (i) all the civil airports and aerodromes in the country including their planning, construction, operation and maintenance; (ii) air routes in Pakistan, in consultation with the Federal Government; (iii) airspace management of civil airports and aerodromes; and (iv) collection of revenues at airports and aerodromes and at various offices of the Authority."
        },
        {
          "section_no": "7",
          "section_title": "Management",
          "body": "(1) The general direction and administration of the Authority and its affairs shall vest in a Board which may exercise all powers, perform all functions and do all acts and things which may be exercised, performed or done by the Authority."
        },
        {
          "section_no": "8",
          "section_title": "Executive Committee",
          "body": "(1) There shall be an Executive Committee of the Authority consisting of the Director-General, who shall be its head, and four other members, of whom three shall be nominated by the Board from amongst the most senior Officers of the Authority, and one to be nominated by the Ministry of Finance and designated as Finance Member."
        },
        {
          "section_no": "9",
          "section_title": "Director-General his duties, functions and powers",
          "body": "The Director-General shall perform such duties and exercise such powers as may be assigned to him by the Authority."
        },
        {
          "section_no": "10",
          "section_title": "Delegation of powers",
          "body": "The Authority may delegate any of its powers to the Director-General or any other officer of the Authority."
        },
        {
          "section_no": "11",
          "section_title": "Transfer of assets and liabilities of the Department of Civil Aviation to the Authority",
          "body": "All assets and liabilities of the Department of Civil Aviation shall stand transferred to the Authority."
        },
        {
          "section_no": "12",
          "section_title": "Recruitment of officers, etc",
          "body": "The Authority shall have the power to recruit officers and staff as may be necessary for the performance of its functions."
        },
        {
          "section_no": "13",
          "section_title": "Members, officers etc, to be public servants",
          "body": "All members, officers and employees of the Authority shall be deemed to be public servants within the meaning of the Pakistan Penal Code."
        },
        {
          "section_no": "14",
          "section_title": "Transfer of civil servants, etc, to the Authority",
          "body": "The Federal Government may transfer any civil servant to the Authority."
        },
        {
          "section_no": "15",
          "section_title": "Budget",
          "body": "The Authority shall prepare its budget for each financial year and submit it to the Federal Government for approval."
        },
        {
          "section_no": "16",
          "section_title": "Civil Aviation Authority Fund",
          "body": "There shall be established a fund to be known as the Civil Aviation Authority Fund."
        },
        {
          "section_no": "17",
          "section_title": "Maintenance of accounts",
          "body": "The Authority shall maintain proper accounts and other relevant records."
        },
        {
          "section_no": "18",
          "section_title": "Audit",
          "body": "The accounts of the Authority shall be audited annually by a qualified auditor."
        },
        {
          "section_no": "19",
          "section_title": "Authority to be deemed to be a local authority",
          "body": "The Authority shall be deemed to be a local authority for the purposes of any law for the time being in force."
        },
        {
          "section_no": "20",
          "section_title": "Liability of the Federal Government to be limited",
          "body": "The liability of the Federal Government in respect of the Authority shall be limited."
        },
        {
          "section_no": "21",
          "section_title": "Submission of yearly reports, returns, etc",
          "body": "The Authority shall submit yearly reports and returns to the Federal Government."
        },
        {
          "section_no": "22",
          "section_title": "Exemption from taxes",
          "body": "The Authority shall be exempt from all taxes and duties."
        },
        {
          "section_no": "23",
          "section_title": "Ordinance XXIII of 1969 not to apply to Authority",
          "body": "The provisions of Ordinance XXIII of 1969 shall not apply to the Authority."
        },
        {
          "section_no": "24",
          "section_title": "Indemnity",
          "body": "No suit or legal proceedings shall lie against the Authority or any member or officer thereof for anything done in good faith."
        },
        {
          "section_no": "25",
          "section_title": "Certain existing arrangements to continue",
          "body": "Any existing arrangements for the management of civil aviation shall continue until modified or revoked."
        },
        {
          "section_no": "26",
          "section_title": "Power of Federal Government to make rules",
          "body": "The Federal Government may make rules for carrying out the purposes of this Ordinance."
        },
        {
          "section_no": "27",
          "section_title": "Power of the Authority to make regulations",
          "body": "The Authority may make regulations for the conduct of its affairs."
        },
        {
          "section_no": "28",
          "section_title": "Winding up of the Authority",
          "body": "The Authority may be wound up in accordance with the provisions of this Ordinance."
        },
        {
          "section_no": "29",
          "section_title": "Removal of difficulties",
          "body": "If any difficulty arises in giving effect to the provisions of this Ordinance, the Federal Government may make such provisions as appear to it to be necessary for removing the difficulty."
        }
      ]
    }
  ],
  "source_file": "administratorb22dc23f6d59ddbc5546f72fc5606b85.txt"
}