{
  "law_name": "The Control of Employment Ordinance",
  "year": 1965,
  "chapters": [
    {
      "chapter_title": "Contents",
      "sections": [
        {
          "section_no": "1",
          "section_title": "Short title, extent, application and commencement",
          "body": "This Ordinance may be called the Control of Employment Ordinance, 1965. It extends to the whole of Pakistan, and also applies to all citizens of Pakistan, and vehicles, vessels and aircraft registered in or chartered for Pakistan wherever they may be. It shall come into force at once and shall be deemed to have taken effect on the eighth day of September, 1965."
        },
        {
          "section_no": "2",
          "section_title": "Definitions",
          "body": "In this Ordinance, unless there is anything repugnant in the subject or context, 'Board' means a Manpower Board constituted under section 4; 'essential personnel' has the same meaning as assigned to it in clause (a) of section 2 of the Essential Personnel (Registration) Ordinance, 1948 (X of 1948), as amended from time to time; 'essential' work means any work relating to the manufacture, production, maintenance or repair of arms, ammunition and equipment or other supplies and any other work which the Federal Government or the Provincial Government may, by notification in the official Gazette, declare to be essential work for the purposes of this Ordinance; 'industrial undertaking' means any concern engaged in the manufacture or production of any article or commodity, the supply or distribution of light, power, gas or water, the supply or maintenance of any kind of mechanised transport, any concern engaged in installing equipment or erecting premises or preparing and producing designs for, or testing the products of, any concern referred to in sub‑clause (a), any technical training establishment or centre, and any other undertaking which the Federal Government or the Provincial Government may, by notification in the official Gazette, declare to be an industrial undertaking for the purposes of this Ordinance; 'Manpower Council' means the National Manpower Council set up by the Federal Government in the Labour and Social Welfare Division; 'prescribed' means prescribed by rules made under this Ordinance; and 'Tribunal' means a Manpower Tribunal constituted under section 9."
        },
        {
          "section_no": "3",
          "section_title": "Manpower Council",
          "body": "The Federal Government shall be the policy‑making body as regards the purposes of this Ordinance and be responsible for co-ordinating manpower problems with the object of bringing a national approach to the labour‑supply policy during an emergency and may issue such directions in connection with the effective use of manpower to the Provincial Governments and the Manpower Board as it may consider necessary."
        },
        {
          "section_no": "4",
          "section_title": "Manpower Board",
          "body": "The Provincial Government shall constitute a Manpower Board consisting of the Secretary of the Labour Department of the Provincial Government, who shall be the Chairman of the Board, one member to represent the Industries Department of the Provincial Government, a Deputy Secretary in the Finance Department of the Provincial Government, one member to represent the General Headquarters, one member to represent the Railway Board of the Province, one member to represent the Road Transport Corporation of the Province, the Adviser, Technical Education of the Provincial Government, and the Deputy Secretary (Co‑ordination) in the Home Department of the Provincial Government."
        },
        {
          "section_no": "5",
          "section_title": "Functions and powers of the Board",
          "body": "The functions of the Board shall include collection of information relating to employment in industrial undertakings and availability of persons therefor, and to control and distribution of, and taking measures to make persons available for, such employment."
        },
        {
          "section_no": "6",
          "section_title": "Obligation to comply with the order or direction of the Board, etc.",
          "body": "Where the Board makes any order or gives any direction requiring any person or industrial undertaking to furnish any information or document or to afford any facility or to take any measure or to do or refrain from doing anything, such persons and, in the case of an industrial undertaking, the owner, director, manager, secretary or other officer or agent thereof competent for the purpose, shall subject to the other provisions of this section comply with such order or direction."
        },
        {
          "section_no": "7",
          "section_title": "Reinstatement of person released under the orders of the Board",
          "body": "Every employer by whom a person was released for any essential work or for service under the Compulsory Service in the Armed Forces Ordinance, 1971, in pursuance of an order or requisition of the Board shall, on the termination of, or release from, such work or service, reinstate such person in his former employment from which he was released."
        },
        {
          "section_no": "8",
          "section_title": "Advisory Committee",
          "body": "The Board may constitute an Advisory Committee to assist it in the performance of its functions."
        },
        {
          "section_no": "9",
          "section_title": "Manpower Tribunal",
          "body": "The Provincial Government shall constitute a Manpower Tribunal to hear and decide appeals against the orders or directions of the Board."
        },
        {
          "section_no": "10",
          "section_title": "Wetified industrial undertakings",
          "body": "The Board may declare certain industrial undertakings as 'wetified' for the purposes of this Ordinance."
        },
        {
          "section_no": "11",
          "section_title": "False statements",
          "body": "Any person who makes a false statement or representation in connection with any matter under this Ordinance shall be liable to penalties."
        },
        {
          "section_no": "12",
          "section_title": "Offences by Industrial undertakings",
          "body": "Industrial undertakings committing offences under this Ordinance shall be liable to penalties."
        },
        {
          "section_no": "13",
          "section_title": "Penalty and procedure",
          "body": "The penalties for offences under this Ordinance shall be prescribed by rules made under this Ordinance."
        },
        {
          "section_no": "14",
          "section_title": "Service of notice, etc.",
          "body": "Notices and other documents required to be served under this Ordinance shall be served in the manner prescribed."
        },
        {
          "section_no": "15",
          "section_title": "Indemnity",
          "body": "No suit or legal proceedings shall lie against any person for anything done in good faith under this Ordinance."
        },
        {
          "section_no": "16",
          "section_title": "Power to make rules",
          "body": "The Federal Government may make rules for carrying out the purposes of this Ordinance."
        },
        {
          "section_no": "17",
          "section_title": "Savings",
          "body": "Nothing in this Ordinance shall affect any other law for the time being in force."
        }
      ]
    }
  ],
  "source_file": "administratorbffe013013f133d371bfd6edc4e48396.txt"
}