{
  "error": "Expecting value: line 1 column 1 (char 0)",
  "raw": "s THE ARBITRATION ACT, 1940 CONTENTS 1. Short title, extent and commencement. 2. Definitions. 3. Provisions implied in arbitration agreement. 4. Agreement that arbitrators be appointed by third party. 5. Authority of appointed arbitrator or umpire irrevocable except by leave of Court. 6. Arbitration agreement not to be discharged by death of party thereto. 7. Provisions in case of insolvency. 8. Power of Court to appoint arbitrator or umpire. 9. Power to party to appoint new arbitrator or, in certain cases, a sole arbitrator. 10. Provisions as to appointment of three or more arbitrators. 11. Power to Court to remove arbitrators or umpire in certain circumstances. 12. Power of Court where arbitrator is removed or his authority revoked. 13. Powers of arbitrator. 14. Award to be signed and filed. 15. Power of Court to modify award. 16. Power to remit award. 17. Judgment in terms of award. 18. Power of Court to pass interim orders.  19. Power to supersede arbitration where award becomes void or is set aside. 20. Application to file in Court arbitration agreement. 21. Parties to suit may apply for order of reference. 22. Appointment of arbitrator. 23. Order of reference. 24. Reference to arbitration by some of the parties. 25. Provisions applicable to arbitrations under this Chapter. 26. Application of Chapter. 26-A. Award to set out reasons 27. Power of arbitrators to make an interim award. 28. Power to Court only to enlarge time for making award 29. Interest on awards. 30. Grounds for setting aside award. 31. Jurisdiction. 32. Bar to suit contesting arbitration agreement or award. 33. Arbitration agreement or award to be contested by application. 34. Power to stay legal proceedings where there is an arbitration agreement. 35. Effect of legal proceedings on arbitration. 36. Power of Court, to order that a provision making an award a condition precedent to an action shall not apply to a particular difference. 37. Limitations. 38. Disputes as to arbitrator’s remuneration ",
  "source_file": "administrator0a802e3468735238090ceede22ccfd11.txt",
  "law_name": "The Arbitration Act, 1940",
  "year": 1940
}