{
  "error": "Expecting value: line 1 column 1 (char 0)",
  "raw": "THE REGULATION OF MINES AND OIL-FIELDS AND MINERAL DEVELOPMENT (GOVERNMENT CONTROL) ACT, 1948. CONTENTS 1. Short title, extent and commencement 2. Power to make rules 3. Penalties etc 3 A. Production sharing agreement 3B. Concessions to petroleum exploration companies 4. Effect of rules etc, inconsistent with other enactments 5. Power to exempt 6. Definitions of appropriate Government SCHEDULE. THE REGULATION OF MINES AND OIL-FIELDS AND MINERAL DEVELOPMENT (GOVERNMENT CONTROL) ACT, 1948. 1ACT NO. XXIV OF 1948 [8th January, 1949] An Act to make provision for certain matters connected with the regulation of mines and oil-fields and mineral development. WHEREAS it is expedient to make provision for certain matters connected with the regulation of mines and oil-fields and mineral development under 2[Government Control]; AND WHEREAS it appears to the 3[Federal Government] to be expedient in the public interest to make such provision to the extent hereinafter appearing; it is hereby enacted as follows: 1. Short title, extent and commencement. (1) This Act may be called the Regulation of Mines and Oil-fields and Mineral Development 2[Government Control] Act, 1948. 4[(2) It extends to the whole of Pakistan.] (3) It shall come into force on such date3 as the 3[Federal Government] may, by notification in the official Gazette, appoint in this behalf. 5* * * * * * * 62. Power to make rules. It is hereby declared to be expedient in the public interest that the 7[appropriate Government] shall have power to make rules8 to provide for all or any of the following matters, namely: 1 For Statement of Objects and Reasons, see Gaz. of P., 1948, Pt. V, p. 127. The Act has been applied (i) to Baluchistan, see Gaz. of P., 1949, Pt. I, p. 408; (ii) in the Federated Areas of Baluchistan, see ibid., Ext.,1950, p. 512; (iii) to the excluded areas of West Pakistan, with effect from the 21st March, 1956 see Gazette of West Pakistan, 1956, Ext., p. 239; and (iv) to the Special Areas of West Pakis",
  "source_file": "administrator3c0b4994cddecb135e5abf2b1c626d39.txt",
  "law_name": "The Regulation of Mines and Oil-Fields and Mineral Development (Government Control) Act, 1948",
  "year": 1948
}