{
  "law_name": "THE ASSOCIATED CEMENT (VESTING) ACT",
  "year": 1974,
  "chapters": [
    {
      "chapter_title": "Contents",
      "sections": [
        {
          "section_no": "1",
          "section_title": "Short title and commencement",
          "body": "(1) This Act may be called the Associated Cement (Vesting) Act, 1974. (2) It shall come into force at once."
        },
        {
          "section_no": "2",
          "section_title": "Definitions",
          "body": "In this Act, unless there is anything repugnant in the subject or context, (a) “Associated Cement” means the undertakings known as Associated Cement which immediately before the commencing day vested in the Federal Government, together with all lands, buildings, machinery, appliances, fixtures and funds appertaining thereto; (b) “commencing day” means the day on which this Act comes into force; and (c) “Corporation” means the State Cement Corporation of Pakistan Limited formed and registered under the Companies Act, 1913 (VII of 1913)."
        },
        {
          "section_no": "3",
          "section_title": "Vesting of Associated Cement in Corporation",
          "body": "As from the commencing day, (a) the Associated Cement shall vest in the Corporation and all powers which immediately before that day were exerciseable by the Federal Government in relation to the Associated Cement shall be exerciseable by the Corporation; (b) all rights, properties, assets, liabilities, debts and obligations of the Federal Government relating to the Associated Cement shall be the rights, properties, assets, liabilities, debts and obligations of the Corporation; (c) any contract made, or deemed to have been made, on behalf of the President for the purposes of the Associated Cement shall be deemed to have been made on behalf of the Corporation; (d) all suits and other legal proceedings in relation to the Associated Cement instituted, or deemed to have been instituted, by or against the Federal Government shall be deemed to be suits and proceedings instituted by or against the Corporation and may be proceeded with accordingly; and (e) all orders and instructions issued by the President or the Federal Government before the commencing day in relation to the Associated Cement shall, to the extent they are not inconsistent with the provisions of this Act, be deemed to be orders and instructions issued by the Corporation."
        },
        {
          "section_no": "4",
          "section_title": "Continuance in service of employees, etc.",
          "body": "(1) Every officer and employee employed for the purposes of the Associated Cement shall, on the commencing day, become an officer or employee, as the case may be, of the Corporation and shall hold office therein on such terms and conditions, which are not less favourable than those to which he was entitled immediately before the commencing day, as the Corporation may determine: Provided that an officer or employee of the Corporation shall, unless his services are earlier terminated in accordance with the terms and conditions applicable to him, retire from service on the completion of the fifty-eighth year of his age. (2) Any officer or employee who becomes an officer or employee of the Corporation under sub-section (1) may be transferred- (a) by the Corporation, to any company or project set up by it, or (b) by the Federal Government, to any other corporation, company or industrial unit controlled by it, and shall hold office therein on terms and conditions which are not less favourable than those to which he was entitled immediately before such transfer. (3) Any officer or employee who becomes an officer or employee of the Corporation under sub-section (1), or is transferred under sub-section (2), shall not be entitled to any compensation or to the designation which he was holding immediately before the commencing day or, as the case may be, the date of such transfer, and no claim for such compensation or designation shall be entertained by any court, tribunal or other authority. (4) If any question arises as to whether any person was, immediately before the commencing day, an officer or employee employed for the purposes of the Associated Cement, the question shall be referred to the Federal Government whose decision shall be final."
        },
        {
          "section_no": "5",
          "section_title": "Administration, etc., of the Associated Cement",
          "body": "(1) The Corporation shall, subject to the provisions of this Act, be competent to administer, control, operate, manage, reorganise or dispose of the Associated Cement in such manner as it deems fit. (2) In particular and without prejudice to the generality of the foregoing provision, the Corporation may, with the approval of the Federal Government, transfer the management of the Associated Cement to one or more companies sponsored by the Corporation and registered under the Companies Act, 1913 (VII of 1913)."
        },
        {
          "section_no": "6",
          "section_title": "Provident Fund",
          "body": "(1) Notwithstanding anything contained in the rules relating to the Provident Fund of the Staff of the Associated Cement and the Provident Fund of the Workers of Associated Cement, the accumulated balance standing to the credit of every officer or employee referred to in sub-section (1) of section 4 in either of those Funds immediately before the commencing day shall be paid to the Corporation. (2) An officer or employee referred to in sub-section (1) of section 4 shall be deemed to have become as from the commencing day a member of the Provident Fund established, by the Corporation and, in the records of such Provident Fund, a separate account shall be opened for such officer or employee and be credited with the amount of the accumulated balance standing to the credit of such officer or employee in the Provident Fund of the Staff of the Associated Cement or, as the case may be, the Provident Fund of the Workers of the Associated Cement immediately before the commencing day. (3) Where the services of any officer or employee referred to in sub-section (1) of section 4 are transferred to any other corporation or company, the accumulated balance standing to the credit of every such officer or employee in the Provident Fund of the Corporation immediately before such transfer shall be paid to such other corporation or company and, in the records of the Provident Fund of the corporation or company, a separate account shall be opened for such officer or employee and be credited with the amount of the accumulated balance standing to his credit in the Provident Fund of the Corporation immediately before such transfer."
        },
        {
          "section_no": "7",
          "section_title": "Investment by the Federal Government",
          "body": "(1) The investment made by the Federal Government in the Associated Cement before the commencing day shall be deemed to be the Federal Government's equity in the Corporation: Provided that the loans advanced for the expansion of the factories of the Associated Cement and the interest thereon shall be repayable by the Corporation. (2) The amount of equity referred to in sub-section (1) shall be determined by the Federal Government in consultation with the Corporation."
        },
        {
          "section_no": "8",
          "section_title": "Indemnity",
          "body": "No suit, prosecution or other legal proceeding shall lie against the Federal Government, the Corporation or any other person for anything in good faith done or intended or purported to be done under this Act."
        },
        {
          "section_no": "9",
          "section_title": "Bar of jurisdiction",
          "body": "(1) No court shall call in question, or permit to be called in question any provision of this Act, or of any rule or order made or anything done or any action taken or purporting to be made, done or taken thereunder. (2) No court shall grant any injunction, make any order or entertain any proceedings in relation to anything done or intended or purporting to be done under this Act."
        },
        {
          "section_no": "10",
          "section_title": "Power to make rules",
          "body": "The Federal Government may, by notification in the official Gazette, make such rules as appear to it to be necessary or expedient for carrying out the purposes of this Act."
        },
        {
          "section_no": "11",
          "section_title": "Removal of difficulties",
          "body": "If any difficulty arises in giving effect to any provision of this Act, the Federal Government may make such order or issue such directive, not inconsistent with the provisions of this Act, as may appear to it to be necessary or expedient for the purpose of removing the difficulty: Provided that no such order shall be made after the expiry of one year from the commencing day."
        },
        {
          "section_no": "12",
          "section_title": "[Repeal]",
          "body": "Omitted by the Federal Laws (Revision and Declaration) Ordinance, 1981 (XXVII of 1981),s.3 and Sch.,II."
        }
      ]
    }
  ],
  "source_file": "administrator1c780bc21fc1c4e01e81569e040d0016.txt"
}