{
  "law_name": "THE ASSOCIATED PRESS OF PAKISTAN (TAKING OVER) ORDINANCE",
  "year": 1961,
  "chapters": [
    {
      "chapter_title": "Contents",
      "sections": [
        {
          "section_no": "1",
          "section_title": "Short title and commencement.",
          "body": "(1) This Ordinance may be called the Associated Press of Pakistan (Taking Over) Ordinance, 1961. (2) It shall come into force at once."
        },
        {
          "section_no": "2",
          "section_title": "Definition.",
          "body": "In this Ordinance 'Associated Press' means the company registered on the 28th day of May, 1960, under the Companies Act, 1913 (VII of 1913), under the name of the Associated Press of Pakistan Limited."
        },
        {
          "section_no": "3",
          "section_title": "Power to take over Associated Press.",
          "body": "(1) The Federal Government may, notwithstanding anything contained in any other law for the time being in force, or in any trust or wakf, or in any deed or other instrument, by notification in the official Gazette, take over the entire undertaking of the Associated Press on such date as may be specified in the notification. (2) On the date specified in the notification under sub-section (1), (a) the Associated Press shall stand dissolved for the purposes of the Companies Act, 1913 (VII of 1913); (b) all assets, rights, powers, authorities and privileges, all property, movable and immovable, cash and bank balances, reserve funds, investments and all other interests and rights in, or arising out of, such property, of the Associated Press, shall stand transferred to, and vest in, the Federal Government; (c) all debts and liabilities incurred, all obligations undertaken, all contracts entered into, and all agreements made by or with the Associated Press, shall stand transferred to, and be deemed to have been incurred, undertaken, entered into or made, by or with, the Federal Government; (d) any sum payable to, or recoverable by, the Associated Press shall be deemed to be payable to, or recoverable by, the Federal Government; (e) the members of the Associated Press shall be liable to contribute to the assets thereof for payment of its debts and liabilities to the extent to which they would have been liable had the Associated Press been wound up under the Companies Act, 1913 (VII of 1913); (f) all suits and other legal proceedings instituted by or against the Associated Press before the said date shall be deemed to have been instituted by or against the Federal Government and may be continued or proceeded with accordingly; (g) any reference to the Associated Press in any law other than this Ordinance, or in any rule, regulation, order or notification or in any contract, deed or other document shall, except where the context otherwise requires or the Federal Government otherwise directs, be construed as reference to the Federal Government."
        },
        {
          "section_no": "4",
          "section_title": "Management etc. of the Associated Press after the taking over.",
          "body": "(1) After the Associated Press has been taken over, the Federal Government shall conduct the business and manage and administer the affairs of that undertaking as a separate institution, hereinafter referred to as the 'undertaking'. (2) The Federal Government may appoint a person to take possession of the Associated Press and all its properties, records and documents, and, after taking such possession, to manage and administer, on behalf of the Federal Government the affairs of the undertaking and to exercise such powers and perform such duties in relation thereto as the Federal Government may, from time to time, require him to exercise and perform, and any such appointment may, at any time, be revoked and a fresh appointment made on such conditions and with such limitations as the Federal Government may determine. (3) When taking possession under sub-section (2), it shall be lawful for any police officer to seize any property of the undertaking, or its records or documents, found anywhere in Pakistan, and for any Magistrate, by warrant, to authorize any police officer, not below the rank of Sub-Inspector, to enter upon and search for any such property, record or document in any premises where they may be or where they may reasonably be expected to be found. (4) In conducting the business and managing and administering the affairs of the undertaking due regard shall be had to: (a) the free and efficient flow of information, (b) the stability of the organization, (c) supply of unbiased and reliable news to the newspapers and news agencies in Pakistan and abroad, and (d) expansion and development of news service."
        },
        {
          "section_no": "5",
          "section_title": "Future Management of the undertaking.",
          "body": "After the affairs of the undertaking have been put on a sound footing with respect to its finance, management and the efficiency of its news service, the Federal Government shall make such arrangements for running and managing it on a permanent basis in order to ensure that the undertaking shall provide independent, healthy and efficient news service, as to it might appear proper. To this end the Federal Government may transfer the whole or a part of the undertaking or any interest in it to an individual or an organization or a Board of Trustees set up for this purpose."
        },
        {
          "section_no": "6",
          "section_title": "Recovery of dues.",
          "body": "Any sum payable to or recoverable by the Federal Government under this Ordinance shall be recoverable as arrears of land revenue."
        },
        {
          "section_no": "7",
          "section_title": "Officers and employees of the Associated Press.",
          "body": "(1) The Federal Government may make such arrangements or take such measures with respect to the officers and other employees of the Associated Press as it thinks fit. (2) Until the Federal Government otherwise directs, all the officers and employees of the Associated Press in employment immediately before the taking over under sub-section (1) of section 3, shall continue to be in their respective employments on the same terms and conditions as then in force, and unless the Federal Government otherwise directs, no such officer and employee shall be subject to rules relating to emoluments, allowances, pensions, appointment, dismissal or disciplinary action applicable to Government servants, and subject to any agreement to the contrary, such officers and employees may also be transferred with the transfer of the undertaking under section 5 of the Ordinance."
        },
        {
          "section_no": "8",
          "section_title": "Compensation.",
          "body": "If, after assessment of the assets and liabilities of the Associated Press, the value of the assets exceed the value of the liabilities, the Federal Government shall, to the extent of the excess, pay compensation to the persons who would have been entitled to surplus remaining after payment of the debts and liabilities as if the Associated Press has been wound up under the Companies Act, 1913 (VII of 1973)."
        },
        {
          "section_no": "9",
          "section_title": "Power to make rules.",
          "body": "The Federal Government may make rules for carrying out the purposes of this Ordinance."
        },
        {
          "section_no": "10",
          "section_title": "Immunity.",
          "body": "No suit or other legal proceedings shall be instituted in any court in respect of anything done under this Ordinance."
        }
      ]
    }
  ],
  "source_file": "administrator748fa1413263d08c2323b3bf8eb3b7fe.txt"
}