{
  "error": "Expecting value: line 1 column 1 (char 0)",
  "raw": "THE LAND IMPROVEMENT LOANS ACT, 1883 CONTENTS 1. Short title 2. Acts XXVI of 1871 and XXI of 1876 repealed 3. “Collector” defined 4. Purposes of which loans may be granted under this Act 5. Mode of dealing with applications for loans 6. Period for repayment of loans 7. Recovery of loans 8. Order granting loan conclusive on certain points 9. Liability of joint borrower as among themselves 10. Power to make rules 11. Exemption of improvements from assessment to land-revenue 12. Certain powers of Provincial Government to be exercisable by Board of Revenue or Financial Commissioner THE LAND IMPROVEMENT LOANS ACT, 1883 1ACT NO. XIX OF 1883 [12th October, 1883] An Act to consolidate and amend the law relating to loans of money by the Government for agricultural improvements. WHEREAS it is expedient to consolidate and amend the law relating to loans of money by the Government for agricultural improvements; It is hereby enacted as follows: 1. Short title. -(1) This Act may be called the Land Improvement Loans Act, 1883. (2) Local extent, Commencement. It extends to 2[the whole of Pakistan], but shall not come into force in any 3[part thereof] until such date as the 4[Provincial Government] 5* * * may, by notification in the 6[official Gazette], appoint in this behalf7. 2. Acts XXVI of 1871 and XXI of 1876 repealed. (1) The Land Improvement Act, 1871, and Act XXI of 1876 (An Act to amend the Land Improvement Act, 1871), shall, except as regards the recovery of advances made before this Act comes into force and costs incurred by the Government in respect of such advances, be repealed. (2) When in any Act, Regulation or Notification passed or issued before this Act comes into force, reference is made to either of those Acts, the reference shall, so far as may be practicable, be read as applying to this Act or the corresponding part of this Act. 3. “Collector” defined. In this Act, “Collector” means the Collector of land revenue of a district, or the Deputy Commissioner, or any",
  "source_file": "administrator489c40fa445ba2b3c8bce4092c211e31.txt",
  "law_name": "The Land Improvement Loans Act, 1883",
  "year": 1883
}