{
  "law_name": "THE CANTONMENTS PURE FOOD ACT",
  "year": 1966,
  "chapters": [
    {
      "chapter_title": "PART I PRELIMINARY",
      "sections": [
        {
          "section_no": "1",
          "section_title": "Short title, extent and commencement",
          "body": "(1) This Act may be called the Cantonments Pure Food Act, 1966. (2) It extends to all the cantonments in Pakistan. (3) It shall come into force at once."
        },
        {
          "section_no": "2",
          "section_title": "Definitions",
          "body": "In this Act, unless there is anything repugnant in the subject or context, various definitions related to food and its adulteration are provided."
        }
      ]
    },
    {
      "chapter_title": "PART II GENERAL PROVISIONS",
      "sections": [
        {
          "section_no": "3",
          "section_title": "False warranty",
          "body": "No person shall in respect of any food sold by him or given by him for sale to an agent give to the purchaser or the agent a false warranty in writing."
        },
        {
          "section_no": "4",
          "section_title": "Prohibition of mixing colouring, staining or powdering of food, etc.",
          "body": "(1) No person shall mix, colour, stain or powder or direct or permit any other person to mix, colour, stain or powder any food with any matter or ingredient (a) in contravention of the rules; or (b) so as to render the food injurious to health, with intent that the same may be sold in that state."
        },
        {
          "section_no": "5",
          "section_title": "Prohibition of preparation, manufacture sale, etc, of adulterated and other foods",
          "body": "(1) No person shall, directly, or indirectly, himself or by any other person, prepare, manufacture, keep or store for sale, or sell or offer to sell, (i) any adulterated food; (ii) any misbranded food; (iii) any article of food for the sale of which a licence is required otherwise than in accordance with the conditions of the licence; or (iv) any article of food in contravention of any other provision of this Act or the rules."
        },
        {
          "section_no": "6",
          "section_title": "Manufacture import and sale of unwholesome food",
          "body": "No person shall, directly or indirectly, himself or by any other person, prepare, manufacture, keep or store for sale, or sell or offer to sell any food which is unsound, unwholesome, injurious to health or unfit for human consumption."
        },
        {
          "section_no": "7",
          "section_title": "Manufacture and sale of food not of proper nature or quality",
          "body": "No person shall directly or indirectly, himself or by any other person, prepare, manufacture, keep or store for sale, or sell or offer to sell, any food which is not of the nature, substance or quality which it purports or is represented to be."
        },
        {
          "section_no": "8",
          "section_title": "Pre-packed food",
          "body": "No person shall keep or store for sale, or sell or offer to sell pre-packed food unless he has complied with the rules made in this behalf."
        },
        {
          "section_no": "9",
          "section_title": "Import or manufacture, etc, without complying with rules",
          "body": "No person shall import, export, prepare, manufacture, keep or store for sale, or sell or offer to sell, any food, unless the rules providing for the mode of its manufacture, processing or preparation, packaging, labelling, consignment, delivery, standard of quality or fill of containers have been complied with."
        },
        {
          "section_no": "10",
          "section_title": "Sale of banaspati margarine and charbi",
          "body": "No person shall sell or offer to sell banaspati, margarine or charbi loose or from an open package: Provided that banaspati may be so sold or offered for sale under a licence and subject to such conditions as may be prescribed in this behalf."
        },
        {
          "section_no": "11",
          "section_title": "Licence for manufacture storage and sale of goods",
          "body": "(1) Except under a licence to be granted in such manner as may be prescribed no place shall be used (a) for the preparation, or the manufacturing, processing, blending, preserving, refrigerating, canning or bottling of any food."
        }
      ]
    },
    {
      "chapter_title": "PART III AUTHORITIES",
      "sections": [
        {
          "section_no": "14",
          "section_title": "Duty of local authorities",
          "body": "Local authorities have specific duties under this Act."
        },
        {
          "section_no": "15",
          "section_title": "Appointment of Inspectors",
          "body": "The appointment of inspectors is governed by this section."
        },
        {
          "section_no": "16",
          "section_title": "Powers of Inspectors",
          "body": "Inspectors have specific powers as defined in this section."
        }
      ]
    },
    {
      "chapter_title": "PART IV FOOD ANALYSIS",
      "sections": [
        {
          "section_no": "17",
          "section_title": "Public Analyst",
          "body": "Public Analysts are appointed under this section."
        },
        {
          "section_no": "18",
          "section_title": "Purchase of samples, etc.",
          "body": "This section governs the purchase of samples for analysis."
        },
        {
          "section_no": "19",
          "section_title": "Right of private persons to have Samples analysed",
          "body": "Private persons have the right to have samples analysed."
        },
        {
          "section_no": "20",
          "section_title": "Action in respect of samples",
          "body": "This section outlines the actions that can be taken in respect of samples."
        },
        {
          "section_no": "21",
          "section_title": "Certificate of Public Analyst",
          "body": "The certificate of the Public Analyst is defined in this section."
        },
        {
          "section_no": "22",
          "section_title": "Power of government to seize sample",
          "body": "The government has the power to seize samples as defined in this section."
        }
      ]
    },
    {
      "chapter_title": "PART V PENALTIES AND PROCEDURE",
      "sections": [
        {
          "section_no": "23",
          "section_title": "Penalties",
          "body": "Penalties for violations of this Act are defined in this section."
        },
        {
          "section_no": "24",
          "section_title": "Power to try Summarily",
          "body": "This section grants the power to try certain cases summarily."
        },
        {
          "section_no": "25",
          "section_title": "Certain things to be presumed",
          "body": "This section outlines certain presumptions in legal proceedings."
        },
        {
          "section_no": "26",
          "section_title": "Declaration under section 18 to be evidence",
          "body": "Declarations made under section 18 are considered evidence."
        },
        {
          "section_no": "27",
          "section_title": "Certificate of public Analyst to be evidence of act stated therein",
          "body": "The certificate of the Public Analyst serves as evidence."
        },
        {
          "section_no": "28",
          "section_title": "Analysis by Chemical Examiner",
          "body": "This section governs the analysis conducted by the Chemical Examiner."
        },
        {
          "section_no": "29",
          "section_title": "What shall or shall not be a good defence",
          "body": "This section outlines what constitutes a good defense in legal proceedings."
        },
        {
          "section_no": "30",
          "section_title": "Forfeiture of food upon conviction",
          "body": "Food may be forfeited upon conviction as defined in this section."
        },
        {
          "section_no": "31",
          "section_title": "Expenses of analysis",
          "body": "This section outlines the expenses related to analysis."
        },
        {
          "section_no": "32",
          "section_title": "Trial of offences",
          "body": "The trial of offences under this Act is governed by this section."
        }
      ]
    },
    {
      "chapter_title": "PART VI MISCELLANEOUS",
      "sections": [
        {
          "section_no": "33",
          "section_title": "Indemnity",
          "body": "This section provides for indemnity."
        },
        {
          "section_no": "34",
          "section_title": "Inspector etc., to be public servants",
          "body": "Inspectors and related officials are considered public servants."
        },
        {
          "section_no": "35",
          "section_title": "Power to make rules",
          "body": "The power to make rules under this Act is defined in this section."
        }
      ]
    }
  ],
  "source_file": "administratorf8a8c1661a39d36d076bbd98704a845b.txt"
}