{
  "law_name": "THE NATIONAL BOOK FOUNDATION ACT",
  "year": 1972,
  "chapters": [
    {
      "chapter_title": "Contents",
      "sections": [
        {
          "section_no": "1",
          "section_title": "Short title, extent and commencement",
          "body": "(1) This Act may be called the National Book Foundation Act, 1972. (2) It extends to the whole of Pakistan. (3) It shall come into force at once."
        },
        {
          "section_no": "2",
          "section_title": "Definitions",
          "body": "In this Act, unless there is anything repugnant in the subject or context,- (a) “books” shall include textbooks, reference books and other books on religion and other books and reading material for use by students and the general public; and (b) “Foundation” means the Foundation established under this Act."
        },
        {
          "section_no": "3",
          "section_title": "Establishment of the Foundation",
          "body": "(1) As soon as may be after the commencement of this Act, the Federal Government may, for the purpose of making books available at moderate prices, by notification in the official Gazette, establish a National Book Foundation, hereinafter referred to as the Foundation. (2) The Foundation shall be a body corporate having perpetual succession and a common seal with power to acquire, hold and dispose of property, both movable and immovable."
        },
        {
          "section_no": "4",
          "section_title": "Constitution of the Foundation",
          "body": "(1) The management, overall control and supervision of the affairs of the Foundation shall vest in a Board of Governors consisting of the following members, namely:- (1) the Minister for Education and Provincial Coordination, who shall also be the chairman of the Board; (2) the Secretary, Ministry of Education and Provincial Coordination; (3) one representative of each of the Provinces; (4) one representative of the areas not forming part of any province, to be appointed by the Federal Government; (5) a representative of the University Grants Commission; (6) the Chairman, Committee of Chairmen of Education Board; (7) (i) five persons to be appointed by the Federal Government from amongst eminent educationists scholars, scientists, men of letters and persons connected with education or the production of books; (ii) five representatives of whom one shall be a female to be elected by the National Assembly of Pakistan from amongst themselves; (8) the Managing Director of the Foundation, to be appointed by the Federal Government; and (9) the Secretary of the Foundation, to be appointed by the Federal Government. (2) The members of the Board of Governors, other than the ex-officio members, shall hold office for three years and shall be eligible for re-appointment. (3) The office of the Foundation shall be at Islamabad."
        },
        {
          "section_no": "5",
          "section_title": "Managing Director",
          "body": "The Managing Director shall be the chief executive officer of the Foundation and shall, subject to the general supervision of the Chairman of the Board of Governors, be responsible for carrying out the objects of the Foundation as laid down by the Board from time to time."
        },
        {
          "section_no": "6",
          "section_title": "Functions of the Foundation",
          "body": "The following shall be the functions of the Foundation, namely:- (a) to receive any money or financial grants from the Federal Government, the Provincial Governments, local bodies and any statutory or non-statutory corporation; (b) to collect, accept or otherwise receive from any person, body, association, institution or organization any subscription or donation made to the Foundation; (c) to undertake writing of books and to encourage writers to produce good books; (d) to undertake the translation of foreign and locally-produced books into the national and regional languages of the country and vice versa; (e) to arrange the original publication and re-production of local books as well as those published abroad; (f) to import foreign books and to undertake the distribution of books among the educational institutions and the general public; (g) to encourage the writers and the book trade in general in the production of books and making them available to the students and the general public at moderate prices; (h) to provide technical know-how and financial assistance and to take other steps aimed at fostering interest in books and in reading; and (i) to initiate such other activities and programmes as may assist in the task of book development, book promotion, advancement of literacy and dissemination of knowledge by means of the printed word."
        },
        {
          "section_no": "7",
          "section_title": "Audit",
          "body": "The accounts of the Foundation shall be audited annually by the Auditor-General of Pakistan and the balance-sheet and statements of assets and liabilities shall be duly considered by the Board of Governors."
        },
        {
          "section_no": "8",
          "section_title": "Power to make rules",
          "body": "The Foundation may make rules for carrying out the purposes of this Act."
        },
        {
          "section_no": "9",
          "section_title": "[Omitted]",
          "body": "Omitted by the Federal Laws (Revision and Declaration) Ordinance, 1981 (XXVII of 1981), s. 3 and Sch., II."
        }
      ]
    }
  ],
  "source_file": "administrator67c2ad375b8297f6fd5c41dda169c595.txt"
}