{
  "error": "Expecting value: line 1 column 1 (char 0)",
  "raw": "UNDER PROOF READING THE MERCHANDISE MARKS ACT, 1889 CONTENTS 1. Title, extent and commencement 2. Definitions 3. [Repealed] TRADE DESCRIPATIONS 4. Provisions supplemental to the definition of false trade description 5. Application of trade descriptions 5A. Power to require goods to show indication of origin 6. Penalty for applying a false trade description 7. Penalty for selling goods to which as false trade description is applied UNINTENTIONAL CONTRAVENTION OF THE LAW RELATING TO MARKS AND DESCRIPTIONS 8. Unintentional contravention of the law relating to marks and descriptions FORFEITURE OF GOODS. 9. Forfeiture of goods 10-11. [Repealed] STAMPING OF LENGTH OF PIECE-GOODS MANUFACTURED IN PAKISTAN 12. Stamping of length of piece-goods manufactured in Pakistan SUMPLENTAL PROVISION 13. Evidence of origin of goods imported by sea 14. Costs of defence or prosecution UNDER PROOF READING 15. Limitation of prosecution 16. Authority of the [Federal Government] to issue instructions as to administration of this Act 17. Implied warranty on sale of marked goods 18. Savings 19. Definition of piece-goods 20. Determination of character of goods by sampling 21. Information as to commission of offence 22. Punishment of abetment in Pakistan of acts done out of Pakistan UNDER PROOF READING THE MERCHANDISE MARKS ACT, 1889 1ACT No. IV OF 1889 [1st March, 1889] An Act to amend the Law relating to Fraudulent Marks on Merchandise. WHEREAS it is expedient to amend the law relating to fraudulent marks on merchandise; It is hereby enacted as follows :- 1. Title, extent and commencement.-(1) This Act may be called the 2 * Merchandise Marks Act, 1889. 3[(2) It extends to the whole of Pakistan]; and 4[* * *] (3) It shall come into force on the first day of April, 1889. 2. Definitions. In this Act, unless there is something repugnant in the subject or context,- 5[(1) “trade mark” means any mark sured for denoting that goods as are the manufacture . or merchandise of a particular person and inclu",
  "source_file": "administrator928b2c2ef45547f6fd72490e62757369.txt",
  "law_name": "The Merchandise Marks Act, 1889",
  "year": 1889
}