{
  "error": "Expecting value: line 1 column 1 (char 0)",
  "raw": "THE NATIONAL COLLEGE OF ARTS ORDINANCE, 1985 CONTENTS 1. Short title and commencement 2. Definitions 3. Establishment of the College 4. The purpose, powers and functions of the College 5. Teaching and Examinations 6. Patron 7. The Controlling Authority 8. Visitation 9. The Principal 10. Board of Governors 11. Powers and functions of the Board 12. Chairman of the Board 13. Committees 14. Regulations 15. First Regulations 16. Rules 17. Fund of the College 18. Audit and accounts 19. Transfer of assets and liabilities, etc 20. Removal of difficulties THE SCHEDULE THE NATIONAL COLLEGE OF ARTS ORDINANCE, 1985 ORDINANCE XXVIII OF 1985 [31st March, 1985] An Ordinance to confer on the National College of Arts, Lahore, the power to award degrees. WHEREAS it is expedient to confer on the National College of Arts, Lahore, the power to award degrees and to provide for matters connected therewith or ancillary thereto; AND WHEREAS the President is satisfied that circumstances exist which render it necessary to take immediate action ; NOW, THEREFORE, in pursuance of the Proclamation of the fifth day of July, 1977, and in exercise of all powers enabling him in that behalf, the President is pleased to make and promulgate the following Ordinance: 1. Short title and commencement. (1) This Ordinance may be called the National College of Arts Ordinance, 1985. (2) It shall come into force at once. 2. Definitions. In this Ordinance, unless there is anything repugnant in the subject or context, (a) “Board” means the Board of Governors of the College; (b) “Chairman” means Chairman of the Board; (c) “College” means the National College of Arts, Lahore, established by the late Government of West Pakistan under letter No. C-II-26/58, dated the 14th October, 1958; (d) “Commission” means the University Grants Commission; (e) “Controlling Authority” means the Controlling Authority of the College ; (f) “Member” means member of the Board ; (g) “Patron” means the President of the Islamic Republic of ",
  "source_file": "administrator73253a0ac882a843e2ee9a1262c193b4.txt",
  "law_name": "The National College of Arts Ordinance, 1985",
  "year": 1985
}