{
  "error": "Expecting value: line 1 column 1 (char 0)",
  "raw": "THE FERRIES ACT, 1878 CONTNETS I.-PRELIMINARY 1. Short title 2. [Repeal] 3. Interpretation clause 3A. Definition II.-PUBLIC FERRIES 4. Power to declare, establish, and discontinue public ferries 5. Claims for compensation 6. Superintendence of public ferries 7. Management may be vested in municipality 7A. Management may be vested in District Council or District or Local Board 8. Letting ferry tolls by auction 9. Recovery of arrears from lessee 10. Power to cancel lease 11. Surrender of lease 12. Power to make rules 13. Private ferry not to ply within two miles of public ferry without sanction 14. Person using approaches, etc., liable to pay toll 15. Tolls 16. Table of tolls 17. Tolls, rents, compensation and fines are to form part of revenues of Province 18. Compounding for tolls III.-PRIVATE FERRIES 19. Power to make rules 20. Tolls IV.-PENALTIES AND CRIMINAL PROCEDURE 21. Penalty for breach of provisions as to table of tolls, list of tolls and return of traffic 22. Penalty for taking unauthorized toll, and for causing delay 23. Penalty for breach of rule made under sections 12 and 19 24. Cancelment of lease on default or breach of rules 25. Penalties on passengers offending 26. Penalty for maintaining private ferry within prohibited limits. 27. Fines payable to lessee 28. Penalty for rash navigation and stacking of timber 29. Power to arrest without warrant 30. Power to try summarily 31. Magistrate may assess damage done by offender V.-MISCELLANEOUS 32. Power to take possession of boats, etc., on surrender or cancellation of lease 33. Similar power in cases of emergency 34. Jurisdiction of Civil Courts barred 35. Delegation of Powers 36. [Repeal] THE FERRIES ACT, 1878 1ACT No. XVII OF 1878 [9th November, 1878] An Act to regulate Ferries 2* * *. Preamble. WHEREAS it is expedient to regulate ferries in 3[certain Provinces]; It is hereby enacted as follows: I.-PRELIMINARY 1. Short title. This Act may be called the 4* * Ferries Act, 1878. Local extent. 5[It extends on",
  "source_file": "administratord4052d132eb84f24c085f56fd91debee.txt",
  "law_name": "The Ferries Act, 1878",
  "year": 1878
}