{
  "law_name": "The Cotton Cloth and Yarn (Contracts) Ordinance",
  "year": 1944,
  "chapters": [
    {
      "chapter_title": "Contents",
      "sections": [
        {
          "section_no": "1",
          "section_title": "Short title, extent and commencement",
          "body": "(1) This Ordinance may be called the Cotton Cloth and Yarn (Contracts) Ordinance, 1944. (2) It extends to the whole of Pakistan. (3) It shall come into force at once."
        },
        {
          "section_no": "2",
          "section_title": "Sales in pursuance of contracts",
          "body": "(1) Where after the making of any contract for the sale of cotton cloth or cotton yarn by one wholesale dealer to another or by a wholesale dealer to a retail dealer the maximum prices ex-factory and retail at which such cloth or yarn may be sold have been fixed by an order made under the Cotton Cloth and Yarn (Control) Order, 1943, then, notwithstanding anything to the contrary in such contract, when any delivery takes place in pursuance of that contract on or after the date of the said order, the maximum price which may be charged for such cloth or yarn shall not in any case exceed the maximum retail price fixed by the said order, nor shall if in the case of a first or any subsequent sale after delivery from the manufacturer exceed by more than a percentage to be fixed in this behalf by the Textile Commissioner the price paid on the occasion of the last preceding transfer, or, if the said order has fixed a maximum price in respect of such sale, that maximum price; and where, in pursuance of any such contract, the buyer has paid a price exceeding that laid down in this section, whether voluntarily or in execution of a decree passed by a Court or otherwise, he shall be entitled to receive from the seller any sum so paid in excess. (2) The provisions of this section apply to contracts made whether before or after the commencement of this Ordinance, and to sales made in pursuance of any such contract on or after the 15th day of August, 1943."
        }
      ]
    }
  ],
  "source_file": "administratorc8394b0d2e1a74176bb00e01392e473b.txt"
}