{
  "law_name": "THE SECURITY OF PAKISTAN ACT",
  "year": 1952,
  "chapters": [
    {
      "chapter_title": "Contents",
      "sections": [
        {
          "section_no": "1",
          "section_title": "Short title, extent and commencement",
          "body": "(1) This Act may be called the Security of Pakistan Act, 1952. (2) It extends to the whole of Pakistan. (3) It shall come into force at once."
        },
        {
          "section_no": "2",
          "section_title": "Definitions",
          "body": "In this Act, unless there is anything repugnant in the subject or context, (a) ‘Board’ means the Review Board referred to in clause (4) of Article 10 of the Constitution which is appointed by the Chief Justice of Pakistan and consists of a Chairman and two other persons, each of whom is or has been a Judge of the Supreme Court or a High Court; (b) “Code” means the Code of Criminal Procedure, 1898 (Act V of 1898); (c) “document” includes any painting, drawing, photograph or other visible representation and gramophone records, sound tracks and any other article on which sounds have been recorded with a view to their subsequent reproduction."
        },
        {
          "section_no": "3",
          "section_title": "Restrictions on the movements of suspected persons and their detention",
          "body": "(1) The Federal Government if satisfied with respect to any particular person, that, with a view to preventing him from acting in any manner prejudicial to the defence or the external affairs or the security of Pakistan, may make an order (a) directing such person to remove himself from Pakistan in such manner, before such time, and by such route, as may be specified in the order; (b) directing that he be detained; (c) directing that, except in so far as may be permitted by the provisions of the order, or by such authority or person as may be specified therein, he shall not be in any such area or place as may be specified in the order; (d) requiring him to reside or remain in such place or within such area in Pakistan as may be specified in the order; (e) requiring him to notify his movements or to report himself or both; (f) requiring him to conduct himself in such manner, abstain from such acts, or take such order with any property in his possession or under his control, as may be specified in the order."
        },
        {
          "section_no": "3A",
          "section_title": "Temporary release of persons detained",
          "body": "(1) The Federal Government may at any time direct that any person detained in pursuance of a detention order may be released for any specified period either without conditions or upon such conditions specified in the direction as that person accepts, and may at any time cancel his release."
        },
        {
          "section_no": "3B",
          "section_title": "Execution of detention order",
          "body": "The provisions regarding the execution of detention orders as specified in the Act."
        },
        {
          "section_no": "3C",
          "section_title": "Detention orders not to be invalid or inoperative on certain grounds",
          "body": "The provisions regarding the validity of detention orders as specified in the Act."
        },
        {
          "section_no": "4",
          "section_title": "Powers of photographing, etc., persons",
          "body": "The provisions regarding the powers of photographing persons as specified in the Act."
        },
        {
          "section_no": "5",
          "section_title": "Omitted",
          "body": ""
        },
        {
          "section_no": "6",
          "section_title": "Communication of grounds of order",
          "body": "The provisions regarding the communication of grounds of orders as specified in the Act."
        },
        {
          "section_no": "6A",
          "section_title": "Reference to Board and its procedure",
          "body": "The provisions regarding the reference to the Board and its procedure as specified in the Act."
        },
        {
          "section_no": "7",
          "section_title": "Omitted",
          "body": ""
        },
        {
          "section_no": "8",
          "section_title": "Omitted",
          "body": ""
        },
        {
          "section_no": "9",
          "section_title": "Omitted",
          "body": ""
        },
        {
          "section_no": "10",
          "section_title": "Control of subversive associations",
          "body": "The provisions regarding the control of subversive associations as specified in the Act."
        },
        {
          "section_no": "11",
          "section_title": "Control of information",
          "body": "The provisions regarding the control of information as specified in the Act."
        },
        {
          "section_no": "11A",
          "section_title": "Control of certain undertakings and sale of shares, etc.",
          "body": "The provisions regarding the control of certain undertakings and sale of shares as specified in the Act."
        },
        {
          "section_no": "11B",
          "section_title": "Removal of control and possession, etc.",
          "body": "The provisions regarding the removal of control and possession as specified in the Act."
        },
        {
          "section_no": "11C",
          "section_title": "Payment of sale price, etc.",
          "body": "The provisions regarding the payment of sale price as specified in the Act."
        },
        {
          "section_no": "12",
          "section_title": "Regulation of publication of certain matters",
          "body": "The provisions regarding the regulation of publication of certain matters as specified in the Act."
        },
        {
          "section_no": "13",
          "section_title": "Penalties",
          "body": "The provisions regarding penalties as specified in the Act."
        },
        {
          "section_no": "14",
          "section_title": "Cognizance of offences",
          "body": "The provisions regarding cognizance of offences as specified in the Act."
        },
        {
          "section_no": "15",
          "section_title": "Procedure for the trial of offences",
          "body": "The provisions regarding the procedure for the trial of offences as specified in the Act."
        },
        {
          "section_no": "16",
          "section_title": "Offences to be cognizable and non-bailable",
          "body": "The provisions regarding offences to be cognizable and non-bailable as specified in the Act."
        },
        {
          "section_no": "17",
          "section_title": "Bar of jurisdiction of Courts",
          "body": "The provisions regarding the bar of jurisdiction of Courts as specified in the Act."
        },
        {
          "section_no": "18",
          "section_title": "Omitted",
          "body": ""
        },
        {
          "section_no": "19",
          "section_title": "Power to make rules",
          "body": "The provisions regarding the power to make rules as specified in the Act."
        },
        {
          "section_no": "20",
          "section_title": "Omitted",
          "body": ""
        }
      ]
    }
  ],
  "source_file": "administrator4d89bd23fd7d2201bf1e4fb0dc7a29d8.txt"
}