{
  "law_name": "The Arms Act",
  "year": 1878,
  "chapters": [
    {
      "chapter_title": "PRELIMINARY",
      "sections": [
        {
          "section_no": "1",
          "section_title": "Short title. Local extent. Savings.",
          "body": "This Act may be called the Arms Act, 1878; and it extends to the whole of Pakistan. But nothing herein contained shall apply to arms, ammunition or military stores on board any seagoing vessel and forming part of her ordinary armament or equipment, or the manufacture, conversion, import or export of arms, ammunition or military stores by order of the Federal Government or any Provincial Government, or by a public servant or a member of the forces constituted by the Pakistan Territorial Force Act, 1950 in the course of his duty as such public servant or member."
        },
        {
          "section_no": "2",
          "section_title": "Commencement.",
          "body": "This Act shall come into force on such day as the Federal Government by notification in the official Gazette appoints."
        },
        {
          "section_no": "3",
          "section_title": "[Repealed.]",
          "body": "[Repealed.]"
        },
        {
          "section_no": "4",
          "section_title": "Interpretation-clause.",
          "body": "In this Act, unless there be something repugnant in the subject or context, 'cannon' includes also all howitzers, mortars, wall-pieces, mitrailleuses and other ordnance and machine-guns, all parts of the same, and all carriages, platforms and appliances for mounting, transporting and serving the same. 'appropriate Government' means (a) in relation to military stores; and import, export and inter-provincial trade or transport, the Federal Government; and (b) in relation to other matters, the Provincial Government. 'arms' includes fire-arms, bayonets, swords, daggers, spears, spearheads and bows and arrows, also cannon and parts of arms, and machinery for manufacturing arms. 'ammunition' includes also all articles especially designed for torpedo service and submarine mining, rockets, gun-cotton, dynamite, lithofracteur and other explosive or fulminating material, gun-flint, gun-wads, percussion-caps, fuses and friction-tubes, all parts of ammunition and all machinery for manufacturing ammunition, but does not include lead, sulphur or saltpetre. 'military stores', in any section of this Act as applied to any part of Pakistan, means any military stores to which the Federal Government may from time to time, by notification in the official Gazette, specially extend such section in such part, and includes also all lead, sulphur, saltpetre and other material to which the Federal Government may from time to time so extend such section. 'license' means a license granted under this Act, and 'licensed' means holding such license."
        }
      ]
    },
    {
      "chapter_title": "MANUFACTURE, CONVERSION AND SALE",
      "sections": [
        {
          "section_no": "5",
          "section_title": "Unlicensed manufacture or conversion prohibited.",
          "body": "No person shall manufacture or convert any arms, ammunition or military stores except under a license and in the manner and to the extent permitted thereby."
        }
      ]
    },
    {
      "chapter_title": "IMPORT, EXPORT AND TRANSPORT",
      "sections": [
        {
          "section_no": "6",
          "section_title": "Unlicensed importation and exportation prohibited.",
          "body": "No person shall bring or take by air, sea or land into or out of Pakistan any arms, ammunition or military stores except under a license and in the manner and to the extent permitted by such license. Nothing in the first clause of this section extends to arms (other than cannon) or ammunition imported or exported in reasonable quantities for his own private use by any person lawfully entitled to possess such arms or ammunition; but the Collector of Customs or any other officer empowered by the Federal Government in this behalf by name or in virtue of his office may at any time detain such arms or ammunition until he receives the orders of the Federal Government thereon."
        },
        {
          "section_no": "7",
          "section_title": "Sanction of Federal Government required to warehousing of arms, etc.",
          "body": "Notwithstanding anything contained in the Customs Act, 1969, no arms, ammunition or military stores shall be deposited in any warehouse licensed under section 13 of that Act without the sanction of the Federal Government."
        },
        {
          "section_no": "8",
          "section_title": "[Repealed.]",
          "body": "[Repealed.]"
        },
        {
          "section_no": "9",
          "section_title": "[Repealed.]",
          "body": "[Repealed.]"
        },
        {
          "section_no": "10",
          "section_title": "[Omitted.]",
          "body": "[Omitted.]"
        },
        {
          "section_no": "11",
          "section_title": "Power to establish searching stations.",
          "body": "The Federal Government may, at any places along the boundary-line between Pakistan and foreign territory, and at such distance within such line as it deems expedient, establish searching-posts at which all vessels, carts and baggage-animals, and all boxes, bales and packages in transit, may be stopped and searched for arms, ammunition and military stores by any officer empowered by the Federal Government in this behalf by name or in virtue of his office."
        },
        {
          "section_no": "12",
          "section_title": "[Omitted.]",
          "body": "[Omitted.]"
        }
      ]
    },
    {
      "chapter_title": "GOING ARMED AND POSSESSING ARMS, ETC.",
      "sections": [
        {
          "section_no": "13",
          "section_title": "[Omitted.]",
          "body": "[Omitted.]"
        },
        {
          "section_no": "14",
          "section_title": "[Omitted.]",
          "body": "[Omitted.]"
        },
        {
          "section_no": "15",
          "section_title": "[Omitted.]",
          "body": "[Omitted.]"
        },
        {
          "section_no": "16",
          "section_title": "[Omitted.]",
          "body": "[Omitted.]"
        }
      ]
    },
    {
      "chapter_title": "LICENSES",
      "sections": [
        {
          "section_no": "17",
          "section_title": "Power to make rules as to licenses.",
          "body": "Power to make rules as to licenses."
        },
        {
          "section_no": "18",
          "section_title": "Cancelling and suspension of license.",
          "body": "Cancelling and suspension of license."
        }
      ]
    },
    {
      "chapter_title": "PENALTIES",
      "sections": [
        {
          "section_no": "19",
          "section_title": "For breach of sections 5, 6, 10, 13 to 17.",
          "body": "For breach of sections 5, 6, 10, 13 to 17."
        },
        {
          "section_no": "20",
          "section_title": "For secret breaches of sections 5 and 6. For concealing arms, etc.",
          "body": "For secret breaches of sections 5 and 6. For concealing arms, etc."
        },
        {
          "section_no": "21",
          "section_title": "For breach of license.",
          "body": "For breach of license."
        },
        {
          "section_no": "22",
          "section_title": "[Omitted.]",
          "body": "[Omitted.]"
        },
        {
          "section_no": "23",
          "section_title": "Penalty for breach of rule.",
          "body": "Penalty for breach of rule."
        },
        {
          "section_no": "24",
          "section_title": "Power to confiscate.",
          "body": "Power to confiscate."
        }
      ]
    },
    {
      "chapter_title": "MISCELLANEOUS",
      "sections": [
        {
          "section_no": "25",
          "section_title": "[Omitted.]",
          "body": "[Omitted.]"
        },
        {
          "section_no": "26",
          "section_title": "[Omitted.]",
          "body": "[Omitted.]"
        },
        {
          "section_no": "27",
          "section_title": "Power to exempt.",
          "body": "Power to exempt."
        },
        {
          "section_no": "28",
          "section_title": "Information to be given regarding offences.",
          "body": "Information to be given regarding offences."
        },
        {
          "section_no": "29",
          "section_title": "[Omitted.]",
          "body": "[Omitted.]"
        },
        {
          "section_no": "30",
          "section_title": "[Omitted.]",
          "body": "[Omitted.]"
        },
        {
          "section_no": "31",
          "section_title": "Operation of other laws not barred.",
          "body": "Operation of other laws not barred."
        },
        {
          "section_no": "32",
          "section_title": "[Omitted.]",
          "body": "[Omitted.]"
        },
        {
          "section_no": "33",
          "section_title": "Notice and limitation of proceedings.",
          "body": "Notice and limitation of proceedings."
        }
      ]
    }
  ],
  "source_file": "administrator95dda114739682aed8b784a819634050.txt"
}