{
  "error": "Expecting value: line 1 column 1 (char 0)",
  "raw": "THE CAPITAL DEVELOPMENT AUTHORITY ORDINANCE, 1960 CONTENTS CHAPTER I. PRELIMINARY SECTION: 1. Short title, extent and commencement. 2. Definition. 3. Declaration of Capital Site. CHAPTER II. CONSTITUTION OF THE AUTHORITY 4. Constitution of the Authority. 5. Management. 6. Constitution of the Board. 7. Remuneration and conditions of service. 8. Disqualification of the members. 9. Duties and functions of Chairman and other members. 10. Headquarters of the Authority and meetings of the Board. CHAPTER III. POWERS AND DUTIES OF THE AUTHORITY 11. Master-plan and master-programme. 12. Preparation of schemes by local bodies or agencies. 13. Preparation of schemes by Authority. 14. Manner and form, etc., of scheme. 15. Power of the Authority. 15 A. Ommitted. 16. Borrowing powers. 17. Execution of scheme etc., through local bodies and agencies. 18. Utilization of building material. 19. Amendment of schemes. 20. Removal, etc., of buildings after hearing. 21. Schemes to be executed after calling objection. CHAPTER IV. ACQUISITION OF LAND 22. Liability to acquisition. 23. Entry upon land, preliminary survey, etc. 24. Compensation for damage. 25. Power to acquire land. 26. Land to be marked out, measured and planned. 27. Notice to persons interested. 28. Enquiry and award of Deputy Commissioner. 29. Compensation. 30. Matter to be considered in determining compensation. 31. Factors to be ignored in determining compensation. 32. Vesting of land in the Authority. 32 A. Payment of additional compensation. 33. Acquisition in cases of urgency. 33 A. Temporary occupation and use of land. 33 B. Payment of compensation to persons under disability and heirs of deceased persons. 34. Power of Deputy Commissioner to call for information. 35. Power of Authority to give directions to Deputy Commissioner. 36. Appeal and review. 36 A. Deputy Commissioner and Commissioner to have powers of Civil Court, etc. 36 B. Fees on applications. CHAPTER V. ESTABLISHMENT 37. Appointment of officers and servan",
  "source_file": "administrator61805913d2877bbf319c042d8394196d.txt",
  "law_name": "The Capital Development Authority Ordinance, 1960",
  "year": 1960
}