{
  "law_name": "The Cotton Ginning and Pressing Factories Act",
  "year": 1925,
  "chapters": [
    {
      "chapter_title": "Contents",
      "sections": [
        {
          "section_no": "1",
          "section_title": "Short title, extent and commencement",
          "body": "(1) This Act may be called the Cotton Ginning and Pressing Factories Act, 1925. (2) It extends to the whole of Pakistan. (3) It shall come into force on such date as the Federal Government may, by notification in the official Gazette, appoint."
        },
        {
          "section_no": "2",
          "section_title": "Definitions",
          "body": "In this Act, unless there is anything repugnant in the subject or context, (a) 'bale' means any pressed package of cotton of whatever size or density; (b) 'cotton' means ginned or unginned cotton or cotton waste; (c) 'cotton ginning factory' means any place where cotton is ginned or where cotton fibre is separated from cotton seed by any process whatever involving the use of steam, water or other mechanical power or of electrical power; (d) 'cotton pressing factory' means any factory as defined in the Indian Factories Act, 1911 (XII of 1911), in which cotton is pressed into bales; (e) 'cotton waste' means droppings, strippings, fly and other waste products of a cotton mill or of a cotton ginning factory or of a cotton pressing factory, but does not include yarn waste; (f) 'Pakistan Central Cotton Committee' means the Pakistan Central Cotton Committee constituted under the Cotton Cess (Amendment) Act, 1948 and includes any sub-committee appointed by it to perform any function of the Pakistan Central Cotton Committee under this Act; (g) 'occupier' includes a managing agent or other person authorised to represent the occupier; (h) 'prescribed' means prescribed by or under rules made under this Act."
        },
        {
          "section_no": "3",
          "section_title": "Maintenance of registers",
          "body": "(1) The owner of every cotton ginning factory shall cause to be maintained at the factory in such form, if any as may be prescribed, a ginning register containing a record of all cotton ginned in the factory and of the names of the persons for whom and the dates on which the cotton has been ginned and of the amount ginned for each person. (2) The owner of every cotton pressing factory shall cause to be maintained at the factory in such form, if any, as may be prescribed, a press register containing a daily record of the number of bales pressed in the factory, the serial number of each bale, and the name of the person for whom it has been pressed. (3) The owner or the person in charge of a cotton ginning or cotton pressing factory shall be bound to produce any ginning register or press register maintained under this section when required to do so by any person appointed by the Provincial Government in this behalf, and the owner or person in charge of any cotton pressing factory shall be bound to furnish to the Pakistan Central Cotton Committee, if so required by it in writing, a copy, certified as correct by the owner or person in charge of the factory, of the entry in any press register maintained at the factory relating to any specified bale. (4) No register required to be maintained by this section shall be destroyed until after the expiration of three years from the date of the last entry therein. (5) If (a) in any factory any register required by this section to be maintained is not maintained or is maintained in any form other than the form, if any, prescribed for the purpose, or (b) any entry in any such register is proved to be false in any material particular, or (c) any such register is destroyed before the expiration of the period referred to in sub-section (4), the owner of the factory shall be punished with fine which may extend to fifty rupees or, if he has previously been convicted of any offence under this sub-section, to five hundred rupees. (6) If the owner or the person in charge of any factory fails to produce any register, or to furnish a certified copy of any entry, when required to do so under sub-section (3), or furnishes a certified copy of an entry knowing or having reason to believe such copy to be false, he shall be punished with fine which may extend to fifty rupees or, if he has previously been convicted of any offence under this sub-section, to five hundred rupees."
        },
        {
          "section_no": "4",
          "section_title": "Marking of bales",
          "body": "(1) The owner of every cotton pressing factory shall cause every bale pressed in the factory to be marked in such manner as may be prescribed before it is removed from the press-house, with a serial number and with the mark prescribed for the factory. (2) If any bale is removed from the press-house of any cotton pressing factory without having been marked as required by sub-section (1), the owner of the factory shall be punished with fine which may extend to fifty rupees."
        },
        {
          "section_no": "5",
          "section_title": "Returns",
          "body": "(1) The owner of every cotton pressing factory shall submit to the prescribed authority, within such time and in such form as may be prescribed, weekly returns showing the total number of bales of cotton pressed during the preceding week and from the commencement of the season to the end of that week, and the approximate average net weight of the bales pressed in that week. (2) The Provincial Government shall compile from the weekly returns, and shall publish in such manner as it thinks fit, a statement showing the total number of bales pressed in the Province during the week and from the commencement of the season to the end of the week, to which the returns relate: Provided that the number of bales pressed in any individual factory shall not be published. (3) If default is made in submitting any return as required by sub-section (1), the owner of the factory shall be punished with fine which may extend to fifty rupees. (4) Where the owner of a cotton pressing factory has notified to the prescribed authority that the work of pressing bales in that factory has been suspended, it shall not be necessary for the owner to submit returns under sub-section (1) until such work has been resumed. Explanation. In this section 'season' means the period notified in this behalf by the Provincial Government in the official Gazette."
        },
        {
          "section_no": "5A",
          "section_title": "Returns from cotton ginning factories",
          "body": "(1) This section shall be in force in the Karachi Division and Baluchistan only; but the Provincial Government concerned may, by notification in the official Gazette, bring this section into force in East Pakistan or the remaining parts of West Pakistan. (2) The owner of every cotton ginning factory shall submit to the prescribed authority, within such time and in such form as may be prescribed, weekly returns showing the quantity of cotton ginned in the factory during the preceding week and from the commencement of the season to the end of that week. (3) The Provincial Government shall compile from the weekly returns so submitted, and shall publish in such manner as it thinks fit, a statement showing the total quantity of cotton ginned in the Province during the week and from the commencement of the season to the end of the week, to which the returns relate: Provided that the quantity of cotton ginned in any individual factory shall not be published. (4) If default is made in submitting any return as required by sub-section (2), the owner of the factory shall be punished with fine which may extend to fifty rupees."
        },
        {
          "section_no": "6",
          "section_title": "Scales and weights",
          "body": "(1) No scales or weights shall be used in any cotton ginning or cotton pressing factory other than the scales or weights, if any, prescribed by the Federal Government as standard for the district in which the factory is situated. (2) If in any factory and scale or weight is used in contravention of the provisions of sub-section (1), the owner of the factory shall be punished with fine which may extend to fifty rupees or, if he has been previously convicted of any offence under this sub-section, to five hundred rupees."
        },
        {
          "section_no": "7",
          "section_title": "Liability of lessee as owner",
          "body": "(1) Where the owner of a cotton ginning or pressing factory has leased the factory for a period of not less than one month in the case of a cotton ginning factory, or three months in the case of a cotton pressing factory, and the lessor retains no interest in the management or profits of the factory and notice of the lease has been given by the lessor and the lessee to the prescribed authority, the lessee shall be deemed to be the owner of the factory, from the date of the notice and for the period of the continuance of the lease, for the purposes of section 3, in respect of the registers maintained or to be maintained from that date and for that period, and for the purposes of sections 4, 5, 5A and 6. (2) On the termination of the lease the lessee shall hand over to the lessor the registers maintained under section 3, and the lessor shall forthwith report to the prescribed authority any default of the lessee in complying with the provisions of this sub-section or in maintaining the registers in accordance with the provisions of section 3."
        }
      ]
    }
  ],
  "source_file": "administrator765a7fcd92df977a9c6fc4ababb3f829.txt"
}