{
  "law_name": "THE PUNJAB LAWS ACT",
  "year": 1872,
  "chapters": [
    {
      "chapter_title": "Preamble",
      "sections": [
        {
          "section_no": "1",
          "section_title": "Short title",
          "body": "This Act may be called the Punjab Laws Act, 1872."
        },
        {
          "section_no": "2",
          "section_title": "Local extent",
          "body": "It extends to the territories comprised in the Punjab, but not so as to alter the effect of any regulations made for any parts of the said territories under the Statute 33 Vict., cap. 3, section 1; Commencement, and it shall come into force on the first day of June, 1872."
        },
        {
          "section_no": "3",
          "section_title": "Enactments in force",
          "body": "The Regulations, Acts and Orders specified in the First Schedule hereto annexed are in force in the Punjab to the extent specified in the third column of the said Schedule."
        },
        {
          "section_no": "4",
          "section_title": "[Repealed]",
          "body": "Rep. by the Second Repealing and Amending Act, 1914 (XVII of 1914), s. 3 and Sch. II."
        }
      ]
    },
    {
      "chapter_title": "CIVIL JUDICATURE",
      "sections": [
        {
          "section_no": "5",
          "section_title": "Decisions in certain cases to be according to Native law",
          "body": "In questions regarding succession, special property of females betrothal, marriage, divorce, dower, adoption, guardianship, minority, bastardy, family relations, wills, legacies, gifts, partitions, or any religious usage or institution, the rule of decision shall be: (a) Where the parties are not Muslims, any custom applicable to the parties concerned, which is not contrary to justice, equity or good conscience, and has not been by this or any other enactment altered or abolished, and has not been declared to be void by any competent authority; (b) the Hindu law, in cases where the parties are Hindus, except in so far as such law has been altered or abolished by legislative enactment, or is opposed to the provisions of this Act, or has been modified by any such custom as is above referred to."
        },
        {
          "section_no": "6",
          "section_title": "Decisions in cases not specially provided for",
          "body": "In cases not otherwise specially provided for, the Judges shall decide according to justice, equity and good conscience."
        },
        {
          "section_no": "7",
          "section_title": "Local customs and mercantile usages when valid",
          "body": "All local customs and mercantile usages shall be regarded as valid, unless they are contrary to justice, equity or good conscience, or have, before the passing of this Act, been declared to be void by any competent authority."
        },
        {
          "section_no": "8",
          "section_title": "[Repealed]",
          "body": "Rep. by the Punjab Jaghirs Act, 1941 (Punjab Act V of 1941), s. 13."
        }
      ]
    },
    {
      "chapter_title": "PRE-EMPTION",
      "sections": [
        {
          "section_no": "9 to 20",
          "section_title": "[Repealed]",
          "body": "Rep. by the Punjab Pre-emption Act, 1905 (Punjab Act II of 1905), s. 2 (I)."
        }
      ]
    },
    {
      "chapter_title": "DECREES CONCERNING LAND",
      "sections": [
        {
          "section_no": "21",
          "section_title": "[Repealed]",
          "body": "Rep. by the Punjab Land Revenue Act, 1887 (XVII of 1887)."
        }
      ]
    },
    {
      "chapter_title": "INSOLVENCY",
      "sections": [
        {
          "section_no": "22 to 32",
          "section_title": "[Repealed]",
          "body": "Rep. by the Provincial Insolvency Act, 1907 (III of 1907)."
        },
        {
          "section_no": "33",
          "section_title": "[Repealed]",
          "body": "Rep. by the Amending Act, 1891 (XII of 1891)."
        }
      ]
    },
    {
      "chapter_title": "MINORS AND THE COURT OF WARDS",
      "sections": [
        {
          "section_no": "34 to 38",
          "section_title": "[Repealed]",
          "body": "Rep. by the Punjab Court of Wards Act, 1903 (Punjab Act II of 1903), s. 2 (I)."
        }
      ]
    },
    {
      "chapter_title": "CRIMINAL JUDICATURE",
      "sections": [
        {
          "section_no": "39",
          "section_title": "[Omitted]",
          "body": "Omitted by the Federal Laws (Revision and Declaration) Ordinance, 1981 (XXVII of 1981)."
        },
        {
          "section_no": "39A",
          "section_title": "Power to establish a system of village-watchmen and municipal watchmen, and to make rules",
          "body": "The Provincial Government may establish a system of village-watchmen or municipal watchmen in any part of the Punjab, and in furtherance of this object may, from time to time, make rules to provide for the following matters: (a) the definition of the limits of watchmen’s beats; (b) the determination of the several grades of watchmen, and the number of each grade to be appointed to each beat; (c) the appointment, suspension, dismissal and resignation of watchmen of each grade; (d) the equipment and discipline of, and the control and supervision over, such watchmen; (e) the conferring upon them, and the exercise by them, of any powers and the enjoyment by them of any protection or privilege, which may be exercised and enjoyed by a police-officer under any law for the time being in force; (f) the performance by them of such duties relating to police, sanitation or statistics, or for the benefit of the village communities or municipalities within their respective beats, as the Provincial Government thinks fit; (g) the exercise of authority over, and the rendering of aid to, such watchmen by headmen of the villages or members of the Municipal Committees of the towns comprised in their respective beats; (h) the performance, by the headmen of villages comprised in the beat, of any watchman, of any of the duties of a village-watchman in aid of, or substitution for, such watchman; (i) the exercise, by such village-headmen for the purposes referred to in clauses (g) and (h), or by members of Municipal Committees for the purposes referred to in clause (g) of this section, of any of the powers, and the enjoyment by such headmen or members of any privilege or protection, of a village-watchman, or a municipal watchman, as the case may be; (j) the determination of the rate at which, and the mode in which, watchmen shall be paid, and, in the case of village watchmen, of the mode in which their pay, the expenses of their equipment, and other charges connected with the village-watchman-system shall be provided for, whether out of cesses or funds already leviable or available in the villages comprised in the beat, or by a special tax in money or kind to be imposed on any class of persons residing or owning property in, or resorting to, such villages, or partly in one of these ways and partly in the other; (k) the collection with or without the aid of the village-headmen, and by any process available for the realisation of the land-revenue, of any tax imposed under clause (j) of this section, and the application of, and the mode of accounting for, the same; and generally for the efficient working of the system of village-watchmen or municipal watchmen."
        },
        {
          "section_no": "39B",
          "section_title": "Obligation to assist watchman and headman",
          "body": "Every person is bound to render to a village-watchman, or municipal watchman, or village-headman discharging the duties of a Police-officer under the rules made hereunder, all the assistance which he is bound to render to a Police-officer. Person obstructing watchman or headman may be arrested without warrant."
        },
        {
          "section_no": "39C",
          "section_title": "Power to direct local taxation for payment of police enrolled under Act V of 1861",
          "body": "Whenever it seems to the Provincial Government expedient that the duties of watch-and-ward and other internal police-service of any town or village not comprised within the limits of a municipality or within the limits of a village-watchman’s beat as defined under the power conferred by section 39A should be performed by Police-officers enrolled under Act V of 1861, the Provincial Government may direct that the said service shall be so performed, and may also direct that the charges for the time being fixed by such Government on account of such service shall be defrayed by taxes to be levied in such town or village."
        }
      ]
    },
    {
      "chapter_title": "HONORARY POLICE-OFFICERS",
      "sections": [
        {
          "section_no": "40",
          "section_title": "Provincial Government may confer powers of Police-officer",
          "body": "The Provincial Government may confer powers of Police-officer."
        }
      ]
    },
    {
      "chapter_title": "TRACK LAW",
      "sections": [
        {
          "section_no": "41",
          "section_title": "Trackers may call for assistance in carrying on tracks",
          "body": "Trackers may call for assistance in carrying on tracks."
        },
        {
          "section_no": "42",
          "section_title": "Penalty for withholding assistance or conniving at offence or escape",
          "body": "Penalty for withholding assistance or conniving at offence or escape. Limit to fine. Appeal to High Court Fine may be awarded to injured parties, and fee to tracker."
        }
      ]
    },
    {
      "chapter_title": "SLAUGHTER OF KINE",
      "sections": [
        {
          "section_no": "43",
          "section_title": "Control of slaughter of kine and sale of beef",
          "body": "Control of slaughter of kine and sale of beef."
        }
      ]
    },
    {
      "chapter_title": "ARMED MEN AND FOREIGN VAGRANTS",
      "sections": [
        {
          "section_no": "44",
          "section_title": "[Omitted]",
          "body": "[Omitted]"
        },
        {
          "section_no": "45",
          "section_title": "[Omitted]",
          "body": "[Omitted]"
        },
        {
          "section_no": "46",
          "section_title": "[Omitted]",
          "body": "[Omitted]"
        }
      ]
    },
    {
      "chapter_title": "MISCELLANEOUS",
      "sections": [
        {
          "section_no": "47",
          "section_title": "Crossing of streams on buoys or skins",
          "body": "Crossing of streams on buoys or skins."
        },
        {
          "section_no": "48",
          "section_title": "Use of pasturage or natural product of Government land",
          "body": "Use of pasturage or natural product of Government land."
        },
        {
          "section_no": "49",
          "section_title": "[Repealed]",
          "body": "[Repealed]"
        },
        {
          "section_no": "50",
          "section_title": "Power to make rules as to matters mentioned in sections 43 to 48",
          "body": "Power to make rules as to matters mentioned in sections 43 to 48. Existing rules."
        },
        {
          "section_no": "50A",
          "section_title": "Conditions of validity of rules hereafter made under this Act",
          "body": "Conditions of validity of rules hereafter made under this Act."
        },
        {
          "section_no": "50B",
          "section_title": "Penalties for breach of rules",
          "body": "Penalties for breach of rules."
        },
        {
          "section_no": "51",
          "section_title": "[Omitted]",
          "body": "[Omitted]"
        },
        {
          "section_no": "52",
          "section_title": "[Repealed]",
          "body": "[Repealed]"
        }
      ]
    }
  ],
  "source_file": "administrator03228293f22331aa4d74568d913399ac.txt"
}