{
  "error": "Expecting value: line 1 column 1 (char 0)",
  "raw": "THE COTTON ACT, 1957 CONTENTS 1. Short title, extent and commencement 2. Definitions 3. Constitution of the Cotton Board 4. Functions of the Board 5. Control of the Board 6. Requisition of factories etc. 7. Power to secure fulfillment of contracts 8. Power to call for information 9. Registration of contracts 10. Control of contracts through recognised associations 11. Delegation of powers 12. Penalty, etc. 13. False statements 14. Power to make rules 15. Cognizance of offences 16. Special provision regarding fines 17. Presumption as to orders 18. Repealed THE COTTON ACT, 1957 ACT No. XXXVIII OF 1957 [10th September, 1957] An Act to provide for measures for the promotion of international trade in cotton. WHEREAS it is expedient to provide for measures for the promotion of international trade in cotton; It is hereby enacted as follows: 1. Short title extent and commencement. (1) This Act may be called the Cotton Act, 1957. (2) It extends to the 1[Karachi Division], and with the exception of section 6, to the rest of Pakistan. (3) It shall come into force at once. 2. Definitions. In this Act, unless there is anything repugnant in the subject or context, (a) “contract” means a contract for the purchase or sale of cotton, and includes a factory selection contract; (b) “cotton” means unginned cotton (kapas) or ginned cotton (rui) or pressed and baled cotton but does not include wool cotton or silk cotton; (c) “factory selection contract” means a contract for the sale of cotton entered into in Pakistan and providing for selection by the buyer at the factory and for delivery of the cotton selected in full pressed bales at Karachi within the period and at the price specified in the contract; (d) “notified order” means an order published in the official Gazette; (e) “pressing factory” means a place wherein steam, water or other mechanical power or electric power is used and where cotton is pressed into bales. 3. Constitution of the Cotton Board. The 2[Federal Government] may,",
  "source_file": "administratorf9396ed16f308a520606b5299d8c7dac.txt",
  "law_name": "The Cotton Act, 1957",
  "year": 1957
}