{
  "error": "Expecting value: line 1 column 1 (char 0)",
  "raw": "THE NATIONAL HIGHWAYS SAFETY ORDINANCE, 2000 ORDINANCE No. XL of 2000 [2nd September, 2000] An Ordinance to provide for safe driving on the national highways WHEREAS it is expedient to provide for safe driving on the national highways and for matters connected therewith or incidental thereto; AND WHEREAS the National Assembly and the Senate stand suspended in pursuance of the Proclamation of Emergency of the fourteenth day of October, 1999, and the Provisional Constitution Order No. 1 of 1999; AND WHEREAS the President is satisfied that circumstances exist which render it necessary to take immediate action; NOW THEREFORE, in pursuance of the Proclamation of Emergency of the fourteenth day of October, 1999, and Provisional Constitution Order No. 1 of 1999, as well as order No. 9 of 1999, and in exercise of all powers enabling him in that behalf, the President of the Islamic Republic of Pakistan is pleased to make and promulgate the following Ordinance :- CHAPTER I.-PRELIMINARY 1. Short title, extent and commencement: (1) This Ordinance may be called the National Highways Safety Ordinance, 2000. (2) It extends to the whole of Pakistan. (3) It shall come into force at once. 2. Definition: (1) In this Ordinance, unless there is anything repugnant in the subject or context,- (i) \"ambulance\" means a vehicle designed for the carriage of sick, wounded or invalid persons or animals; (ii) \"animal drawn vehicle\" means a road vehicle designed and constructed primarily for carrying persons or goods and is propelled solely by one or more domestic animals; (iii) \"axle weight\" means in relation to an axle of a motor vehicle the total weight transmitted by the several wheels attached to the axle to the surface whereon the vehicle rests; (iv) \"bicycle\" means any road vehicle having at least two wheels propelled solely by muscular energy of the person on that vehicle; (v) \"board\" means the Medical Board constituted under sub-section (3) of section 4; (vi) \"carriage-way\" means the part",
  "source_file": "administrator79f454ff038827bacaf1758984d449f7.txt",
  "law_name": "The National Highways Safety Ordinance, 2000",
  "year": 2000
}