{
  "law_name": "THE WOMEN IN DISTRESS AND DETENTION FUND ACT",
  "year": 1996,
  "chapters": [
    {
      "chapter_title": "Contents",
      "sections": [
        {
          "section_no": "1",
          "section_title": "Short title, extent and commencement.",
          "body": "(1) This Act may be called the Women in Distress and Detention Fund Act, 1996. (2) It extends to the whole of Pakistan. (3) It shall come into force at once."
        },
        {
          "section_no": "2",
          "section_title": "Definitions.",
          "body": "In this Act, unless there is anything repugnant in the subject or context- (a) “Board” means the Board of Governors set up under section 6; (b) “Fund” means the Fund for women in Distress and Detention established under section 3; and (c) “women in distress and detention” means a female or a class of females in need of financial assistance to alleviate her or their miseries due to detention, litigation or for similar connected matters."
        },
        {
          "section_no": "3",
          "section_title": "Establishment of the Fund.",
          "body": "The Federal Government shall establish the Fund for Women in Distress and Detention to carry out the purposes of this Act."
        },
        {
          "section_no": "4",
          "section_title": "Purpose of the Fund.",
          "body": "The purpose of the Fund shall be to provide financial and legal assistance to women in distress and detention."
        },
        {
          "section_no": "5",
          "section_title": "Sources of Fund.",
          "body": "(1) The Fund shall consist of the following sources, namely:- (a) grants from the Federal Government and Provincial Governments; (b) aid and assistance from local, national and international agencies; (c) contributions from the statutory bodies, corporations, private organizations and individuals; (d) income and earnings from the moveable and immovable properties acquired or leased by the fund; and (e) any income from the investment of the amount credited to the Fund. (2) The amount credited to the Fund shall not lapse at the end of a financial year and shall be available for utilization at any time. (3) The capital of the Fund in full or a part thereof may be invested in any Government savings scheme and the interest, profit or earnings thus obtained may be utilized for the purposes of the Fund."
        },
        {
          "section_no": "6",
          "section_title": "Board of Governors.",
          "body": "(1) The management, overall control and supervision of the affairs of the Fund shall vest in a Board of Governors consisting of the following members, namely: (a) Minister-in-charge of the Administrative Division; Chairperson (b) One-women member each of the National Assembly Members and the Senate to be nominated by the Speaker and the Chairman respectively; (c) Secretary of the administrative Division Member (d) One women prominent social worker from each province Members to be nominated by the Provincial government; and (e) An officer in BS-20 or above of the administrative Division Member-cum- Secretary. (2) The members of the Board, other than ex-officio members, shall hold office for a term of three years and shall be eligible for re-appointment. (3) No act or proceeding of the Board shall be invalid merely on the ground of existence of any vacancy or defect in the constitution of the Board. (4) The Board may coopt any other persons for performance of its functions. (5) The Secretariat of the Board shall be at Islamabad. (6) The Board may appoint an executive committee for carrying out its functions as may be assigned to it by the Board. (7) The meeting of the Board shall be presided over by the Chairman or, in his absence, by the Secretary, Ministry of Human Rights."
        },
        {
          "section_no": "7",
          "section_title": "Functions and powers of the Board.",
          "body": "The Board shall- (a) sanction disbursement out of the fund amongst women in distress and detention; (b) make appointment of the staff of the Board; (c) acquire, sell and purchase property of the fund; and (d) manage and control the fund."
        },
        {
          "section_no": "8",
          "section_title": "Exemption from tax.",
          "body": "Notwithstanding anything contained in the Income Tax Ordinance, 1979 (XXXI of 1979), Wealth Tax Act, 1963 (XV of 1963), Zakat and Ushr Ordinance, 1980 (XVIII of 1980), all contributions and donations to the Fund shall be exempt from levy of these taxes and deduction of Zakat."
        },
        {
          "section_no": "9",
          "section_title": "Accounts of the Fund, etc.",
          "body": "(1) The accounts of the Fund shall be audited by the Auditor-General of Pakistan and shall be laid before the National Assembly. (2) The Board shall, periodically, submit reports to the Federal Government relating to the Fund and its activities."
        },
        {
          "section_no": "10",
          "section_title": "Delegation of Powers.",
          "body": "The Board may delegate all or any its powers and functions to the Chairman or a member of the Board, executive committee, Provincial Government or any other authority as it may deem fit."
        },
        {
          "section_no": "11",
          "section_title": "Rules.",
          "body": "(1) The Board may make rules for carrying out the purposes of this Act. (2) In particular and without prejudice to the generality of the foregoing provision, such rules may include- (a) procedure for disbursement of the fund; (b) resignation of non­official members; and (c) appointment of members on seats becoming vacant due to death or resignation of a non-official member."
        }
      ]
    }
  ],
  "source_file": "administrator8d2abbb2c732e10da2c91038e0804080.txt"
}