{
  "law_name": "THE PROTECTION OF COMMUNAL PROPERTIES OF MINORITIES ORDINANCE",
  "year": 2002,
  "chapters": [
    {
      "chapter_title": "Contents",
      "sections": [
        {
          "section_no": "1",
          "section_title": "Short title, extent, commencement and application",
          "body": "(1) This Ordinance may be called the Protection of Communal Properties of Minorities Ordinance, 2001. (2) It extends to the whole of Pakistan. (3) It shall come into force at once. (4) It shall apply to properties belonging to the minority communities in Pakistan meant for their communal use."
        },
        {
          "section_no": "2",
          "section_title": "Definition",
          "body": "In this Ordinance, unless there is anything repugnant in the subject or context,- (a) “Commission” means the National Commission for Minorities. (b) “Property” means places of worship, monasteries, seminaries, vicarages, dharamshalas, gaoshalas, burial places, community centers, social welfare, educational, health and recreational institutions meant for communal use of minority communities and includes side buildings, vacant places, lands, residential places or offices annexed to the said properties."
        },
        {
          "section_no": "3",
          "section_title": "Ban on sale or transfer of minority communities properties",
          "body": "(1) No property of a minority community meant for its communal use shall be bought, sold or transferred by any person without N.O.C from the Federal Government: Provided that nothing contained herein shall apply to a property bought, sold or transferred for a Housing Scheme, meant for a minority community, approved by a Provincial or Federal Government. (2) The N.O.C. referred to in sub-section (1) may be given by the Federal Government on the recommendation of the National Commission for Minorities."
        },
        {
          "section_no": "4",
          "section_title": "Ordinance not to apply to evacuee trust properties",
          "body": "Nothing in this Ordinance shall apply to the evacuee trust properties forming party of Trust Pool and vested in the Federal Government under the Evacuee Trust Properties (Management and Disposal) Act,1975 (XIII of 1975)."
        },
        {
          "section_no": "5",
          "section_title": "Punishment",
          "body": "Whoever buys, sells or transfers any property belonging to a minority community meant for its communal use in violation of section 3, shall be punishable with imprisonment of either description which may extend to seven years and shall also be liable to fine which shall not be less than one hundred thousand rupees and the sale or transfer transaction shall be of no legal effect."
        },
        {
          "section_no": "6",
          "section_title": "Removal of difficulties",
          "body": "If any difficulty arises in giving effect to any of the provision of this Ordinance, the Federal Government may make such order, not inconsistent with the provisions of this Ordinance, as may appear to be necessary for the purpose of removing the difficulty."
        },
        {
          "section_no": "7",
          "section_title": "Power to make rules",
          "body": "The Federal Government may, by notification in the official Gazette, make rules for carrying out the purposes of this Ordinance."
        }
      ]
    }
  ],
  "source_file": "administratorec3ee90d7c8aef5ea43c2de8369e71a3.txt"
}