{
  "error": "Expecting value: line 1 column 1 (char 0)",
  "raw": "THE TRANSFER OF EVACUEE DEPOSITS ACT, 1956 CONTENTS 1. Short title, extent and commencement 2. Definitions 3. Appointment of Custodian and Assistant Custodian of Deposits 4. Procedure for transfer of certain deposits 5. Procedure for transfer of certain other deposits 6. Transfer of records relating to transferable deposits 7. Power of Court or Custodian to convert deposits into money before transmission to India 8. Cessation of jurisdiction in respect of deposits transferred 9. Reception in Pakistan of deposits transferred from India 10. Powers of Custodian 11. Jurisdiction of Civil courts barred 12. Protection of action taken in good faith 13. Power to make rules 14. Repealed THE TRANSFER OF EVACUEE DEPOSITS ACT, 1956 ACT NO. XLV OF 1956 [12th November, 1956] An Act to provide, in pursuance of an Agreement with India, for the transfer to that country of certain deposits belonging to evacuees, the reception in Pakistan of similar deposits belonging to refugees and matters connected therewith. WHEREAS, in pursuance of an Agreement with India, it is expedient to provide for the transfer to that country of certain deposits belonging to evacuees, the reception in Pakistan of similar deposits belonging to refugees and matters connected therewith ; It is hereby enacted as follows : 1. Short title, extent and commencement. (1) This Act may be called the Transfer of Evacuee Deposits Act, 1956. (2) It extends to 1[the whole of Pakistan] 2[* * *]. (3) It shall come into force at once. 2. Definitions. In this Act, unless there is anything repugnant in the subject or context, (a) “Custodian” means the Custodian of Deposits appointed under section 3, and includes an Assistant Custodian of Deposits ; (b) “deposit” means (i) any movable property in the custody or under the control of any Civil or Revenue court in respect of any proceedings before it ; or (ii) any movable property under the superintendence or in the custody of a Court of Wards under any law for the time being in f",
  "source_file": "administrator86d2c3db62e273da1f2a13a2416c3d1b.txt",
  "law_name": "The Transfer of Evacuee Deposits Act, 1956",
  "year": 1956
}