{
  "law_name": "THE TRAFFIC OFFENCES (SPECIAL COURTS) ORDINANCE",
  "year": 1981,
  "chapters": [
    {
      "chapter_title": "Contents",
      "sections": [
        {
          "section_no": "1",
          "section_title": "Short title, extent and commencement",
          "body": "(1) This Ordinance may be called the Traffic Offences (Special Courts) Ordinance, 1981. (2) It extends to the whole of Pakistan. (3) It shall come into force at once."
        },
        {
          "section_no": "2",
          "section_title": "Definitions",
          "body": "In this Ordinance, unless there is anything repugnant in the subject or context,- (a) “Special Court” means a Special Court constituted under section 3; and (b) “traffic offence” means an offence punishable under the Provincial Motor Vehicles Ordinance, 1965 (W.P Ordinance No. XIX of 1965)."
        },
        {
          "section_no": "3",
          "section_title": "Constitution of Special Courts",
          "body": "(1) The Provincial Government shall, by notification in the official Gazette, constitute, for the whole or any part of the Province, a Special Court consisting of a person who is- (a) a local dignitary; or (b) a member of a Local Council constituted under the law relating to local government; or (c) an advocate of not less than five years' standing; or (d) a serving Magistrate. (2) A Special Court shall sit at such place as the Provincial Government may direct. (3) The terms and conditions of a person appointed as a Special Court shall be such as the Provincial Government may determine. (4) A Special Court shall have all the powers conferred by the Code of Criminal Procedure, 1898 (Act V of 1898), on a Magistrate of the first Class. (5) A Special Court shall follow the procedure prescribed by the Code of Criminal Procedure, 1898 (Act V of 1898), for trial of cases by Magistrates, and a person conducting prosecution before a Special Court shall be deemed to be a Public Prosecutor. (5A) A Special Court may, if it thinks fit, try a traffic offence in a summary way in accordance with the provisions contained in sections 262 to 265 of the Code of Criminal Procedure, 1898 (Act V of 1898). (6) All proceedings before a Special Court shall be deemed to be judicial proceedings within the meaning of sections 193 and 288 of the Pakistan Penal Code (Act XLV of 1860), and the Special Court shall be deemed to be a Court for the purposes of sections 480 and 482 of the Code of Criminal Procedure, 1898 (Act V of 1898)."
        },
        {
          "section_no": "4",
          "section_title": "Jurisdiction of Special Court",
          "body": "(1) Notwithstanding anything contained in the Code of Criminal Procedure, 1898 (Act V of 1898), or the Provincial Motor Vehicles Ordinance, 1965 (W.P Ordinance No. XIX of 1965), the traffic offences shall be triable exclusively by a Special Court. (2) If in the course of a trial before the Special Court, the Court is of opinion that any of the offences which the accused is alleged to have committed is not a traffic offence, the Court shall record such opinion and try the accused only for such offence, if any, as is a traffic offence."
        },
        {
          "section_no": "5",
          "section_title": "Transfer of pending cases",
          "body": "(1) Upon the constitution of a Special Court, all cases to which the jurisdiction of the Special Court extends and which may be pending in any Court immediately before the constitution of the Special Court shall stand transferred to the Special Court. (2) In respect of a case transferred to a Special Court by virtue of sub-section (1), the Special Court shall not, by reason of such transfer be bound to recall and rehear any witness who has given evidence in the case before the transfer and may act on the evidence already recorded by or produced before the Court which tried the case before the Transfer."
        },
        {
          "section_no": "6",
          "section_title": "Appeal",
          "body": "An appeal from a judgment of a Special Court shall lie to the Court of Session except in a case tried summarily in which a Special Court passes a sentence of fine not exceeding two thousand rupees only."
        },
        {
          "section_no": "7",
          "section_title": "Power to make rules",
          "body": "The Provincial Government may, by notification in the official Gazette, make rules for carrying out the purposes of this Ordinance."
        }
      ]
    }
  ],
  "source_file": "administrator0c86b7462c4639789b27534aaadf1c27.txt"
}