{
  "law_name": "THE PAKISTAN SCIENCE FOUNDATION ACT",
  "year": 1973,
  "chapters": [
    {
      "chapter_title": "Contents",
      "sections": [
        {
          "section_no": "1",
          "section_title": "Short title, extent and commencement",
          "body": "(1) This Act may be called the Pakistan Science Foundation Act, 1973. (2) It extends to the whole of Pakistan. (3) It shall come into force at once."
        },
        {
          "section_no": "2",
          "section_title": "Definition",
          "body": "In this Act, unless there is anything repugnant in the subject or context, (a) 'Board' means the Board of Trustees of the Foundation; (b) 'Chairman' means the Chairman of the Foundation; and (c) 'Foundation' means the Pakistan Science Foundation established under this Act."
        },
        {
          "section_no": "3",
          "section_title": "Establishment of the Foundation",
          "body": "(1) As soon as may be after the commencement of this Act, the Federal Government may, by notification in the official Gazette, establish a Pakistan Science Foundation to promote and finance scientific activities having a bearing on the socio-economic needs of the country. (2) The Foundation shall be a body corporate by the name of the Pakistan Science Foundation, having perpetual succession and a common seal, with power, subject to the provisions of this Act, to acquire, hold and dispose of property, both movable and immovable, and shall by the said name sue and be sued. (3) The head office of the Foundation shall be at Islamabad."
        },
        {
          "section_no": "4",
          "section_title": "Functions of the Foundation",
          "body": "(1) The Foundation shall function as a financing agency for (i) the establishment of comprehensive scientific and technological information and dissemination centres; (ii) the promotion of basic and fundamental research in the universities and other institutions on scientific problems relevant to the socio-economic development of the country; (iii) the utilisation of the results of scientific and technological research including pilot plant studies to prove the technical and economic feasibility of processes found to be promising on a laboratory scale; (iv) the establishment of science centres, clubs, museums, herbaria and planetaria; (v) the promotion of scientific societies, associations and academies engaged in spreading the cause of scientific knowledge in general or in the pursuit of a specific scientific discipline or technology in particular; (vi) the organisation of periodical science conferences, symposia and seminars; (vii) the exchange of visits of scientists and technologists with other countries; (viii) the grant of awards, prizes and fellowships to individuals engaged in developing processes, products and inventions of consequence to the economy of the country; and (ix) special scientific surveys not undertaken by any other organization and collection of scientific statistics related to the scientific effort of the country. (2) The Foundations shall also (i) review the progress of scientific research sponsored by it and evaluate the results of such research; (ii) maintain a National Register of highly qualified and talented scientists of Pakistan, including engineers and doctors, in or outside the country and to assist them, in collaboration with the concerned agencies in finding appropriate employment; and (iii) establish liaison with similar bodies in other countries. (3) In the performance of its functions, the Foundation shall be guided on questions of policy by the instructions, if any, given to it by the Federal Government which shall be the sole judge as to whether a question is a question of policy."
        },
        {
          "section_no": "5",
          "section_title": "Board of Trustees",
          "body": "The general direction, conduct and management of the affairs of the Foundation, including administration of its funds, shall vest in a Board of Trustees consisting of the following members namely:- Whole-time members (i) the Chairman; (ii) one eminent scientist; (iii) the Director of Finance; to be appointed by the President; Part-time members (iv) the Chairman of the National Science Council; (v) four scientists to be nominated by the National Science Council; and (vi) eleven eminent scientists to be nominated by the President. (2) The remuneration and other terms and conditions of service of the Chairman and the two other whole-time members of the Board shall be such as may be determined by the President."
        },
        {
          "section_no": "6",
          "section_title": "Chairman of the Foundation",
          "body": "(1) The Chairman of the Board shall be the Chairman of the Foundation and shall be appointed from amongst eminent scientist of the country having experience of research and scientific administration. (2) The Chairman shall, subject to sub-section (3), hold office for a term not exceeding three years and shall be eligible for re-appointment. (3) The President may at any time terminate the appointment of the Chairman without notice and without assigning any reason."
        },
        {
          "section_no": "7",
          "section_title": "Members of the Board",
          "body": "(1) The members of the Board, other than the ex-officio member shall, subject to sub-section (3), hold office for a term not exceeding three years and shall be eligible for re-appointment or re-nomination, as the case may be. (2) A member, other than an ex-officio member, may at any time resign his office by writing under his hand addressed to the President but shall continue to perform his functions until his resignation has been accepted. (3) The President may at any time terminate the appointment or, as the case may be, nomination of any member of the Board without notice and without assigning any reason."
        },
        {
          "section_no": "8",
          "section_title": "Meetings of the Board",
          "body": "(1) The meetings of the Board shall be held at least twice a year and shall be presided over by the Chairman or, in his absence, by its whole-time scientist member. (2) All decisions at a meeting of the Board shall be taken by a majority of the votes of the members present and voting."
        },
        {
          "section_no": "9",
          "section_title": "Quorum at the meeting of the Board",
          "body": "To constitute a quorum at a meeting of the Board not less than nine members shall be present."
        },
        {
          "section_no": "10",
          "section_title": "Executive Committee",
          "body": "There shall be an Executive Committee consisting of the Chairman and the two other whole-time members of the Board."
        },
        {
          "section_no": "11",
          "section_title": "Delegation of powers",
          "body": "The Board may, from time to time, delegate to the Chairman or the Executive Committee such of its powers and functions as it may consider necessary."
        },
        {
          "section_no": "12",
          "section_title": "Ad hoc Committees",
          "body": "The Foundation may set up ad hoc committees consisting of university professors and other leading scientists and experts to scrutinize applications for financial assistance for carrying out scientific research submitted to the Foundation by the universities or other institutions or by individual scientific workers or groups of scientific workers and to review and evaluate the results of research sponsored by the Foundation."
        },
        {
          "section_no": "13",
          "section_title": "Funds",
          "body": "The funds of the Foundation shall consist of (a) grants made by the Federal Government and the Provincial Governments; (b) donations and endowments; and (c) income from other sources."
        },
        {
          "section_no": "14",
          "section_title": "Budget",
          "body": "The Foundation shall cause to be prepared and approve a statement of its receipts and expenditure for each financial year."
        },
        {
          "section_no": "15",
          "section_title": "Accounts and Audit",
          "body": "(1) The funds of the Foundation shall be kept in a personal ledger account of the Foundation with the State Bank of Pakistan or with any Branch of the National Bank of Pakistan acting as an agent of the State Bank. (2) The accounts of the Foundation shall be maintained in such form and manner as the Auditor-General of Pakistan may determine in consultation with the Federal Government. (3) The accounts of the Foundation shall be audited by one or more auditors who are chartered accountants within the meaning of the Chartered Accountants Ordinance, 1961 (X of 1961) and are appointed by the Foundation in consultation with the Auditor-General of Pakistan."
        },
        {
          "section_no": "16",
          "section_title": "Appointments of officers and servants",
          "body": "(1) The Foundation may appoint such officers and servants, and engage such consultants or experts, as it may consider necessary for the efficient performance of its Functions, on such terms and conditions as it may deem fit. (2) In fixing the terms and conditions of service of its officers and servants, the Foundation shall as nearly as may be conform to the scales of pay, allowances and conditions of service applicable to the corresponding class of employees of the Federal Government."
        },
        {
          "section_no": "17",
          "section_title": "Annual Report",
          "body": "(1) The annual report of the Foundation, which shall, among other things, clearly bring out the benefits accruing to the nation as a result of the activities sponsored by the Foundation, shall be prepared by the Chairman and submitted, through the Board, to the Federal Government alongwith the audited accounts of the Foundation. (2) The annual report alongwith the audited accounts of the Foundation shall be laid before the National Assembly."
        },
        {
          "section_no": "18",
          "section_title": "Regulation",
          "body": "The Foundation may make Regulations for the efficient conduct of its affairs."
        },
        {
          "section_no": "19",
          "section_title": "[Repeal]",
          "body": "Omitted by the Federal Laws (Revision and Declaration) Ordinance, 1981(XXVIIof 1981), s. 3 and Sch., II."
        }
      ]
    }
  ],
  "source_file": "administrator73b8488fc2d15e4c017ef6c69f87d329.txt"
}