{
  "law_name": "THE KARACHI HOTELS AND LODGING HOUSES (CONTROL) ACT",
  "year": 1950,
  "chapters": [
    {
      "chapter_title": "Contents",
      "sections": [
        {
          "section_no": "1",
          "section_title": "Short title, commencement and extent",
          "body": "(1) This Act may be called the Karachi Hotels and Lodging-houses (Control) Act, 1950. (2) It shall come into force at once. (3) It extends to the Karachi Division."
        },
        {
          "section_no": "2",
          "section_title": "Definitions",
          "body": "In this Act, unless there is anything repugnant in the subject or context (1) the expression “accommodation” has reference to lodging, board and service, or any one or more than one of these facilities, as may be required by, or agreed to be provided to, a guest; (2) “fair rate” means the rate fixed under section 6, and includes a revised rate; (3) “guest” means a person who is in possession or enjoyment of accommodation engaged for him; (4) “Hotel or Lodging-house” means a building which is exclusively or mainly used, for providing accommodation for guests for a monetary consideration but shall not include a home or hostel which is maintained exclusively for aged or incurable persons, or, as the case may be, for students, by or under the control of a charitable or educational institution; (5) “manager of a hotel” means any person in charge of a hotel; (6) “owner of a lodging-house” means the person who receives or is entitled to receive payment from a guest on account of accommodation provided, and includes a person managing a lodging-house, as an agent or trustee or otherwise; (7) “prescribed” means prescribed by rules made under this Act; (8) “public rooms” means and includes all rooms in a hotel or lodging-house which are reserved and left open for the common use of all guests; (9) “service” means any service ordinarily provided in a hotel or lodging-house."
        },
        {
          "section_no": "3",
          "section_title": "Appointment of Controller and Additional Controllers",
          "body": "(1) The Provincial Government may, by notification in the official Gazette, appoint a person to be Controller for the purposes of this Act and may, also appoint such number of Additional Controllers as may be necessary for carrying out the said purposes. (2) Appointment of Advisory Committee. The Provincial Government may also constitute an Advisory Committee, consisting of not less than three and not more than five persons, to aid and advise the Controller in relation to such of his functions as may be prescribed."
        },
        {
          "section_no": "4",
          "section_title": "Registration of hotels and lodging-houses",
          "body": "Within a period of two months from the commencement of this Act, or from the opening of any hotel or lodging-house, whichever is later, the owner of every hotel and lodging-house shall apply to the Controller for registration of his hotel or lodging-house, and for determination of fair rates in relation thereto."
        },
        {
          "section_no": "5",
          "section_title": "Classification of hotels and lodging-houses",
          "body": "(1) The Controller may, by order in writing, classify all hotels and lodging houses into categories according to the standard of board, lodging and service provided by them, for the purpose of determination of fair rates. (2) Nothing in sub-section (1) shall be deemed to prevent the determination of fair rates by the Controller in relation to any hotel or lodging-house, irrespective of any category in which it may have been placed, or whether it has been so classified."
        },
        {
          "section_no": "6",
          "section_title": "Controller to fix fair rates for accommodation",
          "body": "(1) The Controller may fix a fair rate to be charged for board, lodging and other service provided in a hotel or boarding-house, at such amount as, having regard to all the circumstances, he deems just. (2) A fair rate may be fixed separately for (a) lodging with reference to the nature of the accommodation and the number of guests to be accommodated; (b) board, partial or full; or (c) other service, or the Controller may fix a consolidated rate for lodging, board and service, or for lodging and service only, as above. (3) A fair rate may be fixed separately for daily and monthly guests. Explanation. A guest who agrees to reserve accommodation, or for whom accommodations reserved for a period of one month or more shall be deemed to be a monthly guest, provided he actually stays for one month or more or has actually paid in advance for one month: where the reservation is not for any specified period, or is for a period less than a month, the guest shall be deemed to be a daily guest. (4) The Controller may from time to time revise the fair rates determined by him under this section. (5) In making an order fixing or revising a fair rate, the Controller shall fix the date, being the first day of a month not earlier than the month in which the order is made, from which the order is to take effect. (6) Until such time as fair rates are fixed in relation to any hotel or lodging-house under this section, the rate, if any, charged by such hotel or lodging-house on the first day of July, 1947, for equivalent lodging, board or service to that provided, shall be deemed to be the fair rate chargeable."
        },
        {
          "section_no": "7",
          "section_title": "Controller to fix limit of persons to be accommodated in any room",
          "body": "(1) The Controller may fix the maximum number of guests to be accommodated in each room or other unit of accommodation in a hotel or lodging-house. (2) Save as hereafter provided, no room for which an order has been made under sub-section (1) shall be used to accommodate any number of guests in, excess of the number specified in the order except with the previous permission of the Controller in writing. (3) The Controller may from time to time revise any order made by him under sub-section (1) so as to increase or reduce the number of guests specified in such order. (4) The Provincial Government may by rule prescribe the conditions under and the circumstances in which the permission of the Controller under sub-section (2) shall not be necessary."
        },
        {
          "section_no": "8",
          "section_title": "Fair rates and limits of persons for rooms to be displayed",
          "body": "The fair rate fixed by the Controller and the maximum number of guests who may be accommodated in relation to each room or unit of accommodation in a hotel or lodging-house shall be displayed in such room or place, and a consolidated chart showing such information in respect of all the rooms and other accommodation, in a hotel or lodging-house shall be displayed in a conspicuous manner in the office and in the public rooms, if any, of such hotel or lodging-house."
        },
        {
          "section_no": "9",
          "section_title": "Reservation of accommodation at the instance of Controller",
          "body": "(1) Subject to such rules as may be made in this behalf by the Provincial Government the Controller may by order direct the manager of a hotel or the owner of a lodging-house to reserve in the hotel or lodging-house such accommodation as may be specified in the order. (2) Subject to any direction by the Provincial Government in this behalf, the Controller may allot the accommodation reserved under sub-section (1) to any person and such person shall thereupon be deemed to be a guest at the hotel or lodging-house, in relation to the accommodation allotted to him. (3) Where any accommodation is reserved under sub-section (1), the manager of the hotel or the owner of the lodging-house shall make the accommodation so reserved, or such portion of it as the Controller may direct, available to the Controller, for occupation by the person to whom it has been allotted, at the expiry of twenty-four hours from the service upon him of a notice in writing in this behalf by the Controller. (4) Nothing in this section shall prevent the manager of a hotel or the owner of a lodging-house from letting any accommodation reserved under sub-section (1) to a guest other than the person to whom such accommodation is allotted by the Controller, upon the condition that if and when a notice is received from the Controller under sub-section (3), such guest will vacate the accommodation within twenty-four hours of the receipt of such notice."
        },
        {
          "section_no": "10",
          "section_title": "Charge in excess of fair rate prohibited",
          "body": "(1) Notwithstanding any agreement to the contrary, no manager of a hotel or an owner of a lodging-house shall charge a guest any amount in excess of the fair rate. (2) Any agreement for the payment of any charges in excess of the fair rate shall be void in respect of such excess, and shall be construed as if it were an agreement for payment of the said fair rate. (3) Any sum paid by a guest in excess of the fair rate shall be recoverable at any time within a period of six months from the date of payment from the manager of the hotel or the owner of the lodging-house to whom it was paid, or from the legal representative of either of these persons, and without prejudice to any other mode of recovery which may be open to him, the guest may deduct such amount from any sum payable by him for his accommodation."
        },
        {
          "section_no": "11",
          "section_title": "Conditions applicable to eviction of guests",
          "body": "(1) Except as provided hereinafter, no guest in a hotel or lodging-house shall be evicted or refused board or other service so long as he pays, or is ready and willing to pay the fair rate, and observes and performs the conditions of his agreement in so far as they are consistent with the provisions of this Act. (2) If the Controller is satisfied that (a) a guest in a hotel or lodging-house has been guilty of conduct which is a nuisance or source of annoyance to other guests or to persons living in the neighborhood; or (b) the accommodation he occupies is reasonably and bona fide required by the manager of the hotel or the owner of the lodging-house as the case may be, for his own occupation, or for occupation by any person for whose benefit the accommodation has been reserved to the knowledge of such guest, or for any other cause which may be deemed satisfactory by the Controller; or (c) the guest has failed to vacate the accommodation on the termination of the period of his agreement in respect thereof; the Controller may make an order to that effect and authorise the manager or owner, as the case may be, to recover possession of the accommodation provided to such guest, after giving him such notice, not exceeding seven days, as may be specified in the order. (3) An order under sub-section (2) shall not be made unless the guest has been given an opportunity to show cause against it."
        }
      ]
    }
  ],
  "source_file": "administrator21bb14bbc6e056e91de5499c01197754.txt"
}