{
  "law_name": "THE PAKISTAN COUNCIL OF RESEARCH IN WATER RESOURCES ACT",
  "year": 2007,
  "chapters": [
    {
      "chapter_title": "PRELIMINARY",
      "sections": [
        {
          "section_no": "1",
          "section_title": "Short title, extent and commencement.",
          "body": "(1) This Act may be called the Pakistan Council of Research in Water Resources Act, 2007. (2) It extends to the whole of Pakistan. (3) It shall come into force at once."
        },
        {
          "section_no": "2",
          "section_title": "Definitions.",
          "body": "In this Act, unless there is anything repugnant in the subject or context, - (a) “Board” means the Board of Governors of the Council; (b) “Chairman” means the Chairman of the Council; (c) “Council” means the Pakistan Council of Research in Water Resources; (d) “Executive Committee” means the Executive Committee of the Council; (e) “Member” means a member of the Board; (f) “prescribed” means prescribed by rules; (g) “President” means the President of the Board; (h) “regulations” means regulations made under this Act; (i) “rules” means rules made under this Act; (j) “Secretary” means Secretary of the Council; (k) “Technical Advisory Committee” means the Technical Advisory Committee of the Council; and (l) “water resources” means various fields of hydraulics and hydrology, namely, water supply, irrigation, drainage and reclamation, flood control, inland navigation and related problems prevalent in Pakistan."
        },
        {
          "section_no": "3",
          "section_title": "Establishment of the Council.",
          "body": "(1) As soon as may be after the commencement of this Act, the Pakistan Council of Research in Water Resources shall be established by the Federal Government in accordance with the provisions of the Act. (2) The Council shall be a body corporate by the name of the Pakistan Council of Research in Water Resources having perpetual succession and a common seal, with powers, subject to the provisions of this Act, to acquire and hold property and shall by the said name sue and be sued. (3) The headquarter of the Council shall be at Islamabad. (4) Until the Council is established under this Act, notwithstanding its dissolution by section 25, it shall continue to function and while so functioning be deemed to be the Council established under this Act."
        }
      ]
    },
    {
      "chapter_title": "FUNCTION OF THE PAKISTAN COUNCIL OF RESEARCH IN WATER RESOURCES",
      "sections": [
        {
          "section_no": "4",
          "section_title": "Functions of the Pakistan Council of Research in Water Resources.",
          "body": "The functions of the Council shall be to- (a) conduct, organize, coordinate and promote research on all aspects of water resources including irrigation, drainage, reclamation, navigation, drinking water, industrial water, and sewerage management and to set up national research centers wherever necessary; (b) design, develop and evaluate water conservation technologies for irrigation, drinking and industrial water; (c) initiate national water quality monitoring programme including urban and rural areas of Pakistan and develop technologies for providing safe drinking water to the public; (d) conduct and coordinate research on desertification, drought and flood mitigation; (e) develop and maintain national water resources database for use by the planning, implementing agencies and public; or advise the government and submit policy recommendations regarding water quality, development, management, conservation and utilization of water resources; (f) advise the government and submit policy recommendations regarding water quality, development, management, conservation and utilization of water resources; (g) publish scientific papers, reports and periodicals, as well as to arrange seminars, workshops and conferences on water related issues; (h) establish liaison with other related national and international research and development organizations, universities and non-government organizations; (i) undertake contractual research, provide consultancy services and collaborate with other organizations in the public and private sector; (j) provide financial and technical support to universities and research institutions for collaborative research projects and fellowships; (k) design and develop water related technologies and items of utility for various users according to market demand and undertake design and development projects on contract; (l) undertake human resources development through training in skills related to the specialized functions of the Council; and (m) commercialize its research and development results from sale of products, patents and services as well as collaboration with other organizations."
        },
        {
          "section_no": "5",
          "section_title": "Management.",
          "body": "The management of the Council shall consist of- (a) Board of Governors; (b) Chairman; and (c) Executive Committee."
        },
        {
          "section_no": "6",
          "section_title": "Board of Governors.",
          "body": "The overall control, direction and superintendence of the affairs of the Council shall vest in a Board of Governors which may exercise all powers, perform all functions and do all acts and things which may be exercised, performed or done by the Council."
        },
        {
          "section_no": "7",
          "section_title": "Composition of the Board of Governors.",
          "body": "(1) The Board of Governors shall consist of following, namely:- (a) Minister for Science and Technology President (b) Secretary, Scientific and Technological Research Division Vice- President (c) Representative from Ministry Finance, not below the rank of Joint Secretary Member (d) Representative from Ministry of Science and Technology not below the rank of Joint Secretary Member (e) Chief Engineering Advisor, Ministry of Water and Power Member (f) Four representatives to be nominated by Provincial Governments from the Water Sector Member (g) Four Representatives of the Farmers, one each to be nominated by the respective Provincial Governments (h) Representative of Water Industry to be Nominated by Federation of Pakistan Chamber of Commerce and Industries Member (i) Chairman of the Council Member (j) One Member each from the National Assembly and Senate to be nominated by the Speaker and Chairman Senate respectively. (2) The Chairman of the Council shall act as Secretary of the Board."
        },
        {
          "section_no": "8",
          "section_title": "Functions and powers of the Board.",
          "body": "In particular and without prejudice to the generality of the powers conferred by section 6, the Board shall (a) approve overall plans, policies and programmes of the Council; (b) review and approve annual and long-term business plans of the Council; (c) review and approve research projects proposed by the Technical Advisory Committee; (d) approve the annual development and non-development budget of the Council; (e) create posts of such officers and servants and engage such consultants or experts, as it may consider necessary for the efficient performance of the functions of the Council, on such terms and conditions as it may deem fit; (f) recommend to the Government to terminate the contract of the Chairman before the expiry of his tenure in case of unsatisfactory performance; and (g) make regulations in the light of rules for carrying out activities considered necessary for achieving efficient functioning of the Council under this Act."
        },
        {
          "section_no": "9",
          "section_title": "Term of office of members.",
          "body": "(1) Save as hereinafter provided, a member, other than an ex-officio member, shall hold office for a period of three years from the date of his nomination. (2) A person who becomes, or is nominated to be, a member by virtue of his holding an office or appointment shall cease to be a member when he ceases to hold that office or appointment. (3) A member, other than an ex-officio member, may at any time resign his office by writing under his hand addressed to the Government but shall continue to perform his functions until his resignation has been accepted. (4) A vacancy caused by resignation or any other reason shall be filled by the nomination of a person qualified to fill such vacancy. (5) No act or proceeding of the Board shall be invalid on the ground only of the existence of a vacancy in the Board. (6) The Federal Government may increase or decrease the number of members of the Board of Governors and prescribe the qualifications and mode of appointment of such members in such manner as it may prescribe."
        },
        {
          "section_no": "10",
          "section_title": "Meetings of the Board.",
          "body": "(1) Save as hereinafter provided, the Board shall regulate the procedure for its meetings. (2) Meetings of the Board shall be called by its President on such date and at such time and place as he may deem fit: Provided that not less than two meetings shall be held in a year. (3) Eight members shall constitute the quorum for a meeting of the Board. (4) Each meeting of the Board shall be presided over by the President and, in his absence, by the Vice-president of the Board."
        },
        {
          "section_no": "11",
          "section_title": "Chairman of the Council.",
          "body": "The Chairman shall be an eminent scientist or engineer having at least 15 years experience in the relevant field and shall be appointed by the Federal Government on the recommendation of Board of Governors for a term of three years on such terms and conditions as may be determined. The Government, on the recommendation of Board of Governors, may extend the tenure of the Chairman for another term or terms as it may deem fit, or convert it into permanent appointment."
        },
        {
          "section_no": "12",
          "section_title": "Powers and functions of the Chairman.",
          "body": "The Chairman, who shall be the chief executive of the Council, shall work under the general policy guideline of the Board and have such powers, functions and duties as may be conferred on, or vested in, him by or under his Act. The Chairman:- (a) may, from time to time, for the purpose of ensuring efficient functioning of the Council and to facilitate its day to day functions, delegate to the Secretary or other officers of the Council, such of his functions, powers or duties as he may consider necessary; (b) shall in consultation with the Technical Advisory Committee formulate business and research plans and submit to the Board for approval; (c) shall ensure the protection of all assets of the Council including intellectual property assets; (d) shall promote commercialization of research and development work of the Council linking it with the market demand; (e) arrange for annual performance evaluation of the Council; (f) prepare the annual report of the Council for submission to the Federal Government which shall place it before the Parliament; (g) identify areas of strength and weakness and formulate remedial programs; (h) commission industry specific studies to identify technical problems and to approve plans for technical scientific input by the Council towards their solution; (i) arrange management courses on a regular basis for managerial levels of the Council; and (j) may subject to the provisions clause (e) of section 8, appoint such office."
        }
      ]
    },
    {
      "chapter_title": "MISCELLANEOUS",
      "sections": [
        {
          "section_no": "19",
          "section_title": "Submission of periodical reports, etc.",
          "body": ""
        },
        {
          "section_no": "20",
          "section_title": "Directives from the Federal Government.",
          "body": ""
        },
        {
          "section_no": "21",
          "section_title": "Discoveries and inventions to vest in the Council.",
          "body": ""
        },
        {
          "section_no": "22",
          "section_title": "Declaration of fidelity and secrecy.",
          "body": ""
        },
        {
          "section_no": "23",
          "section_title": "Continuance of certain rules.",
          "body": ""
        },
        {
          "section_no": "24",
          "section_title": "Winding up.",
          "body": ""
        },
        {
          "section_no": "25",
          "section_title": "Dissolution of Council.",
          "body": ""
        },
        {
          "section_no": "26",
          "section_title": "Exemption from taxes.",
          "body": ""
        },
        {
          "section_no": "27",
          "section_title": "Ordinance XCI of 2002, not to apply to the Council.",
          "body": ""
        },
        {
          "section_no": "28",
          "section_title": "Power to make Rules.",
          "body": ""
        },
        {
          "section_no": "29",
          "section_title": "Removal of difficulties.",
          "body": ""
        }
      ]
    }
  ],
  "source_file": "administratord6369a6d16474d51e20eac4a31ae883e.txt"
}