{
  "error": "Expecting value: line 1 column 1 (char 0)",
  "raw": "THE CHEMICAL WEAPONS CONVENTION IMPLEMENTATION ORDINANCE, 2000 CONTENTS 1. Short title, extent and commencement. 2. Definitions. 3. Prohibition on development etc; of chemical weapon 4. Premises or equipment for producing chemical weapon 5. Prohibition on production, etc. of toxic chemicals and precursors 6. Transfer of any scheduled chemical for permitted purposes 7. Production, etc, for permitted purposes 8. Verification activities 9. National Authority 10. Functions of the Authority 11. Delegation of powers 12. Inspections under the Convention 13. Particulars of authorisation 14. Effect of authorisation 15. Right of occupier, etc. 16. Bar to jurisdiction 17. Proof regarding status of a member of inspection team 18. Power to amend authorisation, and its effect 19. Offences in respect of an inspection 20. Privileges and immunities of members of inspection team and observers 21. Disclosure of information 22. Privileged information and documents 23. Registration 24. Power to enter a premises and search, remove or immobilise objects 25. Extension to external territories 26. Power to make rules SCHEDULE I SCHEDULE II SCHEDULE III SCHEDULE IV SCHEDULE V THE CHEMICAL WEAPONS CONVENTION IMPLEMENTATION ORDINANCE, 2000 ORDINANCE No. LIV of 2000 [11th October, 2000] An Ordinance to give effect in Pakistan to the Convention on the Prohibition of the Development, Production, Stockpiling and use of Chemical Weapons and on their Destruction signed at Paris on the 13th January, 1993 WHEREAS it is expedient to give effect in Pakistan to the Convention on the Prohibition of the Development, Production, Stockpiling and use of Chemical Weapons, and on their destruction signed at Paris on the 13th January, 1993; AND WHEREAS the National Assembly and the Senate stand suspended in pursuance of the Proclamation of Emergency of the fourteenth day of October, 1999, and the Provisional Constitution Order No.1 of 1999; AND WHEREAS the President is satisfied that circumstances exist which ren",
  "source_file": "administratorffca67e7dc76b0ec7a050f421f9b6437.txt",
  "law_name": "The Chemical Weapons Convention Implementation Ordinance, 2000",
  "year": 2000
}