{
  "error": "Expecting value: line 1 column 1 (char 0)",
  "raw": "Updated till 14.04.2023 THE MOTION PICTURES ORDINANCE, 1979 CONTENTS CHAPTER I PRELIMINARY 1. Short title, extent and commencement. 2. Definition. CHAPTER II ESTABLISHMENT OF THE BOARD 3. Constitution of Board. 4. Uncertified film not to be exhibited. 5. Certification of films. 6. Principles of guidance in certifying films. 7. Appeals. 8. Powers to suspend exhibition of films in certain cases. 9. Revisional powers of the Federal Government. 10. Information and documents to be given to distributors and exhibitors with respect to certified films. 11. Powers to direct exhibition of films for examination. 12. Vacancies, etc., not to invalidate proceedings. CHAPTER III REGULATION OF EXHIBITION BY MEANS OF CINEMATOGARPH 13. Licensing of places for exhibition of films. 14. Directions as to screening of documentaries, etc. CHAPTER IV MISCELLANEOUS 15. Delegation of powers. 16. Certain persons to be public servants. 17. Bar to legal proceedings. 18. Penalties and procedure. 19. Powers to make rules. 20. Power to exempt. 21. Repeals and savings. THE MOTION PICTURES ORDINANCE, 1979. ORDINANCE No. XLIII OF 1979 [3rd September,1979] An Ordinance to provide for the censorship of films and the regulations of exhibition of films by means of cinematographs WHEREAS it is expedient to provide for the censorship of films and the regulation of exhibition of films by means of cinematographs, and for matters connected therewith or incidental thereto; AND WHEREAS the President is satisfied that circumstances exist which render it necessary to take immediate action ; NOW, THEREFORE, in pursuance of the Proclamation of the fifth day of July, 1977, read with the Laws (Continuance in Force) Order, 1977 (C. M. L. A. Order No. 1 of 1977), and in exercise of all powers enabling him in that behalf, the President is pleased to make and promulgate the following Ordinance :― CHAPTER I PRELIMINARY 1. Short title, extent and commencement.― (1) This Ordinances may be called the Motion Pictures Ordinance",
  "source_file": "administratoreb33b52bbe1303f593b6674f960a536e.txt",
  "law_name": "The Motion Pictures Ordinance, 1979",
  "year": 1979
}