{
  "error": "Expecting value: line 1 column 1 (char 0)",
  "raw": "THE NAVAL ARMAMENT ACT, 1923 CONTENTS 1. Short title, extent and commencement 2. Definitions 3. Restriction on building or equipping vessels of war 4. Licences 5. Offences against the Act 6. Liability of ships to forfeiture 7. Seizure, detention and search of ships 8. Procedure in forfeiture of ships 9. Disposal of forfeit 10. Special proof of relevant facts 11. Penalties for proceeding to sea after seizure 12. Power to enter dockyards, etc. 13. Courts by which and conditions subject to which offences may be tried 14. Indemnity THE NAVAL ARMAMENT ACT, 1923 ACT No. VII or 1923 [5th March, 1923] An Act to give effect in 1[Pakistan] to the Treaty for the Limitation of Naval Armament. WHEREAS it is expedient to give effect in 1[Pakistan] to the 2[Treaty for the Limitation of Naval Armament and for the Exchange of Information concerning Naval Construction signed in London on behalf of His Majesty on the twenty-fifth day of March, 1936]; It is hereby enacted as follows; 1. Short title, extent and commencement. (1) This Act may be called the 3[*] Naval Armament Act, 1923. 1[(2) It extends to the whole of Pakistan.] (3) It shall come into force on such date as the 4[Federal Government] may, by notification in the 5[official Gazette], appoint. 2. Definitions. In this Act, unless there is anything repugnant in the subject or context, (a) “competent Court” means the High Court or such other Court having unlimited original civil jurisdiction as the 4[Federal Government] may declare to be competent Court for the purposes of this Act ; (b) “ship” means any boat, vessel, battery or craft, whether wholly or partly constructed, which is intended to float or is capable of floating, on water, and includes all equipment belonging to any ship ; and 2[(c) “the Treaty” means the Treaty for the Limitation of Naval Armament and for the Exchange of Information concerning Naval Construction signed in London on behalf of His Majesty on the twenty-fifth day of March, 1936.] 3. Restriction on bu",
  "source_file": "administrator0d00360b02f38387639f455f5ead73a3.txt",
  "law_name": "The Naval Armament Act, 1923",
  "year": 1923
}