{
  "error": "Expecting value: line 1 column 1 (char 0)",
  "raw": "THE EMPLOYMENT OF CHILDREN ACT, 1991 CONTENTS PART I PRELIMINARY 1. Short title, extent and commencement. 2. Definitions. PART II PROHIBITION OF EMPLOYMENT OF CHILDREN IN CERTAIN OCCUPATIONS AND PROCESSES 3. Prohibition on employment. 4. Amendment of schedule. 5. National committee on the rights of the child. PART III REGULATION OF CONDITIONS OF WORK OF CHILDREN 6. Application of part. 7. Hours and period of work. 8. Weekly holidays. 9. Notice to inspector. 10. Dispute as to age. 11. Maintenance of register. 12. Display of notice containing abstract of sections. 13. Health and safety. PART IV MISCELLANEOUS 14. Penalties. 15. Modified application of certain laws in relation to penalties. 16. Procedure relating to offences. 17. Appointment of inspectors. 18. Power to make rules. 19. Certain other provisions of law not barred. 20. Power to remove difficulties. 21. Repeal and saving. THE SCHEDULE. PART I OCCUPATIONS PART II PROCESSES THE EMPLOYMENT OF CHILDREN ACT, 1991 1*ACT NO. V OF 1991 [2nd April, 1991] An Act to prohibit the employment of children in certain occupations and to regulate the conditions of work of children PART I PRELIMINARY 1. Short Title, Extent and Commencement. (1) This Act may be called the Employment of Children Act, 1991. (2) It extends to the whole of Pakistan. (3) The provisions of this Act, shall come into force at once. 2. Definitions. In this Act, unless the context otherwise requires (i) “adolescent” means a person who has completed his fourteenth but has not completed his eighteenth year; (ii) “appropriate Government” means the Federal Government in relation to an establishment under the control of the Federal Government, and in all other cases, the Provincial Government concerned; (iii) “child” means a person who has not completed his fourteenth year of age; (iv) “day” means a period of twenty-four hours beginning at mid-night; (v) “establishment” includes a shop, commercial establishment, workshop, factory, farm, residential hotel or r",
  "source_file": "administratorbce84c6cf30cb149d8820a00cd175b08.txt",
  "law_name": "The Employment of Children Act, 1991",
  "year": 1991
}