{
  "law_name": "THE INTERNATIONAL FINANCE CORPORATION ACT",
  "year": 1956,
  "chapters": [
    {
      "chapter_title": "International Finance Corporation Act, 1956",
      "sections": [
        {
          "section_no": "1",
          "section_title": "Short title, extent and commencement",
          "body": "(1) This Act may be called the International Finance Corporation Act, 1956. (2) It extends to the whole of Pakistan. (3) It shall come into force on such date as the Federal Government may, by notification in the official Gazette, appoint."
        },
        {
          "section_no": "2",
          "section_title": "Definitions",
          "body": "In this Act, unless there is anything repugnant in the subject or context, (a) “agreement” means any Agreement which may be signed and accepted on behalf of the Government of Pakistan in pursuance of the Articles of Agreement approved by the Executive Directors of the Bank on the eleventh day of April 1955 providing for the establishment and operation of an international body to be called the International Finance Corporation; (b) “Corporation” means the International Finance Corporation; (c) “member” means a member of the Corporation."
        },
        {
          "section_no": "3",
          "section_title": "Financial provisions",
          "body": "(1) There shall be paid out of the Federal Consolidated Fund and until the Federal Consolidated Fund is constituted, out of the Revenues of the Federal Government, all such sums as may be required for the purpose of making payments on behalf of the Government of Pakistan under paragraph (a) of section 3 of Article II of the Agreement. (2) Any sums received by the Government of Pakistan from the Corporation in pursuance of the Agreement shall be paid into the Federal Consolidated Fund and until the Federal Consolidated Fund is constituted into the Revenues of the Federal Government."
        },
        {
          "section_no": "4",
          "section_title": "State Bank to be depository for the Corporation",
          "body": "The State Bank of Pakistan shall be the depository of the Pakistan currency holdings or other assets of the Corporation."
        },
        {
          "section_no": "5",
          "section_title": "Certain provisions of Agreements to have force of Law",
          "body": "Notwithstanding anything to the contrary contained in any other law, the provisions of Article VI of the Agreement set out in the Schedule shall have the force of law in Pakistan: Provided that nothing in section 9 thereof shall be construed as (a) entitling the Corporation to import into Pakistan goods free of any duty of customs without any restriction on their subsequent sale therein, or (b) conferring on the Corporation any exemption from duties or taxes which form part of the price of goods sold or which are in fact no more than charges for services rendered."
        }
      ]
    }
  ],
  "source_file": "administratore33a61bdf0659ec30aa77435f93ce2a7.txt"
}