{
  "error": "Expecting value: line 1 column 1 (char 0)",
  "raw": "THE STATE IMMUNITY ORDINANCE, 1981 CONTENTS 1. Short title, extent and commencement. 2. Interpretation. IMMUNITY FROM JURISDICTION 3. General immunity from jurisdiction EXCEPTIONS FROM IMMUNITY 4. Submission to jurisdiction. 5. Commercial transactions and contracts to be performed in Pakistan. 6. Contracts of employment. 7. Ownership, possession and use of property. 8. Patents, trade marks, etc. 9. Membership of bodies corporate, etc. 10. Arbitrations. 11. Ships used for commercial purposes. 12. Value added tax, customs-duties, etc. PROCEDURE 13. Service of process and judgment in default of appearance. 14. Other procedural privileges. SUPPLEMENTARY PROVISIONS 15. States entitled to immunities and privileges. 16. Restriction and extension of immunities and privileges. 17. Savings, etc. 18. Proof as to certain matters. 19. Repeal. THE STATE IMMUNITY ORDINANCE, 1981 ORDINANCE VI OF 1981 [11th March, 1981] An Ordinance to amend and consolidate the law relating to the immunity of States from the jurisdiction of Courts. WHEREAS it is expedient to amend and consolidate the law relating to the immunity of States from the jurisdiction of Courts; AND WHEREAS the President is satisfied that circumstances exist which render it necessary to take immediate action; NOW, THEREFORE, in pursuance of the Proclamation of the fifth day of July, 1977, read with the Laws (Continuance in Force) Order, 1977 (C. M. L. A. Order No. 1 of 1977), and in exercise of all powers enabling him in that behalf, the President is pleased to make and promulgate the following Ordinance : 1. Short title, extent and commencement.⸻(1) This Ordinance may be called the State Immunity Ordinance, 1981. (2) It extends to the whole of Pakistan. (3) It shall come into force at once. 2. Interpretation. In this Ordinance, “Court” includes any tribunal or body exercising judicial functions. IMMUNITY FROM JURISDICTION 3. General immunity from jurisdiction. (1) A State is immune from the jurisdiction of the Courts of Pa",
  "source_file": "administratore76fcf01a8103c67d13c638ef9545317.txt",
  "law_name": "The State Immunity Ordinance, 1981",
  "year": 1981
}