{
  "error": "Expecting value: line 1 column 1 (char 0)",
  "raw": "THE TERRORIST AFFECTED AREAS (SPECIAL COURTS) ACT, 1992 CONTENTS 1. Short title, extent and commencement. 2. Definitions 3. Declaration of terrorist affected area 4. Use of Police and Civil Armed Forces, etc. 5. Power of police, civil armed forces, etc. 6. Establishment of Special Courts 7. Composition and appointment of Presiding Officers of Special Court 8. Place of sitting 9. Jurisdiction of Special Court 10. Transfer of cases 11. Powers of Special Courts with respect to other offences 12. Public prosecutors 13. Procedure and powers of Special Court 14. Protection of witnesses 15. Manner and place of execution of sentence 16. Power to transfer cases to regular Courts 17. Appeal 18. Trial before special Court to have precedence 19. Modified application of certain provisions of the Code 20. Overriding effect of Act 21. Delegation 22. Power to amend the Schedule 23. Power to make rules 24. Saving 25. Presumption as to certain offences 26. Contempt of Court 27. Indemnity TERRORIST AFFECTED AREAS (SPECIAL COURTS) ACT, 1992 ACT NO. X OF 1992 [18th July, 1992] An Act to provide for the suppression of acts of terrorism, subversion and other heinous offences in the terrorist affected areas. WHEREAS it is expedient to provide for the suppression of acts of terrorism, subversion and other heinous offences in the terrorist affected areas and for matters connected therewith or incidental thereto; It is hereby enacted as follows:- 1. Short title, extent and commencement.-(1) This Act may be called the Terrorist Affected Areas (Special Courts) Act, 1992. (2) It extends to the whole of Pakistan. (3) It shall come into force at once. 2. Definitions.-In this Act, unless there is anything repugnant in the subject or context, (a) “Code” means the Code of Criminal Procedure, 1898 (Act V of 1898); (b) “Government” means the Federal Government; (c) “Civil armed forces” means the Pakistan Rangers, the Frontiers Crops, Pakistan Coast Guards, Frontier Constabulary or any other force notif",
  "source_file": "administrator08daaa3b42611022ec49c811a6a6cbda.txt",
  "law_name": "The Terrorist Affected Areas (Special Courts) Act, 1992",
  "year": 1992
}