{
  "law_name": "THE COAL MINES (FIXATION OF RATES OF WAGES) ORDINANCE",
  "year": 1960,
  "chapters": [
    {
      "chapter_title": "Contents",
      "sections": [
        {
          "section_no": "1",
          "section_title": "Short title, extent and commencement",
          "body": "(1) This Ordinance may be called the Coal Mines (Fixation of Rates of Wages) Ordinance, 1960. (2) It extends to the whole of Pakistan. (3) It shall come into force at once."
        },
        {
          "section_no": "2",
          "section_title": "Definitions",
          "body": "In this Ordinance, unless there is anything repugnant in the subject or context, - (a) “coal mine” means any excavation where any operation for the purpose of searching for, or obtaining, coal or coke has been or is being carried on, and includes all works, machinery, tramways and sidings, whether above or below ground, in, or adjacent to, or belonging to, a coal mine : Provided that it shall not include any part of such premises on which a manufacturing process is being carried on unless such process is for the making of coke or the dressing of coal ; (b) “owner” means owner of a coal mine and includes a lessee or mortgagee in possession of such coal mine and any partner, managing director, director, agent, manager or any other person authorized to represent the coal mine in its transactions ; (c) “wages” shall have the same meaning as are assigned to it in clause (vi) of section 2 of the Payment of Wages Act, 1936 (IV of 1936)."
        },
        {
          "section_no": "3",
          "section_title": "Minimum rates of wages",
          "body": "(1) The Provincial Government may, from time to time, by notification in the official Gazette, fix minimum rates of wages payable to persons employed in a coal mine. (2) In fixing or revising the minimum rates of wages fixed under this Ordinance, the Provincial Government may, if it so considers necessary, consult the Miners Welfare Board constituted under the Excise Duty on Minerals (Labour Welfare) Act, 1967 (VIII of 1967)."
        },
        {
          "section_no": "4",
          "section_title": "Coal mine workers entitled to minimum wages",
          "body": "On the issue of a notification under section 3, every person employed in a coal mine shall be entitled to be paid by the owner wages at a rate which shall in no case be less than the rate of wages specified in the notification."
        },
        {
          "section_no": "5",
          "section_title": "Ordinance not to affect certain agreements, etc.",
          "body": "The provisions of this Ordinance shall have effect notwithstanding anything inconsistent therewith in any award, agreement or contract of service, whether made before or after the commencement of this Ordinance : Provided that where under any such award, agreement, or contract of service a person employed in a coal mine is entitled to higher rates of wages, he shall continue to be entitled to such higher rates."
        },
        {
          "section_no": "6",
          "section_title": "Provisions of this Ordinance to be in addition to and not in derogation of certain laws",
          "body": "The provisions of this Ordinance shall be in addition to, and not in derogation of, the provisions of the Payment of Wages Act, 1936 (VI of 1936), West Pakistan Industrial and Commercial Employment (Standing Orders) Ordinance, 1968 (W.P. Ordinance No. VI of 1968) and the Industrial Relations Ordinance, 1969 (XXIII of 1969)."
        }
      ]
    }
  ],
  "source_file": "administrator97cb430458c3149a54b33a28ae8143cd.txt"
}