{
  "law_name": "THE RAILWAYS (LOCAL AUTHORITIES’ TAXATION) ACT",
  "year": 1941,
  "chapters": [
    {
      "chapter_title": "Contents",
      "sections": [
        {
          "section_no": "1",
          "section_title": "Short title and extent",
          "body": "(1) This Act may be called the Railways (Local Authorities Taxation) Act, 1941. (2) It extends to the whole of Pakistan."
        },
        {
          "section_no": "2",
          "section_title": "Definitions",
          "body": "In this Act, (a) “local authority” means a local authority as defined in the General Clauses Act, 1897 (X of 1897), and includes any authority legally entitled to or entrusted with the control or management of any fund for the maintenance of watchmen or for the conservancy, of a river; (b) “railway administration” has the meaning assigned to the expression in clause (6) of section 3 of the Railways Act, 1890 (IX of 1890)."
        },
        {
          "section_no": "3",
          "section_title": "Liability of Railways to taxation by local authorities",
          "body": "(1) In respect of property vested in the Federal Government, being property of a railway, a railway administration shall be liable to pay any tax in aid of the funds of any local authority, if the Federal Government, by notification in the official Gazette, declares it to be so liable. (2) While a notification under sub-section (1) is in force, the railway administration shall be liable to pay to the local authority either the tax mentioned in the notification or in lieu thereof such sum, if any, as a person appointed in this behalf by the Federal Government may, having regard to the services rendered to the railway and all the relevant circumstances of the case, from time to time determine to be fair and reasonable. The person so appointed shall be a person who is or has been a Judge of a High Court or a District Judge."
        },
        {
          "section_no": "5",
          "section_title": "Saving",
          "body": "Nothing in this Act shall be construed as debarring any railway administration administering a railway from entering into a contract with any local authority for the supply of water or light or for the scavenging of railway, premises or for any other service which the local authority may be rendering or be prepared to render within any part of the local area under its control."
        }
      ]
    }
  ],
  "source_file": "administrator809a246717f4d2a1d2909ed86ca7dbde.txt"
}