{
  "law_name": "THE FOREST ACT",
  "year": 1927,
  "chapters": [
    {
      "chapter_title": "PRELIMINARY",
      "sections": [
        {
          "section_no": "1",
          "section_title": "Short title and extent",
          "body": "(1) This Act may be called Forest Act, 1927. (2) It extends to Sind, the Punjab and the North-West Frontier Province (except the District of Hazara). (3) The Provincial Government of a Province may, by notification in the official Gazette, extend this Act to the whole or any specified part thereof."
        },
        {
          "section_no": "2",
          "section_title": "Interpretation clause",
          "body": "In this Act, unless there is anything repugnant in the subject or context, (1) “cattle” includes elephants, camels, buffaloes, horses, mares, geldings, ponies colts, fillies mules, asses, pigs, rams, ewes, sheep, lambs, goats and kids; (2) “Forest-officer” means, any person whom the Provincial Government or any officer empowered by the Provincial Government in this behalf, may appoint to carry out all or any of the purposes of this Act or to do anything required by this Act or any rule made thereunder to be done by a Forest-officer; (3) “forest-offence” means an offence punishable under this Act or under any rule made thereunder; (4) “forest-produce” includes timber, charcoal, caoutchouc, catechu, wood-oil, resin, natural varnish, bark, lac, mahua flowers, mahua seeds, kuth and myrabolams, and other specified items."
        }
      ]
    },
    {
      "chapter_title": "OF RESERVED FORESTS",
      "sections": [
        {
          "section_no": "3",
          "section_title": "Power to reserve forests",
          "body": "The Provincial Government may constitute any forest-land or waste-land which is the property of Government, or over which the Government has proprietary rights, or to the whole or any part of the forest produce of which the Government is entitled, a reserved forest in the manner hereinafter provided."
        },
        {
          "section_no": "4",
          "section_title": "Notification by Provincial Government",
          "body": "(1) Whenever it has been decided to constitute any land a reserved forest, the Provincial Government shall issue a notification in the official Gazette declaring that it has been decided to constitute such land a reserved forest; specifying, as nearly as possible, the situation and limits of such land; and appointing an officer to inquire into and determine the existence, nature and extent of any rights alleged to exist in favour of any person in or over any land comprised within such limits or in or over any forest-produce."
        },
        {
          "section_no": "5",
          "section_title": "Bar of accrual of forest-rights",
          "body": "After the issue of a notification under section 4, no right shall be acquired in or over the land comprised in such notification, except by succession or under a grant or contract in writing made or entered into by or on behalf of the Government or some person in whom such right was vested when the notification was issued."
        }
      ]
    },
    {
      "chapter_title": "OF VILLAGE-FORESTS",
      "sections": [
        {
          "section_no": "28",
          "section_title": "Formation of village-forests",
          "body": ""
        }
      ]
    },
    {
      "chapter_title": "OF PROTECTED FORESTS",
      "sections": [
        {
          "section_no": "29",
          "section_title": "Protected forests",
          "body": ""
        },
        {
          "section_no": "30",
          "section_title": "Power to issue notification reserving trees, etc.",
          "body": ""
        }
      ]
    },
    {
      "chapter_title": "OF THE CONTROL OVER FORESTS AND LANDS NOT BEING THE PROPERTY OF GOVERNMENT",
      "sections": [
        {
          "section_no": "35",
          "section_title": "Protection of forests for special purposes",
          "body": ""
        }
      ]
    },
    {
      "chapter_title": "OF THE DUTY ON TIMBER AND OTHER FOREST-PRODUCE",
      "sections": [
        {
          "section_no": "39",
          "section_title": "Power to impose duty on timber and other forest-produce",
          "body": ""
        }
      ]
    },
    {
      "chapter_title": "OF THE CONTROL OF TIMBER AND OTHER FOREST-PRODUCE IN TRANSIT",
      "sections": [
        {
          "section_no": "41",
          "section_title": "Power to make rules to regulate transit of forest produce",
          "body": ""
        }
      ]
    },
    {
      "chapter_title": "OF THE COLLECTION OF DRIFT AND STRANDED TIMBER",
      "sections": [
        {
          "section_no": "45",
          "section_title": "Certain kinds of timber to be deemed property of Government until title thereto proved, and may be collected accordingly",
          "body": ""
        }
      ]
    },
    {
      "chapter_title": "PENALTIES AND PROCEDURE",
      "sections": [
        {
          "section_no": "52",
          "section_title": "Seizure of property liable to confiscation",
          "body": ""
        }
      ]
    },
    {
      "chapter_title": "CATTLE-TRESPASS",
      "sections": [
        {
          "section_no": "70",
          "section_title": "Cattle-trespass Act, 1871, to apply",
          "body": ""
        }
      ]
    },
    {
      "chapter_title": "OF FOREST-OFFICERS",
      "sections": [
        {
          "section_no": "72",
          "section_title": "Provincial Government may invest Forest-officers with certain powers",
          "body": ""
        }
      ]
    },
    {
      "chapter_title": "SUBSIDIARY RULES",
      "sections": [
        {
          "section_no": "76",
          "section_title": "Additional powers to make rules",
          "body": ""
        }
      ]
    },
    {
      "chapter_title": "MISCELLANEOUS",
      "sections": [
        {
          "section_no": "79",
          "section_title": "Persons bound to assist Forest-officers and Police-officers",
          "body": ""
        }
      ]
    }
  ],
  "source_file": "administrator2f7f6b8cfdf87e1119c78768ad083e0c.txt"
}