{
  "error": "Expecting value: line 1 column 1 (char 0)",
  "raw": "THE PAKISTAN STANDARDS AND QUALITY CONTROL AUTHORITY ACT, 1996 CONTENTS CHAPTER I PRELIMINARY 1. Short title, extent and commencement. 2. Definitions. CHAPTER II CONSTITUTION 3. Constitution of the Authority. 4. Management. 5. Constitution of the Board. 6. Advisory Council. 7. Director-General. CHAPTER III POWERS 8. Powers and functions of the Authority. 9. Authentication of orders and other instruments of the Authority. 10. Prohibition of improper use of Authority marks. 11. Prohibition of use of certain names, etc. 12. Prohibition of registration in certain cases. 13. Power to prohibit or restrict export of certain articles. 14. Power to prohibit, manufacture, keeping in stock and sale of certain articles. 15. Inspectors. 16. Power to obtain information, etc. 17. Powers of Authority to other bodies, etc. 18. Appeals. 19. Certain matters to be kept confidential. 20. Penalty for improper use of Authority marks, etc. 21. Penalty for contravention of section 13. 22. Penalty for other contraventions. 23. Cognizance of offences by courts. 24. Protection of action taken under this Act. 25. Power to exempt. 26. Power to make rules. 27. Power to make regulations. CHAPTER IV ESTABLISHMENT 28. Appointment of officers, servants, etc., by the Authority. 29. Appointment of officers, servants etc., by the Director-General in cases of urgency. 30. Members and officers etc., to be public servants. 31. Delegation of powers to the Director-General etc. CHAPTER V FINANCE 32. Funds. 33. Budget. 34. Audit and Accounts. 35. Saving. CHAPTER VI MISCELLANEOUS 36. Submission of yearly reports and returns. 37. Dissolution of the department of Central testing laboratories and the Pakistan Standards Institution. 38. Removal of difficulties. 39. Repeal. THE PAKISTAN STANDARD AND QUALITY CONTROL AUTHORITY ACT, 1996 ACT NO. VI OF 1996 An Act to provide for the establishment of Pakistan Standards and Quality Control Authority WHEREAS it is expedient to establish a Pakistan Standards and Quality Co",
  "source_file": "administratorbf3c739041f23d1715243047f9bab24c.txt",
  "law_name": "The Pakistan Standards and Quality Control Authority Act, 1996",
  "year": 1996
}