{
  "law_name": "THE MINIMUM WAGES ORDINANCE",
  "year": 1961,
  "chapters": [
    {
      "chapter_title": "Contents",
      "sections": [
        {
          "section_no": "1",
          "section_title": "Short title, extent and commencement",
          "body": "(1) This Ordinance may be called the Minimum Wages Ordinance, 1961. (2) It extends to the whole of Pakistan. (3) It shall come into force at once."
        },
        {
          "section_no": "2",
          "section_title": "Definitions",
          "body": "In this Ordinance, unless there is anything repugnant in the subject or context, definitions of terms such as 'adult', 'Board', 'Council', 'employer', 'factory', 'industry', 'juvenile worker', 'wages', and 'worker' are provided."
        },
        {
          "section_no": "3",
          "section_title": "Establishment of Minimum Wages Boards",
          "body": "(1) The Provincial Government shall establish a Minimum Wages Board for the Province consisting of four members appointed by it. (2) The Chairman and independent member shall be appointed from persons with adequate knowledge of industrial, labour and economic conditions. (3) Members representing employers and workers shall be appointed after considering nominations from representative organizations."
        },
        {
          "section_no": "4",
          "section_title": "Recommendation of minimum rates of wages for unskilled and Juvenile workers",
          "body": "(1) A Board shall recommend minimum rates of wages for adult unskilled workers and juvenile workers upon a reference made by the Provincial Government. (2) The Board shall indicate whether the minimum rates should be uniform or have local variations."
        },
        {
          "section_no": "5",
          "section_title": "Recommendation of minimum rates of wages for workers with respect to particular industries",
          "body": "(1) The Provincial Government may direct the Board to recommend minimum rates of wages for workers in particular industries. (2) The Board may specify minimum rates for time work, piece work, overtime work, and work on holidays."
        },
        {
          "section_no": "6",
          "section_title": "Power to declare minimum rates of wages",
          "body": "(1) The Provincial Government may declare minimum rates of wages recommended by the Board. (2) If the recommendation is not equitable, it may refer it back to the Board for reconsideration."
        },
        {
          "section_no": "7",
          "section_title": "Periodical review of minimum rates of wages",
          "body": "(1) The Board shall review its recommendations based on changes in economic conditions and cost of living. (2) No recommendation shall be reviewed earlier than one year from the date it was made."
        },
        {
          "section_no": "8",
          "section_title": "Constitution of the minimum wages council",
          "body": "Details regarding the constitution of the Minimum Wages Council are provided."
        },
        {
          "section_no": "9",
          "section_title": "Prohibition to pay wages at a rate below the minimum rate of wages",
          "body": "It is prohibited to pay wages below the minimum rate of wages declared under this Ordinance."
        },
        {
          "section_no": "10",
          "section_title": "Cognizance of offences",
          "body": "Details regarding the cognizance of offences related to the Ordinance are provided."
        },
        {
          "section_no": "11",
          "section_title": "Protection of the proceedings of a Board or the Council",
          "body": "Details regarding the protection of proceedings of the Board or the Council are provided."
        },
        {
          "section_no": "12",
          "section_title": "Powers of Boards, etc. to collect information",
          "body": "Details regarding the powers of Boards to collect information are provided."
        },
        {
          "section_no": "13",
          "section_title": "Certain powers of Court to Boards, etc.",
          "body": "Details regarding the powers of the Court in relation to Boards are provided."
        },
        {
          "section_no": "14",
          "section_title": "Chairmen, etc. deemed to be public servants",
          "body": "Chairmen and members of the Boards are deemed to be public servants."
        },
        {
          "section_no": "15",
          "section_title": "Bar to legal proceedings",
          "body": "Details regarding the bar to legal proceedings are provided."
        },
        {
          "section_no": "16",
          "section_title": "[Omitted]",
          "body": ""
        },
        {
          "section_no": "17",
          "section_title": "Rules relating to Boards",
          "body": "Details regarding the rules relating to Boards are provided."
        },
        {
          "section_no": "18",
          "section_title": "[Omitted]",
          "body": ""
        }
      ]
    }
  ],
  "source_file": "administrator26a975453aac76e06711066e6c07e718.txt"
}