{
  "error": "Expecting value: line 1 column 1 (char 0)",
  "raw": "THE CHARTERED ACCOUNTANTS ORDINANCE, 1961 PREAMBLE. CHAPTER I. PRELIMINARY 1. Short title, extend and commencement. 2. Definitions. CHAPTER II. THE INSTITUTE OF CHARTERED ACCOUNTANTS OFPAKISTAN 3. Incorporation of the institute. 4. Entry of names in register. 5. Associates and fellows. 6. Certificate of practice. 7. Members to be known as Chartered Accountants. 8. Disabilities. CHAPTER III. COUNCIL OF THE INSTITUTE 9. Constitution of the Council of the Institute. 10. Mode of election to the Council. 11. Nomination in default of election. 12. President and Vice President or Vice-Presidents. 13. Resignation of membership and casual vacancies. 14. Duration and dissolution of Council. 15. Functions of the council. 16. Staff, remuneration and allowances. 17. Finances of the Institute. CHAPTER IV. REGISTER OF MEMBERS 18. Register 19. Removal from the Register. CHAPTER V. REGIONAL COMMITTEES 20. Constitution and functions of Regional Committees. CHAPTER VA. MISCONDUCT 20 A. Facts, etc, to be laid before the Investigation Committee. 20 B. Enquiry by the Investigation Committee. 20 C. Member or student not found guilty. 20 D. Orders by the Council if member found guilty. 20 E. Orders by the Council if student found guilty. 20 F. Hearing of case by the High Court. 20 G. Effect of inquiry 20 H. Council and Investigation Committee to have powers of civil court. 20 I. Publication of findings and decisions. 20 J. Return of certificate. 20 K. Appeal and revision. CHAPTER VI. PENALTIES 21. Penalty for falsely claiming to be a member etc. 22. Penalty for using name of the Council awarding degree of chartered accountancy,etc. 23. Companies not to engage in accountancy. 24. Unqualified persons not to sign documents. 25. Sanction to prosecute. CHAPTER VII. MISCELLANEOUS 26. Maintenance of branch offices. 27. Power to make byelaws. 28. Powers of Federal Government to direct byelaws to be made or to make or amend byelaws 29. References to registered accountants, etc to be construed as re",
  "source_file": "administratorb6470b8aab4926f2943e7870919a09bc.txt",
  "law_name": "The Chartered Accountants Ordinance, 1961",
  "year": 1961
}