{
  "error": "Expecting value: line 1 column 1 (char 0)",
  "raw": "THE WAR INJURIES ORDINANCE, 1941 CONTENTS 1. Short title, extent and commencement 2. Interpretation 3. Power to make schemes for relief in respect of war injuries and war service injuries 4. Relief from liability to pay compensation or damages 5. Information as to earnings 5A. Medical attention in dispensaries and hospitals 6. Penalty for false statement 7. Assignment or charges to be void THE WAR INJURIES ORDINANCE, 1941 1ORDINANCE No. VII OF 1941 [25th July, 1941] An Ordinance to make provision for the grant of relief in respect of certain personal injuries sustained during the continuance of 2[* *] hostilities. WHEREAS an emergency has arisen which renders it necessary to make provision for the grant of relief in respect of certain personal injuries sustained during the continuance of 2[* *] hostilities; Now, THEREFORE, in exercise of the powers conferred by section 72 of the Government of India Act, as set out in the Ninth Schedule to the Government of India Act, 1935, the Governor-General is pleased to make and promulgate the following Ordinance:⸻ 1. Short title, extent and commencement.⸻(1) This Ordinance may be called the War Injuries Ordinance, 1941. 3[(2) It extends to the whole of Pakistan]. (3) It shall come into force at once. 2. Interpretation.-In this Ordinance, unless there is anything repugnant in the subject or context,⸻ (1) “civil defence organization” means any organisation established for civil defence purposes which is declared by a scheme to be a civil defence organisation for the purposes of this Ordinance and the scheme; (2) “civil defence volunteer”, in relation to an injury, means a person certified, by an officer of a civil defence organisation authorised by the 4[Federal Government] to grant such certificates, to have been a member of that organisation at the time the injury was sustained; 5[(3) “continuance of hostilities” means,⸻ (a) in relation to the hostilities during 1939-1945, the period beginning with the commencement of this Ordi",
  "source_file": "administrator3cbae595db7d5550014c8b399de42441.txt",
  "law_name": "The War Injuries Ordinance, 1941",
  "year": 1941
}