{
  "law_name": "THE PRISONERS ACT",
  "year": 1900,
  "chapters": [
    {
      "chapter_title": "PART I PRELIMINARY",
      "sections": [
        {
          "section_no": "1",
          "section_title": "Short title and extent",
          "body": "(1) This Act may be called the Prisoners Act, 1900; (2) It extends to the whole of Pakistan."
        },
        {
          "section_no": "2",
          "section_title": "Definitions",
          "body": "In this Act, unless there is anything repugnant in the subject or context, (a) 'Court' includes a Coroner and any officer lawfully exercising civil, criminal or revenue jurisdiction; and (b) 'prison' includes any place which has been declared by the Provincial Government, by general or special order, to be a subsidiary jail."
        }
      ]
    },
    {
      "chapter_title": "PART II GENERAL",
      "sections": [
        {
          "section_no": "3",
          "section_title": "Officers in charge of prisons to detain persons duly committed to their custody",
          "body": "The officer in charge of a prison shall receive and detain all persons duly committed to his custody, under this Act or otherwise, by any Court, according to the exigency of any writ, warrant or order by which such person has been committed, or until such person is discharged or removed in due course of law."
        },
        {
          "section_no": "4",
          "section_title": "Officers in charge of prisons to return writs, etc., after execution or discharge",
          "body": "The officer in charge of a prison shall forthwith, after the execution of every such writ, order or warrant as aforesaid other than a warrant of commitment for trial, or after the discharge of the person committed thereby, return such writ, order or warrant to the Court by which the same was issued or made, together with a certificate, endorsed thereon and signed by him, showing how the same has been executed, or why the person committed thereby has been discharged from custody before the execution thereof."
        }
      ]
    },
    {
      "chapter_title": "PART IV EXECUTION OF SENTENCES",
      "sections": [
        {
          "section_no": "14",
          "section_title": "References in this part to prisons, etc., to be construed as referring also to Reformatory Schools",
          "body": "In this Part all references to prisons or to imprisonment or confinement shall be construed as referring also to Reformatory Schools or to detention therein."
        },
        {
          "section_no": "15",
          "section_title": "Power of officers in charge of prisons to give effect to sentences of certain Courts",
          "body": "Officers in charge of prisons may give effect to any sentence or order or warrant for the detention of any person passed or issued by any Court or tribunal, whether within or without Pakistan, established by law."
        },
        {
          "section_no": "16",
          "section_title": "Warrant of officer of such Court to be sufficient authority",
          "body": "A warrant under the official signature of an officer of such Court or tribunal as is referred to in section 15 shall be sufficient authority for holding any person in confinement, in pursuance of the sentence passed upon him."
        },
        {
          "section_no": "17",
          "section_title": "Procedure where officer in charge of prison doubts the legality of warrant sent to him for execution under this Part",
          "body": "(1) Where an officer in charge of a prison doubts the legality of a warrant or order sent to him for execution under this Part, or the competency of the person whose official seal or signature is affixed thereto to pass the sentence and issue the warrant or order, he shall refer the matter to the Provincial Government, by whose order on the case he and all other public officers shall be guided as to the future disposal of the prisoner. (2) Pending a reference made under sub-section (1), the prisoner shall be detained in such manner and with such restrictions or mitigations as may be specified in the warrant or order."
        },
        {
          "section_no": "18",
          "section_title": "Execution in the Provinces, etc., of certain capital sentences not ordinarily executable there",
          "body": "(1) Where a Court established by the authority of the Federal Government exercising, in or with respect to territory beyond the limits of Pakistan, jurisdiction which the Government has in such territory, (a) has sentenced any person to death, and, (b) being of opinion that such sentence should, by reason of there being in such territory no secure place for the confinement of such person or no suitable appliances for his execution in a decent and humane manner, be executed in Pakistan, has issued its warrant for the execution of such sentence to the officer in charge of a prison in Pakistan, such officer shall, on receipt of the warrant, cause the execution to be carried out at such place as may be prescribed therein in the same manner and subject to the same conditions in all respects as if it were a warrant duly issued under the provisions of section 381 of the Code of Criminal Procedure, 1898 (V of 1898)."
        }
      ]
    },
    {
      "chapter_title": "PART VIII DISCHARGE OF PRISONERS",
      "sections": [
        {
          "section_no": "33",
          "section_title": "Release, on recognizance, by order of High Court, of prisoner recommended for pardon",
          "body": "Release, on recognizance, by order of High Court, of prisoner recommended for pardon."
        }
      ]
    },
    {
      "chapter_title": "PART IX PROVISIONS FOR REQUIRING THE ATTENDANCE OF PRISONERS AND OBTAINING THEIR EVIDENCE",
      "sections": [
        {
          "section_no": "34",
          "section_title": "References in this Part to prisons, etc., to be construed as referring also to Reformatory Schools",
          "body": "References in this Part to prisons, etc., to be construed as referring also to Reformatory Schools."
        },
        {
          "section_no": "35",
          "section_title": "Power for Civil Courts to require appearance of prisoner to give evidence",
          "body": "Power for Civil Courts to require appearance of prisoner to give evidence."
        },
        {
          "section_no": "36",
          "section_title": "District judge in certain cases to countersign orders made under section 35",
          "body": "District judge in certain cases to countersign orders made under section 35."
        },
        {
          "section_no": "37",
          "section_title": "Power for certain Criminal Court to require attendance of prisoner to give evidence or answer to charge",
          "body": "Power for certain Criminal Court to require attendance of prisoner to give evidence or answer to charge."
        },
        {
          "section_no": "38",
          "section_title": "Order to be transmitted through Magistrate of the district or sub-division in which person is confined",
          "body": "Order to be transmitted through Magistrate of the district or sub-division in which person is confined."
        },
        {
          "section_no": "39",
          "section_title": "Procedure where removal is desired of person confined more than one hundred miles from place where evidence is required",
          "body": "Procedure where removal is desired of person confined more than one hundred miles from place where evidence is required."
        },
        {
          "section_no": "40",
          "section_title": "Persons confined beyond limits of appellate jurisdiction of High Court",
          "body": "Persons confined beyond limits of appellate jurisdiction of High Court."
        },
        {
          "section_no": "41",
          "section_title": "Prisoner to be brought up",
          "body": "Prisoner to be brought up."
        },
        {
          "section_no": "42",
          "section_title": "Power to Government to exempt certain prisoners from operation of this Part",
          "body": "Power to Government to exempt certain prisoners from operation of this Part."
        },
        {
          "section_no": "43",
          "section_title": "Officer in charge of prison when to abstain from carrying out order",
          "body": "Officer in charge of prison when to abstain from carrying out order."
        },
        {
          "section_no": "44",
          "section_title": "Commissions for examination of prisoners",
          "body": "Commissions for examination of prisoners."
        },
        {
          "section_no": "45",
          "section_title": "Commissions for examination of prisoners beyond limits of appellate jurisdiction of High Court",
          "body": "Commissions for examination of prisoners beyond limits of appellate jurisdiction of High Court."
        },
        {
          "section_no": "46",
          "section_title": "Commission how to be directed",
          "body": "Commission how to be directed."
        },
        {
          "section_no": "47",
          "section_title": "Process how served on prisoners",
          "body": "Process how served on prisoners."
        },
        {
          "section_no": "48",
          "section_title": "Process served to be transmitted at prisoner’s request",
          "body": "Process served to be transmitted at prisoner’s request."
        },
        {
          "section_no": "50",
          "section_title": "Deposit of posts",
          "body": "Deposit of posts."
        },
        {
          "section_no": "51",
          "section_title": "Power to make rules under this Part",
          "body": "Power to make rules under this Part."
        },
        {
          "section_no": "52",
          "section_title": "Power to declare who shall be deemed officer in charge of prison",
          "body": "Power to declare who shall be deemed officer in charge of prison."
        }
      ]
    }
  ],
  "source_file": "administrator169829d77aa24cbd19baeb40776f2a89.txt"
}