{
  "error": "Expecting value: line 1 column 1 (char 0)",
  "raw": "THE NEWSPAPER EMPLOYEES (CONDITIONS OF SERVICE) ACT, 1973. CONTENTS 1. Short title, extent and commencement 2. Definitions 3. Order of appointment, etc. 4. Termination of employment 5. Provident Fund 6. Hours of work 7. Leave 8. Medical care 9. Wage Board 10. Fixations of wages 11. Publication of the decision of the Board 12. Decision of Board to be deemed to be an award of the Commission 12A. Tribunal 13. Powers of the Tribunal 13A. Appeal from sentence of Tribunal 13B. Benches of the Tribunal, etc. 14. Powers and procedure of the Board 15. Decision of the Board to be binding on all employers 16. Powers of Board to fix interim rates of wages 16A. Additional power of Board and Tribunal 17. W. P. Ordinance VI of 1968 to apply to newspaper establishment 18. Ordinance XXIII of 1969 to apply to newspaper employees 19. Effect of laws and agreements inconsistent with this Act 20. Inspectors 21. Offences and penalties 21A. Chairman, etc., to be public servants 22. Indemnity 23. Power to make rules 23A. Continuation of powers 24. Repeal and savings THE NEWSPAPER EMPLOYEES (CONDITIONS OF SERVICE) ACT, 1973. 1ACT NO. LVIII OF1973 [11th August, 1973] An Act to repeal and, with certain amendments, re-enact the Working Journalists (Conditions of Service) Ordinance, 1960. WHEREAS it is expedient to repeal and, with certain amendments, re-enact the Working Journalists (Conditions of Service) Ordinance, 1960; It is hereby enacted as follows:― 1. Short title, extent and commencement.―(1) This Act may be called the Newspaper Employees (Conditions of Service) Act 1973. (2) It extends to the whole of Pakistan. (3) It shall come into force at once. 2. Definitions. In this Act, unless there is anything repugnant in the subject or context, (a) “Board” means the Wage Board constituted under section 9; (b) “Commission” means the National Industrial Relations Commission constituted under section 22A of the Ordinance; (c) “newspaper” means any printed periodical work containing public news or",
  "source_file": "administrator3d1271e37c7e9c01a3f6f0976552bc91.txt",
  "law_name": "The Newspaper Employees (Conditions of Service) Act, 1973",
  "year": 1973
}