{
  "error": "Expecting value: line 1 column 1 (char 0)",
  "raw": "THE PAKISTAN NATIONAL SERVICE ORDINANCE, 1970 CONTENTS 1. Short title, extent, application and commencement 2. Definitions 3. National service liability, etc. 4. Deferment of liability to render national service 5. Selection and enrolment, etc. 6. National Service Reserve 7. Refresher training 8. Service in Defence Services 8A. Service of notice 9. Certificate to granted 10. Permission to leave Pakistan necessary 11. Extension of age limit 12. Employers not to employ certain persons 13. Obligations of employers of persons in the Reserve 14. Penalty 15. Power to make rules 16. Jurisdiction of courts barred. THE PAKISTAN NATIONAL SERVICE ORDINANCE, 1970 *ORDINANCE NO. XXII OF 1970 [7th November, 1970] An Ordinance to introduce compulsory national service in Pakistan WHEREAS it is expedient to introduce compulsory national service in Pakistan and to provide for matters ancillary thereto; NOW, THEREFORE, in pursuance of the Proclamation of the 25th day of March, 1969, read with the Provisional Constitution Order, and in exercise of all powers enabling him in that behalf, the President is pleased to make and promulgate the following Ordinance: 1. Short title, extent, application and commencement. (1) This Ordinance may be called the Pakistan National Service Ordinance, 1970. (2) It extends to the whole of Pakistan and applies to all citizens of Pakistan wherever they may be. (3) It shall come into force on such 1day as the 2[Federal Government] may, by notification in the official Gazette, appoint in this behalf. 2. Definitions. In this Ordinance, unless there is anything repugnant in the subject or context, (a) “emoluments”, in relation to a person, includes the pay, allowances, gratuity, fees, commissions, perquisites and profits which such person is entitled to receive from his employer for his services; (b) “employer” means any person or body of persons, whether incorporated or not, who or which employs another person for hire or reward, either directly or through a ",
  "source_file": "administrator26067ba220b033040ae07ffdeced81c9.txt",
  "law_name": "The Pakistan National Service Ordinance, 1970",
  "year": 1970
}