{
  "error": "Expecting value: line 1 column 1 (char 0)",
  "raw": "THE TERRITORIAL WATERS AND MARITIME ZONES ACT, 1976 CONTENTS 1. Short title and commencement 2. Territorial waters 3. Use of territorial waters by foreign ships 4. Contiguous Zone 5. Continental Shelf 6. Exclusive Economic Zone 7. Historic waters 8. Maritime boundaries between Pakistan and States having coasts opposite or adjacent to those of Pakistan 9. Publication of charts 10. Offences 11. Offences by companies 12. Place of trial 13. Previous sanction of the Federal Government for Prosecution 14. Power to make rules THE TERRITORIAL WATERS AND MARITIME ZONES ACT, 1976 1ACT No. LXXXII OF 1976 [31st December, 1976] An Act to provide for the declaration of the territorial waters and maritime zones of Pakistan. WHEREAS it is expedient to provide for the declaration of the territorial waters and maritime zones of Pakistan and for matters connected therewith ; It is hereby enacted as follows: 1. Short title and commencement. This Act may be called the Territorial Waters and Maritime Zones Act, 1976. (2) It shall come into force at once. 2. Territorial waters. (1) The sovereignty of Pakistan extends and has always extended to the territorial waters of Pakistan, hereinafter referred to as the territorial waters, as well as to the air space over, and the bed and subsoil of, such waters. (2) The limit of the territorial waters is twelve nautical miles beyond the land territory and internal waters of Pakistan measured from the baseline. (3) The baseline from which such limit shall be measured and the waters on the landward side of which shall form part of the internal waters of Pakistan shall be specified by the Federal Government by notification in the official Gazette. (4) Where a single island, rock or a composite group thereof constituting a part of the territory of Pakistan is situated off the main coast, the baseline referred to in sub-section (3) shall be drawn along the outer seaward limits of such island, rock of composite group. 3. Use of territorial waters by fore",
  "source_file": "administrator401f8aa04201fe132c0cd002e9fb451c.txt",
  "law_name": "The Territorial Waters and Maritime Zones Act, 1976",
  "year": 1976
}