{
  "error": "Expecting value: line 1 column 1 (char 0)",
  "raw": "The Pakistan Veterinary Medical Council Act 1996. CONTENTS 1. Short title, extent and commencement 2. Definition 3. Composition and incorporation of the Council 4. Terms of office of member of Council 5. President and Vice President 6. Executive Committee 7. Officers and Servants of the Council 8. Terms and conditions of the officers, etc. of the Council 9. Recognition of Veterinary and Animal Husbandry qualifications granted by Veterinary Institutions in Pakistan 10. Non Pakistan veterinary qualifications in Second Schedule to be recognized 11. Arrangement for modifying the Second Schedule 12. Power of the Council to certify certain persons to be possessed to sufficient qualifications 13. Power to required information as to courses of study and examination 14. Inspection of examination 15. Withdrawal of recognition 16. Maintenance of register 17. Register to be public document 18. Penalty for fraudulent representation or registration 19. Privileges of registered members 20. Responsibility of a registered person 21. Prohibition against use of unregistered veterinary qualification 22. Removal of names from the register 23. Power to make regulations 24. Information to be furnished by the Council and publication thereof 25. Commission of inquiry The Pakistan Veterinary Medical Council Act 1996. ACT No. III OF 1996 An act to constitute the Veterinary Medical Council in Pakistan. Whereas it is expedient to regulate the registration, practice and conduct of the veterans to establish uniform standards of basic and higher qualifications in veterinary medicine and surgery and to constitute a Pakistan Veterinary Medical Council: It is hereby enacted as follow:- 1. Short title, extent and commencement:-(1) This Act may be called the Pakistan Veterinary Medical Council Act 1996. (2) It extends to the whole of Pakistan. (3) It shall come into force at once. 2. Definition:- In this Act unless there is anything repugnant in the subject or context.- (a) “Council” means the Pakistan",
  "source_file": "administratorac84fec38cbdff67dd3898bd38c30673.txt",
  "law_name": "The Pakistan Veterinary Medical Council Act 1996",
  "year": 1996
}