{
  "error": "Expecting value: line 1 column 1 (char 0)",
  "raw": "THE CONCILIATION COURTS ORDINANCE, 1961 CONTENTS PREAMBLE 1. Short title, extent and commencement 2. Definitions 3. Cases referable to conciliation 4. Application for constitution of a Conciliation Court 5. Conciliation Courts, their composition, etc 6. Jurisdiction of Conciliation Courts, etc 7. Power of Conciliation courts towards compensation 8. Finality of the decisions of Conciliation Courts 9. Enforcement of decree 10. Procedure on failure of conciliation 11. Power of Conciliation Courts to summon witnesses, etc 12. Contempt of Conciliation Courts 13. Recovery of fine 14. Limitation, etc, in certain cases 15. Procedure 16. No appearance through counsel 17. Transfer of certain cases 18. Investigation by police 19. Pending cases 20. Power to exempt 21. Power to make rules SCHEDULE PART I Section A-Criminal cases PART II Section B-Criminal cases THE CONCILIATION COURTS ORDINANCE, 1961. 1ORDINANCE NO. XLIV OF 1961 [28th November, 1961] An Ordinance to make provision for the establishment of Conciliation Courts. WHEREAS it is expedient to make provision for the establishment of Conciliation Courts to enable people to settle certain disputes through conciliation, and for matters connected therewith; NOW, THEREFORE, in pursuance of the Proclamation of the seventh day of October, 1958, and in exercise of all powers enabling him in that behalf the President is pleased to make and promulgate the following Ordinance:- 1. Short title, extent and commencement.- (1) This Ordinance may be called the Conciliation Courts Ordinance, 1961. (2) It extends to the whole of Pakistan. (3) It shall come into force on such date2 as the 3[Federal Government] may, by notification in the Official Gazette, appoint in this behalf. 2. Definitions.- In this Ordinance, unless there is anything repugnant in the subject or context,- (a) “cognizable offence” means a cognizable offence as defined in section 4 of the Code of Criminal Procedure, 1898 (Act V of 1898); (b) “Conciliation Court” means a",
  "source_file": "administratorf161addf2835d80f9c3e460daa990828.txt",
  "law_name": "The Conciliation Courts Ordinance, 1961",
  "year": 1961
}