{
  "law_name": "THE NATIONAL GUARDS ACT",
  "year": 1973,
  "chapters": [
    {
      "chapter_title": "PRELIMINARY",
      "sections": [
        {
          "section_no": "1",
          "section_title": "Short title, application and commencement.",
          "body": "(1) This Act may be called the National Guards Act, 1973. (2) It extends to the whole of Pakistan and applies to all persons subject to this Act, wherever they may be. (3) It shall come into force at once: Provided that nothing in this Act shall be deemed to authorize the punishment of any person for any act or omission which was not punishable before the 24th day of December, 1973."
        },
        {
          "section_no": "2",
          "section_title": "Persons subject to this Act.",
          "body": "(1) Every person enrolled in the Mujahid Force or the Janbaz Force and every person who was subject to the Mujahid Force Ordinance, 1965 (XXII of 1965), immediately before the commencement of this Act, shall be subject to this Act wherever he may be and shall remain so subject until his discharge in accordance with this Act."
        },
        {
          "section_no": "3",
          "section_title": "Constituents of National Guards.",
          "body": "The following four types of forces shall constitute the National Guards, namely: (a) the Mujahid Force; (b) the Janbaz Force."
        },
        {
          "section_no": "4",
          "section_title": "Definitions.",
          "body": "In this Act, unless there is anything repugnant in the subject or context, various definitions are provided for terms such as 'Board', 'college', 'commanding officer', 'Director-General', 'employer', 'enrolled', 'Force', 'junior commissioned officer', 'non-commissioned officer', 'officer', 'prescribed', 'regulations', 'rules', and 'unit'."
        }
      ]
    },
    {
      "chapter_title": "CONSTITUTION AND CONTROL OF THE MUJAHID FORCE",
      "sections": [
        {
          "section_no": "5",
          "section_title": "Constitution of Mujahid Force.",
          "body": "There shall be raised and maintained, in accordance with the provisions of this Act, a force to be designated the Mujahid Force."
        },
        {
          "section_no": "6",
          "section_title": "Constitution and disbandment of units.",
          "body": "The Federal Government, or any officer or authority empowered by it in this behalf, may constitute one or more units of the Mujahid Force to be recruited from persons residing in Pakistan and may disband or reconstitute any unit so constituted."
        },
        {
          "section_no": "7",
          "section_title": "Personnel of the Mujahid Force.",
          "body": "(1) There shall be the following classes of personnel in the Mujahid Force, namely: (a) officers holding commissions in the Force granted by the President; (b) junior commissioned officers holding commissions in the Force granted by the Chief of the Army Staff; (c) non-commissioned officers appointed as such by the respective commanding officers; and (d) Mujahids. (2) An officer or a junior commissioned officer shall be deemed to be enrolled in the Force for so long as he holds commission therein."
        },
        {
          "section_no": "8",
          "section_title": "Enrolment.",
          "body": "(1) Every male citizen of Pakistan who is of such age as may be prescribed may offer himself for enrolment in the Mujahid Force for service in any unit and any such person who satisfies the conditions laid down in the regulations may be enrolled for such period and in such manner as may be prescribed. (2) Every person enrolled shall, without unnecessary delay, be appointed to a unit in which he has applied for service."
        },
        {
          "section_no": "9",
          "section_title": "Transfer and attachment.",
          "body": "Notwithstanding anything contained in section 8, any person appointed to a unit may (a) with his consent, be transferred, whether on disbandment of the unit or otherwise, to another unit in such manner as may be prescribed; and (b) at his request, be attached to another unit."
        }
      ]
    },
    {
      "chapter_title": "CONSTITUTION AND CONTROL OF THE JANBAZ FORCE",
      "sections": [
        {
          "section_no": "10",
          "section_title": "Constitution of Janbaz Force.",
          "body": "There shall be raised and maintained, in accordance with the provisions of this Act, a force to be designated the Janbaz Force."
        },
        {
          "section_no": "11",
          "section_title": "Constitution and disbandment of Unit.",
          "body": "The Federal Government, or any officer or authority empowered by it in this behalf, may constitute for any division or district one or more units to be recruited from persons residing in such division or district and may disband or reconstitute any unit so constituted."
        },
        {
          "section_no": "12",
          "section_title": "Personnel of Janbaz Force.",
          "body": "(1) There shall be the following classes of personnel in the Janbaz Force, namely: (a) officers holding commissions in the Force granted by the President; (b) junior commissioned officers holding commissions in the Force granted by the Chief of the Army Staff; (c) non-commissioned officers appointed as such by the respective commanding officers; and (d) Janbazes. (2) An officer or a junior commissioned officer shall be deemed to be enrolled in the Force for so long as he holds commission therein."
        },
        {
          "section_no": "13",
          "section_title": "Enrolment.",
          "body": "(1) Any male citizen of Pakistan who is of such age as may be prescribed may offer himself for enrolment in the Janbaz Force for service in the unit constituted for the division or district in which he resides and any such person who satisfies the conditions laid down in the regulations may be enrolled for such period and in such manner as may be prescribed. (2) Every person enrolled shall, without unnecessary delay, be appointed to a unit in which he has applied for service."
        },
        {
          "section_no": "14",
          "section_title": "Transfer and attachment.",
          "body": "Notwithstanding anything contained in section 13, any person appointed to a unit may (a) with his consent, be transferred, whether on disbandment of the unit or otherwise, to another unit in such manner as may be prescribed; (b) at his request, be attached to another unit; and (c) at his request, be employed for duties outside the division or district from which he is recruited."
        }
      ]
    },
    {
      "chapter_title": "PROVISIONS APPLICABLE GENERALLY TO THE MUJAHID FORCE AND THE JANBAZ FORCE",
      "sections": [
        {
          "section_no": "15",
          "section_title": "Liability for military training.",
          "body": "(1) The persons referred to in sub-section (1) of section 2 shall be liable to be called up for training and, for the purpose of such training, their command and control shall be regulated according to the orders of the Director General or any authority empowered by him in this behalf. (2) For calling up a person under sub-section (1) it shall be sufficient to broadcast or telecast over the Radio or Television or to publish in the newspapers a notice requiring such person, or the class of persons to which he belongs, to report to such authority and all such time and place as may be specified in the notices."
        },
        {
          "section_no": "16",
          "section_title": "Liability to serve and perform embodied service.",
          "body": "(1) Every person referred to in sub-section (1) of section 2 shall be liable to serve in any unit to which he has been appointed or transferred or is for the time being attached and shall be subject to all rules and regulations. (2) Every such person shall be liable to perform (a) service when called out with any portion of the Force by an order of the Director-General or any officer or authority empowered by him in this behalf, either to act in support of the civil power or departments or agencies of Government engaged in nation building activities or development programmes or to provide guards which, in the opinion of such officer or authority, are essential, or (b) military service when the unit to which he belongs has been embodied to support or supplement the Pakistan Army by an order, directing such embodiment, of the Federal Government, or an authority empowered by it in this behalf. (3) For calling out a person under sub-section (2), it shall be sufficient to broadcast or telecast over the Radio or Television and to publish in the newspapers a notice requiring such person, or the class of persons to which he belongs, to report to such authority and at such time and place as may be specified in the notice."
        },
        {
          "section_no": "17",
          "section_title": "Discharge.",
          "body": "(1) Every person enrolled shall be entitled to discharge in accordance with the provisions of this Act."
        }
      ]
    },
    {
      "chapter_title": "MISCELLANEOUS",
      "sections": [
        {
          "section_no": "36",
          "section_title": "Regrant of Commissions.",
          "body": ""
        },
        {
          "section_no": "36A",
          "section_title": "Re-employment of officers having reserve liability.",
          "body": ""
        },
        {
          "section_no": "37",
          "section_title": "Provision of storage accommodation.",
          "body": ""
        },
        {
          "section_no": "38",
          "section_title": "Employer not to prevent employee from getting enrolled.",
          "body": ""
        },
        {
          "section_no": "39",
          "section_title": "Power to make rules.",
          "body": ""
        },
        {
          "section_no": "40",
          "section_title": "Power to make regulations.",
          "body": ""
        },
        {
          "section_no": "40A",
          "section_title": "Rules and regulations to have retrospective effect.",
          "body": ""
        },
        {
          "section_no": "41",
          "section_title": "Repeal.",
          "body": ""
        }
      ]
    }
  ],
  "source_file": "administratord6e6b4be928d501164ee8af487fa6d3e.txt"
}