{
  "law_name": "THE WEIGHTS AND MEASURES (INTERNATIONAL SYSTEM) ACT",
  "year": 1967,
  "chapters": [
    {
      "chapter_title": "Contents",
      "sections": [
        {
          "section_no": "1",
          "section_title": "Short title, extent and commencement",
          "body": "This Act may be called the Weights and Measures International system Act, 1967. It extends to the whole of Pakistan. It shall come into force on such date as the Federal Government may, by notification in the official Gazette, appoint."
        },
        {
          "section_no": "2",
          "section_title": "Definitions",
          "body": "In this Act, unless there is anything repugnant in the subject or context, various definitions are provided for terms such as 'ampere', 'Assistant Controller', 'candela', 'commercial weight or measure', 'Controller', 'Deputy Controller', and others."
        },
        {
          "section_no": "3",
          "section_title": "Certain units of measure",
          "body": "The unit of electric current shall be an ampere. The unit of luminous intensity shall be a candela."
        },
        {
          "section_no": "4",
          "section_title": "Scale of temperature",
          "body": "The kelvin, unit of thermodynamic temperature, is the fraction 1/273.16 of the thermodynamic temperature of the triple point of water."
        },
        {
          "section_no": "5",
          "section_title": "Certain primary units of measure",
          "body": "The primary unit of mass shall be a kilogram. The primary unit of length shall be a metre. The primary unit of area shall be the square metre. The primary unit of volume shall be the cubic metre. The primary unit of capacity shall be a litre. The primary unit of time shall be a second."
        },
        {
          "section_no": "6",
          "section_title": "National prototype of certain primary units",
          "body": "The Federal Government shall cause to be prepared a national prototype of the kilogram and the metre and shall deposit the same in such custody and at such place as it may deem fit."
        },
        {
          "section_no": "7",
          "section_title": "Secondary units of measure",
          "body": "The Federal Government may, by notification in the official Gazette, declare the magnitude and denomination of such units of measure as it deems fit to be the secondary units of measure under this Act."
        },
        {
          "section_no": "8",
          "section_title": "Standard of measure",
          "body": "The primary units of measure and the secondary units of measure declared under this Act shall be the standards of measure."
        },
        {
          "section_no": "9",
          "section_title": "Conversion of existing weights and measures into standard of measure",
          "body": "The value expressed in terms of any weight or measure may be converted into the value expressed in terms of the appropriate standard of measure at the rates specified in the First Schedule."
        },
        {
          "section_no": "10",
          "section_title": "Reference standards",
          "body": "The Federal Government shall cause to be prepared sets of standards of measure specified in sub-section (1) of Section 8, called reference standards."
        },
        {
          "section_no": "11",
          "section_title": "Secondary standards",
          "body": "For the purpose of verifying the correctness of the working standards, the Federal Government shall prepare secondary standards."
        },
        {
          "section_no": "12",
          "section_title": "Working standards",
          "body": "Working standards shall be prepared for the purpose of verification."
        },
        {
          "section_no": "13",
          "section_title": "Standard weighing and measuring instruments",
          "body": "Standard weighing and measuring instruments shall be defined."
        },
        {
          "section_no": "13A",
          "section_title": "Working weighing and measuring instruments",
          "body": "Working weighing and measuring instruments shall be defined."
        },
        {
          "section_no": "14",
          "section_title": "Appointment of Controllers, Inspectors, etc.",
          "body": "The Federal Government shall appoint Controllers, Inspectors, and other officials as necessary."
        },
        {
          "section_no": "15",
          "section_title": "Verification and stamping by inspectors",
          "body": "Inspectors shall verify and stamp weights and measures."
        },
        {
          "section_no": "16",
          "section_title": "Power to inspect and verify (working standards and working instruments)",
          "body": "Inspectors shall have the power to inspect and verify working standards and instruments."
        },
        {
          "section_no": "22",
          "section_title": "Prohibition of use of weights and measures other than standard weights and measures",
          "body": "The use of weights and measures other than standard weights and measures is prohibited."
        },
        {
          "section_no": "24",
          "section_title": "Power to direct the use of weights only, or measures only, in certain areas",
          "body": "The Federal Government may direct the use of weights or measures in certain areas."
        },
        {
          "section_no": "32",
          "section_title": "Validity of weights and measures duly stamped",
          "body": "Weights and measures that are duly stamped shall be considered valid."
        },
        {
          "section_no": "34",
          "section_title": "Limits of error to be tolerated in weights and measures",
          "body": "Limits of error in weights and measures shall be specified."
        },
        {
          "section_no": "36",
          "section_title": "Indemnity",
          "body": "Provisions for indemnity shall be established."
        },
        {
          "section_no": "37",
          "section_title": "Cognizance of offences",
          "body": "Offences under this Act shall be cognizable."
        },
        {
          "section_no": "39",
          "section_title": "Power to exempt",
          "body": "The Federal Government may grant exemptions."
        },
        {
          "section_no": "40",
          "section_title": "Delegation of powers",
          "body": "Powers under this Act may be delegated."
        },
        {
          "section_no": "41",
          "section_title": "Power to make rules",
          "body": "The Federal Government shall have the power to make rules."
        },
        {
          "section_no": "42",
          "section_title": "Repeal",
          "body": "Previous laws inconsistent with this Act shall be repealed."
        }
      ]
    }
  ],
  "source_file": "administrator73bab03e326bc445d88192ab8cbc16e7.txt"
}