{
  "error": "Expecting value: line 1 column 1 (char 0)",
  "raw": "THE PUBLIC HEALTH (EMERGENCY PROVISIONS) ORDINANCE, 1944 CONTENTS 1. Short title, extent and commencement 2. Definitions 3. Power to require local authorities to take health measures 4. Powers to appoint additional health staff 5. Power of superintendence 6. Power to take over administration of services 7. Water supply 8. Power to give directions 9. Power to supersede local authorities 10. Power to modify rules, bye-laws, etc. 11. Power to make rules 12. Certain persons deemed to be public servants 13. Protection of action taken under this Ordinance 14. Effect of other laws THE PUBLIC HEALTH (EMERGENCY PROVISIONS) ORDINANCE, 1944. ORDINANCE No. XXI OF 1944 [20th May, 1944] An Ordinance to make special provisions in regard to public health. WHEREAS an emergency has arisen which renders it necessary to make special provision for preventing the spread of human disease, safeguarding the public health and providing and maintaining adequate medical services and other services essential to the health of the community; Now, THEREFORE, in exercise of the powers conferred by section 72 of the Government of India Act (26) Geo 5,c. 2.), as set out in the Ninth Schedule to the Government of India Act, 1935, the Governor General is pleased to make and promulgate the following Ordinance :- 1. Short title, extent and commencement.-(1) This Ordinance may be called the Public Health (Emergency Provisions) Ordinance, 1944. 1[(2) It extends to the whole of Pakistan]. (3) It shall come into force at once. 2. Definitions. In this Ordinance, unless there is anything repugnant in the subject or context, - (a) “appropriate Government” means in relation to cantonment authorities and to port authorities in major ports, the 3[Federal Government], and in relation to all other local authorities, the Provincial Government; (b) “local area” means the area within which a local authority exercises its functions ; (c) “local authority” in this section and sections 7 to 10 and 14 includes, any body, w",
  "source_file": "administrator6279ee5af21b73b01b433d6b2121190d.txt",
  "law_name": "The Public Health (Emergency Provisions) Ordinance, 1944",
  "year": 1944
}