{
  "error": "Expecting value: line 1 column 1 (char 0)",
  "raw": "THE COTTON CESS ACT, 1923 CONTENTS 1. Short title and extent. 2. Definitions. 3. Imposition of Cotton Cess. 4. Constitution of Pakistan Central Cotton Committee. 5. [Omitted]. 6. Delivery of monthly returns. 7. Collection of cess by Collector. 8. Collection of cess on exported cotton. 9. Finality of assessment and recovery of unpaid cess. 10. Power to inspect mills and take copies of records and accounts. 11. Information acquired to be confidential. 12. Application of proceeds of cess. 12A. [Omitted]. 13. Validation. 14. Dissolution of Committee. 15. Power of the Federal Government to make rules. 16. Power of the Committee to make rules. 17. Publications of rules. THE COTTON CESS ACT, 1923 1ACT No. XIV of 1923 [16th March, 1923] An Act to provide for the creation of a fund for the improvement and development of the growing, marketing and manufacture of cotton 2* *. WHEREAS it is expedient to provide for the creation of a fund to be expended by a Committee specially constituted in this behalf for the improvement and development of the growing, marketing and manufacture of cotton 2* * It is hereby enacted as follows:― 1. Short title and extent. -(1) This Act may be called the 3* Cotton Cess Act, 1923. 4[(2) It extends to the whole of Pakistan.] 2. Definitions. In this Act, unless there is anything repugnant in the subject or context,- (a) “Collector” means, in reference to cotton consumed in a mill in 5[Pakistan], the Collector of the district in which the mill is situated 6[or any other officer appointed by the 7[Federal Government] to perform the duties of a collector under this Act]; (b) “the Committee” means the 8[Pakistan Central Cotton Committee] constituted under this Act; (c) “cotton” means raw cotton, whether baled or loose, which has been ginned; 9[(d) “Collector of Customs” means an officer appointed as such under section 3 of the Customs Act, 1969 (IV of 1969); (dd) “Customs airport” and “customs-port” mean, respectively, a customs- air-port and customs po",
  "source_file": "administrator22a7cbe4feb13c97121968c20d606d55.txt",
  "law_name": "The Cotton Cess Act, 1923",
  "year": 1923
}