{
  "law_name": "THE NEWSPRINT CONTROL ORDINANCE",
  "year": 1971,
  "chapters": [
    {
      "chapter_title": "Contents",
      "sections": [
        {
          "section_no": "1",
          "section_title": "Short title, extent and commencement.",
          "body": "(1) This Ordinance may be called the Newsprint Control ordinance, 1971. (2) It extends to the whole of Pakistan. (3) It shall come into force at once."
        },
        {
          "section_no": "2",
          "section_title": "Ordinance to override other laws.",
          "body": "This Ordinance shall have effect notwithstanding anything to the contrary contained in the Price Control and Prevention of Profiteering and Hoarding Act, 1977 (XIXX of 1977) or any order or other instrument made or issued thereunder or any other law for the time being in force."
        },
        {
          "section_no": "3",
          "section_title": "Definitions.",
          "body": "In this Ordinance, unless there is anything repugnant in the subject or context, (a) “daily newspaper” means a newspaper which is published not less than five days a week; (b) “newspaper” means any publication printed on newsprint and published at regular intervals of not more than a month; and (c) “newsprint” means printing paper, white or coloured, in reels or in sheets, unsized or soft sized, the fiber content of which comprises not less than 70 per cent of mechanical wood pulp and which weights between 50 to 54 grams per square meter."
        },
        {
          "section_no": "4",
          "section_title": "Regulation of use of newsprint etc.",
          "body": "Except with the prior permission in writing of the Federal Government, no person shall: (a) use newsprint for printing of publishing any newspaper started after the commencement of this Ordinance; (b) use newsprint for printing or publishing any newspaper in excess of such quantity as the Federal Government may, by general or special order, prescribe in respect of such newspaper; or (c) use newsprint for printing or publishing any book, pamphlet, poster or other thing which is not a newspaper."
        },
        {
          "section_no": "5",
          "section_title": "Dealing in newsprint.",
          "body": "(1) The Federal Government may, by notification in the official Gazette, specify the dealers who shall be approved dealers of newsprint for the purposes of this Ordinance. (2) Subject to an order under sub-section (3), upon the issue of a notification under sub-section (1), no dealer shall, except with the prior permission in writing of the Federal Government, sell or dispose of newsprint to any person other than: (a) an approved dealer; or (b) a person who requires the newsprint (i) for printing or publishing any newspaper started before the commencement of this Ordinance, or (ii) for printing or publishing any newspaper started after the commencement of this Ordinance, where the use of newsprint for printing or publishing such newspaper has been permitted under clause (a) of section 4, or (iii) for printing or publishing any book, pamphlet, poster or other thing which is not a newspaper, where the use of newsprint for such printing or publishing has been permitted under clause (c) of section 4. (3) The Federal Government may, by order in writing, require any dealer to sell to such person as is referred to in clause (b) of sub-section (2) such quantity of newsprint as may be specified in the order and may issue and incidental or supplementary instructions in regard to such sale."
        },
        {
          "section_no": "6",
          "section_title": "Fixation of price.",
          "body": "(1) The Federal Government may, by notification in the official Gazette, fix the maximum price above which newsprint shall not be sold and different prices may be fixed for different localities for different varieties of newsprint or for newsprint of different origins. (2) No person shall buy or sell or offer to buy or sell newsprint at a price above the maximum price fixed under subsection (1)."
        },
        {
          "section_no": "7",
          "section_title": "Declaration of stock held.",
          "body": "Every dealer and every person holding stocks of newsprint shall, within a period of seven days from the commencement of this Ordinance, submit to the Federal Government or an officer authorised by it in this behalf a declaration of the stocks of newsprint held by him at such commencement."
        },
        {
          "section_no": "8",
          "section_title": "Declaration by importer.",
          "body": "Every importer of newsprint shall, within seven days of the clearance of the newsprint from Customs, submit to the Federal Government or an officer authorised by it is this behalf a declaration specifying the particulars of newsprint so cleared by him or on his behalf."
        },
        {
          "section_no": "9",
          "section_title": "Maintenance of records of sale, etc.",
          "body": "The Federal Government may direct a dealer or an importer or a person using newsprint to maintain records of all sales, purchases, imports and uses of newsprint and may prescribe the form in which such record shall be maintained."
        },
        {
          "section_no": "10",
          "section_title": "Power to call for information, etc.",
          "body": "(1) The Federal Government may require the proprietor of, or any other person concerned with, any printing press or newspaper, daily newspaper, book, pamphlet or poster or any person carrying on or concerned with any business or undertaking which involves the sales, distribution, storage or use of newsprint, to give any information in his possession or within his knowledge with respect to any transaction relating to newsprint, and the person so required shall give the required information to the best of his knowledge and belief. (2) No person shall mutilate, deface, tamper with, conceal or destroy any book or document relating to any transaction referred to in sub-section (1). (3) The Federal Government may, by order in writing, authorise any officer or other person, to inspect any books or documents referred to in sub-section (2) in the possession of any of the persons referred to in sub-section (1) and such person shall, whenever required to do so, permit the inspection to be made without any hindrance, evasion or concealment. (4) The Federal Government may, by order in writing, authorise any officer or other person to enter and search or cause to be entered and searched any premises, or place where he has reason to believe that anything in contravention of this Ordinance has taken place or is likely to take place, and such officer or person may seize any newsprint or other articles in respect of which he has reason to believe that any such contravention has been committed or is about to be committed."
        },
        {
          "section_no": "11",
          "section_title": "Penalty.",
          "body": "Whoever contravenes any provision of this Ordinance or of any order made, notification issued or direction given under this Ordinance shall be punishable with imprisonment for a term which may extend to three years, or with fine, or with both."
        },
        {
          "section_no": "12",
          "section_title": "Delegation of powers.",
          "body": "The Federal Government may, by order in writing, direct that any of its powers and functions under this Ordinance shall, in relation to such matters and subject to such conditions, if any, as may be specified in the order, be exercisable also by an officer specified in the order."
        }
      ]
    }
  ],
  "source_file": "administratored344512ee8880c806252ff508032c93.txt"
}