{
  "law_name": "THE OIL SEEDS COMMITTEE ACT",
  "year": 1946,
  "chapters": [
    {
      "chapter_title": "Contents",
      "sections": [
        {
          "section_no": "1",
          "section_title": "Short title and extent",
          "body": "This Act may be called the Oilseeds Cesses Act, 1946. It extends to the whole of Pakistan."
        },
        {
          "section_no": "2",
          "section_title": "Definitions",
          "body": "In this Act, unless there is anything repugnant in the subject or context, 'Collector' means the officer appointed by the Federal Government to perform in any specified area the duties of a Collector under the provisions of this Act and the rules made thereunder, and includes any officer subordinate to that officer whom he may by order in writing authorise to perform his duties under those provisions. 'Grower' means an agriculturist who grows oilseeds, with or without the aid of hired labour. 'Mill' means any place in which oilseeds are crushed with the aid of power, which is a factory as defined in section 2 of the Factories Act, 1934. 'Oilseeds' does not include coconuts. 'Prescribed' means prescribed by rules made under this Act."
        },
        {
          "section_no": "3",
          "section_title": "Imposition of oilseeds cess",
          "body": "There shall be levied and collected on and after the date of the commencement of this Act as cesses for the purposes of this Act, on all oils extracted from oilseeds crushed in any mill in Pakistan, whether the oilseeds are produced in or imported from outside Pakistan, a duty of excise at the rate of one anna per maund, and on all oilseeds exported out of Pakistan, to a destination outside Pakistan, a duty of customs at the rate of two annas per maund."
        },
        {
          "section_no": "10",
          "section_title": "Delivery of monthly returns",
          "body": "The owner of every mill shall furnish to the Collector, on or before the 7th day of each month, a return stating the total amount of oils extracted in the mill during the preceding month, together with such further information in regard thereto as may be prescribed."
        },
        {
          "section_no": "11",
          "section_title": "Collection of duty of excise",
          "body": "On receiving any return made under section 10, the Collector shall assess the amount of the duty of excise payable under section 3 in respect of the period to which the return relates."
        },
        {
          "section_no": "12",
          "section_title": "Finality of assessment and recovery of unpaid duty of excise",
          "body": "Any owner of a mill who is aggrieved by an assessment made under section 11 may, within three months of service of the notice referred to in sub-section (1) of that section, apply to the District Judge for the cancellation or modification of the assessment."
        },
        {
          "section_no": "13",
          "section_title": "Power to inspect mills and take copies of records and accounts",
          "body": "The Collector or any officer empowered by general or special order of the Federal Government in this behalf shall have free access at all reasonable times during working hours to any mill or to any part of any mill."
        },
        {
          "section_no": "14",
          "section_title": "Information acquired to be confidential",
          "body": "All such copies and extracts and all information acquired by a Collector or any other officer from an inspection of any mill or warehouse or from any return submitted under this Act shall be treated as confidential."
        },
        {
          "section_no": "17",
          "section_title": "Power of the Federal Government to make rules",
          "body": "The Federal Government may, after previous publication, make rules for the purpose of carrying into effect the provisions of this Act."
        },
        {
          "section_no": "17A",
          "section_title": "Penalty for contravention of rules",
          "body": "Rules made under section 17 may provide that a breach of any of them shall be punishable with fine not exceeding one thousand rupees."
        },
        {
          "section_no": "19",
          "section_title": "Publication of rules and regulations",
          "body": "All rules made under section 17 shall be published in the official Gazette."
        }
      ]
    }
  ],
  "source_file": "administratord09318b5121053d149a1d2ee8c024cd6.txt"
}