{
  "law_name": "THE PAKISTAN CITIZENSHIP ACT",
  "year": 1951,
  "chapters": [
    {
      "chapter_title": "Contents",
      "sections": [
        {
          "section_no": "1",
          "section_title": "Short title and commencement",
          "body": "This Act may be called the Pakistan Citizenship Act, 1951. It shall come into force at once."
        },
        {
          "section_no": "2",
          "section_title": "Definitions",
          "body": "In this Act 'alien' means a person who is not a citizen of Pakistan or a Commonwealth citizen; 'Indo-Pakistan sub-continent' means India as defined in the Government of India Act, 1935; 'minor' means any person who has not completed the age of twenty-one years; 'prescribed' means prescribed by rules made under this Act."
        },
        {
          "section_no": "3",
          "section_title": "Citizenship at the date of commencement of this Act",
          "body": "At the commencement of this Act, every person shall be deemed to be a citizen of Pakistan who or any of whose parents or grandparents was born in the territory now included in Pakistan and who after the fourteenth day of August, 1947, has not been permanently resident in any country outside Pakistan."
        },
        {
          "section_no": "4",
          "section_title": "Citizenship by birth",
          "body": "Every person born in Pakistan after the commencement of this Act shall be a citizen of Pakistan by birth."
        },
        {
          "section_no": "5",
          "section_title": "Citizenship by descent",
          "body": "A person born after the commencement of this Act shall be a citizen of Pakistan by descent if his parent is a citizen of Pakistan at the time of his birth."
        },
        {
          "section_no": "6",
          "section_title": "Citizenship by migration",
          "body": "The Federal Government may, upon his obtaining a certificate of domicile under this Act, register as a citizen of Pakistan by migration any person who has migrated to the territories now included in Pakistan from any territory in the Indo-Pakistan sub-continent."
        },
        {
          "section_no": "7",
          "section_title": "Persons migrating from the territories of Pakistan",
          "body": "A person who has after the first day of March, 1947, migrated from the territories now included in Pakistan to the territories now included in India shall not be a citizen of Pakistan."
        },
        {
          "section_no": "8",
          "section_title": "Rights of citizenship of certain persons resident abroad",
          "body": "The Federal Government may, upon application made to it, register as a citizen of Pakistan any person who, or whose father or whose father’s father, was born in the Indo-Pakistan sub-continent and who is ordinarily resident in a country outside Pakistan."
        },
        {
          "section_no": "9",
          "section_title": "Citizenship by naturalisation",
          "body": "The Federal Government may, upon an application made to it, register that person as a citizen of Pakistan by naturalization."
        },
        {
          "section_no": "10",
          "section_title": "Married women",
          "body": "Any woman who by reason of her marriage to a British subject before the first day of January, 1949, has acquired the status of a British subject shall, if her husband becomes a citizen of Pakistan, be a citizen of Pakistan."
        },
        {
          "section_no": "11",
          "section_title": "Registration of minors",
          "body": "The Federal Government may, upon application made in the prescribed manner by a parent or guardian of a minor child of a citizen of Pakistan, register the child as a citizen of Pakistan."
        },
        {
          "section_no": "12",
          "section_title": "Citizenship by registration to begin on date of registration",
          "body": "Any person registered as a citizen of Pakistan shall be such a citizen from the date of his registration."
        },
        {
          "section_no": "13",
          "section_title": "Citizenship by incorporation of territory",
          "body": "If any territory becomes a part of Pakistan the President may, by order, specify the persons who shall be citizens of Pakistan by reason of their connection with that territory."
        },
        {
          "section_no": "14",
          "section_title": "Dual citizenship or nationality not permitted",
          "body": "Dual citizenship or nationality is not permitted."
        },
        {
          "section_no": "14A",
          "section_title": "Renunciation of citizenship",
          "body": "Provisions regarding renunciation of citizenship."
        },
        {
          "section_no": "14B",
          "section_title": "Certain persons to be citizens of Pakistan",
          "body": "Provisions regarding certain persons being citizens of Pakistan."
        },
        {
          "section_no": "15",
          "section_title": "Persons becoming citizens to have the status of Commonwealth citizens",
          "body": "Persons becoming citizens shall have the status of Commonwealth citizens."
        },
        {
          "section_no": "16",
          "section_title": "Deprivation of citizenship",
          "body": "Provisions regarding deprivation of citizenship."
        },
        {
          "section_no": "16A",
          "section_title": "Certain persons to lose and others to retain citizenship",
          "body": "Provisions regarding loss and retention of citizenship."
        },
        {
          "section_no": "17",
          "section_title": "Certificate of domicile",
          "body": "Provisions regarding certificate of domicile."
        },
        {
          "section_no": "18",
          "section_title": "Delegation of powers",
          "body": "Provisions regarding delegation of powers."
        },
        {
          "section_no": "19",
          "section_title": "Cases of doubt as to citizenship",
          "body": "Provisions regarding cases of doubt as to citizenship."
        },
        {
          "section_no": "20",
          "section_title": "Acquisition of Pakistan citizenship by citizens of Commonwealth countries",
          "body": "Provisions regarding acquisition of citizenship by Commonwealth citizens."
        },
        {
          "section_no": "21",
          "section_title": "Penalties",
          "body": "Provisions regarding penalties."
        },
        {
          "section_no": "22",
          "section_title": "Interpretation",
          "body": "Provisions regarding interpretation."
        },
        {
          "section_no": "23",
          "section_title": "Rules",
          "body": "Provisions regarding rules."
        }
      ]
    }
  ],
  "source_file": "administratora2b6f3407a109a491d47d649f6ff0c01.txt"
}