{
  "law_name": "THE ISLAMABAD WILDLIFE (PROTECTION, PRESERVATION, CONSERVATION AND MANAGEMENT) ORDINANCE",
  "year": 1979,
  "chapters": [
    {
      "chapter_title": "Contents",
      "sections": [
        {
          "section_no": "1",
          "section_title": "Short title, extent and commencement",
          "body": "(1) This Ordinance may be called the Islamabad Wildlife (Protection, Preservation, Conservation and Management) Ordinance, 1979. (2) It extends to the Islamabad Capital Territory. (3) It shall come into force at once."
        },
        {
          "section_no": "2",
          "section_title": "Definitions",
          "body": "In this Ordinance, unless there is anything repugnant in the subject or context: (a) “authorised officer” means any person whom the Federal Government or any officer empowered by the Federal Government in this behalf may appoint to carry out all or any of the purposes of this Ordinance or to do anything required by this Ordinance or the rules, to be done by an authorised officer; (b) “Board” means the Wildlife Management Board constituted under section 4; (c) “capture” means the taking alive of any wild animal; (d) “certificate of lawful possession” means a certificate of lawful possession issued under section 9; (e) “dealer’s permit” means a dealer’s permit issued under section 14; (f) “game animal” means a wild animal specified in the First Schedule; (g) “game reserve” means an area declared as such under section 22; (h) “hunting” means any act immediately directed to the killing or capturing of wild animal, and includes the taking of nests or eggs of such animals; (i) “hunting permit” means a hunting permit issued under sub-section (2) of section 22; (j) “Licence” means a licence issued under section 7; (k) “meat” means the fat, blood, flesh or any edible part of a wild animal, whether fresh or preserved; (l) “national park” means an area declared as such under section 21; (m) “prescribed” means prescribed by rules; (n) “Private game reserve” means an area declared as such under section 23; (o) “protected animal” means an animal or bird specified in the Third Schedule; (p) “rules” means rules made under this Ordinance; (q) “trophy” means the dead body of a wild animal or any horn, antler, tooth, tusk, bone, claw, hoof, skin, hair, feather, egg, shell or other durable part of any wild animal, whether or not included in a manufactured or processed article; (r) “wild animal” means an animal or bird specified in the First Schedule or the Third Schedule; (s) “wildlife” means all natural resources, including organic resources, animals, birds, reptiles, vegetation, soil and water; and (t) “wildlife sanctuary” means an area declared as such under section 20."
        },
        {
          "section_no": "3",
          "section_title": "Appointment of officers and staff",
          "body": "The Federal Government may, for the purposes of this Ordinance, appoint such officers and staff as it thinks fit and on such terms and conditions as may be prescribed."
        },
        {
          "section_no": "4",
          "section_title": "Constitution of the Board",
          "body": "(1) The Federal Government may constitute a Board of Wildlife Management consisting of such members, including a Chairman, as it may appoint. (2) The Chairman and members of the Board shall hold office during the pleasure of the Federal Government and on such terms and conditions as it may determine. (3) The Board shall exercise such powers and perform such functions as may be prescribed."
        },
        {
          "section_no": "5",
          "section_title": "Killing and capturing of wild animals prohibited",
          "body": "Save as otherwise provided in this Ordinance and the rules, no person shall hunt, kill or capture wild animals."
        },
        {
          "section_no": "6",
          "section_title": "Restrictions of hunting",
          "body": "No person shall: (i) hunt any wild animal by means of a set-gun, dropspear, deadfall, gun-trap, explosive projectile, bomb, grenade, baited hook or any other trap whatsoever; (ii) hunt any game animal by means of an automatic weapon or a weapon of a calibre used by the Pakistan Army or Police Force, a projectile containing any drug or chemical substance having the property of anaesthetising, paralyzing, stupefying or rendering an animal incapacitated, whether partly or totally; (iii) hunt any game animal, other than a bird or hare, with a shot-gun or a non-magnum rifle of 22 caliber or less; (iv) use, or have in his possession, any poison or like injurious substance for the purpose of hunting a game animal; (v) use any motor vehicle, motor-driven vessel, water-craft of any type, aircraft or any other manually or mechanically propelled vehicle of any type to pursue, drive or stampede game animal for any purpose whatsoever; (vi) shoot any game animal from any aircraft, motor vehicle, rail-trolley, cart, board or any kind of watercraft or any other conveyance or form within two hundred metres of such conveyance; (vii) hunt any wild animal with the help of live decoys or call-birds; or (viii) construct, use or have in his possession for the purpose of hunting any game animal any pitfall, gamepit, trench or similar excavation, fence or enclosure, or use bhagwa or any other contrivance. Provided that an authorised officer may, in his discretion, exempt any person from one or more of the provisions of this Section."
        },
        {
          "section_no": "7",
          "section_title": "Prohibition to employ hawks and dogs without licence",
          "body": "No person shall use hawks for hawking or dogs for coursing game animals, except under a licence issued by an authorised officer in such manner, on such terms and conditions and on payment of such fees as may be prescribed."
        },
        {
          "section_no": "8",
          "section_title": "Animals found dead, etc. to be property of the Government",
          "body": "Any wild animal found dead or dying or which has been killed or caught otherwise than in accordance with the provisions of the Ordinance or the rules, and any trophy or meat thereof, shall be the property of the Federal Government."
        },
        {
          "section_no": "9",
          "section_title": "Certificate of lawful possession",
          "body": "(1) No person shall be in possession of any wild animal, trophy or meat specified in the Second Schedule except under a certificate of lawful possession in respect thereof issued by an authorised officer in such manner, on such terms and conditions on payment of such fees as may be prescribed. (2) Provided that a person who, on the coming into force of this Ordinance, is in possession of, or at any time thereafter, imports or acquires any such animal, trophy or meat shall, within such time as may be prescribed, apply to the authorised officer for a certificate of lawful possession. (3) The authorised officer shall mark the wild animal, trophy or meat in respect of which a certificate of lawful possession is issued and make entries in respect thereof in the prescribed register. (4) The holder of a certificate of lawful possession shall produce the certificate to the authorised officer when asked by him to do so. (5) No person shall: (a) be in possession of a wild animal trophy or meat specified in the Second Schedule without a certificate of lawful possession or without having applied for such certificate as required by sub-section (2); or (b) counterfeit, change, or in any way interfere with, any mark put on a wild animal, trophy or meat under subsection (3) or alter or in any way change a certificate of lawful possession."
        },
        {
          "section_no": "10",
          "section_title": "Restriction on transfer of wild animals, etc.",
          "body": "(1) No person who is not in possession of a certificate of lawful possession in respect of a wild animal trophy or meat specified in the Second Schedule shall transfer such wild animal, trophy or meat to any other person by way of gift, sale or otherwise. (2) No person shall receive by gift, purchase or otherwise any wild animal, trophy or meat specified in the Second Schedule unless he is at the same time given the certificate of lawful possession clearly mentioning thereon the nature of the transfer and the name of the person to whom the wild animal, trophy or meat is transferred. (3) The person to whom a wild animal, trophy or meat is transferred shall submit the certificate of lawful possession given to him by the transferor to the authorised officer who shall endorse it in favour of the transferee and make necessary amendment in the prescribed register."
        },
        {
          "section_no": "11",
          "section_title": "Restriction on import of wild animals, trophies etc.",
          "body": "(1) No person shall import, or attempt to import, into Pakistan any live wild animal or any endemic or exotic species thereof, or any trophy or meat, except through a customs-port of entry, and any person importing such animal, or endemic or exotic species, trophy or meat shall, in respect thereof, produce to the officer of customs: (i) proof to his satisfaction that it has been lawfully exported from the country of export; (ii) an import permit. (2) The officer of customs may detain any live wild animal, endemic or exotic species, trophy or meat, which has been imported until such time as the proof of its lawful export from the country of export is given and the import permit is surrendered to him, and if the proof is not given or the import permit is not surrendered within a reasonable time, the wild animal, endemic or exotic species, trophy or meat shall be forfeited to the Federal Government and disposed of in the prescribed manner."
        },
        {
          "section_no": "12",
          "section_title": "Restriction on export of wild animals, trophies, etc.",
          "body": "No person shall export, or attempt to export, any wild animal, trophy or meat except through a customs-port of exit, and a person exporting such animal, trophy or meat shall produce to the officer of customs an export permit in respect thereof."
        },
        {
          "section_no": "13",
          "section_title": "Animals, trophies, etc., in transit",
          "body": "Nothing in sections 11 and 12 shall apply to any live wild animal, any endemic or exotic species thereof or any trophy or meat in transit through Pakistan."
        }
      ]
    }
  ],
  "source_file": "administrator2e171c7427b76a35922f5982ad2ea5be.txt"
}