{
  "error": "Expecting value: line 1 column 1 (char 0)",
  "raw": "THE INTERNATIONAL ISLAMIC UNIVERSITY ORDINANCE, 1985 CONTENTS CHAPTER I THE PRILIMINARY 1. Short title and commencement 2. Definitions 3. CHAPTER II THE UNIVERSITY 4. Establishment of the University 5. Powers and functions of the University 6. University open to all classes, creeds, etc 7. Teaching in the University CHAPTER III OFFICERS OF THE UNIVERSITY 8. Officers of the University 9. Chancellors 10. Visitation 11. Pro-Chancellor 12. Rector 13. President 14. Vice-Presidents 15. Other Officers CHAPTER IV AUTHORITIES OF THE UNIVERSITY 16. Authorities 17. Board of Trustees 18. Meetings of the Board of Trustees 19. Board of Governors 20. Meetings of the Board of Governors 21. Powers of the Board of Governors 22. Academic Council 23. Powers and duties of the Academic Council 24. Constitution, functions and powers of other Authorities 25. Appointment of Committees by the Authorities 26. The academic and administrative staff 27. Academic freedom CHAPTER V STATUTES, REGULATIONS AND RULES 28. Statutes 29. Regulations 30. Rules CHAPTER VI THE UNIVERSITY FUND 31. University Fund 32. Payments 33. Accounts 34. Audit 35. Annual statement of accounts CHAPTER VII GENERAL PROVISIONS 36. Retirement from service 37. Opportunity to show cause 38. Appeal to, and review by, the Board of Governors 39. Pension, insurance, gratuity, provident fund and benevolent fund 40. Commencement of term of office of members of authorities 41. Filling of casual vacancies in Authorities 42. Filling of vacancies in Authorities in Certain Circumstances 43. Disputes about membership of Authorities, etc. 44. Proceeding of Authorities not invalidated by vacancies 45. First Statutes 46. Bar of Jurisdiction 47. Indemnity 48. Transitional provisions 49. Repeal and savings 50. Trust 51. Removal of difficulties THE SCHEDULE. (The First Statutes) ANNEX I. (Islamic Research Institute) ANNEX II. (International Institute of Islamic Economics) ANNEX III. (Shariah Academy) ANNEX IV. (Academy for Da'wah Training of Ima",
  "source_file": "administrator20fdf57154a60334611d239e58068a11.txt",
  "law_name": "The International Islamic University Ordinance, 1985",
  "year": 1985
}