{
  "law_name": "THE EXCISE (SPIRITS) ACT",
  "year": 1863,
  "chapters": [
    {
      "chapter_title": "Contents",
      "sections": [
        {
          "section_no": "1",
          "section_title": "Duty payable on removal of such spirits from distillery",
          "body": "Spirits intended to be used exclusively in arts and manufactures or in chemistry may be removed from any licensed distillery in any part of Pakistan on payment of duty not exceeding five per cent. on the value of the spirits: Provided that no spirits shall be so removed until they have been effectually and permanently rendered unfit for human consumption."
        },
        {
          "section_no": "2",
          "section_title": "Rules of ascertaining that spirits to be removed have been rendered unfit for human consumption, etc.",
          "body": "In each Province the Board of Revenue, or other authority specially authorized in that behalf by the Federal Government shall prescribe from time to time, subject to the approval of the Federal Government rules for ascertaining and determining that spirits proposed to be removed for the purposes aforesaid have been effectually and permanently rendered unfit for human consumption, as required by section 1 of this Act; for causing such spirits to be so rendered, if necessary, by its own officers at the expense of the person who wishes to remove them; and for fixing the value of the spirit on which the ad valorem duty shall be levied."
        },
        {
          "section_no": "3",
          "section_title": "Penalty for breach of such rules",
          "body": "Every person who shall willfully contravene any rule prescribed by the Board of Revenue, or other authority as aforesaid, under the last preceding section of this Act, shall be liable on conviction before any officer exercising the powers of a Magistrate to a penalty not exceeding five hundred rupees for every such offence."
        },
        {
          "section_no": "4",
          "section_title": "Penalty for attempting to render fit for human consumption spirits removed under Act",
          "body": "Every person who shall attempt, or shall connive at an attempt, to render fit for human consumption, spirits removed from a distillery under the provisions of this Act, shall be liable to a penalty not exceeding one thousand rupees; and the possessor of such spirits on which such attempt has been made, or which may have been rendered fit for human consumption, shall be liable on conviction before any officer exercising the powers of a Magistrate, to a penalty not exceeding five hundred rupees."
        },
        {
          "section_no": "5",
          "section_title": "Penalty how levied",
          "body": "Any penalty imposed under either of the last two preceding sections may in case of non-payment be levied by distress and sale of the goods and chattels of the offender, by warrant under the hand of the officer by whom such penalty was imposed."
        },
        {
          "section_no": "6",
          "section_title": "In case of non-payment of penalty, offender may be detained pending return to distress warrant",
          "body": "In case any such penalty shall not be forthwith paid, any such officer may order the offender to be apprehended and detained in safe custody, until the return can be conveniently made to such warrant of distress, unless the offender shall give security to the satisfaction of such officer for his appearance at such place and time as shall be appointed for the return of the warrant of distress."
        },
        {
          "section_no": "7",
          "section_title": "Imprisonment of offender in case of failure to recover penalty by distress",
          "body": "If upon the return of such warrant it shall appear that no sufficient distress can be had whereon to levy such penalty, and the same shall not be forthwith paid, or in case it shall appear to the satisfaction of such officer by the confession of the offender or otherwise that he has not sufficient goods and chattels whereupon such penalty could be levied if a warrant of distress were issued, any such officer may by warrant under his hand commit the offender to the civil Jail, there to be imprisoned, according to the discretion of such officer, for any term not exceeding two calendar months when the amount of penalty shall not exceed fifty rupees, and for any term not exceeding four-calendar months when the amount shall not exceed one hundred rupees, and for any term not exceeding six calendar months in any other case, the commitment to be determinable in each of the cases aforesaid on payment of the amount."
        },
        {
          "section_no": "8",
          "section_title": "[Provision of section 11, Act III of 1852, relating to adulteration, not to apply to spirits rendered unfit for consumption under Act]",
          "body": "Rep. by the Repealing and Amending Act, 1891 (XII of 1891), s. 2 (1)."
        },
        {
          "section_no": "9",
          "section_title": "Confiscation in cases of conviction under section 3 or 4",
          "body": "In every case of conviction under section 3 or section 4 of this Act, the liquor or spirits with the cask or vessel containing in the same, and the cart, boat and animal or animals employed in carrying such liquor or spirit, shall be liable to confiscation."
        }
      ]
    }
  ],
  "source_file": "administrator9e6785790fb43c10beb79d45b7daa106.txt"
}