{
  "error": "Expecting value: line 1 column 1 (char 0)",
  "raw": "THE PARSI MARRIAGE AND DIVORCE ACT, 1936 CONTENTS PART I. PRELIMINARY 1. Short title, extent and commencement 2. Definitions PART II. MARRIAGES BETWEEN PARSIS 3. Requisites to validity of parsi marriages 4. Remarriage when unlawful 5. Punishment of bigamy 6. Certificate and registry of marriage 7. Appointment of Registrar 8. Marriage registers to be open for public inspection 9. Copy of certificate to be sent to Registrar-General of Births, Deaths and Marriages 10. Registration of divorces 11. Penalty for solemnizing marriage contrary to section 4 12. Penalty for priest's neglect of requirements of section 6 13. Penalty for omitting to subscribe and attest certificate 14. Penalty for making, etc., false certificate 15. Penalty for failing to register certificate 16. Penalty for secreting, destroying or altering register 17. Formal irregularity not to invalidate marriage PART III. PARSI MATRIMONIAL COURTS 18. Constitution of special Courts under the Act 19. Omitted 20. Parsi District Matrimonial Courts 21. Power to alter territorial jurisdiction of District Courts 22. Omitted 23. Court seals 24. Appointment of delegates 25. Power to appoint new delegates 26. Delegates to be deemed public servants 27. Selection of delegates under section 20 to be from those appointed under section 28. Practitioners in Matrimonial Courts 29. Court in which Suits to be brought PART IV. MATRIMONIAL SUITS 30. Suits for nullity 31. Suits for dissolution 32. Grounds of divorce 33. Joining of co-defendant 34. Suits for judicial separation 35. Decrees in certain suits 36. Suit for restitution of conjugal rights 37. Counter-claim by defendant for any relief 38. No suit to be brought to enforce marriage or contract arising out of marriage when husband is under sixteen or wife under fourteen years 39. Alimony pendente lite 40. Permanent alimony 41 Payment of alimony to wife or to her trustee 42. Disposal of joint property 43. Suits may be heard with closed doors 44. Validity of trial 45. Provisi",
  "source_file": "administrator71b03c0461fc9cbbb7b0cad08bdcb03f.txt",
  "law_name": "The Parsi Marriage and Divorce Act, 1936",
  "year": 1936
}