{
  "law_name": "THE HINDU DISPOSITION OF PROPERTY ACT",
  "year": 1916,
  "chapters": [
    {
      "chapter_title": "Hindu Disposition of Property Act, 1916",
      "sections": [
        {
          "section_no": "1",
          "section_title": "Short title and extent",
          "body": "(1) This Act may be called the Hindu Disposition of Property Act, 1916. (2) It extends to the whole of Pakistan."
        },
        {
          "section_no": "2",
          "section_title": "Disposition for the benefit of persons not in existence",
          "body": "Subject to the limitations and provisions specified in this Act, no disposition of property by a Hindu, whether by transfer inter vivos or by will, shall be invalid by reason only that any person for whose benefit it may have been made was not in existence at the date of such disposition."
        },
        {
          "section_no": "3",
          "section_title": "Limitations and conditions",
          "body": "The limitations and provisions referred to in section 2 shall be the following, namely: - (a) in respect of dispositions by transfer inter vivos, those contained in Chapter II of the Transfer of Property Act, 1882 (IV of 1882) and (b) in respect of dispositions by will, those contained in sections 113, 114, 115 and 116 of the Indian Succession Act, 1925 (XXXIX of 1925)."
        },
        {
          "section_no": "4",
          "section_title": "[Failure of prior disposition]",
          "body": "Rep. By the Transfer of Property (Amdt.) Supplementary Act, 1929 (XXI of 1929), s. 12."
        },
        {
          "section_no": "5",
          "section_title": "Application of this Act to the Khoja community",
          "body": "Where the Provincial Government is of opinion that the Khoja community in the Province or any part thereof desire that the provisions of this Act should be extended to such community, it may by notification in the Official Gazette, declare that the provisions of this Act, with the substitutions of the word 'Khojas' or 'Khoja', as the case may be, for the word 'Hindus' or 'Hindu' wherever those words occur, shall apply to that community in such area as may be specified in the notification, and this Act shall thereupon have effect accordingly."
        }
      ]
    }
  ],
  "source_file": "administrator2153575f47e8a97a8776320d8eac6a3c.txt"
}