{
  "law_name": "THE CHILD MARRIAGE RESTRAINT ACT",
  "year": 1929,
  "chapters": [
    {
      "chapter_title": "Contents",
      "sections": [
        {
          "section_no": "1",
          "section_title": "Short title, extent and commencement",
          "body": "(1) This Act may be called the Child Marriage Restraint Act, 1929. (2) It extends to the whole of Pakistan and applies to all citizens of Pakistan wherever they may be. (3) It shall come into force on the 1st day of April, 1930."
        },
        {
          "section_no": "2",
          "section_title": "Definitions",
          "body": "In this Act, unless there is anything repugnant in the subject or context, (a) 'child' means a person who, if a male, is under eighteen years of age, and if a female, is under sixteen years of age; (b) 'child marriage' means a marriage to which either of the contracting parties is a child; (c) 'contracting party' to a marriage means either of the parties whose marriage is thereby solemnised; (d) 'minor' means a person of either sex who is under eighteen years of age; (e) 'Union Council' means the Union Council or Town Committee constituted under the law relating to local government for the time being in force."
        },
        {
          "section_no": "4",
          "section_title": "Punishment for male adult above twenty-one years of age marrying a child",
          "body": "Whoever, being a male above eighteen years of age, contracts a child marriage shall be punishable with simple imprisonment which may extend to one month, or with fine which may extend to one thousand rupees, or with both."
        },
        {
          "section_no": "5",
          "section_title": "Punishment for solemnising a child marriage",
          "body": "Whoever performs, conducts or directs any child marriage shall be punishable with simple imprisonment which may extend to one month, or with fine which may extend to one thousand rupees, or with both, unless he proves that he had reason to believe that the marriage was not a child marriage."
        },
        {
          "section_no": "6",
          "section_title": "Punishment for parent or guardian concerned in a child marriage",
          "body": "(1) Where a minor contracts a child marriage, any person having charge of the minor, whether as parent or guardian or in any other capacity, lawful or unlawful, who does any act to promote the marriage or permits it to be solemnised, or negligently fails to prevent it from being solemnised, shall be punishable with simple imprisonment which may extend to one month, or with fine which may extend to one thousand rupees, or with both: Provided that no woman shall be punishable with imprisonment. (2) For the purposes of this section, it shall be presumed, unless and until the contrary is proved, that where a minor has contracted a child marriage, the person having charge of such minor has negligently failed to prevent the marriage from being solemnised."
        },
        {
          "section_no": "7",
          "section_title": "Imprisonment not to be awarded for offences under section 3",
          "body": "Notwithstanding anything contained in section 25 of the General Clauses Act, 1897, or section 64 of the Pakistan Penal Code 1860, a Court sentencing an offender under section 3 shall not be competent to direct that, in default of payment of the fine imposed, he shall undergo any term of imprisonment."
        },
        {
          "section_no": "8",
          "section_title": "Jurisdiction under this Act",
          "body": "Notwithstanding anything contained in section 190 of the Code of Criminal Procedure, 1898, no Court other than that of a Magistrate of the first class shall take cognizance of, or try, any offence under this Act."
        },
        {
          "section_no": "10",
          "section_title": "Preliminary inquiries into offences under this Act",
          "body": "The Court taking cognizance of an offence under this Act shall, unless it dismisses the complaint under section 203 of the Code of Criminal Procedure, 1898, either itself make an inquiry under section 202 of that Code, or direct a Magistrate of the first class subordinate to it to make such inquiry."
        },
        {
          "section_no": "12",
          "section_title": "Power to issue injunction prohibiting marriage in contravention of this Act",
          "body": "(1) Notwithstanding anything to the contrary contained in this Act, the Court may, if satisfied from information laid before it through a complaint or otherwise that a child marriage in contravention of this Act has been arranged or is about to be solemnised, issue an injunction against any of the persons mentioned in section 3, 4, 5, and 6 of this Act prohibiting such marriage. (2) No injunction under sub-section (1) shall be issued against any person unless the Court has previously given notice to such person, and has afforded him an opportunity to show cause against the issue of the injunction. (3) The Court may either on its own motion or on the application of any person aggrieved rescind or alter any order made under sub-section (1). (4) Where such an application is received, the Court shall afford the applicant an early opportunity of appearing before it either in person or by pleader; and if the Court rejects the application wholly or in part, it shall record in writing its reasons for so doing. (5) Whoever knowing that an injunction has been issued against him under sub-section (1) of this section disobeys such injunction shall be punished with imprisonment of either description for a term which may extend to three months, or with fine which may extend to one thousand rupees, or with both: Provided that no woman shall be punishable with imprisonment."
        }
      ]
    }
  ],
  "source_file": "administrator0cb12b901d4304d7e5463da076d88639.txt"
}