{
  "law_name": "The Tolls Act",
  "year": 1851,
  "chapters": [
    {
      "chapter_title": "Contents",
      "sections": [
        {
          "section_no": "1",
          "section_title": "Repeal of Acts",
          "body": "Rep. by the Repealing Act, 1870 (XIV of 1870)."
        },
        {
          "section_no": "1A",
          "section_title": "Extent",
          "body": "This Act extends to the Province of the Punjab and the Federal Government may, by notification in the official Gazette, extend it to any other Province."
        },
        {
          "section_no": "1B",
          "section_title": "Definition",
          "body": "Omitted by the Federal Laws (Revision and Declaration) Ordinance, 1981 (XXVII of 1981), s. 3 and Sch. II."
        },
        {
          "section_no": "2",
          "section_title": "Power to levy tolls on roads and bridges made or repaired by the Federal Government",
          "body": "The Federal Government may cause such rates of tolls as it thinks fit to be levied upon any road or bridge which has been, or shall hereafter be, made or repaired at the expense of the Federal Government; and place the collection of such tolls under the management of such persons as may appear to it proper; and all persons employed in the management and collection of such tolls shall be liable to the same responsibility as would belong to them if employed in the collection of land revenue."
        },
        {
          "section_no": "3",
          "section_title": "Their powers for recovery of toll",
          "body": "In case of non-payment of any such toll on demand, the officers appointed to collect the same may seize any of the carriages or animals on which it is chargeable, or any part of their burden of sufficient value to defray the toll; and, if any toll remains undischarged for twenty-four hours, with the cost arising from such seizure, the case shall be brought before the officer appointed to superintend the collection of the said toll, who may sell the property seized for discharge of the toll, and all expenses occasioned by such non-payment, seizure and sale, and cause any balance that may remain to be returned, on demand, to the owner of the property; and the said officer, on receipt of the property, shall forthwith issue a notice that, at noon of the next day, exclusive of Sunday, or any closed holiday, he will sell the property by auction."
        },
        {
          "section_no": "4",
          "section_title": "Exemptions from payment of toll",
          "body": "No tolls shall be paid for the passage of Police officers on duty, or of any person or property in their custody, but no other exemption from payment of the toll levied under this Act shall be allowed."
        },
        {
          "section_no": "5",
          "section_title": "Assistance of collectors by Police officers",
          "body": "All Police-officers shall be bound to assist the toll-collectors, when required, in the execution of this Act; and, for that purpose, shall have the same power which they have in the exercise of their common police-duties."
        },
        {
          "section_no": "6",
          "section_title": "Penalty for offences under Act",
          "body": "Every person, other than the persons appointed to collect the tolls under this Act, who shall levy or demand any toll on any public road or bridge, or for passing through any bazar situated thereon, and also every person who shall unlawfully and extortionately demand, or take any other or higher toll than the lawful toll, or under colour of this Act seize or sell any property knowing such seizure or sale to be unlawful, or in any manner unlawfully extort money or any valuable thing from any person under colour of this Act, shall be liable on conviction before a Magistrate to imprisonment for any term not exceeding six calendar months, or to fine not exceeding two hundred rupees, any part of which fine may be awarded by the Magistrate to the person aggrieved; but this remedy shall not be deemed to bar or affect his right to have redress by suit in the Civil Court."
        },
        {
          "section_no": "7",
          "section_title": "Exhibition of table of tolls, and statement of penalties",
          "body": "A table of the tolls authorized to be taken at any toll-gate or station shall be put up in a conspicuous place near such gate or station legibly written or printed in English words and figures, and also in those of the vernacular language of the district, to which shall be annexed, written or printed in like manner, a statement of the penalties for refusing to pay the tolls and for taking any un-lawful toll."
        },
        {
          "section_no": "8",
          "section_title": "Application of proceeds of tolls",
          "body": "The tolls levied under this Act shall be deemed public revenue."
        },
        {
          "section_no": "9",
          "section_title": "Power to compound tolls",
          "body": "Any person entrusted with the management of the collection of tolls under this Act may in his discretion compound for any period not exceeding one year with any persons for a certain sum to be paid by such person for himself or for any vehicle or animal kept by him, in lieu of the rates of toll authorised to be levied under this Act."
        }
      ]
    }
  ],
  "source_file": "administratorb1a231a9ecd9e3713ac761743c6a6986.txt"
}