{
  "law_name": "THE PAKISTAN BANKING AND FINANCE SERVICES COMMISSION ACT",
  "year": 1992,
  "chapters": [
    {
      "chapter_title": "Contents",
      "sections": [
        {
          "section_no": "1",
          "section_title": "Short title and commencement",
          "body": "(1) This Act may be called the Pakistan Banking and Finance Services Commission Act, 1992. (2) It shall come into force at once."
        },
        {
          "section_no": "2",
          "section_title": "Definitions",
          "body": "In this Act, unless there is anything repugnant in the subject or context, (a) “Commission” means the Pakistan Banking and Finance Services Commission established under section 3; (b) “financial institution” means an institution referred to in the Schedule; (c) “Member” means a member of the Commission; (d) “recruitment” means initial appointment otherwise than by promotion or transfer; (e) “rules” means rules made under section 14; and (f) “schedule” means the schedule to this Act."
        },
        {
          "section_no": "3",
          "section_title": "Establishment of the Commission",
          "body": "There shall be established for the purposes of this Act a Commission to be called the Pakistan Banking and Finance Services Commission and consisting of a Chairman and not more than four members appointed by the Federal Government."
        },
        {
          "section_no": "4",
          "section_title": "Salary, Allowances and privileges",
          "body": "The Chairman and the Members shall be entitled to such salary, allowances, and privileges as the Federal Government may determine from time to time."
        },
        {
          "section_no": "5",
          "section_title": "Term of office",
          "body": "The Chairman and Members shall hold office for such term as may be determined by the Federal Government."
        },
        {
          "section_no": "6",
          "section_title": "Resignation and filling of vacancies",
          "body": "(1) The Chairman or a member may, by writing under his hand addressed to the Federal Government, resign his office. (2) Any vacancy occurring in the membership of the Commission due to death, resignation or removal shall be filled by the appointment of another person by the Federal Government."
        },
        {
          "section_no": "7",
          "section_title": "Functions of the Commission",
          "body": "The functions of the Commission shall be- (a) to conduct open competitive examinations for recruitment to Grade III or higher posts in the financial institutions; (b) to conduct interviews and tests for recruitment to posts in grades higher than Grade III, except where such recruitment is excluded from the purview of the Commission by the Federal Government; (c) to conduct tests for promotion of existing employees from lower cadres to Grade III and above, if so, required by a financial institution; and (d) to advise the Federal Government on matters relating to qualifications for, and methods of recruitment to, posts in Grade II or higher grades in the financial institutions, if so required by the Federal Government."
        },
        {
          "section_no": "8",
          "section_title": "Recruitment to posts in financial Institutions",
          "body": "(1) Recruitment to all posts in Grade III or higher grades in a financial institution shall be made on the advice of the Commission: Provided that the Commission may, on the direction of the Federal Government, advise any financial institution for recruitment in any post or grade. (2) The Commission may exempt any professional or class of professionals, like engineers, lawyers and chartered accountants, from appearing in any written test or examination conducted by the Commission. (3) A financial institution shall not disregard, or act contrary to the advice of the Commission without the prior approval of the Federal Government and where the Federal Government grants such approval it shall record its reasons for doing so."
        },
        {
          "section_no": "9",
          "section_title": "Funds of the Commission",
          "body": "(1) There shall be constituted for the Commission a fund to which shall be credited all sums received under sub-section (2) and out of which shall be defrayed all expenditure incurred by the Commission, including expenditure on the emoluments of the Chairman and members and the officers, employees, experts and consultants of the Commission. (2) Every financial institution shall make to the Commission such payments to defray its expenses as the Commission may, with the approval of the Federal Government, demand."
        },
        {
          "section_no": "10",
          "section_title": "Appointment of officers, employees, etc.",
          "body": "For the efficient performance of its functions, the Commission may appoint its officers, employees experts, and consultants, on such terms and conditions as may be prescribed."
        },
        {
          "section_no": "11",
          "section_title": "Report of the Commission",
          "body": "The Commission will submit to the President annually a report on the work done by the Commission."
        },
        {
          "section_no": "12",
          "section_title": "Power to amend Schedule",
          "body": "The Federal Government may, keeping in view the purposes of this Act, by notification in the official Gazette, amend the Schedule so as to add any entry thereto or omit or modify any entry therein."
        },
        {
          "section_no": "13",
          "section_title": "Act to override other laws",
          "body": "The provisions of this Act shall have effect notwithstanding anything contained in any other law, or in any instrument, deed or other document relating to a financial institution."
        },
        {
          "section_no": "14",
          "section_title": "Power to make rules",
          "body": "(1) The Commission may, with the approval of the Federal Government, by notification in the official Gazette, make rules for carrying out the purposes of this Act. (2) In particular and without prejudice to the generality of the foregoing power, such rules may provide for the appointment of officers, employees, experts and consultants and for the payment of travelling allowance and daily allowance to the Chairman, Members, officers and employees and other persons engaged by the Commission, in respect of journeys performed in connection with the functions assigned to them."
        }
      ]
    }
  ],
  "source_file": "administrator7ac8536ae0f83f2fe330a76c8d376d62.txt"
}