{
  "law_name": "The Survey for Documentation of National Economy Ordinance",
  "year": 2000,
  "chapters": [
    {
      "chapter_title": "Contents",
      "sections": [
        {
          "section_no": "1",
          "section_title": "Short title, extent and commencement",
          "body": "(1) This Ordinance may be called the Survey for Documentation of National Economy Ordinance, 2000. (2) It extends to the whole of Pakistan. (3) It shall come into force at once."
        },
        {
          "section_no": "2",
          "section_title": "Role and constitution of survey teams",
          "body": "(1) The Central Board of Revenue may constitute survey teams in such manner and in such number as it may deem fit to carry out survey of non-reporting and under-reporting of manufacturing sales, economic activities, income, wealth and assets. (2) Such survey teams may consist of officials from the departments working under Central Board of Revenue and such other departments of the Federal Government or the Provincial Government, Utility agencies, autonomous bodies, development authorities, cooperative housing societies, Metropolitan Corporations and Municipal Committees as the Central Board of Revenue may deem fit to include in the survey teams. Members of Armed Forces of Pakistan will form part of all survey and registration activity."
        },
        {
          "section_no": "3",
          "section_title": "Filling of questionnaires",
          "body": "(1) For the purpose of carrying out survey under this Ordinance, survey teams shall subject to such instructions and directions as may be issued by the Central Board of Revenue, use the questionnaires set out in the First Schedule, the Second Schedule and the Third Schedule to this Ordinance and the information collected through these questionnaires shall be deemed to be an information collected for the purpose of assessment and determination of turnover, value or tax liabilities under the laws administered by the Central Board of Revenue. (2) Every person to whom a survey team gives both or any of the questionnaires specified in sub-section (1) shall be bound to fill in and provide the correct information asked for therein within such time as may be allowed and in such manner as may be directed by the survey team at the time of survey. (3) Notwithstanding anything contained in sub-section (1), the cases where a person holding National Tax Number does not declare the value of stocks as per entry at Serial No. 13 of the questionnaire set out in the First Schedule to this Ordinance, declaration of stocks made by such person in his income tax return for the assessment year commencing on the first day of July, 2000, under the Income Tax Ordinance, 1979 (XXXI of 1979) shall be deemed to be an information collected under this Ordinance and all the provisions of this Ordinance shall apply accordingly. (4) The information collected through the questionnaires, referred to in sub-section (1), shall be used for the purpose of assessment and determination of turnover, value, wealth, income or tax liabilities under the laws administered by the Central Board of Revenue,- (a) in the case of a person holding National Tax Number, in respect of financial year in which survey is carried out and for preceding financial years commencing on or after the first day of July, 1999; and (b) in other cases, in respect of financial year in which survey is carried out and preceding financial years."
        },
        {
          "section_no": "4",
          "section_title": "Penalty, etc",
          "body": "(1) Any person who refuses or fails to fill in, or does not provide information asked for in any of the questionnaires specified in sub-section (1) of section 3 or fills in or provides false information shall be guilty of an offence punishable with imprisonment for a term which may extend to three months, or with fine which may extend to rupees twenty five thousand, or with both. (2) If the person contravening any provisions of this Ordinance is a company, every person, who at the time the offence was committed, was in charge of, and was responsible to, the company for the conduct of business of the company as well as the company shall be deemed to be guilty of the offence and shall be liable to be proceeded against and punished accordingly: Provided that nothing contained in this sub-section shall render any such person liable to any punishment provided in sub-section (1) if he proves that the offence was committed without his knowledge or that he exercised due diligence to prevent the commission of such offence. (3) Notwithstanding anything contained in sub-section (2) where the offence under this Ordinance has been committed by a company and it is proved that the offence was committed with the consent or connivance of, or is attributable to any neglect on the part of any director, manager, secretary or other officer of the company, such director, manager, secretary or other officer shall be guilty of offence and shall be liable to be proceeded against and punished accordingly."
        },
        {
          "section_no": "5",
          "section_title": "Cognizance of offence, etc",
          "body": "(1) Notwithstanding anything contained in the Code of Criminal Procedure, 1898, (Act V of 1898)- (a) no Magistrate other than an Executive Magistrate of the first class shall try an offence under this Ordinance; (b) a Magistrate trying an offence under this Ordinance shall have the power to try such offence summarily in accordance with the procedure laid down for summary trial in the said Code. (2) Notwithstanding anything contained in section 32 of the Code of Criminal Procedure, 1898, (Act V of 1898) of it shall be lawful for an Executive Magistrate of the first class to pass any sentence authorised by this Ordinance."
        },
        {
          "section_no": "6",
          "section_title": "Ordinance not to derogate from other Laws",
          "body": "The provisions of this Ordinance shall be in addition to, and not in derogation of, any other law for the time being in force."
        },
        {
          "section_no": "7",
          "section_title": "Power to make rules",
          "body": "The Central Board of Revenue may, by notification in the official Gazette, make rules for carrying out the purposes of this Ordinance."
        },
        {
          "section_no": "8",
          "section_title": "Removal of difficulties",
          "body": "If any difficulty arises in giving effect to the provisions of this Ordinance, the Central Board of Revenue, may make such order, not inconsistent with the provisions of this Ordinance, as may appear to it to be necessary for removing the difficulty."
        }
      ]
    }
  ],
  "source_file": "administrator563875ec0d9827cceb66f2b446d9de84.txt"
}