{
  "error": "Expecting value: line 1 column 1 (char 0)",
  "raw": "THE EMPOYEES COST OF LIVING (RELIEF) ACT, 1974 CONTENTS 1. Short title, extent and commencement 2. Definitions 3. Cost of living allowance 3A. Cost of living allowance in addition to that admissible under section 3 4. Responsibility for payment of cost of living allowance 5. Time for payment of cost of living allowance 6. Claims for recovery, or delay in payment, of cost of living allowance 7. Cost of living allowance to form part of Wages 8. Saving of certain right and privileges. 9. Penalty. 10. Cognizance of offences. 11. [Repeal] THE EMPLOYEES COST OF LIVING (RELIEF) ACT, 1974. 1ACT NO. I OF 1974 [31st December, 1973] An Act to provide for payment of a cost of living allowance to employees. WHEREAS it is expedient to provide for payment of a cost of living allowance to employees and for matters ancillary thereto; It is hereby enacted as follows:- 1. Short title, extent and commencement.-(1) This Act may be called the (Relief) Act, 1973. (2) It shall come into force at once. (3) It extends to the whole of Pakistan. 2. Definitions. In this Act, unless there is anything repugnant in the subject or context,- (a) “cost of living allowance” means 2[an amount] payable under the provisions of this Act; (b) “employee” means any person employed, whether directly or through any other person, for wages, lo do any skilled or unskilled, intellectual, technical, clerical, manual or other work in, or in connection with the affairs of, an undertaking, under any contract of service or apprenticeship, whether written or oral, express or implied, and includes such a person when laid off, but does not include 3* * * a person for whom a provision has been, or may be, made by the Federal Government or a Provincial Government for grant of an allowance intended to provide relief due to a rise in the cost of living; (c) “employer”, in relation to an undertaking, means any person who employs, either directly or through any other person, whether on behalf of himself or any other person, an",
  "source_file": "administratorc04599707559bad586492e3c473cf142.txt",
  "law_name": "The Empoyees Cost of Living (Relief) Act, 1974",
  "year": 1974
}