{
  "law_name": "The Pakistan Refugees Rehabilitation Finance Corporation (Dissolution) Ordinance",
  "year": 1980,
  "chapters": [
    {
      "chapter_title": "Contents",
      "sections": [
        {
          "section_no": "1",
          "section_title": "Short title and commencement",
          "body": "(1) This Ordinance may be called the Pakistan Refugees Rehabilitation Finance Corporation (Dissolution) Ordinance, 1980. (2) It shall come into force at once."
        },
        {
          "section_no": "2",
          "section_title": "Definitions",
          "body": "In this Ordinance, unless there is anything repugnant in the subject or context,- (a) “Corporation” mean the Pakistan Refugees Rehabilitation Finance Corporation established under the Pakistan Refugees Rehabilitation Finance Corporation Ordinance, 1959 (II of 1960); and (b) “undertakings and properties” shall include loans, assets, rights, authorities, powers, properties, both movable and immovable, including lands, leases, leaseholds, reserve fund investments, shares, book debts, and all rights, interests and benefits in assignable contracts and choses in action."
        },
        {
          "section_no": "3",
          "section_title": "Transfer of undertaking, etc., of the Corporation",
          "body": "Notwithstanding anything contained in the Pakistan Refugees Rehabilitation Finance Corporation Ordinance, 1959 (II of 1960) or in any law, agreement or contract for the time being in force, the Federal Government may, by order, direct that,- (a) the undertakings and properties of the Corporation shall be transferred to such body or authority as it may think fit, on such date, in such manner and to such extent as may be specified in the order, and the undertakings and properties so transferred shall be carried on by, and vest in the body or authority concerned; and (b) the officers, advisers and employees of the Corporation shall be transferred to, and appointed by, such body or authority as aforesaid, in such manner and on such terms and conditions as may be specified in the order."
        },
        {
          "section_no": "4",
          "section_title": "Dissolution of the Corporation",
          "body": "(1) As soon as may be after the order under section 3 has issued, the Federal Government may, by notification in the official Gazette, direct that the Corporation shall be dissolved on such date as may be specified in the notification, and thereupon the Corporation shall stand dissolved. (2) Upon the dissolution of the Corporation under sub-section (1),- (a) the Pakistan Refugees Rehabilitation Finance Corporation Ordinance, 1959 (II of 1960) shall stand repealed; (b) all debts, liabilities and obligations incurred by the Corporation before its dissolution shall be deemed to be debts, liabilities and obligations incurred by the body or authority to which the undertakings and properties of the Corporation are transferred under section 3; (c) all contracts entered into, and all matters and things engaged to be done, by, with or for the Corporation before its dissolution shall be deemed to be contracts entered into, and matters and things engaged to be done by, with or for such body or authority as aforesaid; and (d) all suits and other legal proceedings instituted by or against the Corporation before its dissolution shall be deemed to be suits and legal proceedings instituted by or against such body or authority as aforesaid."
        },
        {
          "section_no": "5",
          "section_title": "Supplementary powers",
          "body": "Without prejudice to the foregoing provisions, the Federal Government may, in such manner as it may consider necessary or expedient, provide for ,- (a) the removal of difficulties arising out of, or in connection with, the dissolution of the Corporation or in effectively carrying out the purposes of this Ordinance; (b) other matters supplemental or incidental to, or consequential upon, the dissolution of Corporation."
        }
      ]
    }
  ],
  "source_file": "administratorad4eab69eac3b5f52ffe374d3e7ff6bc.txt"
}