{
  "law_name": "THE PAKISTAN BROADCASTING CORPORATION ACT",
  "year": 1973,
  "chapters": [
    {
      "chapter_title": "PRELIMINARY",
      "sections": [
        {
          "section_no": "1",
          "section_title": "Short title, extent and commencement",
          "body": "(1) This Act may be called the Pakistan Broadcasting Corporation Act, 1973. (2) It extends to the whole of Pakistan. (3) It shall come into force at once and shall be deemed to have taken effect on the twentieth day of December, 1972."
        },
        {
          "section_no": "2",
          "section_title": "Definitions",
          "body": "In this Act, unless there is anything repugnant in the subject or context, (a) “Board” means the Board of Directors of the Corporation; (b) “Chairman” means the Chairman of the Board; (c) “Corporation” means the Pakistan Broadcasting Corporation established under section 3; (d) “Member” means a Member of the Board; (e) “regulation” means a regulation made under this Act; (f) “rule” means a rule made under this Act; (g) “station” means any production, receiving, or transmitting unit, fixed or mobile."
        }
      ]
    },
    {
      "chapter_title": "ESTABLISHMENT AND INCORPORATION OF THE CORPORATION",
      "sections": [
        {
          "section_no": "3",
          "section_title": "Establishment of the Corporation",
          "body": "(1) As from the commencement of this Act, there shall be established a Corporation to be called the Pakistan Broadcasting Corporation. (2) The Corporation shall be a body corporate by the name of the Pakistan Broadcasting Corporation, having perpetual succession and a common seal, with power to hold and dispose of property, and shall by the said name sue and be sued."
        },
        {
          "section_no": "3A",
          "section_title": "Application of Act VII of 2023",
          "body": "(1) The provisions of the State-Owned Enterprises (Governance and Operations) Act, 2023 (VII of 2023) shall apply to the Pakistan Broadcasting Corporation which shall be deemed to be a state-owned enterprise for the purposes of the said Act. (2) Where any inconsistency arises in a provision of the said Act and a provision of this Act for the purpose of governance of the corporation as a state-owned enterprise, the provisions of the said Act shall prevail."
        }
      ]
    },
    {
      "chapter_title": "MANAGEMENT",
      "sections": [
        {
          "section_no": "4",
          "section_title": "Board",
          "body": "(1) The general direction and the administration of the Corporation shall vest in a Board consisting of members appointed by the Federal Government. (2) The members, other than ex-officio members, shall hold office for a term of three years and shall be eligible for re-appointment but in no case for more than two consecutive terms."
        },
        {
          "section_no": "6",
          "section_title": "Removal of independent members",
          "body": "The Federal Government may, by notification in the official Gazette, remove an independent member in accordance with the provisions of the SOE Act."
        },
        {
          "section_no": "7",
          "section_title": "Meetings of the Board",
          "body": "(1) The Board shall meet at such time and such place as may be prescribed by regulations. (2) Not less than fifty percent of total membership of the Board including not less than four independent and one ex-officio members shall constitute quorum for a meeting of the Board."
        },
        {
          "section_no": "8",
          "section_title": "Director-General",
          "body": "(1) There shall be a Director General of the Corporation who shall be its chief executive officer to be appointed by the Board. (2) The Director General shall be responsible for the management of the Corporation and for its procedures in financial and other matters under delegation from the Board."
        },
        {
          "section_no": "9",
          "section_title": "Delegation of powers",
          "body": "The Board may, from time to time, delegate any of its powers to the Director-General or any other officer of the Corporation."
        }
      ]
    },
    {
      "chapter_title": "FUNCTIONS OF THE CORPORATION",
      "sections": [
        {
          "section_no": "10",
          "section_title": "Functions of the Corporation",
          "body": "(1) The functions of the Corporation shall be to provide broadcasting services for general reception in all parts of Pakistan and to broadcast programmes that promote Islamic ideology, national unity, and principles of democracy."
        }
      ]
    },
    {
      "chapter_title": "ESTABLISHMENT",
      "sections": [
        {
          "section_no": "11",
          "section_title": "Employment of officers and staff",
          "body": "The Board may, from time to time, employ such persons as it may consider necessary for the performance of its functions on such terms and conditions as it may prescribe by regulations."
        },
        {
          "section_no": "12",
          "section_title": "Transfer of Radio Pakistan servants to the Corporation",
          "body": "(1) The Federal Government may transfer persons in the service of Pakistan and serving in connection with the affairs of Radio Pakistan to the Corporation on the same terms and conditions to which they were entitled immediately before such commencement."
        }
      ]
    },
    {
      "chapter_title": "FINANCE",
      "sections": [
        {
          "section_no": "13",
          "section_title": "Sources of income",
          "body": ""
        },
        {
          "section_no": "14",
          "section_title": "Budget for capital and development expenditure",
          "body": ""
        },
        {
          "section_no": "15",
          "section_title": "Borrowing power",
          "body": ""
        },
        {
          "section_no": "16",
          "section_title": "Audit and accounts",
          "body": ""
        },
        {
          "section_no": "18",
          "section_title": "Reports",
          "body": ""
        },
        {
          "section_no": "19",
          "section_title": "Transfer of assets and liabilities of Radio Pakistan",
          "body": ""
        },
        {
          "section_no": "20",
          "section_title": "Liquidation of Corporation",
          "body": ""
        }
      ]
    },
    {
      "chapter_title": "RULES AND REGULATIONS",
      "sections": [
        {
          "section_no": "21",
          "section_title": "Power to make rules",
          "body": ""
        },
        {
          "section_no": "22",
          "section_title": "Power to make regulations",
          "body": ""
        },
        {
          "section_no": "22A",
          "section_title": "Removal of difficulties",
          "body": ""
        }
      ]
    }
  ],
  "source_file": "administrator79c76a6cda926cc288d9f9b6a5d5b264.txt"
}