{
  "law_name": "THE SPECIAL MARRIAGE ACT",
  "year": 1872,
  "chapters": [
    {
      "chapter_title": "PRELIMINARY",
      "sections": [
        {
          "section_no": "1",
          "section_title": "Local extent",
          "body": "This Act extends to the whole of Pakistan."
        },
        {
          "section_no": "2",
          "section_title": "Conditions upon which marriages under Act may be celebrated",
          "body": "Marriages may be celebrated under this Act between persons neither of whom professes the Christian or the Jewish, or the Hindu or the Muslim, or the Parsi or the Buddhist, or the Sikh or the Jaina religion upon the following conditions: (1) neither party must, at the time of the marriage, have a husband or wife living: (2) the man must have completed his age of eighteen years, and the woman her age of fourteen years, according to the Gregorian calendar: (3) each party must, if he or she has not completed the age of twenty-one years, have obtained the consent of his or her father or guardian to the marriage: (4) the parties must not be related to each other in any degree of consanguinity or affinity which would, according to any law to which either of them is subject, render a marriage between them illegal."
        },
        {
          "section_no": "3",
          "section_title": "Appointment of Marriage Registrars",
          "body": "The Provincial Government may appoint one or more Registrars under this Act, either by name or as holding any office for the time being, for any portion of the territory subject to its administration."
        },
        {
          "section_no": "4",
          "section_title": "One of the parties to intended marriage to give notice to Registrar",
          "body": "When a marriage is intended to be solemnized under this Act, one of the parties must give notice in writing to the Registrar before whom it is to be solemnized."
        },
        {
          "section_no": "5",
          "section_title": "Notice to be filed and copy entered in the Marriage Notice Book",
          "body": "The Registrar shall file all such notices and keep them with the records of his office, and shall also forthwith enter a true copy of every such notice in a book to be for that purpose furnished to him by the Provincial Government."
        },
        {
          "section_no": "6",
          "section_title": "Objection to marriage",
          "body": "Fourteen days after notice of an intended marriage has been given under section 4, such marriage may be solemnized, unless it has been previously objected to."
        },
        {
          "section_no": "7",
          "section_title": "Procedure on receipt of objection",
          "body": "On receipt of such notice of objection the Registrar shall not proceed to solemnize the marriage until the lapse of fourteen days from the receipt of such objection."
        },
        {
          "section_no": "8",
          "section_title": "Objector may file suit",
          "body": "The person objecting to the intended marriage may file a suit in any Civil Court having local jurisdiction for a declaratory decree."
        },
        {
          "section_no": "9",
          "section_title": "Certificate of filing of suit to be lodged with Registrar",
          "body": "The officer before whom such suit is filed shall give the person presenting it a certificate to the effect that such suit has been filed."
        },
        {
          "section_no": "10",
          "section_title": "Court may fine when objection not reasonable",
          "body": "Any Court in which any such suit is filed may, if it shall appear to it that the objection was not reasonable and bona fide, inflict a fine."
        },
        {
          "section_no": "11",
          "section_title": "Declaration by parties and witnesses",
          "body": "Before the marriage is solemnized, the parties and three witnesses shall, in the presence of the Registrar, sign a declaration."
        },
        {
          "section_no": "12",
          "section_title": "Marriage how to be solemnized",
          "body": "The marriage shall be solemnized in the presence of the Registrar and of the three witnesses who signed the declaration."
        },
        {
          "section_no": "13",
          "section_title": "Place where marriage may be solemnized",
          "body": "The marriage may be celebrated either at the office of the Registrar or at such other place, within reasonable distance of the office of the Registrar, as the parties desire."
        },
        {
          "section_no": "13A",
          "section_title": "Transmission of certified copies of entries in Marriage Certificate Book to the Registrar General of Births, Deaths and Marriages",
          "body": "The Registrar shall send to the Registrar General of Births, Deaths and Marriages for the territories within which his district is situate, a true copy certified by him."
        },
        {
          "section_no": "14",
          "section_title": "Fees",
          "body": "The fees for the services provided under this Act shall be prescribed by the Provincial Government."
        },
        {
          "section_no": "15",
          "section_title": "Penalty on married person marrying again under Act",
          "body": "Any married person who marries again under this Act shall be subject to penalties."
        },
        {
          "section_no": "16",
          "section_title": "Punishment of bigamy",
          "body": "Bigamy shall be punishable under the provisions of this Act."
        },
        {
          "section_no": "17",
          "section_title": "Divorce Act to apply",
          "body": "The provisions of the Divorce Act shall apply to marriages solemnized under this Act."
        },
        {
          "section_no": "18",
          "section_title": "Law to apply to issue of marriages under Act",
          "body": "The law applicable to marriages under this Act shall be as prescribed."
        },
        {
          "section_no": "19",
          "section_title": "Saving of marriages solemnized otherwise than under Act",
          "body": "Marriages solemnized otherwise than under this Act shall be saved."
        },
        {
          "section_no": "20",
          "section_title": "[Repealed]",
          "body": ""
        },
        {
          "section_no": "21",
          "section_title": "Penalty for signing declarations or certificates containing false statements",
          "body": "Any person signing false declarations or certificates shall be subject to penalties."
        },
        {
          "section_no": "22",
          "section_title": "Effect of certain marriages on coparcenary",
          "body": "Certain marriages shall have specific effects on coparcenary."
        },
        {
          "section_no": "23",
          "section_title": "Rights of succession in certain cases of marriages under Act",
          "body": "Rights of succession shall be defined for marriages under this Act."
        },
        {
          "section_no": "24",
          "section_title": "Succession to the property of parties married under Act",
          "body": "Succession to property shall be governed by the provisions of this Act."
        },
        {
          "section_no": "25",
          "section_title": "Person marrying under Act not to have right of adoption",
          "body": "Persons marrying under this Act shall not have the right of adoption."
        },
        {
          "section_no": "26",
          "section_title": "Adoption by father of person marrying under Act",
          "body": "The father of a person marrying under this Act may adopt."
        }
      ]
    }
  ],
  "source_file": "administratora0bf0b1883050a237d47158b9a5791a2.txt"
}