{
  "law_name": "THE SENATE (ELECTION) ACT",
  "year": 1975,
  "chapters": [
    {
      "chapter_title": "PRELIMINARY",
      "sections": [
        {
          "section_no": "1",
          "section_title": "Short title and commencement.",
          "body": "(1) This Act may be called the Senate (Election) Act, 1975. (2) It shall come into force at once."
        },
        {
          "section_no": "2",
          "section_title": "Definitions.",
          "body": "(1) In this Act, unless there is anything repugnant in the subject or context, (a) 'bye-election' means an election to fill a casual vacancy referred to in section 77; (b) 'candidate' means a person proposed as a candidate for election as a member; (c) 'Chairman' means Chairman of the Senate; (cc) 'Commission' means the Election Commission; (ccc) 'Commissioner' means the Chief Election Commissioner; (d) 'contesting candidate' means a candidate who has been validly nominated for election as a member and has not withdrawn his candidature; (e) 'election' means an election to the Senate other than a bye-election and includes an election to fill the seat of a member which falls vacant on the expiration of his term; (f) 'election petition' means an election petition made under section 34; (g) 'electoral roll' means an electoral roll prepared under the law relating to the preparation and revision of electoral rolls for the time being in force; (h) 'member' means member of the Senate; (i) 'nomination day' means the day appointed under section 10 for the nomination of candidates; (j) 'polling day' means the day on which poll is taken for an election; (k) 'Polling Officer' means a Polling Officer appointed under section 7; (l) 'prescribed' means prescribed by rules; (m) 'returned candidate' means a candidate who has been declared elected as a member under this Act; (n) 'Returning Officer' means a Returning Officer appointed under section 5 and includes a Polling Officer acting as, or performing the functions of, Returning Officer; (o) 'rules' means rules made under this Act; (p) 'scrutiny day' means the day appointed under section 10 for the scrutiny of nomination papers; (q) 'voter' means, in relation to a Province, a person who is a member of the Provincial Assembly of that Province; and (r) 'withdrawal day' means the day appointed under section 10 on or before which candidature may be withdrawn."
        }
      ]
    },
    {
      "chapter_title": "ADMINISTRATIVE MACHINERY FOR THE CONDUCT OF ELECTIONS",
      "sections": [
        {
          "section_no": "3",
          "section_title": "Organisation and conduct of election.",
          "body": "Subject to the provisions of this Act and the rules, the Commissioner shall regulate the procedure for organizing, and conducting an election in such manner as he may deem fit."
        },
        {
          "section_no": "4",
          "section_title": "Delegation of powers.",
          "body": "The Commissioner may authorise any of the officers subordinate to him to exercise and perform all or any of his powers and functions under this Act."
        },
        {
          "section_no": "5",
          "section_title": "Returning Officers.",
          "body": "For the purposes of an election, the Commissioner shall appoint a Returning Officer for each Province."
        },
        {
          "section_no": "6",
          "section_title": "Polling Stations.",
          "body": "The Commissioner shall provide a polling station for the purpose of election members by the members of a Provincial Assembly."
        },
        {
          "section_no": "7",
          "section_title": "Polling Officers.",
          "body": "The Commissioner shall, for the purpose of conducting an election, also appoint such number of Polling Officers to assist the Returning Officer as he may consider necessary."
        },
        {
          "section_no": "8",
          "section_title": "Duties and powers of Returning Officer.",
          "body": "(1) A Returning Officer shall conduct the poll in accordance with the provisions of this Act and the rules and shall exercise all necessary powers for maintaining order at the polling station and shall report to the Commissioner any fact or incident which may, in his opinion, affect the conduct or fairness of the Poll. (2) The Returning Officer may, during the course of the poll, entrust to any Polling Officer such of his functions as may be specified by him; and it shall be the duty of the Polling Officer to perform the functions so entrusted. (3) The Returning Officer shall authorise one of the Polling Officers to act in his place if he is, at any time during the poll, by reason of illness or other cause, not present at the polling station or is unable to perform his functions. (4) The Returning Officer may, at any time during the poll, for reasons to be recorded in writing, suspend any Polling Officer and make such arrangements as he may consider necessary for the performance of the functions of the Officer so suspended. (5) It shall be the duty of a Returning Officer to do all such acts and things as may be necessary for effectively conducting an election in accordance with the provisions of this Act and the rules."
        }
      ]
    },
    {
      "chapter_title": "CONDUCT OF ELECTION",
      "sections": [
        {
          "section_no": "9",
          "section_title": "Supply of list of voters.",
          "body": "The Commissioner shall provide the Returning Officer with a list of voters of the Province."
        },
        {
          "section_no": "10",
          "section_title": "Notification for election.",
          "body": "(1) For the purpose of an election, the Commissioner shall, by notification in the official Gazette, call upon the members of the Provincial Assembly of a Province to elect such number of members to the Senate from that Province as is specified in such notification. (2) The Commissioner shall in the same notification fix (a) a day for the nomination of candidates; (b) a day for the scrutiny of nomination papers; (c) a day on or before which candidature may be withdrawn; and (d) a day for the taking of the poll and the place at which the poll shall be taken."
        },
        {
          "section_no": "11",
          "section_title": "Nomination for election.",
          "body": "(1) A voter from a Province may propose or second the name of any person qualified for election to the Senate from that Province. (2) Every nomination shall be made by a separate nomination paper in the prescribed form signed both by the proposer and the seconder and shall, on solemn affirmation made and signed by the candidate, accompany (a) a declaration that he has consented to the nomination and that he fulfils the qualifications specified in Article 62 of the Constitution and is not subject to any of the disqualifications specified in Article 63 thereof or any other law for the time being in force for being elected as member; (b) a declaration about his party affiliation, if any; (c) a declaration that no loan for an amount of two million rupees or more, obtained from any bank, financial institution, cooperative society or corporate body in his own name or in the name of his spouse or any of his dependents, or any business concern mainly owned by him or the aforesaid; stands unpaid for more than one year from the due date, or has got such loan written off; (d) a declaration that he, his spouse or any of his dependents or a business concern mainly owned by him or the aforesaid, is not in default in payment of government dues or utility charges, including telephone, electricity, gas and water charges of an amount in excess of ten thousand rupees, for over six month, at the time of filing of nomination paper; (e) a statement specifying his educational qualifications, occupation, National Identity Card number and National Tax Number, if any, along with attested copies thereof; and (f) a statement of his assets and liabilities and those of his spouse and dependents on the prescribed form as on the preceding thirtieth day of June."
        }
      ]
    },
    {
      "chapter_title": "ELECTION EXPENSES",
      "sections": [
        {
          "section_no": "27",
          "section_title": "Election expenses.",
          "body": ""
        },
        {
          "section_no": "28",
          "section_title": "Restriction on election expenses.",
          "body": ""
        },
        {
          "section_no": "29",
          "section_title": "Return of election expenses.",
          "body": ""
        },
        {
          "section_no": "30",
          "section_title": "Inspection of returns, etc.",
          "body": ""
        }
      ]
    },
    {
      "chapter_title": "ELECTION DISPUTES",
      "sections": [
        {
          "section_no": "31",
          "section_title": "Election not to be questioned except by election petition or appeal.",
          "body": ""
        },
        {
          "section_no": "32",
          "section_title": "Appeal against count.",
          "body": ""
        },
        {
          "section_no": "33",
          "section_title": "Commissioner to have certain powers of a court.",
          "body": ""
        },
        {
          "section_no": "34",
          "section_title": "Election petition.",
          "body": ""
        },
        {
          "section_no": "35",
          "section_title": "Parties to the petition.",
          "body": ""
        },
        {
          "section_no": "36",
          "section_title": "Contents of petition.",
          "body": ""
        },
        {
          "section_no": "37",
          "section_title": "Procedure on receipt of petition by the Commissioner.",
          "body": ""
        },
        {
          "section_no": "38",
          "section_title": "Appointment of Tribunal.",
          "body": ""
        },
        {
          "section_no": "39",
          "section_title": "Power to transfer petition.",
          "body": ""
        },
        {
          "section_no": "40",
          "section_title": "Place of trial.",
          "body": ""
        },
        {
          "section_no": "41",
          "section_title": "Advocate-General to assist the Tribunal.",
          "body": ""
        },
        {
          "section_no": "42",
          "section_title": "Appearance before Tribunal.",
          "body": ""
        },
        {
          "section_no": "43",
          "section_title": "Procedure before Tribunal.",
          "body": ""
        },
        {
          "section_no": "44",
          "section_title": "Dismissal of petition during trial.",
          "body": ""
        },
        {
          "section_no": "45",
          "section_title": "Powers of the Tribunal.",
          "body": ""
        },
        {
          "section_no": "46",
          "section_title": "Further provision relating to evidence and witnesses.",
          "body": ""
        },
        {
          "section_no": "47",
          "section_title": "Recrimination where seat is claimed.",
          "body": ""
        },
        {
          "section_no": "48",
          "section_title": "Decision of the Tribunal.",
          "body": ""
        },
        {
          "section_no": "49",
          "section_title": "Ground for declaring election of returned candidate void.",
          "body": ""
        },
        {
          "section_no": "50",
          "section_title": "Ground for declaring a person other than a returned candidate elected.",
          "body": ""
        },
        {
          "section_no": "51",
          "section_title": "Ground for declaring election as a whole void.",
          "body": ""
        },
        {
          "section_no": "52",
          "section_title": "Other provisions relating to tribunal.",
          "body": ""
        },
        {
          "section_no": "53",
          "section_title": "Withdrawal of petition.",
          "body": ""
        },
        {
          "section_no": "54",
          "section_title": "Abatement on death of petitioner.",
          "body": ""
        },
        {
          "section_no": "55",
          "section_title": "Death or withdrawal of respondent.",
          "body": ""
        },
        {
          "section_no": "56",
          "section_title": "Failure of petitioner to appear.",
          "body": ""
        },
        {
          "section_no": "56A",
          "section_title": "Additional Powers of the Tribunal.",
          "body": ""
        },
        {
          "section_no": "57",
          "section_title": "Order as to costs.",
          "body": ""
        }
      ]
    },
    {
      "chapter_title": "OFFENCES, PENALTY AND PROCEDURE",
      "sections": [
        {
          "section_no": "58",
          "section_title": "Corrupt practice.",
          "body": ""
        },
        {
          "section_no": "59",
          "section_title": "Bribery.",
          "body": ""
        },
        {
          "section_no": "60",
          "section_title": "Personation.",
          "body": ""
        },
        {
          "section_no": "61",
          "section_title": "Undue influence.",
          "body": ""
        },
        {
          "section_no": "62",
          "section_title": "Penalty for corrupt practice.",
          "body": ""
        },
        {
          "section_no": "63",
          "section_title": "Illegal practice.",
          "body": ""
        },
        {
          "section_no": "64",
          "section_title": "Prohibition of public meetings, etc., during certain period.",
          "body": ""
        },
        {
          "section_no": "65",
          "section_title": "Prohibition of canvassing in or near polling station.",
          "body": ""
        },
        {
          "section_no": "66",
          "section_title": "Disorderly conduct near polling station.",
          "body": ""
        },
        {
          "section_no": "67",
          "section_title": "Tampering with papers.",
          "body": ""
        },
        {
          "section_no": "68",
          "section_title": "Interference with the secrecy of voting.",
          "body": ""
        },
        {
          "section_no": "69",
          "section_title": "Failure to maintain secrecy.",
          "body": ""
        },
        {
          "section_no": "70",
          "section_title": "Officials not to influence voters.",
          "body": ""
        },
        {
          "section_no": "71",
          "section_title": "Breaches of official duty in connection with election.",
          "body": ""
        },
        {
          "section_no": "72",
          "section_title": "Assistance by Government servant.",
          "body": ""
        },
        {
          "section_no": "73",
          "section_title": "Certain powers of a police officer.",
          "body": ""
        },
        {
          "section_no": "74",
          "section_title": "Certain Offences cognizable.",
          "body": ""
        },
        {
          "section_no": "75",
          "section_title": "Prosecution for offences by public officers.",
          "body": ""
        },
        {
          "section_no": "76",
          "section_title": "Limitation for prosecution for corrupt or illegal practices.",
          "body": ""
        }
      ]
    },
    {
      "chapter_title": "BYE-ELECTION",
      "sections": [
        {
          "section_no": "77",
          "section_title": "Casual vacancies.",
          "body": ""
        },
        {
          "section_no": "78",
          "section_title": "Disqualification.",
          "body": ""
        },
        {
          "section_no": "79",
          "section_title": "Disqualification on account of certain offences.",
          "body": ""
        },
        {
          "section_no": "80",
          "section_title": "Removal and remission of disqualification.",
          "body": ""
        }
      ]
    },
    {
      "chapter_title": "MISCELLANEOUS",
      "sections": [
        {
          "section_no": "81",
          "section_title": "Extension of time for completion of election.",
          "body": ""
        },
        {
          "section_no": "82",
          "section_title": "Term of office.",
          "body": ""
        },
        {
          "section_no": "82A",
          "section_title": "Drawing of lots for determining term of Office of individual members.",
          "body": ""
        },
        {
          "section_no": "83",
          "section_title": "Vacancy in membership of Provincial Assemblies not to invalidate election.",
          "body": ""
        },
        {
          "section_no": "84",
          "section_title": "Commissioner to ensure fair election, etc.",
          "body": ""
        },
        {
          "section_no": "85",
          "section_title": "Directions of commissioner in certain matters.",
          "body": ""
        },
        {
          "section_no": "86",
          "section_title": "Jurisdiction of courts barred.",
          "body": ""
        },
        {
          "section_no": "87",
          "section_title": "Protection of action taken in good faith.",
          "body": ""
        },
        {
          "section_no": "88",
          "section_title": "Power to make rules.",
          "body": ""
        }
      ]
    }
  ],
  "source_file": "administrator131b6e2a860ffda1d587fbd4bc73d116.txt"
}