{
  "error": "Expecting value: line 1 column 1 (char 0)",
  "raw": "THE NORTH-WEST FRONTIER CONSTABULARY ACT, 1915 CONTENTS 1. Short title, extent, application and commencement 2. Definitions 3. Power to maintain Frontier Constabulary 3A. Power to employ Frontier Constabulary in other parts of Pakistan. 4. Constitution of Constabulary 5. Appointment and powers of superior officers 6. Appointment of subordinate officers and men 7. Superintendence, control and administration of Constabulary 8. More heinous offences 9. Less heinous offences 10. Minor punishments 11. Place of imprisonment and liability to dismissal on imprisonment 12. Deductions from pay and allowances. 13. Collective fines 14. Resignation and withdrawal from the Constabulary 15. General duties of members of the Constabulary 16. Power and duties conferable and imposable on members of the Constabulary 17. Protection for acts of members of the Constabulary 17A. Apprehension of deserters 18. Authority to confer exclusive powers of Sessions Court on Deputy Commissioner 19. Criminal powers conferred with in Pakistan, to be exercisable beyond Pakistan 20. Application of Act to other bodies enrolled for service on Frontier 21. Power to make rules. 22. [Repealed.] THE SCHEDULE. CONDITIONS OF SERVICE THE NORTH-WEST FRONTIER CONSTABULARY ACT, 1915. 1ACT NO. XIII OF 1915 [1st October 1915] An Act to provide for the regulation of the Frontier Constabulary in the North-West Frontier 2*. WHEREAS it is expedient to provide for the regulation of the Frontier Constabulary in the North-West Frontier 2[*] ; It is hereby enacted as follows : 1. Short title, extent, application and commencement. (1) This Act may be called the North-West Frontier Constabulary Act, 1915 ; (2) It extends to the whole of the North-West Frontier 2*, and applies also to every member of the Constabulary, wherever he may be serving ; and (3) It shall come into force on such day3 as the 4[Federal Government] may, by notification in the official Gazette, appoint in this behalf. 2. Definition. In this Act, unless ther",
  "source_file": "administrator1df90f20cebe025427367ba96a4f1b62.txt",
  "law_name": "The North-West Frontier Constabulary Act, 1915",
  "year": 1915
}