{
  "error": "Expecting value: line 1 column 1 (char 0)",
  "raw": "THE PAKISTAN INSTITUTE OF FASHION AND DESIGN ACT, 2011 CONTENTS CHAPTER I PRELIMINARY 1. Short title and commencement. 2. Definitions. CHAPTER II THE INSTITUTE 3. Incorporation of the Institute. 4. Powers and purposes of the Institute. 5. Institute open to all classes, creeds, etc. 6. Teaching and examination at the Institute. CHAPTER III OFFICERS OF THE INSTITUTE 7. Officers. 8. Chancellor and Pro-Chancellor. 9. Removal from the Senate. 10. Vice-chancellor of the Institute. 11. Appointment and removal of the Vice-Chancellor. 12. Registrar. 13. Treasurer. 14. Controller of Examinations. 15. Authorities. CHAPTER IV AUTHORITIES OF THE INSTITUE 16. Senate. CHAPTER IV AUTHORITIES OF THE INSTITUTE 17. Powers and functions of the Senate. 18. Visitations. 19. Syndicate. 20. Powers and duties of the Syndicate. 21. Academic Council. 22. Powers and functions of the Academic Council. 23. Representation committees. 24. Appointment of committees by certain Authorities. CHAPTER V STATUTES, REGULATION AND RULES 25. Statutes. 26. Regulations. 27. Rules. CHAPTER VI INSTITUTE FUND 28. Fund of the Institute. 29. Audits and accounts. CHAPTER VII GENERAL PROVISIONS 30. Opportunity to show cause. 31. Appeal to the Syndicate and the Senate. 32. Service of the Institute. 33. Benefits and Insurance. 34. Commencement of term of office of members of Authority. 35. Filling of casual vacancies in Authorities. 36. Flaws in the constitution of Authorities. 37. Proceedings of authorities not invalidated by the vacancies. 38. First statutes and regulations. 39. Transitory provisions 40. Transfer of assets and liabilities, etc. 41. Power to allow appointment of employees of the Government, other universities or educational or research institutions to the Institute. 42. Act to override other instruments, etc. 43. Indemnity. 44. Removal of difficulties. THE PAKISTAN INSTITUTE OF FASHION AND DESIGN ACT, 2011 ACT No. X OF 2011 [29th May, 2011] An Act to provide for reconstitution of the Pakistan Institu",
  "source_file": "administrator38f3ee7a40f2e730cc326044d3663f6e.txt",
  "law_name": "The Pakistan Institute of Fashion and Design Act, 2011",
  "year": 2011
}