{
  "law_name": "THE NATIONAL UNIVERSITY OF COMPUTER AND EMERGING SCIENCES ORDINANCE",
  "year": 2000,
  "chapters": [
    {
      "chapter_title": "Contents",
      "sections": [
        {
          "section_no": "1",
          "section_title": "Short title and commencement",
          "body": "(1) This Ordinance may be called the National University of Computer and Emerging Sciences Ordinance, 2000. (2) It shall come into force at once."
        },
        {
          "section_no": "2",
          "section_title": "Definitions",
          "body": "In this Ordinance, unless there is anything repugnant in the subject or context, various definitions are provided for terms such as 'Academic Council', 'Authority', 'Board', 'Chancellor', 'Dean', 'Faculty', 'Foundation', 'Head', 'Patron', 'Rector', 'Registrar', 'Statutes', 'teachers', 'teaching department', and 'University'."
        },
        {
          "section_no": "3",
          "section_title": "Establishment and incorporation of the University",
          "body": "(1) There shall be established at Islamabad a University to be called the National University of Computer and Emerging Sciences consisting of various members and bodies. (2) The University shall be a body corporate with perpetual succession and a common seal. (3) The University will be a multi-campus university with its principal seat at Islamabad. (4) The University shall receive and abide by directives issued by the Foundation."
        },
        {
          "section_no": "4",
          "section_title": "Powers and functions of the University",
          "body": "The University shall have the powers to provide instruction and training, admit and examine students, hold examinations, confer degrees, prescribe courses, pursue research, establish facilities, and more."
        },
        {
          "section_no": "5",
          "section_title": "University open to all",
          "body": "The University shall be open to persons of either sex of whatever religion, race, creed, colour or domicile who are academically qualified for admission."
        },
        {
          "section_no": "6",
          "section_title": "Teaching and examinations",
          "body": "(1) The academic programmes shall be conducted in the prescribed manner. (2) The University may associate external examiners. (3) No degree shall be granted unless certain examinations are passed."
        },
        {
          "section_no": "7",
          "section_title": "Authorities of the University",
          "body": "The authorities of the University shall consist of various councils and boards."
        },
        {
          "section_no": "8",
          "section_title": "Officers of the University",
          "body": "The officers of the University shall include the Chancellor, Rector, Deans, Heads of teaching departments, and the Registrar."
        },
        {
          "section_no": "9",
          "section_title": "Patron",
          "body": "(1) The President of Pakistan shall be the Patron of the University. (2) The Patron shall preside at the convocation. (3) Proposals for honorary degrees are subject to confirmation by the Patron."
        },
        {
          "section_no": "10",
          "section_title": "Visitation",
          "body": "(1) The Chancellor may cause an inspection or inquiry. (2) The Chancellor shall communicate his views to the Board. (3) The Board shall communicate actions taken. (4) The Chancellor may issue directions if necessary."
        },
        {
          "section_no": "11",
          "section_title": "Rector",
          "body": "(1) The Chancellor shall appoint a Rector on the recommendation of the Board of Trustees. (2) The Rector shall be the chief academic and administrative officer. (3) The Rector shall submit plans, direct activities, authorize expenditure, and appoint staff."
        }
      ]
    }
  ],
  "source_file": "administratordbbced85c2a2e033ef5ef0acced5dc89.txt"
}