{
  "error": "Expecting value: line 1 column 1 (char 0)",
  "raw": "Updated till 06.12.2022 THE TRANSFER OF POPULATION WELFARE PROGRAMME (FIELD ACTIVITIES) ORDINANCE, 1983. CONTENTS SECTIONS: 1. Short title and commencement. 2. Ordinance to override other laws. 3. Definitions. 4. Transfer of field activities to the Provincial Government. 5. Powers, functions and responsibilities of the Provincial Governments. 6. Functions of the Federal Government, etc. 7. Transfer of other activities to the Provinces. 8. Transfer, etc., of employees. 9. Assets and liabilities, etc. 10. Financing of the Population Welfare Programme. 11. Removal of difficulties. 12. Power to make rules. THE TRANSFER OF POPULATION WELFARE PROGRAMME (FIELD ACTIVITIES) ORDINANCE, 1983. ORDINANCE No. XIX OF 1983 [2nd August, 1983] An Ordinance to provide for the transfer of field activities of the Population Welfare Programme to the Provincial Governments. WHEREAS it is expedient to provide for the transfer of field activities of the Population Welfare Programme under the Population Welfare Division to the Provincial Governments for their speedy implementation and exercising effective supervision and control and for matters connected therewith or ancillary thereto; AND WHEREAS the President is satisfied that circumstances exist which render it necessary to take immediate action ; NOW, THEREFORE, in pursuance of the Proclamation of the fifth day of July, 1977, and in exercise of all powers enabling him in that behalf, the President is pleased to make and promulgate the following Ordinance : 1. Short title and commencement.⎯ (1) This Ordinance may be called the Transfer of Population Welfare Programme (Field Activities) Ordinance, 1983. (2) It shall come into force on such date as the Federal Government may, by notification in the official Gazette, appoint. 2. Ordinance to override other laws. This Ordinance shall have effect notwithstanding anything contained in any other law for the time being in force. 3. Definitions. In this Ordinance, unless there is anything repugnan",
  "source_file": "administrator6767baf09de0a47be3636af17e2ac8ab.txt",
  "law_name": "The Transfer of Population Welfare Programme (Field Activities) Ordinance, 1983",
  "year": 1983
}