{
  "law_name": "THE ENEMY PROPERTY (CONTINUANCE OF EMERGENCY PROVISIONS) ORDINANCE",
  "year": 1969,
  "chapters": [
    {
      "chapter_title": "CONTENTS",
      "sections": [
        {
          "section_no": "1",
          "section_title": "Short title, extent and commencement",
          "body": "(1) This Ordinance may be called the Enemy Property (Continuance of Emergency Provisions) Ordinance, 1969. (2) It extends to the whole of Pakistan and applies to all citizens of Pakistan, and persons in the service of Government, wherever they may be. (3) It shall come into force on the day on which the Defence of Pakistan Ordinance, 1965 (XXIII of 1965), ceases to have effect under clause (7) of Article 30 of the Constitution."
        },
        {
          "section_no": "2",
          "section_title": "Continuance of certain emergency provisions",
          "body": "Notwithstanding the Defence of Pakistan Ordinance, 1965 (XXIII of 1965), ceasing to have effect. (a) the provisions of the Defence of Pakistan Rules mentioned in the first column of the Schedule to this Ordinance shall continue in force, and shall have effect subject to the modifications specified in the second column thereof; (b) any order or other instrument made or deemed to be made under or in pursuance of any of the said provisions and in force immediately before the commencement of this Ordinance shall continue in force so far as consistent with the provisions as continued in force by this section and be deemed to be made under or in pursuance of the provisions so continued in force."
        },
        {
          "section_no": "3",
          "section_title": "Effect of rules, etc. inconsistent with other enactments",
          "body": "The provisions of the Defence of Pakistan Rules as continued in force by section 2 and all orders made or deemed to be made under such provisions shall have effect notwithstanding anything inconsistent therewith contained in any enactment other than this ordinance or in any instrument having effect by virtue of any enactment other than this Ordinance."
        },
        {
          "section_no": "4",
          "section_title": "Delegations",
          "body": "(1) The Federal Government may by order direct that any power or duty which by or under any of the provisions as continued in force by section 2 is conferred or imposed upon the Federal Government shall in such circumstances and under such conditions, if any, as may be specified in the direction be exercised or discharged (a) by any officer or authority subordinate to the Federal Government, or (b) by any Provincial Government or by any officer or authority subordinate to such Government, or (c) by any other authority. (2) A Provincial Government may by order direct that any power or duty which has been directed under sub-section (1) to be exercised or discharged by the Provincial Government shall, in such circumstances and under such conditions, if any, as may be specified in the direction, be exercised or discharged by any officer or authority, not being an officer or authority subordinate to the Federal Government. (3) All orders delegating any power or duty conferred or imposed by any of the provisions continued in force by section 2 made by the Federal Government before the commencement of this Ordinance and in force immediately before such commencement shall continue in force and be deemed to be made by the Federal Government under this section."
        },
        {
          "section_no": "5",
          "section_title": "Savings as to orders, etc.",
          "body": "(1) Notwithstanding the Defence of Pakistan Ordinance, 1965 (XXIII of 1965), ceasing to have effect and anything contained in any other law, treaty or agreement for the time being in force or any other instrument having the force of law, all orders and notifications issued and action taken before the commencement of this Ordinance relating to the entry, exit or transit, of traffic to or from any country by rail, road or river transport shall continue in force and shall have effect as if issued or taken under this Ordinance. (2) No order made or deemed to be made in exercise of any power conferred by or under any of the provisions continued in force by section 2 shall be called in question in any court. (3) Where an order purports to have been made and signed by any authority in exercise of any power conferred by or under any of the aforesaid provisions, a court shall, within the meaning of the Evidence Act, 1872 (I of 1872), presume that such order was so made by that authority."
        },
        {
          "section_no": "6",
          "section_title": "Protection of action taken under rules",
          "body": "(1) No suit, prosecution or other legal proceeding shall lie against any person for anything which is in good faith done or intended to be done in pursuance of any of the provisions continued in force by section 2 or any order made or deemed to be made thereunder. (2) No suit or other legal proceeding shall lie against the Government for any damage caused or likely to be caused by any thing in good faith done or intended to be done in pursuance of any of the provisions continued in force by section 2 or any order made or deemed to be made thereunder."
        }
      ]
    }
  ],
  "source_file": "administratore2688f380a1b6331f72585033581d491.txt"
}