{
  "error": "Expecting value: line 1 column 1 (char 0)",
  "raw": "Updated till 3.8.2022 THE UNANI, AYURVEDIC AND HOMOEOPATHIC PRACTITIONERS ACT, 1965 CONTENTS PART I PRELIMINARY 1. Short title, extent and commencement. 2. Definitions. 3. Establishment and incorporation of Councils. PART II CONSTITUTION AND FUNCTIONS OF COUNCILS CHAPTER I COMPOSITION AND PROCEEDINGS OF COUNCILS 4. Composition of the National Council for Tib. 5. Composition of the National Council for Homoeopathy. 6. The President. 7. Elections. 8. Publication of names, etc. 9. Term of office of members. 10. Vacancies not to invalidate proceedings of Council. 11. Resignation by President etc. 12. Declaration of vacancies. 13. Disqualification of members. 14. Functions of the Council. 15. Meetings of the council. 16. Officers of the Council and their pay and allowances. CHAPTER II TEACHING INSTITUTIONS AND EXAMINATIONS 17. Recognition of Institutions. 18. Maintenance of Standard of efficiency. 19. Withdrawal of recognition. 20. Duration of courses. 21. Qualifications for admission to institutions. 22. Qualifying examination. CHAPTER III REGISTRATION OF PRACTIONERS 23. Registration how made. 24. Registration of Unani, Ayurvedic Homoeopathic practitioners. 25. Registration of Unani and Ayurvedic Practitioners in Category B. 26. Registration of Homoeopathic Practitioners. 27. Listing of certain Homoeopathic. 28. Removal from register, etc. 29. Cancellation or alteration of entries in Register, etc. CHAPTER IV POWERS AND DUTIES OF REGISTRAR 30. Maintenance of register, etc. 31. Publication of List. PART III GENERAL PROVISIONS CHAPTER I RIGHT, DUTIES AND LIABILITIES OF REGISTERED PRACTITIONERS 32. Intimation of change of address. 33. Privileges of registered practitioners. 34. Privileges of listed Homoeopaths. 35. Exemption from serving on inquest etc. CHAPTER II OFFENCES, PENALTY AND PROCEDURE 36. Offences and penalties. 37. Persons not registered under Act not to practise, etc. 37A. Prohibition against calling applications, etc., by un-recognized in situations. 38. Colo",
  "source_file": "administrator0fe839ca47be25af43e93b0624d381fa.txt",
  "law_name": "The Unani, Ayurvedic and Homoeopathic Practitioners Act, 1965",
  "year": 1965
}