{
  "law_name": "The Maintenance Orders Enforcement Act",
  "year": 1921,
  "chapters": [
    {
      "chapter_title": "Contents",
      "sections": [
        {
          "section_no": "1",
          "section_title": "Short title and extent",
          "body": "(1) This Act may be called the Maintenance Orders Enforcement Act, 1921. (2) It extends to the whole of Pakistan."
        },
        {
          "section_no": "2",
          "section_title": "Definitions",
          "body": "In this Act, unless there is anything repugnant in the subject or context, 'Court of summary jurisdiction' means the Court of a District Magistrate; 'dependants' means such persons as a person against whom a maintenance order is made is liable to maintain according to the law in force in the country in which the maintenance order is made; 'maintenance order' means a decree or order, other than an order of affiliation, made by a Court in the exercise of civil or criminal jurisdiction for the periodical payment of sums of money towards the maintenance of the wife or other dependants of the person against whom the order is made; 'prescribed' means prescribed by rules made under this Act; 'Proper authority' means the authority appointed by, or under the law of, a reciprocating territory to receive and transmit documents to which this Act applies; and 'reciprocating territory' means any country in respect of which this Act for the time being applies."
        },
        {
          "section_no": "3",
          "section_title": "Reciprocal arrangements",
          "body": "If the Federal Government is satisfied that provisions have been made by the legislature of any country for the enforcement within that country of maintenance orders made by Courts in Pakistan, the Federal Government may, by notification in the official Gazette, declare that this Act applies in respect of that country and thereupon it shall apply accordingly."
        },
        {
          "section_no": "4",
          "section_title": "Registration of maintenance orders",
          "body": "(1) Where a maintenance order has, whether before or after the passing of this Act, been made against any person by any Court in any reciprocating territory, and a certified copy of the order has been transmitted by the proper authority of that territory to the Federal Government, the Federal Government shall send a copy of the order to the prescribed officer of a Court in Pakistan for registration, and, on receipt thereof, the order shall be registered in the prescribed manner. (2) The Court in which an order is to be so registered as aforesaid shall, if the Court by which the order was made was, in the opinion of the Federal Government, a Court of superior jurisdiction, be a High Court, and, if the Court was not, to its opinion, a Court of superior jurisdiction, be a Court of summary jurisdiction."
        },
        {
          "section_no": "5",
          "section_title": "Transmission of maintenance orders made in Pakistan",
          "body": "Where a Court in Pakistan has, whether before or after the commencement of this Act, made a maintenance order against any person, and it is proved to that Court that the person against whom the order was made is resident in a reciprocating territory, the Court shall send to the Federal Government, for transmission to the proper authority of that territory, a certified copy of the order."
        },
        {
          "section_no": "6",
          "section_title": "Power of summary Courts to make Provincial maintenance orders",
          "body": "(1) Where application is made to a Court of summary jurisdiction in Pakistan for a maintenance order against any person, and it is proved that that person is resident in a reciprocating territory, the Court may, in the absence of that person, if after hearing the evidence it is satisfied of the justice of the application, make any such order as it might have made if that person had wilfully neglected to attend the Court; but in such case the order shall be provisional only and shall have no effect unless and until confirmed by a competent Court in such territory. (2) The evidence of every witness who is examined on any such application shall be reduced to writing, and such deposition shall be read over to, and signed by, him. (3) Where such an order is made, the Court shall send to the Federal Government, for transmission to the proper authority of the reciprocating territory in which the person against whom the order is made is alleged to reside, the depositions so taken and a certified copy of the order together with a statement of the grounds on which the making of the order might have been opposed if the person against whom the order is made had been duly served with a summons and had appeared at the hearing and such information as the Court possesses for facilitating the identification of that person and ascertaining his whereabouts."
        },
        {
          "section_no": "7",
          "section_title": "Power of Court of summary jurisdiction to confirm maintenance order made out of Pakistan",
          "body": "(1) Where a maintenance order has been made by a Court in a reciprocating territory and the order is provisional only, and has no effect unless and until confirmed by a Court of summary jurisdiction in Pakistan, and a certified copy of the order, together with the depositions of the witnesses and a statement of the grounds, on which the order might have been opposed, has been transmitted to the Federal Government, and it appears to the Federal Government, that the person against whom the order has been made is resident in Pakistan the Federal Government may send the said documents to the prescribed officer of a Court of summary jurisdiction, with a requisition that a summons be issued calling upon the person to show cause why that order should not be confirmed, and, upon receipt of such documents and requisition, the Court shall issue such a summons and cause it to be served upon such person. (2) A summons issued under sub-section (1) shall for all purposes be deemed to be a summons issued by the Court in the exercise of its original criminal jurisdiction. (3) At the hearing it shall be open to the person to whom the summons was issued to raise any defence which he might have raised in the original proceedings had he been a party thereto, but no other defence, and the certificate from the Court which made the provisional order stating the grounds on which the making of the order might have been opposed if the person against whom the order was made had been a party to the proceedings shall be conclusive evidence that those grounds are grounds on which objection may be taken. (4) If at the hearing the person served with the summons does not appear or, on appearing, fails to satisfy the Court that the order ought not to be confirmed, the Court may, notwithstanding any pecuniary limit imposed on its power by any law for the time being in force in Pakistan, confirm the order either without modification or with such modifications as to the Court after hearing the evidence may seem just: Provided that no sum shall be awarded as maintenance under this section, or shall be recoverable as such, at a rate exceeding that proposed in the provisional order."
        },
        {
          "section_no": "8",
          "section_title": "Enforcement of maintenance orders",
          "body": ""
        },
        {
          "section_no": "9",
          "section_title": "Payment of charges for transmission of sums awarded as maintenance and other costs and charges",
          "body": ""
        },
        {
          "section_no": "10",
          "section_title": "Proof of documents signed by officers of Court",
          "body": ""
        },
        {
          "section_no": "11",
          "section_title": "Depositions to be evidence",
          "body": ""
        },
        {
          "section_no": "12",
          "section_title": "Rule-making power",
          "body": ""
        }
      ]
    }
  ],
  "source_file": "administrator646227a132eef97dffe87d9b649c675f.txt"
}