{
  "law_name": "THE PAKISTAN INDUSTRIAL DEVELOPMENT CORPORATION (DISSOLUTION) ORDINANCE",
  "year": 1984,
  "chapters": [
    {
      "chapter_title": "Contents",
      "sections": [
        {
          "section_no": "1",
          "section_title": "Short title and commencement",
          "body": "(1) This Ordinance may be called the Pakistan Industrial Development Corporation (Dissolution) Ordinance, 1984. (2) It shall come into force at once."
        },
        {
          "section_no": "2",
          "section_title": "Definitions",
          "body": "In this Ordinance, unless there is anything repugnant in the subject or context, (a) “Corporation” means the Pakistan Industrial Development Corporation established under the Pakistan Industrial Development Corporation Ordinance, 1962 (XXXVIII of 1962). (b) “Company” means the Pakistan Industrial Development Corporation Limited, a company formed and registered under the Companies Act, 1913 (VII of 1913); (c) “Managed Company” means a company formed and registered under the Companies Act, 1913 (VII of 1913) which is being managed by the Corporation and of the issued and subscribed share capital of which the whole or a part is held by the Corporation and its nominees; (d) “project” means a project in the possession, ownership, power or control of the Corporation and includes the assets, rights, authorities, powers, privileges, properties, lands, buildings, mines, leases, lease-holds, licences, works, workshops, any related office, shop, factory godown, yard, stocks, stores, reserve fund, cash and bank balances, investments, security, book-debts, and all rights, interests and benefits in assignable contracts and choses in action relating to the project, and all books of accounts, registers, records and all other documents of whatever nature relating thereto and all borrowings, liabilities and obligations of whatever kind of or relating to the project; (e) “properties”, in relation to the Corporation, includes assets, rights, authorities, powers, privileges, properties, both movable and immovable, including lands, mines, leasees, leaseholds, licences, works, workshops, reserve funds, investments, shares, book-debts, and all rights interests and benefits in assignable contracts and choses in action; and (f) “subsidiary” means a company formed by the Corporation and registered under the Companies Act, 1913 (VII of 1913) for the purpose of eventually owning and managing a project."
        },
        {
          "section_no": "3",
          "section_title": "Ordinance to override other laws",
          "body": "The provisions of this Ordinance and any rule or order made thereunder shall have effect notwithstanding anything contained in any other law for the time being in force, or in any contract, agreement, award, memorandum or articles of association or other instrument whatsoever."
        },
        {
          "section_no": "4",
          "section_title": "Transfer of projects, etc. of the Corporation",
          "body": "The Federal Government may, by order, direct that (a) the business, projects and properties of the Corporation shall stand transferred to the Company or to such subsidiary on such date in such manner and to such extent as may be specified in the order and the business, projects and properties so transferred shall, as from that date, be carried on by, and vest, in the Company or subsidiary, as the case may be; and (b) all the shares held by the Corporation and its nominees in the capital of a Managed Company and subsidiary shall stand transferred to and vest in the Company on such date as may be specified in the order, and thereupon the Company shall become the registered holder of such shares and have the same rights under the Companies Act, 1913 (VII of 1913), or any other law or the articles of association of the Managed Company and the subsidiary as the Corporation and its nominees had immediately before the said date."
        },
        {
          "section_no": "5",
          "section_title": "Contracts and proceedings",
          "body": "(1) Unless otherwise expressly provided in this Ordinance, on the vesting of the business, projects, properties and shares of the Managed Companies in the Company or a subsidiary, all orders, contracts, deeds, bonds, agreements, powers of attorney, grants of legal representation and other instruments of whatever nature subsisting or having effect immediately before the date of the vesting, executed or issued by or in favour of the Corporation in relation to such business, projects, properties or Managed Companies shall be of as full force and effect against or in favour of the Company or as the case may be, the subsidiary and may be enforced or acted upon as fully and effectually, as if instead of the Corporation the Company or the subsidiary had been a party thereto or as if the same had been issued by or in favour of the Company or the subsidiary. (2) If any suit, appeal or other proceedings of whatever nature in relation to any business, properties or Managed Company which is or, as the case may be, the shares of which are, vested in the Company or a subsidiary is pending by or against the Corporation, the same shall not abate, be discontinued or be in any way prejudicially affected by reason of the vesting or of anything done under this Ordinance, but the suit, appeal or other proceedings may be continued, prosecuted and enforced by or against the Company or the subsidiary, as the case may be."
        },
        {
          "section_no": "6",
          "section_title": "Continuance in service of employees, etc.",
          "body": "(1) All officers, advisers, workmen and other employees of the Corporation shall stand transferred to the Company or, as the case may be, subsidiary as from the date of vesting of the projects and properties in the Company or the subsidiary. (2) Every officer, adviser, workman and other employee employed in a business or project or in connection with the properties vested in the Company or a subsidiary, by whomsoever appointed, shall, on the day of the vesting of the business, properties or project in the Company or the subsidiary, become an officer, adviser, workman or other employee as the case may be, of the Company or the subsidiary. (3) An officer, adviser, workman or other employee who becomes an officer, adviser, workman or other employee of the Company or a subsidiary shall in the Company or the subsidiary be entitled to such terms and conditions as are not less favourable than those to which he was or may be entitled immediately before the day on which he becomes an officer, adviser, workman or other employee of the Company or the subsidiary and his transfer to the company or the subsidiary shall not entitle any such officer, adviser, workman or other employee to any compensation or to the designation he was holding at the time of such transfer and no claim for such compensation or designation shall be entertained by any court tribunal or other authority."
        },
        {
          "section_no": "7",
          "section_title": "Dissolution of the Corporation",
          "body": "(1) As soon as may be after the order under section 4 is issued, the Federal Government may, by notification in the official Gazette, direct that the Corporation shall be dissolved on such date as may be specified in the notification and thereupon the Corporation shall stand dissolved. (2) Upon the dissolution of the Corporation under sub-section (I), the Pakistan industrial Development Corporation Ordinance, 1962 (XXXVIII of 1962), shall stand repealed."
        },
        {
          "section_no": "8",
          "section_title": "Provident Fund",
          "body": "Notwithstanding anything contained in the Employees Provident Fund Trust Deed or Rules of the Corporation or any other law for the time being in force, the rights and privileges of the Corporation in respect of the Employees Provident Fund shall devolve upon the Company upon the dissolution of the Corporation and any such Fund shall become the fund of the Company."
        },
        {
          "section_no": "9",
          "section_title": "Bar of Jurisdiction, etc.",
          "body": "(1) No Court shall call in question, or permit to be called in question, any order made or anything done or any action taken or purporting to be made, done or taken under this Ordinance. (2) No suit, prosecution or other legal proceedings shall lie against the Federal Government, the Corporation, the Company, a subsidiary, a Managed Company, a project or any other person for anything in good faith done or intended or purporting to be done under this Ordinance."
        },
        {
          "section_no": "10",
          "section_title": "Reference in other laws",
          "body": "Any reference to the Corporation in relation to a business, project or property which is or, as the case may be, to a Managed Company the shares of which are, vested in the Company or a subsidiary in any law, other than this Ordinance, or any contract or other instrument, shall, if not inconsistent with any provision of this Ordinance, be construed as a reference to the Company or, as the case may be, the subsidiary."
        },
        {
          "section_no": "11",
          "section_title": "Power to make rules",
          "body": "The Federal Government may, by notification in the official Gazette, make such rules as appear to it necessary or expedient for carrying out the purposes of this Ordinance."
        },
        {
          "section_no": "12",
          "section_title": "Removal of difficulties",
          "body": "If any difficulty arises in giving effect to any provision of this Ordinance, the Federal Government may make such order or issue such directives, not inconsistent with the provisions of this Ordinance, as may appear to it to be necessary or expedient for the purpose of removing the difficulty: Provided that no such order shall be made after the expiry of one year from the commencement of this Ordinance."
        }
      ]
    }
  ],
  "source_file": "administratorabf2c799818b1c3b4cad372a4972698c.txt"
}