{
  "law_name": "THE MANAGED CEMENT ESTABLISHMENTS (PAYMENT TO CORPORATION) ORDINANCE",
  "year": 1979,
  "chapters": [
    {
      "chapter_title": "Preamble",
      "sections": []
    },
    {
      "chapter_title": "Contents",
      "sections": [
        {
          "section_no": "1",
          "section_title": "Short title, extent and commencement.",
          "body": "(1) This Ordinance may be called the Managed Cement Establishments (Payment to Corporation) Ordinance, 1979. (2) It extends to the whole of Pakistan. (3) It shall come into force at once."
        },
        {
          "section_no": "2",
          "section_title": "Definitions.",
          "body": "In this Ordinance, unless there is anything repugnant in the subject or context, (a) 'Corporation' means the State Cement Corporation of Pakistan, registered under the Companies Act, 1913 (VII of 1913); and (b) 'unit' means a company the management of which has been transferred or may be transferred to the Corporation under Article 7E of the Economic Reforms Order, 1972 (P.O. No. 1 of 1972), a project and a managed company vested in the Corporation under section 4 of the West Pakistan Industrial Development Corporation (Transfer of Projects and Companies) Act, 1974 (XXVIII of 1974), and the Associated Cement vested in the Corporation under section 3 of the Associated Cement (Vesting) Act, 1974 (VII of 1975) or any other unit set up or controlled by the State Cement Corporation of Pakistan."
        },
        {
          "section_no": "3",
          "section_title": "Payment by units to Corporation.",
          "body": "Every unit shall pay to the Corporation in respect of each metric ton of cement produced and sold by it after the twenty-fourth day of March, 1976, such amount as the Federal Government may, by notification in the official Gazette, fix; and different amounts may be fixed for different periods."
        },
        {
          "section_no": "4",
          "section_title": "Allowance to be made for amounts paid by a unit for purpose of income-tax.",
          "body": "Notwithstanding anything contained in the Income-tax Ordinance, 1979 (XXXI of 1979), the amount paid by a unit to the Corporation in pursuance of section 3 shall be an expenditure for which allowance is to be made in computing profits or gains of that unit under section 23 of that Ordinance."
        },
        {
          "section_no": "5",
          "section_title": "Cement Development Fund.",
          "body": "The proceeds of the amounts paid by the units shall be credited to a fund to be known as the Cement Development Fund which shall be administered in such manner, and used by the Corporation in such development scheme or other purposes, including payment of a subsidy to a unit, that may be in the interest of the cement industry owned by the state, as may be prescribed."
        },
        {
          "section_no": "6",
          "section_title": "Power to make rules.",
          "body": "(1) The Federal Government may, by notification in the official Gazette, make rules for carrying out the purposes of this Ordinance. (2) In particular and without prejudice to the generality of the foregoing power, such rules may provide for (a) the manner and time of payment by the units; and (b) the maintenance of the accounts of the Cement Development Fund, investment of the Fund and its use in development schemes."
        }
      ]
    }
  ],
  "source_file": "administrator05a7a8b2a11c238806313e31366151d3.txt"
}