{
  "error": "Expecting value: line 1 column 1 (char 0)",
  "raw": "THE SEED ACT, 1976 CONTENTS PRELIMINARY 1. Short title, extent and commencement 2. Definitions 3. Establishment of the National Seed Development and Regulatory Authority 3A. Appointment and term of office of the Chairperson and members 3B. Meeting of the Authority 3C. Constitution of committees, bodies, etc. 3D. Board of Governors 3E. Powers and functions of the Board 4. Powers and functions of the Authority 4A. Fund of the Authority 5. Establishment of Federal Seed Certification Agency 6. Functions of Federal Seed Certification and Registration Department 7. [Omitted] 8. [Omitted] 9. Establishment of Provincial Seed Council 10. Power to notify varieties or species of seed 11. Regulation of sale of seeds of Plant varieties and species 12. Appointment of registered growers 13. Grant of certificate by Federal Certification and Registration Department 14. Period for which registration and certification shall be effective 15. Cancellation of certification 16. Appeal 17. Seed Analyst 18. Seed Certification Officer 19. Seed Inspector 20. Power of Seed Inspectors 21. Procedure to be followed by Seed Inspector 22. Report of Seed Testing Laboratory 22A. Registration or enlisting of plant variety or hybrid 22B. Registration to do seed business 22C. Registration of seed dealer 22D. Registration of seed processing units 22E. Restrictions 22F. Establishment of seed testing laboratories 22G. Registration of genetically modified plant varieties 22H. Horticulture nurseries to be registered 22I. [Omitted] 22J. Variety Evaluation Committee 23. Offences and penalty 24. Power of court to order forfeiture 24A. Appeal to the Authority 24B. Seed Tribunals 24C. Powers and functions of the Tribunals 25. Cognizance of offence etc. 26. Presumption as to order 27. Indemnity 28. Delegation of powers 28A. Audit 29. Power to make rules 30. Power to make regulations 31. Savings THE SEED ACT, 1976 ACT No. XXIX OF 1976 [11th May, 1976] An Act to provide for controlling and regulating the quality of ",
  "source_file": "administrator7e29dd4c518f15a058c2110713f9d92c.txt",
  "law_name": "The Seed Act, 1976",
  "year": 1976
}