{
  "law_name": "THE WAR INJURIES (COMPENSATION INSURANCE) ACT",
  "year": 1943,
  "chapters": [
    {
      "chapter_title": "Contents",
      "sections": [
        {
          "section_no": "1",
          "section_title": "Short title, extent and commencement",
          "body": "(1) This Act may be called the War Injuries (Compensation Insurance) Act, 1943. (2) It extends to the whole of Pakistan. (3) It shall come into force on such date as the Federal Government may, by notification in the official Gazette, appoint."
        },
        {
          "section_no": "2",
          "section_title": "Definitions",
          "body": "In this Act, unless there is anything repugnant in the subject or context, (a) 'adult' and 'minor' have the meanings assigned to those expressions in the Workmen's Compensation Act, 1923 (V of 1923); (b) 'employer' includes any body of persons whether incorporated or not and any managing agent of an employer and the legal representative of a deceased employer; (c) 'the Fund' means the War Injuries Compensation Insurance Fund constituted under section 11; (d) 'gainfully occupied person' and 'war injury' have the meanings assigned to those expressions in the War Injuries Ordinance, 1941 (Ord. VII of 1941); (e) 'partial disablement' means, where the disablement is of a temporary nature such disablement as reduces the earning capacity of a workman; (f) 'prescribe' means prescribed by rules made under section 20; (g) 'total disablement' means such disablement, whether of a temporary or permanent nature, as incapacitates a workman for all work which he was capable of performing at the time the injury was sustained; (h) 'the Scheme' means the War Injuries Compensation Insurance Scheme referred to in sub-section (1) of section 7; (i) 'wages' means wages as defined in the Workmen’s Compensation Act, 1923; (j) 'workman' means any person employed in any of the employments specified in section 6."
        },
        {
          "section_no": "3",
          "section_title": "Compensation payable under the Act by the whom and how payable",
          "body": "(1) There shall, subject to such conditions as may be specified in the Scheme, be payable by an employer, in respect of a war injury sustained by a gainfully occupied person who is a workman to whom this Act applies, compensation, in addition to any relief provided under the War Injuries Ordinance, 1941, of the amount and kind provided by section 5."
        },
        {
          "section_no": "4",
          "section_title": "Limitation on right to receive compensation otherwise than under this Act and Ordinance VII of 1941",
          "body": "(1) Where any person has a right apart from the provisions of this Act and of the War Injuries Ordinance, 1941, to receive compensation or damages from an employer in respect of a war injury in respect of which compensation is payable under this Act, the right shall extend only to so much of such compensation or damages as exceeds the amount of compensation payable under this Act."
        },
        {
          "section_no": "5",
          "section_title": "Amount of compensation",
          "body": "(1) The compensation payable under this Act shall be as follows: (a) where death results from the injury; (b) where permanent total disablement results from the injury; (c) where permanent partial disablement results from the injury; (d) where temporary disablement, whether total or partial, results from the injury."
        },
        {
          "section_no": "6",
          "section_title": "Workmen to whom the Act applies",
          "body": "The workmen to whom this Act applies are: (a) workmen employed in any employment or class of employment to which the Pakistan Essential Services (Maintenance) Act, 1952, has been declared to apply; (b) workmen employed in any factory; (c) workmen employed in any mine; (d) workmen employed in any major port; (e) workmen employed on any estate which is maintained for the purpose of growing cinchona, coffee, rubber or tea."
        },
        {
          "section_no": "7",
          "section_title": "War Injuries Compensation Insurance Scheme",
          "body": "(1) The Federal Government shall, by notification in the official Gazette, put into operation a scheme to be called the War Injuries Compensation Insurance Scheme whereby provision is made for all matters necessary to give effect to the purposes of this Act."
        },
        {
          "section_no": "8",
          "section_title": "Employment of agents by the Federal Government",
          "body": ""
        },
        {
          "section_no": "9",
          "section_title": "Compulsory insurance",
          "body": ""
        },
        {
          "section_no": "10",
          "section_title": "Prohibition of certain insurance business",
          "body": ""
        },
        {
          "section_no": "11",
          "section_title": "War Injuries Compensation Insurance Fund",
          "body": ""
        },
        {
          "section_no": "12",
          "section_title": "Principals and contractors",
          "body": ""
        },
        {
          "section_no": "13",
          "section_title": "Power of Federal Government to obtain information",
          "body": ""
        },
        {
          "section_no": "14",
          "section_title": "Recovery of premium unpaid",
          "body": ""
        },
        {
          "section_no": "15",
          "section_title": "Payment of compensation where employer has failed to insure",
          "body": ""
        },
        {
          "section_no": "16",
          "section_title": "Limitation of prosecutions",
          "body": ""
        },
        {
          "section_no": "17",
          "section_title": "Compensation of offences",
          "body": ""
        },
        {
          "section_no": "18",
          "section_title": "Bar of legal proceedings",
          "body": ""
        },
        {
          "section_no": "19",
          "section_title": "Power to exempt employers",
          "body": ""
        },
        {
          "section_no": "20",
          "section_title": "Power to make rules",
          "body": ""
        }
      ]
    }
  ],
  "source_file": "administrator653b4d4792ce7297b461fd2de3d7de84.txt"
}