{
  "law_name": "THE AGRICULTURAL PESTICIDES ORDINANCE",
  "year": 1971,
  "chapters": [
    {
      "chapter_title": "INTRODUCTORY",
      "sections": [
        {
          "section_no": "1",
          "section_title": "Short title, extent and commencement",
          "body": "(1) This Ordinance may be called the Agricultural Pesticides Ordinance, 1971. (2) It stands to the whole of Pakistan. (3) It shall come into force at once."
        },
        {
          "section_no": "2",
          "section_title": "Application of other laws not barred",
          "body": "The provisions of this Ordinance shall be in addition to, and not in derogation of the provisions of the Pension Act, 1919 (XII of 1919), and any other law for the time being in force."
        },
        {
          "section_no": "3",
          "section_title": "Definitions",
          "body": "In this Ordinance, unless there is anything repugnant in the subject or context, the expression- (a) 'adulterated' in relation to a pesticide means a pesticide with which spurious, deleterious or harmful substance has been mixed or which is wholly or mainly ineffective for the purpose for which it is intended. (b) 'advertise' means to make known by publication or distribution of any advertisement, circular or other notice; (d) 'Committee' means the Agriculture Pesticide Technical Advisory Committee constituted under this Ordinance; (e) 'formulation' means the process by which a pesticide is converted, by mixing with other substances, into a form in which it is ready to be used; (f) 'fungi' means all rusts smuts, mildews, moulds, yeasts, and similar forms of plant life prescribed in this behalf and includes bacteria affecting plant life; (g) 'Government Analyst' means a Government Analyst appointed under this Ordinance; (h) 'guarantee' means the statement indicating the strength, effectiveness and other qualities of a pesticide which an importer, manufacturer, formulator, vendor or person holding stock for sale of a pesticide is required to submit under the rules at the time of applying for the registration of the pesticide; (i) 'Inspector' means an Inspector appointed under this Ordinance; (j) 'ingredient' means any material used in making a pesticide; (k) 'insect' means any of the small invertebrate animals commonly known as insects and includes such forms of animal life as may be prescribed; (l) 'label' means the written, printed or graphic matter on, or attached to, a pesticide or the immediate container thereof, and the outside container or wrapper of the retail package, if any, of the pesticide; (m) 'package' includes every container; (n) 'pesticide' means any substance or mixture of substances used or represented as a means for preventing, destroying, repelling, mitigating or controlling, directly or indirectly, any insect, fungus, bacterial organism, nematodes, virus, weed, rodent, or other plant or animal pest; but does not include a substance which is a 'drug' within the meaning of the Drug Act, 1976. (o) 'prescribed' means prescribed by rules made under this Ordinance; (p) 'registered' means registered under this Ordinance; (q) 'registration number' means a specific number assigned by the Federal Government to each registered pesticide; (r) 'rules' means rules made under this Ordinance; (rr) 'sub-standard' when used with reference to a pesticide, means any pesticide the strength or purity of which falls below the professed or quality which is expressed on its label or under which it is sold or a pesticide any valuable ingredient of which has been wholly or partially extracted; and (s) 'weed' means any plant which grows where not wanted."
        }
      ]
    },
    {
      "chapter_title": "IMPORT, MANUFACTURE, FORMULATION, SALE, DISTRIBUTION AND USE OF PESTICIDES",
      "sections": [
        {
          "section_no": "4",
          "section_title": "Pesticides to be registered",
          "body": "No person shall import, manufacture, formulate, sell, offer for sale, hold any stock for sale or in any manner advertise any pesticide which has not been registered in the manner provided by this Act or the rules framed thereunder: Provided that the Federal Government may, by notification in the official gazette directed that the pesticide specified in the notification and not having a trade name will be imported only by a class or classes of importers as specified; except a pesticide having a trade name and registered in the country of manufacture which may be improved without undergoing the registration process but subject to the conditions notified from time to time by the Federal Government."
        },
        {
          "section_no": "5",
          "section_title": "Application for registration of pesticide",
          "body": "(1) Any person intending to import, manufacture, formulate, sell, offer for sale, hold in stock for sale or advertise any pesticide may apply to the Federal Government for the registration of the pesticide under such name as he may indicate in the application. (2) An application under sub-section (1) shall be in such form, be accompanied by such fee and contain such statements and information as may be prescribed. (3) Where the person making an application under subsection (1) is not domiciled in Pakistan, the application shall, besides such person, be signed by his agent or representative in Pakistan."
        },
        {
          "section_no": "6",
          "section_title": "Period for which registration shall be effective",
          "body": "The registration of a pesticide shall be effective from the date of its registration until the thirtieth day of June of the third year following the year of registration."
        },
        {
          "section_no": "7",
          "section_title": "Cancellation of registration",
          "body": "If, at any time after the registration of a pesticide, the Federal Government is of opinion that the registration has been secured in violation of any of the provisions of this Ordinance or the rules or that the pesticide is ineffective against pests of hazardous to vegetation, other than weeds, or to human or animal life, the Federal Government may, after giving to the person on whose application it had been registered an opportunity of being heard, cancel the registration."
        },
        {
          "section_no": "8",
          "section_title": "Renewal of registration",
          "body": "(1) The Federal Government may, on the application of the importer, manufacturer, formulator, vendor or stock holder of a registered pesticide in the guarantee or ingredients of which no change has taken place since the date of its registration, renew the registration of the pesticide for a further period of three years. (2) An application under sub-section (1) shall be in such form and be accompanied by such fee as may be prescribed and shall be made before the expiration of the period for which the registration of pesticide is effective."
        },
        {
          "section_no": "9",
          "section_title": "Importation may be prohibited",
          "body": "If any pesticide imported into Pakistan is found to be adulterated or incorrectly or misleadingly tagged, labelled or named, or if its sale in any way contravenes any of the provisions of this Ordinance, the Federal Government may, by notification in the official Gazette, prohibit the further import of the pesticide into Pakistan."
        },
        {
          "section_no": "10",
          "section_title": "Labelling of packages",
          "body": "(1) No person shall sell or offer or expose for sale, or advertise or hold in stock for sale any pesticide unless each package containing the pesticide, and every tag or label durably attached thereto is marked in printed characters in such form and in such manner as may be prescribed."
        },
        {
          "section_no": "11",
          "section_title": "Shortage and use of pesticides",
          "body": "No person shall store or use any pesticide save in accordance with rules made under this Ordinance."
        }
      ]
    },
    {
      "chapter_title": "THE AGRICULTURE PESTICIDE TECHNICAL ADVISORY COMMITTEE, ETC",
      "sections": [
        {
          "section_no": "12",
          "section_title": "The Agriculture Pesticide Technical Advisory Committee",
          "body": ""
        },
        {
          "section_no": "13",
          "section_title": "Pesticide Laboratory",
          "body": ""
        },
        {
          "section_no": "14",
          "section_title": "Government Analyst",
          "body": ""
        },
        {
          "section_no": "15",
          "section_title": "Inspectors",
          "body": ""
        },
        {
          "section_no": "16",
          "section_title": "Powers of Inspectors",
          "body": ""
        },
        {
          "section_no": "17",
          "section_title": "Procedure of Inspectors",
          "body": ""
        },
        {
          "section_no": "18",
          "section_title": "Report of Government Analyst",
          "body": ""
        },
        {
          "section_no": "19",
          "section_title": "Publication of Results of test and analysis",
          "body": ""
        },
        {
          "section_no": "20",
          "section_title": "Purchaser of Pesticide may have it tested or analysed",
          "body": ""
        }
      ]
    },
    {
      "chapter_title": "MISCELLANEOUS",
      "sections": [
        {
          "section_no": "21",
          "section_title": "Offences and penalties",
          "body": ""
        },
        {
          "section_no": "21A",
          "section_title": "Punishment for offences not provided for in section 2",
          "body": ""
        },
        {
          "section_no": "22",
          "section_title": "Manufacturer's warranty to dealers",
          "body": ""
        },
        {
          "section_no": "23",
          "section_title": "Unlawful use of registration number lowering of pesticidal value or hindering the inspector from performing his duty",
          "body": ""
        },
        {
          "section_no": "24",
          "section_title": "Entry and seizure",
          "body": ""
        },
        {
          "section_no": "25",
          "section_title": "Power of court to order forfeiture",
          "body": ""
        },
        {
          "section_no": "26",
          "section_title": "Cognizance of offences, etc",
          "body": ""
        },
        {
          "section_no": "26A",
          "section_title": "Cognizance and prosecution of offences",
          "body": ""
        },
        {
          "section_no": "27",
          "section_title": "Power to try offences summarily",
          "body": ""
        },
        {
          "section_no": "28",
          "section_title": "Indemnity",
          "body": ""
        },
        {
          "section_no": "29",
          "section_title": "Power to make rules",
          "body": ""
        },
        {
          "section_no": "30",
          "section_title": "Delegation of powers",
          "body": ""
        }
      ]
    }
  ],
  "source_file": "administrator4885b870ed8d993fd7c01e46294a9251.txt"
}