{
  "error": "Expecting value: line 1 column 1 (char 0)",
  "raw": "THE NFC INSTITUTE OF ENGINEERING AND TECHNOLOGY MULTAN ACT, 2012 CONTENTS CHAPTER-I PRELIMINARY 1. Short title and Commencement. 2. Definitions. CHAPTER-II THE INSTITUTE 3. Establishment of the Institute. 4. Powers and purpose of the Institute. 5. Institute open to all classes, creeds, etc. 6. Teaching at the Institute. CHAPTER-III OFFICERS OF THE INSTITUTE 7. Principal Officers. 8. Chancellor. 9. Removal from the Senate. 10. The Pro-Chancellor. 11. Vice-Chancellor. 12. Appointment and removal of the vice-Chancellor. 13. Registrar. 14. Treasurer. 15. Controller of Examinations. CHAPTER-IV AUTHORITIES OF THE INSTITUTE 16. Authorities. 17. Senate. 18. Powers and functions of the Senate. 19. Visitations. 20. Syndicate. 21. Powers and duties of the Syndicate. 22. Academic Council. 23. Powers and functions of the Academic Council. 24. Representation Committees. 25. Appointment of committees by certain Authorities. CHAPTER-V STATUTES, REGULATIONS AND RULES 26. Statutes. 27. Regulations. 28. Rules. CHAPTER-VI INSTITUTE FUND 29. Institute fund. 30. Audits and accounts. CHAPTER-VII GENERAL PROVISIONS 31. Opportunity to showcause. 32. Appeal to the Syndicate and the Senate. 33. Terms of service and remedy. 34. Benefits and insurance. 35. Commencement of term of office of members of Authority. 36. Filling of casual vacancies in Authorities. 37. Flaws in the constitution of Authorities. 38. Proceedings of Authorities not invalidated by the vacancies. 39. First statutes and regulations. 40. Repeal and savings. 41. Transitory provisions. 42. Removal of difficulties. 43. Indemnity. 44. Power to allow appointment of the Government, other universities or educational or research institutions to the institute. THE NFC INSTITUTE OF ENGINEERING AND TECHNOLOGY MULTAN ACT, 2012 ACT NO. XIII OF 2012 [30th May, 2012] An Act to establish NFC Institute of Engineering and Technology Multan WHEREAS it is expedient to provide for the establishment of NFC Institute of Engineering and Technology M",
  "source_file": "administrator275d810bafa9a4c7a4447490e951612d.txt",
  "law_name": "The Nfc Institute of Engineering and Technology Multan Act, 2012",
  "year": 2012
}