{
  "error": "Expecting value: line 1 column 1 (char 0)",
  "raw": "THE PASSPORTS ACT, 1974 CONTENTS 1. Short title, extent and commencement 2. Definitions 3. Prohibition of departure from Pakistan without passport, etc. 4. Punishment for contravention of sections 3, etc. 5. Certain acts to be deemed contravention of section 3 6. Penalties for certain offences relating to passport. 7. Power of arrest, seizure, etc. 8. Power to cancel, impound or confiscate passport 9. Burdon of proof 10. Indemnity 11. Delegation of power 12. Power to exempt 13. Power to make rules 14. Act not to derogate from other laws 15. Repeal THE PASSPORTS ACT, 1974. 1ACT NO. XX OF 1974 [7th March, 1974] An Act to regulate departure from and entry into Pakistan and visit to foreign countries of the citizen of Pakistan. WHEREAS it is expedient to regulate departure from and entry into Pakistan and visit to foreign countries of citizens of Pakistan and to provide for matters ancillary thereto; It is hereby enacted as follows:- 1. Short title, extent and commencement.-(1) This act may be called the Passports Act, 1974. (2) It extends to the whole of Pakistan and also applies to all citizens of Pakistan, wherever they may be. (3) It shall come into force at once. 2. Definitions. In this Act, unless there is anything repugnant in the subject or context,- (a) “passport” means a passport 1[including a diplomatic passport and an official passport] which is for the time being valid, and includes any such permit, or other travel document authorising the holder thereof to travel from Pakistan to any other country, issued by or under the authority of the Federal Government; . (b) “Prescribed” means prescribed by rules made under this Act. 3. Prohibition of departure from Pakistan without passport, etc. No citizen of Pakistan shall- (a) depart from Pakistan by any means whatever unless he is in possession of a passport, nor otherwise than from such port or place, by such route and in accordance with such conditions, as may be prescribed; or (b) visit a foreign country unles",
  "source_file": "administrator0ca6ad9e71e29aa62dce67b3f67aff45.txt",
  "law_name": "The Passports Act, 1974",
  "year": 1974
}