{
  "error": "Expecting value: line 1 column 1 (char 0)",
  "raw": "THE SECURITIES ACT, 1920 CONTENTS 1. Short title, extent and commencement 2. Definitions 3. Notice of trust not receivable save as provided 4. Right of survivors of joint or several payees of Government securities 5. Indorsements to be made on security itself 6. Holding of Government securities by holders of public offices. 7. Issue of securities to rulers of Acceding States or non Acceding States 8. Indorser of Government security not liable for amount therof 9. Impression of signature on Government securities ISSUE OF DUPLICATE, RENEWED, CONVERTED, CONSOLIDATED OR SUB-DIVIDED SECURITIES 10. Issue of duplicate securities 11. Renewal of bearer bonds 12. Renewal of promissory notes 13. Renewal of promissory notes in case of dispute as to title 14. Renewal of other securities 15. Issue of converted, etc., securities 16. Liability in respect of promissory note renewed, etc. DISCHARGE 17. Immediate discharge in certain case 18. Discharge in other cases 18A. Discharge in respect of interest SUMMARY PROCEDURE IN CERTAIN CASES 19. Procedure on death of holder of securities SECURITIES HELD BY MINORS AND LUNATICS 20. Payment in case of securities held by minors and lunatics INDEMNITY 21. Indemnity INSPECTION OF REGISTERS, BOOKS AND DOCUMENTS 22. Inspection of documents PENALTY 23. Penalty RULES 24. Power to make rules 25. [Repealed.] 26. Provision as to Pakistan securities THE SECURITIES ACT, 1920 1ACT NO. X OF 1920 [11th March, 1920] An Act to consolidate and amend the law relating to Government securities. WHEREAS it is expedient to consolidate and amend the law relating to Government securities; It is hereby enacted as follows:- 1. Short title, extent and commencement. (1) This Act may be called the 2* Securities Act, 1920; 3[(2) It extends to the whole of Pakistan]; and (3) It shall come into force on the first day of April, 1920. 2. Definitions. In this Act, unless there is anything repugnant in the subject or context,- (a) “Government security” means promissory notes (",
  "source_file": "administrator10b09c34cfd7e31b03898bd6ec49dfe9.txt",
  "law_name": "The Securities Act, 1920",
  "year": 1920
}