{
  "error": "Expecting value: line 1 column 1 (char 0)",
  "raw": "THE UNITED NATIONS (DECLARATION OF DEATH OF MISSING PERSONS) ACT, 1956 CONTENTS 1. Short title and commencement 2. Provisions of the Schedule to have the force of law 3. Powers to make declaration in respect of certain persons having disappeared subsequent to 1945 4. Power to make rules 5. [Repeal.] THE SCHEDULE THE UNITED NATIONS (DECLARATION OF DEATH OF MISSING PERSONS) ACT, 1956 ACT NO. VII OF 1956 [11th April, 1956] An Act to give effect to the United Nations Convention on the Declaration of Death of Missing Persons. WHEREAS it is expedient to give effect to the United Nations Convention on the Declaration of Death of Missing Persons ; It is hereby enacted as follows : 1. Short title and commencement. (1) This Act may be called the United Nations (Declaration of Death of Missing Persons) Act, 1956. (2) It shall extend to the whole of Pakistan and shall come into force at once. 2. Provisions of the Schedule to have the force of law. (1) Notwithstanding anything to the contrary contained in any other law for the time being in force, the provisions set out in the Schedule to this Act, of the Convention on Declaration of Death of Missing Persons, adopted by the United Nations Conference on the Declaration of Death of Missing Persons, on the 6th Day of April, 1950, shall have the force of law in Pakistan. (2) The 2[Federal Government] may by notification in the official Gazette amend the said Schedule in conformity with any amendments duly made in the provisions of the said Convention. 3. Powers to make declaration in respect of certain persons having disappeared subsequent to 1945. (1) Where in pursuance of any international agreement, convention or other instrument it is necessary or permissible to make a declaration of death in respect of persons having disappeared subsequent to 1945 under circumstances similar to those mentioned in the provisions set out in the Schedule to this Act, the 1[Federal Government] may, by notification in the official Gazette, declare t",
  "source_file": "administratorbfdcbedb15edae32d2df6d9b13498a22.txt",
  "law_name": "The United Nations (Declaration of Death of Missing Persons) Act, 1956",
  "year": 1956
}