{
  "error": "Expecting value: line 1 column 1 (char 0)",
  "raw": "THE CHARITABLE FUNDS (REGULATION OF COLLECTIONS) ACT, 1953 CONTENTS 1. Short title, extent and commencement 2. Definitions 3. Regulation of private and charitable funds 4. Declarations of collections of private funds 5. Sanctioning of collection of charitable funds 6. Maintenance and audit of accounts 7. Misapplication of Funds 8. Application of Act VI of 1890 9. Powers of sanctioning authority 10. Appellate authority 11. Revision 12. Penalty for contraventions 13. Offences cognizable, bailable and non-compoundable 14. Prosecution subject to sanction by District Magistrate 15. Jurisdiction of Magistrates 16. Application of other laws 17. Exemptions 18. Rules 19. Protection of persons acting under this Act THE CHARITABLE FUNDS (REGULATION OF COLLECTIONS) ACT, 1953 1ACT NO. XXXI OF 1953 [3rd November, 1953] An Act to provide for the regulation, administration and accounting of collections of charitable donations and for the prevention of frauds. WHEREAS it is expedient to provide for the regulation, administration and accounting of collections of charitable donations and for the prevention of frauds ; It is hereby enacted as follows : 1. Short title, extent and commencement. (1) This Act may be called the Charitable Funds (Regulation of Collection) Act, 1953. (2) It extends to the 2[Karachi Division]. (3) It shall come into force at once. 2. Definitions. In this Act, unless there is anything repugnant in the subject or the context, (a) “collect” and “collection” with their grammatical variations and cognate expressions mean and include appealing for, receiving, collecting and attempting to collect, whether directly or indirectly, any donations whether in money or in kind and whether form the public in a public manner or from particular individuals or otherwise, for any fund to which this Act applies ; but do not include more advice by any person not himself engaged in making the collection; (b) “private fund” means a fund consisting of donations whether in money or in",
  "source_file": "administrator62d364ed9ebce133aae22996352d083b.txt",
  "law_name": "The Charitable Funds (Regulation of Collections) Act, 1953",
  "year": 1953
}