{
  "error": "Expecting value: line 1 column 1 (char 0)",
  "raw": "THE PAKISTAN AGRICULTURAL RESEARCH COUNCIL ORDINANCE, 1981 CONTENTS CHAPTER I PRELIMINARY 1. Short title extent and commencement 2. Definitions CHAPTER II ESTABLISHMENT OF THE COUNCIL 3. Establishment of the Council CHAPTER III FUNCTIONS AND POWERS OF THE COUNCIL 4. Functions and Powers of the Council 5. Directions from the Government CHAPTER IV MANAGEMENT 6. Board of Governors 7. President 8. Executive Committee 9. Chairman 10. Whole-time member 11. Term of office of non-official member 12. Meetings 13. Delegation of Powers by the Board 14. Validation of Proceedings CHAPTER V ESTABLISHMENT 15. Appointment of officers, etc. 16. Transfer of existing civil servants to the council CHAPTER VI FINANCE 17. Grants, etc. 18. Funds 19. Budget and accounts 20. Exemption from taxes 21. Investment of funds 22. Borrowing power 23. Financial assistance to council 24. Annual report CHAPTER VII GENERAL AND MISCELLANEOUS PROVISIONS 25. Power to make rules 26. Power to make regulations 27. Officers, staff, etc. deemed to be public servants 28. Ordinance XXIII of 1969 not to apply to council 29. Indemnity of council, etc. 30. Notice of suit against council, etc. 31. Certain claims for compensation to be barred 32. Winding up 33. Savings 34. Removal of difficulties THE PAKISTAN AGRICULTURAL RESEARCH COUNCIL ORDINANCE, 1981 ORDINANCE No. XXXVIII OF 1981 [29th December, 1981] An Ordinance to provide for constituting and re-organizing the Pakistan Agricultural Research Council. WHEREAS it is expedient to provide for constituting and re-organising the Pakistan Agricultural Research Council and for matters connected therewith or ancillary thereto ; AND WHEREAS the President is satisfied that circumstances exist which render it necessary to take immediate action ; NOW, THEREFORE, in pursuance of the Proclamation of the fifth day of July, 1977, read with the Provisional Constitution Order, 1981 (C.M.L.A. Order No. 1 of 1981), and in exercise of all powers enabling him in that behalf the Presi",
  "source_file": "administrator8b3d323c0cf37678679497c5aafbab40.txt",
  "law_name": "The Pakistan Agricultural Research Council Ordinance, 1981",
  "year": 1981
}