{
  "error": "Expecting value: line 1 column 1 (char 0)",
  "raw": "THE MINES MATERNITY BENEFIT ACT, 1941 CONTENTS 1. Short title, extent and commencement 2. Definitions 3. Prohibition of employment of, and work by women during certain period 4. Right to obtain leave of absence in pregnancy and after delivery 5. Right to and liability for payment of maternity benefit 6. Payment of bonus 7. Notice of delivery to be given to manager 8. Payment of maternity benefit 9. Disposal of maternity benefit in case of death of women entitled to receive it 10. Prohibition of dismissal during or on account of absence from work owing to confinement 11. Power of Chief Inspector or Inspector to direct payments to be made 12. Penalty for contravention of Act by a woman 13. Penalty for contravention of Act by owner or manager 14. Cognizance of cases 15. Power of Provincial Government to make rules 16. Abstract of this Act and the rules made thereunder to be exhibited in mines 17. Power of Provincial Government to exempt mines from operation of Act 18. Act binding on Government THE MINES MATERNITY BENEFIT ACT, 1941 ACT No. XIX OF 1941 [26th November, 1941] An Act to regulate the employment of women in mines for a certain period before and after childbirth and to provide for payment of maternity benefit to them. WHEREAS it is expedient to regulate the employment of women in mines for a certain period before and after childbirth and to provide for payment of maternity benefit to them; It is hereby enacted as follows : 1. Short title, extent and commencement. (1) This Act may be called the Mines Maternity Benefit Act, 1941. 1[(2) It extends to the whole of Pakistan.] (3) It shall come into force on such date2 as the 3[Federal Government] may, by notification in the official Gazette, appoint. 2. Definitions. In this Act, unless there is anything repugnant in the subject or context,- (al) 4[* * * * * * *] (a) “child” includes a still-born child; (b) “Chief Inspector”, “Inspector”, “employed”, “mine” and “owner” have the meanings assigned, respectively, to th",
  "source_file": "administrator0316da7d3863efa4378a3c4e87a9e42f.txt",
  "law_name": "The Mines Maternity Benefit Act, 1941",
  "year": 1941
}