{
  "law_name": "The Service Tribunals Act",
  "year": 1973,
  "chapters": [
    {
      "chapter_title": "Service Tribunals",
      "sections": [
        {
          "section_no": "1",
          "section_title": "Short title, commencement and application",
          "body": "(1) This Act may be called the Service Tribunals Act, 1973. (2) It shall come into force at once. (3) It applies to all civil servants wherever they may be."
        },
        {
          "section_no": "2",
          "section_title": "Definitions",
          "body": "In this Act, unless there is anything repugnant in the subject or context, (a) “civil servant” means a person who is, or has been, a civil servant within the meaning of the Civil Servants Act, 1973 (LXXI of 1973) and shall include a person declared to be a Civil Servant under section 2A; (b) “Tribunal” means a Service Tribunal established under section 3."
        },
        {
          "section_no": "3",
          "section_title": "Tribunals",
          "body": "(1) The President may, by notification in the official Gazette, establish one or more Service Tribunals as hereinafter provided and, where there are established more than one Tribunal, the President shall specify in the notification the territorial limits within which, or the class or classes or cases in respect of which, each such Tribunal shall exercise jurisdiction under this Act. (2) A Tribunal shall have exclusive jurisdiction in respect of matters relating to the terms and conditions of service of civil servants, including disciplinary matters."
        },
        {
          "section_no": "3A",
          "section_title": "Benches of the Tribunal",
          "body": "(1) The powers and functions of a Tribunal may be exercised or performed by Benches consisting of not less than two members of the Tribunal, including the Chairman, constituted by the Chairman. (2) If the members of a Bench differ in opinion as to the decision to be given on any point, the point shall be decided according to the opinion of the majority; if the members are equally divided and the Chairman of the Tribunal is not himself a member of the Bench, the case shall be referred to the Chairman and the decision of the Tribunal shall be expressed in terms of the opinion of the Chairman; and if the members are equally divided and the Chairman of the Tribunal is himself a member of the Bench, the opinion of the Chairman shall prevail and the decision of the Tribunal shall be expressed in terms of the opinion of the Chairman."
        },
        {
          "section_no": "4",
          "section_title": "Appeals to tribunals",
          "body": "(1) Any civil servant aggrieved by any order, whether original or appellate, made by a departmental authority in respect of any of the terms and conditions of his service may, within thirty days of the communication of such order to him, or within six months of the establishment of the appropriate Tribunal, whichever is later, prefer an appeal to the Tribunal: Provided that (a) where an appeal, review or representation to a departmental authority is provided under the Civil Servants Act, 1973 (LXXI of 1973), or any rules against any such order, no appeal shall lie to a Tribunal unless the aggrieved civil servant has preferred an appeal or application for review or representation to such departmental authority and a period of ninety days has elapsed from the date on which such appeal, application or representation was so preferred; (b) no appeal shall lie to a Tribunal against an order or decision of a departmental authority determining the fitness or otherwise of a person to be appointed to or hold a particular post or to be promoted to a higher grade; and (c) no appeal shall lie to a Tribunal against an order or decision of a departmental authority made at any time before the 1st July, 1969."
        },
        {
          "section_no": "4A",
          "section_title": "Review",
          "body": "(1) A tribunal shall have the power to review its final order on a review petition filed by an aggrieved party within thirty days of the order on the following grounds: (i) discovery of new and important matter or evidence which, after exercise of due diligence, was not within knowledge of the petitioner or could not be produced by him at the time when the order was passed; (ii) on account of some mistake or error apparent on the face of record; or (iii) for any other sufficient cause. (2) The Tribunal shall decide the review petition within thirty days. (3) The Tribunal may confirm, set aside, vary or modify the judgement or order."
        },
        {
          "section_no": "5",
          "section_title": "Powers of Tribunals",
          "body": "(1) A Tribunal may, on appeal, confirm, set aside, vary or modify the order appealed against. (2) A Tribunal shall, for the purpose of deciding any appeal, be deemed to be a civil court and shall have the same powers as are vested in such court under the Code of Civil Procedure, 1908 (Act V of 1908), including the powers of (a) enforcing the attendance of any person and examining him on oath; (b) compelling the production of documents; and (c) issuing commission for the examination of witnesses and documents."
        },
        {
          "section_no": "5A",
          "section_title": "Financial powers of a Tribunal",
          "body": "(1) The Registrar of the Tribunal shall be the Principal Accounting Officer of a Tribunal. (2) The Chairman of Tribunal may authorize re-appropriation of funds from one head of account to another head of account and sanction expenditure on any item from within the allocated budget in accordance with the prescribed procedure without reference to Ministry of Finance."
        },
        {
          "section_no": "6",
          "section_title": "Abatement of suits and other proceedings",
          "body": "All suits, appeals or applications regarding any matter within the jurisdiction of a Tribunal pending in any court immediately before the commencement of this Act shall abate forthwith: Provided that any party to such a suit, appeal or application may, within ninety days of the establishment of the appropriate Tribunal, prefer an appeal to it in respect of any such matter which is in issue in such suit, appeal or application."
        },
        {
          "section_no": "7",
          "section_title": "Limitation",
          "body": "The provisions of sections 5 and 12 of the Limitation Act, 1908 (IX of 1908), shall apply to appeals under this Act."
        },
        {
          "section_no": "8",
          "section_title": "Rules",
          "body": "(1) The Federal Government may, by notification in the Official Gazette, make rules for carrying out the purposes of this Act. (2) In particular and without prejudice to the generality of the foregoing power, such rules may provide for all or any of the following matters, namely: (a) requirements as to the number of members of the Tribunal necessary for hearings before, or order or decision by, a Tribunal; (b) filling for a specified period any vacancy in the office of the Chairman or a member of the Tribunal caused by the absence on leave or otherwise of the Chairman or, as the case may be, a member; and (c) execution of decisions of a Tribunal."
        },
        {
          "section_no": "9",
          "section_title": "Repeal",
          "body": "Omitted by the Federal Laws (Revision and Declaration) Ordinance, 1981 (XXVII of 1981), s. 3 and Sch."
        }
      ]
    }
  ],
  "source_file": "administratora25489da1a9ed8c9c927a144f6511732.txt"
}