{
  "error": "Expecting value: line 1 column 1 (char 0)",
  "raw": "THE STAGE-CARRIAGES ACT, 1861 CONTENTS 1. Definition of stage-carriage 2. Carriage to be licensed 3. Power to refuse license 4. Charge for and duration of license 5. Particulars to be painted on conspicuous part of carriage 6. Penalty for letting carriage without having particulars painted 7. Penalty for letting for hire unlicensed carriage 8. Penalty for allowing carriage to be drawn by fewer animals or more passengers, etc., to be carried than provided by license 9. Penalty for ill-treating animals 10. Revocations of license 11. Penalty for not conforming to provisions of section 5 12. Penalty for misconduct on part of drivers 13. Penalty when recoverable from proprietor 14. Issue of summons 15. Adjudication of penalties 16. Recovery of penalties, etc. 17. Offender may be apprehended and detained in custody until return of warrant of distress 18. Imprisonment of offender if distress not sufficient 19. Omitted 20. Jurisdiction 20A. Power to make rules 21. Interpretation-clause “Magistrate” 22. Extent of Act 23. Power to Provincial Government to exempt 1[THE STAGE-CARRIAGES ACT, 1861] 2Act No. XVI OF 1861 [7th July, 1861] An Act for licensing and regulating Stage-Carriages WHEREAS it is expedient to license and to regulate stage carriages in 3[Pakistan] it is enacted as follows :-- 1. Definition of stage-carriage. Every carriage drawn by one or more 4horses which shall ordinarily be used for the purpose of conveying passengers for hire to or from any place in 5[Pakistan] shall, without regard to the form or construction of such carriage, be deemed to be a stage-carriage within the meaning of this Act: 6[* * * * * * *] 2. Carriage to be licensed. No carriage shall be used as a stage-carriage unless licensed by a 7Magistrate 8* * *. 3. Power to refuse license. The Magistrate 9[* * *] to whom the application for a license of stage-carriage is made may refuse to license the same if he shall be of opinion that such stage-\ncarriage is unserviceable or is unsafe or unfit f",
  "source_file": "administratorbb98c6a045200104d017480f99031251.txt",
  "law_name": "The Stage-Carriages Act, 1861",
  "year": 1861
}