{
  "law_name": "The Dock Labourers Act",
  "year": 1934,
  "chapters": [
    {
      "chapter_title": "Contents",
      "sections": [
        {
          "section_no": "1",
          "section_title": "Short title, extent, commencement and application",
          "body": "(1) This Act may be called the Dock Labourers Act, 1934. (2) It extends to the whole of Pakistan. (3) It shall come into force on such date as the Federal Government may, by notification in the official Gazette, appoint. (4) It shall not apply to any ship of war of any nationality."
        },
        {
          "section_no": "2",
          "section_title": "Definitions",
          "body": "In this Act, unless there is anything repugnant in the subject or context, (a) 'the processes' includes all work which is required for or is incidental to the loading or unloading of cargo or fuel into or from a ship and is done on board the ship or alongside it; and (b) 'worker' means any person employed in the processes."
        },
        {
          "section_no": "3",
          "section_title": "Inspectors",
          "body": "(1) The Federal Government may, by notification in the official Gazette, appoint such persons as it thinks fit to be Inspectors for the purposes of this Act within such local limits as it may assign to them respectively. (2) All Principal Officers of the Mercantile Marine Department shall be Inspectors under this Act, ex-officio, within the limits of their charges. (3) Every Inspector shall be deemed to be a public servant within the meaning of the Pakistan Penal Code (XLV of 1860), and shall be officially subordinate to such authority as the Federal Government may direct."
        },
        {
          "section_no": "4",
          "section_title": "Powers of Inspector",
          "body": "Subject to any rules made in this behalf under section 6, an Inspector may, within the local limits for which he is appointed, (a) enter, with such assistants (if any) as he thinks fit, any premises or ship where the processes are carried on; (b) make such examination of the premises or ship and the machinery and gear, fixed or loose, used for the processes, and of any prescribed registers and notices, and take on the spot or otherwise such evidence of any person as he may deem necessary for carrying out the purposes of this Act; and (c) exercise any other powers which may be conferred upon him by the regulations made under section 5."
        },
        {
          "section_no": "5",
          "section_title": "Power to Federal Government to make regulations",
          "body": "(1) The Federal Government may make regulations providing for the safety of working places on shore and of any regular approaches over a dock, wharf, quay or similar premises which workers have to use for going to or from a working place at which the processes are carried on, and for the lighting and fencing of such places and approaches; (2) Regulations made under this section may make special provision to meet the special requirements of any particular port or ports."
        },
        {
          "section_no": "6",
          "section_title": "Power to Federal Government to make rules",
          "body": "The Federal Government may make rules regulating (a) the inspection of premises or ships where the processes are carried on; and (b) the manner in which Inspectors are to exercise the powers conferred on them by this Act."
        },
        {
          "section_no": "7",
          "section_title": "General provisions relating to regulations and rules",
          "body": "(1) The power to make regulations and rules conferred by sections 5 and 6 is subject to the condition of the regulations and rules being made after previous publication. (2) Regulations and rules shall be published in the official Gazette."
        },
        {
          "section_no": "8",
          "section_title": "Abstracts of Acts and regulations to be conspicuously posted",
          "body": "There shall be affixed in some conspicuous place near the main entrance of every dock, wharf, quay or similar premises where the processes are carried on, in English and in the language of the majority of the workers, the abstracts of this Act and of the regulations made thereunder which may be prescribed by the regulations."
        },
        {
          "section_no": "9",
          "section_title": "Penalties",
          "body": "Any person who (a) wilfully obstructs an Inspector in the exercise of any power under section 4, or fails to produce on demand by an Inspector any registers or other documents kept in pursuance of the regulations made under this Act, or any gear, fixed or loose, used for the processes, or conceals or prevents or attempts to prevent any person from appearing before, or being examined by, an Inspector, or (b) unless duly authorised, or in case of necessity, removes any fencing, gangway, gear, ladder, life-saving means or appliance, light, mark, stage or other thing required to be provided by or under the regulations made under this Act, or (c) having in case of necessity removed any such fencing, gangway, gear, ladder, life-saving means or appliance, light, mark, stage or other thing, omits to restore it at the end of the period for which its removal was necessary, Shall be punishable with fine which may extend to five hundred rupees."
        },
        {
          "section_no": "10",
          "section_title": "Provisions relating to jurisdiction",
          "body": "(1) No Court inferior to that of a Magistrate of the first class shall try any offence under this Act or the regulations made thereunder. (2) No prosecution for any offence under this Act or the regulations made thereunder shall be instituted except by or with the previous sanction of an Inspector. (3) No Court shall take cognizance of any offence under this Act or the regulations made thereunder, unless complaint thereof is made within six months of the date on which the offence is alleged to have been committed."
        },
        {
          "section_no": "11",
          "section_title": "Power to exempt",
          "body": "The Federal Government may, by notification in the official Gazette, exempt from all or any of the provisions of this Act and of the regulations made thereunder, on such conditions, if any, as it thinks fit, (a) any port or place, dock, wharf, quay or similar premises at which the processes are only occasionally carried on or the traffic is small and confined to small ships, or (b) any specified ship or class of ship."
        },
        {
          "section_no": "12",
          "section_title": "Protection to persons acting under this Act",
          "body": "No suit, prosecution or other legal proceeding shall lie against any person for anything which is in good faith done or intended to be done under this Act."
        }
      ]
    }
  ],
  "source_file": "administratorf6dbb6da01ffbde98af88b1f0b63af0c.txt"
}