{
  "law_name": "THE DOURINE ACT",
  "year": 1910,
  "chapters": [
    {
      "chapter_title": "Contents",
      "sections": [
        {
          "section_no": "1",
          "section_title": "Short title and extent",
          "body": "(1) This Act may be called the Dourine Act, 1910. (2) This section extends to the whole of Pakistan: the rest of this Act extends only to such areas as the Provincial Government may, by notification in the official Gazette, direct."
        },
        {
          "section_no": "2",
          "section_title": "Definitions",
          "body": "(1) In this Act, the expressions “inspector” and “veterinary practitioner” mean, respectively, the officers appointed as such under this Act, acting within the local limits for which they are so appointed. (2) The provisions of this Act in so far as they relate to entire horses shall, if the Provincial Government, by notification as aforesaid, so directs, apply also to entire asses used for mule-breeding purposes."
        },
        {
          "section_no": "3",
          "section_title": "Registration of horses",
          "body": "The Provincial Government may, by notification as aforesaid, make such orders as it thinks fit directing and regulating the registration of entire horses maintained for breeding purposes."
        },
        {
          "section_no": "4",
          "section_title": "Appointment of inspectors and veterinary practitioners",
          "body": "(1) The Provincial Government may, by notification as aforesaid, appoint any persons it thinks fit to be inspectors, and any qualified veterinary surgeons to be veterinary practitioners, under this Act, and to exercise and perform, within any area prescribed by the notification, the powers conferred and duties imposed by this Act upon such officers respectively. (2) Every person so appointed shall be deemed to be a public servant within the meaning of the Pakistan Penal Code (XLV of 1860)."
        },
        {
          "section_no": "5",
          "section_title": "Powers of inspector",
          "body": "An inspector may, subject to such rules as the Provincial Government may make in this behalf, (a) enter and search any building, field or other place for the purpose of ascertaining whether there is therein any horse which is affected with dourine; (b) prohibit, by order in writing, the owner or keeper of any horse, which in his opinion is affected with dourine, from using such horse for breeding purposes, pending examination by the veterinary practitioner; (c) direct, by order in writing, the owner or keeper of any horse which, in the opinion of the inspectors, is affected with dourine to remove it or permit it to be removed for the purpose of segregation to a place specified in the order, and such direction shall be sufficient authority for the detention of the horse in that place for that purpose."
        },
        {
          "section_no": "6",
          "section_title": "Duties of inspector",
          "body": "An inspector issuing an order under section 5 shall forthwith forward a copy of such order to the veterinary practitioner."
        },
        {
          "section_no": "7",
          "section_title": "Inspection of horses",
          "body": "A veterinary practitioner receiving a copy of an order forwarded under section 6 shall, as soon as possible after receipt of such copy, examine the horse mentioned therein, and may for such purpose enter any building, field or other place."
        },
        {
          "section_no": "8",
          "section_title": "Powers of veterinary practitioner",
          "body": "A veterinary practitioner may (a) cancel any order issued under section 5; or (b) if on microscopical examination or by other scientific test he finds that any horse is affected with dourine, (i) in the case of an entire horse, cause it to be castrated, (ii) in the case of a mare, with the previous sanction of such authority as the Provincial Government may appoint in this behalf, or, if so empowered by the Provincial Government, without such sanction, cause it to be destroyed."
        },
        {
          "section_no": "9",
          "section_title": "Compensation for horse destroyed, etc.",
          "body": "When any horse is castrated or destroyed under section 8, the market-value of such horse immediately before it became affected with dourine shall be ascertained; and the Provincial Government shall pay as compensation to the owner thereof (a) in the case of a mare which has been destroyed, or of an entire horse which has died in consequence of castration, such market-value, and, (b) in the case of an entire horse which survives castration, half the amount by which such value has been diminished owing to infection with dourine and castration."
        },
        {
          "section_no": "10",
          "section_title": "Settlement of compensation",
          "body": "(1) A veterinary practitioner may award, as compensation to be paid under section 9 in respect of each horse castrated or destroyed under section 8, a sum not exceeding two hundred and fifty rupees. (2) If, in the opinion of the veterinary practitioner, the amount which should be paid as such compensation exceeds two hundred and fifty rupees, he shall report accordingly to the Collector, who shall decide the amount to be so paid."
        },
        {
          "section_no": "11",
          "section_title": "Committees for hearing appeals",
          "body": "(1) The Provincial Government shall, by rules published in the official Gazette, make provision for the constitution of a committee or committees for the hearing of appeals from decisions under section 10. (2) Such rules shall provide that not less than one member of any committee constituted thereunder shall be a person not in the service of the Government or of a local authority."
        },
        {
          "section_no": "12",
          "section_title": "Appeals",
          "body": "Any owner may, within two months from the date of a decision under section 10, appeal against such decision to the committee constituted in that behalf by rules made under section 11, and the decision of such committee shall be final."
        },
        {
          "section_no": "13",
          "section_title": "Vexatious entries and searches",
          "body": "(1) Whoever, being an inspector appointed under this Act, vexatiously and unnecessarily enters or searches any field, building or other place, shall be punishable with imprisonment for a term which may extend to six months, or with fine which may extend to five hundred rupees, or with both. (2) No prosecution under this section shall be instituted after the expiry of three months from the date on which the offence has been committed."
        },
        {
          "section_no": "14",
          "section_title": "Rules",
          "body": "(1) The Provincial Government may make rules for the purpose of carrying into effect the provisions of this Act. (2) In particular, and without prejudice to the generality of the foregoing power such rules as aforesaid may (a) regulate the exercise of the powers conferred on Inspectors under section 5; (b) regulate the action to be taken by veterinary practitioners under section 8; (3) All such rules shall be published in the official Gazette, and, on such publication, shall have effect as if enacted in this Act. (4) In making any rule under this section the Provincial Government may direct that a breach of it shall be punishable with fine which may extend to fifty rupees."
        },
        {
          "section_no": "15",
          "section_title": "Penalties",
          "body": "Whoever uses or permits to be used for breeding purposes (a) any horse which has not been registered in accordance with the requirements of a notification under section 3, or (b) any horse in respect of which an order under clause (b) or clause (c) of section 5 is in force, shall be punishable with fine which may amount, in the case of a first conviction, to fifty rupees, or, in the case of a second or subsequent conviction, to one hundred rupees."
        },
        {
          "section_no": "16",
          "section_title": "Protection to persons acting under Act",
          "body": "No suit, prosecution or other legal proceeding shall lie against any person for anything which is, in good faith, done or intended to be done under this Act."
        }
      ]
    }
  ],
  "source_file": "administrator2fdb5ccd9d442238fd84fbcf1b8bafb8.txt"
}