{
  "error": "Expecting value: line 1 column 1 (char 0)",
  "raw": "MY UNIVERSITY ISLAMABAD ACT, 2013 CONTENTS CHAPTER I PRELIMINARY 1. Short title and commencement. 2. Definitions. CHAPTER-II THE UNIVERSITY 3. Establishment and incorporation of the University. 4. Powers and Purposes of the University. 5. University open to all classes, creeds, etc. 6. Teaching at the University. CHAPTER III OFFICERS OF THE UNIVERSITY 7. Officers of the University. 8. Patron. 9. Visitation. 10. Appointment and removal of Patron 11. Chancellor. 12. Appointment and Removal of the Chancellor. 13. Vice-Chancellor. 14. Dean. 15. Registrar. 16. Treasurer. 17. Controller of examinations. CHAPTER-IV AUTHORITIES OF THE UNIVERSITY 18. Authorities. 19. Board of Governors. 20. Powers and functions of the Board of Governors. 21. Executive Committee. 22. Powers and duties of the Executive Committee. 23. Academic Council. 24. First Statutes. 25. Appointment of committees by certain authorities. CHAPTER-V STATUTES, REGULATIONS AND RULES 26. Regulations. 27. Amendment and repeal of statutes and regulations. 28. Rules. CHAPTER-VI UNIVERSITY FUND 29. The University fund. 30. Audit and accounts. CHAPTER-VII GENERAL PROVISIONS 31. Commencement of term of members of authorities. 32. Disputes about membership of authorities. 33. Proceedings of authorities not invalidated by vacancies. 34. Removal of difficulties. 35. Indemnity. THE MY UNIVERSITY ISLAMABAD ACT, 2013 ACT NO. VII OF 2013 [14th March, 2013] An Act to provide for the establishment of my University, Islamabad WHEREAS it is expedient to provide for the establishment of MY University at Islamabad and for matters connected with and ancillary thereto; It is hereby enacted as follows: CHAPTER I PRELIMINARY 1. Short title and commencement. (1) This Act may be called the My University Islamabad Act, 2013. (2) It shall come into force at once. 2. Definitions.-In this Act, unless there is anything repugnant in the subject or context,- (i) “Academic Council” means the Academic Council of the University; (ii) “Authority” ",
  "source_file": "administrator7e6c41131f4f419dcac8f009173e180a.txt",
  "law_name": "The My University Islamabad Act, 2013",
  "year": 2013
}