{
  "error": "Expecting value: line 1 column 1 (char 0)",
  "raw": "THE PORT QASIM AUTHORITY ACT, 1973 CONTENTS CHAPTER I PRELIMINARY 1. Short title, extent and commencement. 2. Definitions. 3. Declaration of Port area. CHAPTER II ESTABLISHMENT OF THE AUTHORITY 4. Establishment of the Authority. 5. Management. 6. Constitution of the Board. 7. Remuneration and conditions of service. 8. Duties and functions of Chairman and members. 9. Headquarters of the Authority and meetings of the Board. CHAPTER III POWERS AND DUTIES OF THE AUTHORITY 10. Master-plan and master-programme. 11. Preparation of schemes by local bodies or agencies. 12. Manner and form, etc. of scheme. 13. Powers [and functions] of the Authority. 14. Tolls and charges may be remitted in special cases. 15. Board’s lien for tolls and charges. 16. Owner’s lien for freight. 17. Discharge of shipowner’s lien for freight. 18. Goods may be removed to warehouse. 19. Recovery of tolls and charges by sale of goods. 20. Removal of unclaimed goods. 21. Power to distrain vessels for non-payment of rates, etc. 22. Port-clearance not to be granted till rates, etc., paid. 23. Alternative remedy by suit. 24. Surplus of port dues to be paid to Board. 25. Right of Board to maintain pilots. 26. Approval and publication of bye-laws. 27. Removal, etc, of building. 28. Private wharves, etc., prohibited. 29. Power to permit erection of private wharves, etc. 30. Power to amend schemes. 31. Execution of schemes, etc., through local bodies and agencies. 32. Borrowing powers. 33. Utilization of building material. CHAPTER IV ACQUISITION OF LAND 34. Liability to acquisition. 35. Entry upon land, preliminary surveys, etc. 36. Compensation for damage. 37. Power to acquire land. 38. Land to be marked out, measured and planned. 39. Notice to persons interested. 40. Enquiry and award by Deputy Commissioner. 41. Compensation. 42. Matters to be considered in determining compensation. 43. Factors to be ignored in determining compensation. 44. Vesting of land in the Authority. 45. Acquisition in cases of urgen",
  "source_file": "administrator25f8872773a009ddfefb71c90ada01dc.txt",
  "law_name": "The Port Qasim Authority Act, 1973",
  "year": 1973
}