{
  "error": "Expecting value: line 1 column 1 (char 0)",
  "raw": "THE BONDED LABOUR SYSTEM (ABOLITION) ACT,1992 CONTENTS 1. Short title, extent and commencement. 2. Definitions. 3. Act to over ride other laws, etc. 4. Abolition of bonded labour system. 5. Agreement, custom, etc., to be void. 6. Liability to repay bonded debt to stand extinguished. 7. Property of bonded labour to be freed from mortgage, etc. 8. Creditor not to accept payment against extinguished debt. 9. Authorities who may be specified for implementing the provisions of this Act. 10. Duty of District Magistrate and other officers designated by him. 11. Punishment for enforcement of bonded labour. 12. Punishment for extracting bonded labour under the bonded labour system. 13. Punishment for omission or failure to restore possession of property to, bonded labourer. 14. Abetment to be an offence. 15. Vigilance Committees. 16. Offences to be tried by the Magistrate. 17. Cognizance of offences. 18. Offences by companies. 19. Protection of action taken in good faith. 20. Jurisdiction of courts barred. 21. Power to make rules. THE BONDED LABOUR SYSTEM (ABOLITION) ACT,1992 ACT No. III OF 1992 [11th March 1992] An Act to provide for abolition of bonded labour system WHEREAS clause (2) of Article 11 of the Constitution of the Islamic Republic of Pakistan prohibits all forms of forced labour; AND WHEREAS it is necessary to provide for abolition of bonded labour system with a view to preventing the economic and physical exploitation of the labour class in the country and for matters connected therewith or incidental thereto; It is hereby enacted as follows: 1. Short title, extent and commencement. (1) This Act may be called the Bonded Labour System (Abolition) Act, 1992. (2) It extends to the whole of Pakistan. (3) It shall come into force at once. 2. Definitions. In this Act, unless there is anything repugnant in the subject or context, (a) “advance (peshgi)” means an advance (peshgi), whether in cash or in kind, or partly in cash or partly in kind, made by one person (herei",
  "source_file": "administrator193484c31f7b4b5c5cbd0aae5038201e.txt",
  "law_name": "The Bonded Labour System (Abolition) Act,1992",
  "year": 1992
}