{
  "law_name": "THE PAKISTAN INTERNATIONAL AIRLINES CORPORATION ACT",
  "year": 1956,
  "chapters": [
    {
      "chapter_title": "Contents",
      "sections": [
        {
          "section_no": "1",
          "section_title": "Short title, extent and commencement",
          "body": "This Act may be called the Pakistan International Airlines Corporation Act, 1956. It extends to the whole of Pakistan. It shall come into force at once."
        },
        {
          "section_no": "2",
          "section_title": "Interpretation",
          "body": "In this Act, unless there is anything repugnant in the subject or context, 'Board' means the Board of Directors of the Corporation; 'Chairman' means Chairman of the Board; 'Corporation' means the Pakistan International Airlines Corporation established under this Act; and 'prescribed' means prescribed by rules or regulations made under this Act."
        },
        {
          "section_no": "3",
          "section_title": "Establishment and incorporation",
          "body": "As soon as may be after the commencement of this Act, the Federal Government shall establish a Corporation to be called the Pakistan International Airlines Corporation. The Corporation shall be a body corporate by the name of the Pakistan International Airlines Corporation, having perpetual succession and a common seal with power, subject to the provisions of this Act, to acquire and hold property both movable and immovable and to carry out the functions and duties of the Corporation under this Act, and shall by the said name sue and be sued."
        },
        {
          "section_no": "4",
          "section_title": "Functions of the Corporation",
          "body": "It shall be the function of the Corporation to take over the undertaking of the Orient Airways Limited and all such undertakings of the Federal Government as were undertaken for the purposes of the Corporation and, subject to the provisions of the Civil Aviation Ordinance, 1960, to provide and further develop safe, efficient, adequate, economical and properly coordinated air-transport services, internal as well as international."
        },
        {
          "section_no": "5",
          "section_title": "Administration of the affairs of the Corporation",
          "body": "The general direction and the administration of the Corporation and its affairs shall vest in the Board of Directors which may exercise all powers and do all acts which may be exercised or done by the Corporation."
        },
        {
          "section_no": "6",
          "section_title": "The Board of Directors",
          "body": "The Board of Directors shall consist of the following eleven Directors, namely: The Chairman; Eight Directors to be nominated by the Federal Government; and two Directors to be elected by shareholders other than the Federal Government."
        },
        {
          "section_no": "7",
          "section_title": "Terms of office of Directors",
          "body": "An appointed Director shall hold office for a term of three years unless sooner removed by the Federal Government, and may be appointed thereafter for a further term or terms of such duration as the Federal Government may in appointing him therefor, determine."
        },
        {
          "section_no": "8",
          "section_title": "Chairman",
          "body": "The Federal Government shall appoint a Chairman of the Board, who shall be the chief executive of the Corporation."
        },
        {
          "section_no": "8A",
          "section_title": "Managing Director",
          "body": "There shall be a Managing Director of the Corporation, who shall be appointed by the Federal Government after consultation with the Chairman."
        },
        {
          "section_no": "9",
          "section_title": "Disqualification of Directors",
          "body": "No person shall be appointed or elected or shall continue to be a Director who is or at any time has been convicted of an offence involving moral turpitude."
        },
        {
          "section_no": "10",
          "section_title": "Appointment of officers, etc.",
          "body": "The Corporation may appoint such officers, employees and agents as it may consider necessary for the efficient performance of its functions."
        },
        {
          "section_no": "11",
          "section_title": "Meetings of the board. Quorum",
          "body": "The Board shall meet at least once in every three months and the quorum for a meeting shall be such number as may be prescribed by the regulations."
        },
        {
          "section_no": "12",
          "section_title": "Head Office",
          "body": "The head office of the Corporation shall be at such place as the Federal Government may determine."
        },
        {
          "section_no": "13",
          "section_title": "Deposit account",
          "body": "The Corporation shall maintain a deposit account with the State Bank of Pakistan."
        },
        {
          "section_no": "14",
          "section_title": "Investment of funds",
          "body": "The Corporation may invest its funds in such manner as may be prescribed."
        },
        {
          "section_no": "15",
          "section_title": "Borrowing powers",
          "body": "The Corporation may borrow money from the Federal Government or from any other source."
        },
        {
          "section_no": "16",
          "section_title": "Audit",
          "body": "The accounts of the Corporation shall be audited by an auditor appointed by the Federal Government."
        },
        {
          "section_no": "17",
          "section_title": "Accounts",
          "body": "The Corporation shall maintain proper accounts and other records."
        },
        {
          "section_no": "18",
          "section_title": "General meetings",
          "body": "The Corporation shall hold general meetings as prescribed."
        },
        {
          "section_no": "19",
          "section_title": "Declaration of fidelity and secrecy",
          "body": "Every Director, officer or employee of the Corporation shall, before entering upon his duties, make a declaration of fidelity and secrecy."
        },
        {
          "section_no": "20",
          "section_title": "Indemnity of Directors",
          "body": "The Corporation shall indemnify every Director against any loss or damage incurred by him in the execution of his duties."
        },
        {
          "section_no": "21",
          "section_title": "Transfer to the Corporation of the undertaking of the Orient Airways Ltd.",
          "body": "The undertaking of the Orient Airways Ltd. shall be transferred to the Corporation."
        },
        {
          "section_no": "22",
          "section_title": "Certain existing arrangements to continue",
          "body": "Any existing arrangements made by the Orient Airways Ltd. shall continue until altered by the Corporation."
        },
        {
          "section_no": "23",
          "section_title": "Winding up and dissolution of Orient Airways Ltd.",
          "body": "The Orient Airways Ltd. shall be wound up and dissolved."
        },
        {
          "section_no": "24",
          "section_title": "Valuation of assets of Orient Airways Ltd, and allotment of shares to the shareholders of Orient Airways Ltd.",
          "body": "The assets of Orient Airways Ltd. shall be valued and shares allotted to its shareholders."
        },
        {
          "section_no": "25",
          "section_title": "Share capital",
          "body": "The share capital of the Corporation shall be determined by the Federal Government."
        },
        {
          "section_no": "26",
          "section_title": "Limited guarantee against loss",
          "body": "The Federal Government may provide a limited guarantee against loss to the Corporation."
        },
        {
          "section_no": "27",
          "section_title": "Liquidation of Corporation",
          "body": "The Corporation may be liquidated as per the provisions of this Act."
        },
        {
          "section_no": "28",
          "section_title": "Provisions relating income-tax and super-tax",
          "body": "The Corporation shall be subject to the provisions of income-tax and super-tax."
        },
        {
          "section_no": "29",
          "section_title": "Power of Federal Government to make rules",
          "body": "The Federal Government may make rules for carrying out the purposes of this Act."
        },
        {
          "section_no": "30",
          "section_title": "Power of Board to make regulations",
          "body": "The Board may make regulations for the conduct of its business."
        },
        {
          "section_no": "31",
          "section_title": "Rules and regulations to be held before the Legislature",
          "body": "All rules and regulations made under this Act shall be laid before the Legislature."
        },
        {
          "section_no": "32",
          "section_title": "[Repealed]",
          "body": ""
        }
      ]
    }
  ],
  "source_file": "administratord23ba7d141055b0987b896a1cb5cf247.txt"
}