{
  "law_name": "THE TEA ORDINANCE",
  "year": 1959,
  "chapters": [
    {
      "chapter_title": "PRELIMINARY",
      "sections": [
        {
          "section_no": "1",
          "section_title": "Short title, extent and commencement.",
          "body": "(1) This Ordinance may be called the Tea Ordinance, 1959. (2) It extends to the whole of Pakistan. (3) It shall come into force at once."
        },
        {
          "section_no": "2",
          "section_title": "Definitions.",
          "body": "In this Ordinance, unless there is anything repugnant in the subject or context, (a) “Board” means the Pakistan Tea Board constituted under section 3; (aa) “Collector” means a Collector of Customs appointed under section 3 of the Customs Act, 1969 (IV of 1969); (b) “Committee” means the Tea Development Committee constituted under section 9; (c) “estate” means a tea estate and includes a tea garden or a part of tea estate or garden; (d) “export” means to take out of Pakistan by land, sea or air to any place outside Pakistan; (e) “owner” includes any agent of an owner; (f) “prescribed” means prescribed by rules, made under this Ordinance; (g) “tea” means the commodity known as tea made from the leaves of the plant Camellia Thea or Camellia Sinnensis including adjacent tender stalks or green tea but excluding tea waste; and (h) “tea seed” includes seeds, roots, stumps, cuttings, buds and any living portion of the plant Camellia Thea or Camellia Sinnensis which may be used to propagate that plant."
        }
      ]
    },
    {
      "chapter_title": "PAKISTAN TEA BOARD",
      "sections": [
        {
          "section_no": "3",
          "section_title": "Constitution of Pakistan Tea Board.",
          "body": "(1) As soon as may be, the Federal Government shall constitute a body to be called the Pakistan Tea Board consisting of the following members, that is to say: (a) A Chairman to be appointed by the Federal Government; (b) two members elected by the Tea Traders Association of Pakistan of whom one shall represent the tea brokers and shippers and the other the tea traders; (c) one member to be nominated by the Federal Government to represent the estates under proprietary management; (d) two persons possessing special knowledge of tea or tea cultivation, or agriculture, to be nominated by the Federal Government; (e) one person to be elected by the recognized labour unions of tea gardens; (f) one officer serving under the Federal Government in the Ministry of Commerce to be nominated by the Federal Government. (2) The Federal Government shall publish in the official Gazette the names of all the members of the Board and thereupon the Board shall be deemed to be constituted. (3) Members of the Board shall, subject to the provisions of sub-section (4), hold office for three years, and shall be eligible for re-election or re-nomination."
        },
        {
          "section_no": "4",
          "section_title": "Functions of the Board.",
          "body": "The functions of the Board shall be to undertake such business, or to acquire take over or manage the business of such concern, as the Federal Government may direct; to regulate, control and promote the cultivation and export of tea; to organise and assist in special research connected with tea cultivation and tea industry; to regulate and control the sale of tea; to collect statistics from growers, manufactures or dealers of tea and other persons on any matter relating to tea and the tea industry; to fix grading standards of tea and provide for training in tea tasting; and generally, to take such measures as may appear advisable in the interests of the tea industry of Pakistan; and to perform such other functions as the Federal Government may, from time to time, direct."
        },
        {
          "section_no": "5",
          "section_title": "Control of the Board.",
          "body": "(1) The Board shall be subject to the superintendence and control of the Federal Government, and in the discharge of its functions shall be guided by such general or special instructions as may, from time to time, be given to it by the Federal Government. (2) The Federal Government may cancel, suspend or modify, as it thinks fit, any act of the Board, and the records of the Board shall be open to inspection by any officer authorized in this behalf by the Federal Government."
        },
        {
          "section_no": "6",
          "section_title": "Imposition of tea cess.",
          "body": "There shall be levied and collected, for the purposes of this Ordinance, a cess on all tea produced in Pakistan, at such rate not exceeding two rupees and eight annas per one hundred pounds of tea as the Federal Government may, by notification in the official Gazette, fix."
        },
        {
          "section_no": "7",
          "section_title": "Application of proceeds of cess.",
          "body": "(1) The proceeds of the cess after deducting the cost of collection, if any, shall be paid to the Board and shall be applied by the Board for meeting the expenses of measures taken in the performance of its functions, for payment, of contributions to any international organisation connected with tea, and for contributing towards a provident fund constituted and maintained in such manner as may be prescribed for the benefit of the employees of the Board. (2) The Board may, subject to any rules made in this behalf borrow on the security of the cess for any purpose for which it is authorized under sub-section (1) to expend its funds."
        },
        {
          "section_no": "8",
          "section_title": "Keeping of accounts and audit and annual reports.",
          "body": "(1) The Board shall publish annual reports and shall keep regular accounts of all moneys received and expended by it. (2) The accounts shall be audited every year by auditors approved in this behalf by the Auditor-General of Pakistan, and such auditors shall have power to disallow any item, which has, in their opinion, been expended otherwise than for the purpose of this Ordinance."
        }
      ]
    },
    {
      "chapter_title": "TEA DEVELOPMENT COMMITTEE",
      "sections": [
        {
          "section_no": "9",
          "section_title": "Constitution of Tea Development Committee.",
          "body": "(1) The Federal Government may set up a Committee of the Board, to be known as the Tea Development Committee, consisting of (a) The Chairman of the Board. (2) A member of the Committee, not being a Government servant shall receive such allowances as the Federal Government may determine. (3) A member of the Committee shall cease to be so when he ceases to be a member of the Board."
        },
        {
          "section_no": "10",
          "section_title": "Functions of the Committee.",
          "body": "(1) The functions of the Committee shall be to establish new tea gardens to acquire and rehabilitate derelict tea gardens in accordance with such schemes as may be approved by the Federal Government and generally to render assistance to the existing gardens to improve their production. (2) The Committee may, with the approval of the Federal Government, sell or transfer its tea gardens after they are established, or rehabilitated to any Pakistani national, firm or company."
        },
        {
          "section_no": "11",
          "section_title": "Grants and loans by Government to the Committee.",
          "body": "The Federal Government may make grants or give loans from the general revenues to the Committee to carry out its functions and may, subject to such conditions as it may impose, authorize the Committee to give loans to any person, firm or company at concessional rates for the improvement and expansion of tea estates or tea factories and to borrow money from banks on the security of the assets of its gardens."
        }
      ]
    },
    {
      "chapter_title": "CONTROL OVER CULTIVATION AND EXPORTS",
      "sections": [
        {
          "section_no": "13A",
          "section_title": "Power to direct compulsory expansion.",
          "body": ""
        },
        {
          "section_no": "14",
          "section_title": "Export allotment and its distribution.",
          "body": ""
        },
        {
          "section_no": "15",
          "section_title": "Export auctions.",
          "body": ""
        },
        {
          "section_no": "16",
          "section_title": "Export of tea purchased at export auctions.",
          "body": ""
        },
        {
          "section_no": "17",
          "section_title": "Control of export of tea and tea seeds.",
          "body": ""
        },
        {
          "section_no": "18",
          "section_title": "Registration of contracts.",
          "body": ""
        },
        {
          "section_no": "19",
          "section_title": "Power to prohibit transport storage or sale.",
          "body": ""
        },
        {
          "section_no": "19A",
          "section_title": "Limitation of application of certain provisions of this Chapter.",
          "body": ""
        }
      ]
    },
    {
      "chapter_title": "MISCELLANEOUS",
      "sections": [
        {
          "section_no": "20",
          "section_title": "Power to call for information etc.",
          "body": ""
        },
        {
          "section_no": "21",
          "section_title": "Delegation of powers.",
          "body": ""
        },
        {
          "section_no": "22",
          "section_title": "Power to exempt.",
          "body": ""
        },
        {
          "section_no": "23",
          "section_title": "Penalties.",
          "body": ""
        },
        {
          "section_no": "24",
          "section_title": "False statement.",
          "body": ""
        },
        {
          "section_no": "25",
          "section_title": "Protection of action taken in good faith.",
          "body": ""
        },
        {
          "section_no": "26",
          "section_title": "Cognizance of offences.",
          "body": ""
        },
        {
          "section_no": "27",
          "section_title": "Special provision regarding fines.",
          "body": ""
        },
        {
          "section_no": "28",
          "section_title": "Presumption as to orders.",
          "body": ""
        },
        {
          "section_no": "29",
          "section_title": "Power to make rules.",
          "body": ""
        },
        {
          "section_no": "30",
          "section_title": "Power to make bye-laws.",
          "body": ""
        },
        {
          "section_no": "31",
          "section_title": "Repeal.",
          "body": ""
        }
      ]
    }
  ],
  "source_file": "administratorc7c877581e52d3d1120d355c0db410c5.txt"
}