{
  "law_name": "THE COMPANIES PROFITS (WORKERS PARTICIPATION) ACT",
  "year": 1968,
  "chapters": [
    {
      "chapter_title": "Contents",
      "sections": [
        {
          "section_no": "1",
          "section_title": "Short title, extent and commencement.",
          "body": "(1) This Act may be called the Companies Profits (Workers Participation) Act, 1968. (2) It extends to the whole of Pakistan. (3) It shall come into force at once."
        },
        {
          "section_no": "2",
          "section_title": "Definitions.",
          "body": "In this Act, unless there is anything repugnant in the subject or context, (a) “Board” in relation to a Fund means a Board of Trustees constituted under section 4 for the management and administration of the Fund; (b) “company” means a company within the meaning of Companies Ordinance, 1984 (XLVII of 1984), and includes- (i) a body corporate established by or under any law for the time being in force; (ii) any institution, organization or association whether incorporated or not, declared by the Federal Government in the official Gazette to be a company for the purposes of this Act; (c) “Fund” means a Workers Participation Fund established under section 3; (d) “Profits” in relation to a company means such of the “net Profits” as defined in section 87C of the Companies Act, 1913, as are attributable to its business, trade, undertakings or other operations in Pakistan; (e) “scheme” means the scheme set out in the Schedule; (f) “worker” in relation to a company, means an employee of the company who falls within the definition of a worker as defined in clause (xxx) of section 2 of the Industrial Relations Ordinance, 2002 (XCI of 2002) and has been working for or in the company for a period of not less than six months."
        },
        {
          "section_no": "3",
          "section_title": "Establishment of Fund.",
          "body": "(1) Every company to which the scheme applies shall (a) establish a Workers Participation Fund in accordance with the scheme as soon as the accounts for the year in which the scheme becomes applicable to it are finalised, but not later than nine months after the close of that year; (b) subject to adjustments, if any, pay every year to the Fund not later than nine months after the close of that year five percent of its profits during such year; and (c) furnish to the Federal Government and the Board, not later than nine months after the close of every year of account, its audited accounts for that year, duly signed by its auditors."
        },
        {
          "section_no": "4",
          "section_title": "Management of the Fund.",
          "body": "(1) As soon as may be but not later than two months, after the establishment by a company of a Fund under section 3, there shall be constituted a Board of Trustees consisting of the following trustees, namely:- (a) two persons elected by the workers of the company from amongst themselves; and (b) two persons nominated by the management of the company of whom at least one shall be a person from the accounts branch of the company."
        },
        {
          "section_no": "5",
          "section_title": "Penalty.",
          "body": "(1) Where a company to which the scheme applies fails to comply with any of the provisions of this Act or the scheme, every director, manager or other officer responsible for the management of the affairs of the company, shall, if the Federal Government by order so directs, pay by way of penalty a sum which may extend to five thousand rupees and, in case of a continuing failure, a further sum which may extend to one thousand rupees for every day after the first during which the failure continues."
        },
        {
          "section_no": "6",
          "section_title": "Power to call for information.",
          "body": "The Federal Government may, at any time, call upon a company or a Board to furnish it with such information and documents, including the records of the proceedings of the company or the Board, as may be relevant or useful for the purpose of, or necessary for ensuring proper compliance with, the provisions of this Act, the rules and the scheme."
        },
        {
          "section_no": "7",
          "section_title": "Settlement of disputes, etc.",
          "body": "(1) Any difference arising between the Board and the company relating to the administration of the scheme shall be reported to the Federal Government whose decision thereon shall be final."
        },
        {
          "section_no": "8",
          "section_title": "Delegation of power.",
          "body": "The Federal Government may, by notification in the official Gazette, direct that all or any of its powers or functions under this Ordinance may, subject to such limitations, restrictions or conditions, if any, as may be specified in the notification, be exercised or performed also by any officer subordinate to it or by any authority so specified."
        },
        {
          "section_no": "9",
          "section_title": "Power to make rules.",
          "body": "The Federal Government may make rules to carry out the purposes of this Act."
        },
        {
          "section_no": "10",
          "section_title": "Act to override other laws.",
          "body": "The provisions of this Act shall have effect notwithstanding anything contained in any other law for the time being in force, or in any contract or the memorandum or articles of association of a company."
        }
      ]
    }
  ],
  "source_file": "administrator82a1ef468ce026f7dc3a1a0e19759e2e.txt"
}