{
  "law_name": "The Port Authorities Lands and Buildings (Recovery of Possession) Ordinance",
  "year": 1962,
  "chapters": [
    {
      "chapter_title": "Contents",
      "sections": [
        {
          "section_no": "1",
          "section_title": "Short title, application and commencement",
          "body": "(1) This Ordinance may be called the Port Authorities Lands and Buildings (Recovery of Possession) Ordinance, 1962. (2) It applies to all major ports. (3) It shall come into force at once."
        },
        {
          "section_no": "2",
          "section_title": "Definition",
          "body": "In this Ordinance, unless there is anything repugnant in the subject or context, various definitions are provided for terms such as 'allotment', 'Authorized Officer', 'land or building', 'lease', 'major port', 'port authority', 'prescribed', and 'unauthorized occupant'."
        },
        {
          "section_no": "3",
          "section_title": "Eviction of out-going lessees and unauthorized occupants from land",
          "body": "(1) If, on the expiry of the period of any lease, the lessee refuses or fails to vacate, the Port Authority may require such lessee to vacate. (2) If the Port Authority finds a person to be an unauthorized occupant, it may require that person to vacate. (3) If a person fails to comply, the Port Authority may complain to the Authorized Officer."
        },
        {
          "section_no": "4",
          "section_title": "Proceedings before Authorized Officer",
          "body": "(1) Upon receipt of a complaint, the Authorized Officer shall issue notice to the person to show cause for their eviction. (2) If the person fails to comply, the Authorized Officer may evict them. (3) No eviction shall occur between sunset and sunrise."
        },
        {
          "section_no": "5",
          "section_title": "Appeal",
          "body": "(1) Any person aggrieved by an order may appeal within fifteen days. (2) The decision of the District Magistrate on an appeal shall be final."
        },
        {
          "section_no": "6",
          "section_title": "Service of notice and order",
          "body": "A notice or an order under section 3 or section 4 shall be served in such manner as may be prescribed."
        },
        {
          "section_no": "7",
          "section_title": "Recovery of cost of demolition of structures",
          "body": "(1) The cost of demolition shall be payable to the Port Authority by the evicted lessee or unauthorized occupant. (2) If not paid, the Authorized Officer may sell the materials in auction. (3) Proceeds of the sale shall cover the cost, with any excess returned."
        },
        {
          "section_no": "8",
          "section_title": "Recovery of arrears of rent",
          "body": "If any rent is in arrears on the day of recovery of possession, the amount due shall be recoverable as arrears of land revenue."
        },
        {
          "section_no": "9",
          "section_title": "Jurisdiction of courts barred",
          "body": "No court shall question anything done under this Ordinance by a Port Authority or grant an injunction in relation to any notice or complaint issued under this Ordinance."
        },
        {
          "section_no": "10",
          "section_title": "Indemnity",
          "body": "No suit, prosecution or other legal proceeding shall lie against a Port Authority or any person in respect of anything done in good faith under this Ordinance."
        },
        {
          "section_no": "11",
          "section_title": "Rules",
          "body": "A Port Authority may make rules for carrying out the purposes of this Ordinance with the previous approval of the Federal Government."
        }
      ]
    }
  ],
  "source_file": "administratorb27d6e146d5ae6fc96b77e4a81fa3cf6.txt"
}