{
  "law_name": "The Official Trustees Act",
  "year": 1913,
  "chapters": [
    {
      "chapter_title": "Part I Preliminary",
      "sections": [
        {
          "section_no": "1",
          "section_title": "Short title, extent and commencement",
          "body": "(1) This Act may be called the Official Trustees Act, 1913. (2) It extends to the whole of Pakistan. (3) It shall come into force on such date as the Federal Government, by notification in the official Gazette, may direct."
        },
        {
          "section_no": "2",
          "section_title": "Interpretation Clause",
          "body": "In this Act, unless there is anything repugnant in the subject or context, 'Government' or 'the Government' means in relation to any Province, the Provincial Government."
        },
        {
          "section_no": "3",
          "section_title": "Extent of jurisdiction of High Courts",
          "body": "For the purposes of this Act the High Court shall have jurisdiction throughout the Province."
        }
      ]
    },
    {
      "chapter_title": "Part II The Office of Official Trustee",
      "sections": [
        {
          "section_no": "4",
          "section_title": "Official Trustees",
          "body": "(1) The Provincial Government for each Province shall appoint an Official Trustee. (2) No person shall be appointed to the office of Official Trustee who is not an advocate practising in a High Court or a person already in the service of the State."
        },
        {
          "section_no": "5",
          "section_title": "Appointment and powers of Deputy Official Trustees",
          "body": "The Government may appoint a Deputy or Deputies to assist the Official Trustee; and any Deputy so appointed shall, subject to the control of the Government and the general or special orders of the Official Trustee, be competent to discharge any of the duties and exercise any of the powers of the Official Trustee."
        },
        {
          "section_no": "6",
          "section_title": "Official Trustee to be corporation sole to have perpetual succession and official seal, and to sue and be sued in his corporate name",
          "body": "The Official Trustee shall be a corporation sole by the name of the Official Trustee of the Province for which he is appointed and, as such Official Trustee, shall have perpetual succession and an official seal, and may sue and be sued in his corporate name."
        }
      ]
    },
    {
      "chapter_title": "Part III Rights, Powers, Duties and Liabilities of Official Trustee",
      "sections": [
        {
          "section_no": "7",
          "section_title": "General powers and duties of official Trustee",
          "body": "(1) Subject to, and in accordance with, the provisions of this Act and the rules made thereunder, the Official Trustee may, if he thinks fit, act as an ordinary trustee. (2) The Official Trustee shall have the same powers, duties and liabilities and be entitled to the same rights and privileges and be subject to the same control and orders of the Court as any other trustee acting in the same capacity."
        },
        {
          "section_no": "8",
          "section_title": "Official Trustee may with consent be appointed trustee of settlement by grantor",
          "body": "(1) Any person intending to create a trust may by the instrument creating the trust and with the consent of the Official Trustee, appoint him to be the trustee of the property subject to such trust."
        },
        {
          "section_no": "9",
          "section_title": "Appointment of Official Trustee as trustee by will",
          "body": "When the Official Trustee has been appointed trustee under any will, the executor of the will shall notify the contents of such will to such Official Trustee."
        },
        {
          "section_no": "10",
          "section_title": "Power of High Court to appoint Official Trustee to be trustee of property",
          "body": "(1) If any property is subject to a trust and there is no trustee within the local limits of the High Court willing or capable to act in the trust, the High Court may on application make an order for the appointment of the Official Trustee."
        },
        {
          "section_no": "11",
          "section_title": "Power of private trustees to appoint official Trustee to be trustee of property",
          "body": "(1) If any property is subject to a trust and all the trustees are desirous that the Official Trustee shall be appointed, it shall be lawful for such trustees to appoint the Official Trustee."
        },
        {
          "section_no": "12",
          "section_title": "Executor or administrator may pay to Official Trustee legacy share etc. of infant or lunatic",
          "body": "(1) If any infant or lunatic is entitled to any gift, legacy or share of the assets of a deceased person, it shall be lawful for the executor or administrator to pay such legacy to the Official Trustee."
        }
      ]
    },
    {
      "chapter_title": "Part IV Fees",
      "sections": [
        {
          "section_no": "17",
          "section_title": "Fees",
          "body": "Details regarding fees to be prescribed."
        },
        {
          "section_no": "18",
          "section_title": "Disposal of fees",
          "body": "Details regarding the disposal of fees."
        }
      ]
    },
    {
      "chapter_title": "Part V Audit",
      "sections": [
        {
          "section_no": "19",
          "section_title": "Auditors to be appointed to examine official Trustee’s accounts etc., and to report to Government",
          "body": "Auditors shall be appointed to examine the accounts of the Official Trustee."
        },
        {
          "section_no": "20",
          "section_title": "Auditor’s power to summon witnesses and to call for documents",
          "body": "Auditors shall have the power to summon witnesses and call for documents."
        },
        {
          "section_no": "21",
          "section_title": "Costs of audit, etc., how paid",
          "body": "Details regarding the payment of audit costs."
        },
        {
          "section_no": "22",
          "section_title": "Right of beneficiary to inspection and copies of accounts",
          "body": "Beneficiaries shall have the right to inspect and obtain copies of accounts."
        }
      ]
    },
    {
      "chapter_title": "Part VI Miscellaneous",
      "sections": [
        {
          "section_no": "23",
          "section_title": "Transfer to Government of accumulations in the hands of Official Trustee",
          "body": "Details regarding the transfer of accumulations to the Government."
        },
        {
          "section_no": "24",
          "section_title": "Mode of proceeding by claimant to recover money so transferred",
          "body": "Details regarding the procedure for claimants to recover transferred money."
        },
        {
          "section_no": "25",
          "section_title": "Power of High Court to make orders in respect of property vested in Official Trustee",
          "body": "The High Court may make orders regarding property vested in the Official Trustee."
        },
        {
          "section_no": "26",
          "section_title": "Who may apply for order under Act",
          "body": "Details regarding who may apply for orders under this Act."
        },
        {
          "section_no": "27",
          "section_title": "Order of Court to have effect of a decree",
          "body": "Orders of the Court shall have the effect of a decree."
        },
        {
          "section_no": "28",
          "section_title": "General powers of administration",
          "body": "Details regarding the general powers of administration."
        },
        {
          "section_no": "29",
          "section_title": "Transfer of trust property by Official Trustee to original trustee or any other trustee",
          "body": "Details regarding the transfer of trust property."
        },
        {
          "section_no": "30",
          "section_title": "Rules",
          "body": "Details regarding the rules to be made under this Act."
        },
        {
          "section_no": "31",
          "section_title": "[Repealed]",
          "body": "This section has been repealed."
        },
        {
          "section_no": "32",
          "section_title": "Saving of Provisions of Registration Act, 1908",
          "body": "Provisions of the Registration Act, 1908 shall be saved."
        },
        {
          "section_no": "32A",
          "section_title": "[Omitted]",
          "body": "This section has been omitted."
        },
        {
          "section_no": "33",
          "section_title": "[Repealed]",
          "body": "This section has been repealed."
        }
      ]
    }
  ],
  "source_file": "administrator2572c4ac0ac32549a5562652ef9cf8a9.txt"
}