{
  "error": "Expecting value: line 1 column 1 (char 0)",
  "raw": "THE CIVIL DEFENCE ACT, 1952 CONTENTS 1. Short title, extent and commencement 1 A. Definitions 2. Power to make rules 3. Ordinary avocations of life to be interfered with as little as possible 4. Savings as to orders 5. Protection of action taken under the Act 6. Compensation to be paid in accordance with certain principles for compulsory acquisition of immovable property, etc 7. Power to acquire requisitioned property 8. Release from requisition 9. Delegation of powers under the Acts 10. Repeal of Ordinance, (VIII of 1951) THE CIVIL DEFENCE ACT, 1952 1ACT No. XXXI OF 1952 [29th April, 1952] An Act to provide for powers to secure the civil defence of 2[Pakistan]. WHEREAS it is necessary to provide for powers to secure the civil defence of 2[Pakistan] ; It is hereby enacted as follows 1. Short title, extent and commencement. (1) This Act may be called the Civil Defence Act, 1952. (2) It extends to the whole of Pakistan. (3) It shall come into force at once. 3[1A. Definitions. In this Act, unless there is anything repugnant in the subject or context 4[(1) civil defence includes any measures not amounting to actual combat, for affording defence against any form of hostile attack by a foreign power or for depriving any form of hostile attack by a foreign power of its effect, whether such measures are taken before, during or after the time of the attack and includes remedial measures during calamity or disaster in peace time.] (2) ‘Civil Defence Services’ means the services formed wholly or mainly to meet the needs of civil defence. 2. Power to make rules. The 1[Federal Government] may by notification in the official Gazette make such rules2 as appear to it to be necessary or expedient for securing the civil defence of 3[Pakistan]. (2) Without prejudice to the generality of the powers conferred by subsection (1) such rules may provide for, or may empower any authority to make orders providing for, all or any of the following matters, namely. 1For Statement of Objects and ",
  "source_file": "administratore30ef38868e5116d72022d5c3983d341.txt",
  "law_name": "The Civil Defence Act, 1952",
  "year": 1952
}