{
  "law_name": "THE PAY-AS-YOU-EARN SCHEME ACT",
  "year": 1973,
  "chapters": [
    {
      "chapter_title": "Contents",
      "sections": [
        {
          "section_no": "1",
          "section_title": "Short title and commencement",
          "body": "(1) This Act may be called the Pay-As-You-Earn Scheme Act, 1973. (2) It shall come into force at once."
        },
        {
          "section_no": "2",
          "section_title": "Definitions",
          "body": "In this Act, unless there is anything repugnant in the subject or context,- (a) “Prescribed” means prescribed by the Scheme or the rules made under this Act; and (b) “Scheme” means the scheme brought into force under section 3."
        },
        {
          "section_no": "3",
          "section_title": "The Scheme",
          "body": "(1) The Federal Government may prepare and, by notification in the official Gazette, bring into force a scheme, to be known as the Pay-As-You-Earn Scheme, for the import of machinery and equipment on credit for the establishment of an industrial unit or enterprise and requiring that the cost of the machinery or equipment so imported, and such other charges in foreign exchange as may be prescribed, shall be met from out of the export earnings of such industrial unit or enterprise. (2) The Scheme may specify, among other things, the categories of industrial units or enterprises for the establishment of which machinery or equipment may be imported under the Scheme, the proportion of export earnings which may be utilized by an industrial unit or enterprise for meeting charges in foreign exchange, the procedure for sanctioning of projects and scrutiny of list of importable machinery, and the terms and conditions of foreign credits."
        },
        {
          "section_no": "4",
          "section_title": "Power to make rules",
          "body": "(1) The Federal Government may, by notification in the official Gazette, make rules for the administration of the Scheme. (2) Any rules made under sub-section (1) may provide that an industrial unit or enterprise shall,- (a) if it fails to repatriate to Pakistan any foreign exchange which it is required by the Scheme to repatriate ; or (b) if the prescribed percentage of its export earnings is not sufficient to meet the cost of the machinery and equipment and the other prescribed charge in foreign exchange, be liable to pay to the State Bank of Pakistan by way of penalty a sum not exceeding twenty-seven per cent, of the value in Pakistan rupees of the amount of foreign exchange it fails to repatriate or, as the case may be, of the amount by which its export earnings fall short of the aggregate of the cost and charges referred to in clause (b). (3) Any amount payable by an industrial unit or enterprise as a penalty under the rules made under sub-section (1) shall be recoverable as an arrear of land revenue."
        },
        {
          "section_no": "5",
          "section_title": "Omitted",
          "body": "[Omitted]"
        }
      ]
    }
  ],
  "source_file": "administrator15055bd7e69390aaa2043b5a02be7d87.txt"
}