{
  "law_name": "THE RIOT AND CIVIL COMMOTION RISKS INSURANCE ORDINANCE",
  "year": 1947,
  "chapters": [
    {
      "chapter_title": "Contents",
      "sections": [
        {
          "section_no": "1",
          "section_title": "Short title, extent and applications",
          "body": "(1) This Ordinance may be called the Riot and Civil Commotion Risks Insurance Ordinance, 1947. (2) It extends to the whole of Pakistan. (3) The Federal Government may, by notification in the official Gazette, apply it to the whole of Pakistan or any part thereof from such date and in such manner as may be specified in the said notification."
        },
        {
          "section_no": "2",
          "section_title": "Definitions",
          "body": "In this Ordinance, unless there is anything repugnant in the subject or context (1) 'factory' means a factory as defined in clause (j) of section 2 of the Factories Act, 1934; (2) 'factory buildings' includes all buildings comprised in the factory, and such other buildings within a radius of two miles from the main factory as are in the same ownership or occupation as the factory; (3) 'the Fund' means the Riot and Civil Commotion Insurance Fund constituted under section II; (4) 'Riot and Civil Commotion Risks' means the risks of loss or damage directly caused by persons taking part in riots or civil commotions; (5) 'prescribed' means prescribed by rules made by the Federal Government under this Ordinance."
        },
        {
          "section_no": "3",
          "section_title": "Properties insurable under this Ordinance",
          "body": "(1) Subject to the provisions of this Ordinance every factory, factory buildings and other moveable or immoveable property described in the Schedule shall be deemed to be the property insurable under this Ordinance. (2) The Federal Government may, by notification in the official Gazette, from time to time amend the Schedule by adding thereto or omitting therefrom any kind of property."
        },
        {
          "section_no": "4",
          "section_title": "Ownership",
          "body": "Any property shall be deemed for the purposes of this Ordinance, to be owned if the ownership of the property is for the time being vested in a person in relation to whom the property is insurable under this Ordinance."
        },
        {
          "section_no": "5",
          "section_title": "[Repealed]",
          "body": ""
        },
        {
          "section_no": "6",
          "section_title": "[Repealed]",
          "body": ""
        },
        {
          "section_no": "7",
          "section_title": "Employment of agents by Federal Government",
          "body": "The Federal Government may employ or authorise the employment of any person or firm as prescribed in order to act as its agent for any of the purposes of this Ordinance."
        },
        {
          "section_no": "8",
          "section_title": "[Repealed]",
          "body": ""
        },
        {
          "section_no": "9",
          "section_title": "Recovery of premiums unpaid",
          "body": "(1) Where any person has failed to insure as required by this Ordinance, an officer authorised by the Federal Government may determine the amount, payment of which has been evaded. (2) A person against whom a determination is made under sub-section (1) may appeal against such determination to the Federal Government."
        },
        {
          "section_no": "10",
          "section_title": "[Repealed]",
          "body": ""
        },
        {
          "section_no": "11",
          "section_title": "Riot and Civil Commotion Insurance Fund",
          "body": "(1) The Federal Government shall establish a Fund for the purposes of this Ordinance, to be called the Riot and Civil Commotion Insurance Fund. (2) If the sum required for a payment is less than the sum standing to the credit of the Fund, an amount equal to the deficiency shall be paid into the Fund as an advance out of general revenues."
        },
        {
          "section_no": "12",
          "section_title": "Powers of Federal Government to obtain information",
          "body": "(1) Any person authorised by the Federal Government may require any person carrying on the business of fire insurance to submit accounts, books or other documents. (2) Whoever willfully obstructs any person in the exercise of his powers under this section shall be punishable with fine."
        },
        {
          "section_no": "13",
          "section_title": "Refund of premiums in certain cases",
          "body": "(1) Where property has been insured and ceases to be property insurable under this Ordinance, the person who has insured such property shall be entitled to a proportionate refund of premium."
        },
        {
          "section_no": "14",
          "section_title": "Limitation on prosecution",
          "body": "No prosecution for any offence punishable under this Ordinance shall be instituted against any person except by or with the consent of the Federal Government."
        },
        {
          "section_no": "15",
          "section_title": "Composition of offences",
          "body": "Any offence punishable under sub-section (2) of section 8 may be compounded by the Federal Government."
        },
        {
          "section_no": "16",
          "section_title": "Bar of legal proceedings",
          "body": ""
        },
        {
          "section_no": "17",
          "section_title": "Power to make rules",
          "body": ""
        }
      ]
    }
  ],
  "source_file": "administrator5fd04a6dbe98996406f13e8bec75d26d.txt"
}