{
  "law_name": "THE SMALL CLAIMS AND MINOR OFFENCES COURTS ORDINANCE",
  "year": 2002,
  "chapters": [
    {
      "chapter_title": "Contents",
      "sections": [
        {
          "section_no": "1",
          "section_title": "Short title, extent and commencement",
          "body": "(1) This Ordinance may be called the Small Claims and Minor Offences Courts Ordinance, 2002. (2) It extends to the whole of Pakistan. (3) It shall come into force on such date as the Federal Government may, by notification in the official Gazette, appoint in this behalf."
        },
        {
          "section_no": "2",
          "section_title": "Definitions",
          "body": "(1) In this Ordinance, unless there is anything repugnant in the subject or context, (a) 'amicable settlement' includes settlement through arbitration process, other than arbitration under the Arbitration Act, 1940 (X of 1940), mediation, conciliation or any other lawful means mutually agreed upon by the parties; (b) 'award' means findings of a Salis; (c) 'Court' means the Small Claims and Minor Offences Court established under section 4; (d) 'Government' means the Provincial Government; (e) 'prescribed' means prescribed by rules; (f) 'rules' means rules made under section 42; (g) 'Salis' means the person acting as conciliator, mediator or arbitrator. (2) Any expression not specifically mentioned or defined in this Ordinance shall have the same meaning as defined in the Code of Civil Procedure, 1908 (Act V of 1908), and shall have effect accordingly."
        },
        {
          "section_no": "3",
          "section_title": "Ordinance to override other laws",
          "body": "The provisions of this Ordinance shall have effect notwithstanding anything contained in any other law for the time being in force."
        },
        {
          "section_no": "4",
          "section_title": "Establishment of Courts",
          "body": "(1) The Government, in consultation with the High Court, may establish one or more Small Claims and Minor Offences Courts in each district or at such other place or places as it may deem necessary. (2) The Court shall be presided over by a Civil Judge-cum-Judicial Magistrate. (3) The local limits of jurisdiction of the Court shall be such as the High Court may, by notification in the official Gazette, determine and define from time to time."
        },
        {
          "section_no": "5",
          "section_title": "Jurisdiction",
          "body": "(1) The Court shall have exclusive jurisdiction to: (a) try all suits and claims arising therefrom, specified in Part I of the Schedule to this Ordinance, the subject matter of which does not exceed one hundred thousand rupees in value for the purposes of jurisdiction: Provided that the High Court may, by notification in the Official Gazette, vary such value from time to time; and (b) try offences specified in Part II of the Schedule to this Ordinance."
        },
        {
          "section_no": "6",
          "section_title": "Procedure in civil trials",
          "body": "Proceedings under this Ordinance relating to claims or suits shall be conducted in the manner hereinafter provided, namely (i) Every claim or suit before the Court shall be instituted by presentation of a plaint duly verified on oath or solemn affirmation; (ii) the plaint shall contain all material facts relating to the claim or dispute, a schedule giving the number of witnesses intended to be produced in support of the plaint, the names and addresses of witnesses and a brief summary of the facts to which they would depose; (iii) where a plaintiff sues or relies upon a document in his possession or power, he shall produce it in the Court either in original or copy thereof alongwith the plaint; (iv) where a plaintiff relies on any other document, not in his possession or power as evidence in support of his claim, he shall enter such document in a list to be appended to the plaint, giving reasons of relevancy to the claim in the plaint; (v) the plaint shall be accompanied by as many copies thereof including the schedule and the lists of documents referred to in clause (4) as there are defendants in the suit, for service upon the defendants; and (vi) the plaint shall be accompanied by one time process fee of twenty-five rupees."
        },
        {
          "section_no": "7",
          "section_title": "Rejection of plaint",
          "body": "(1) The plaint shall be rejected in the following cases (a) where it does not disclose a cause of action; (b) where the relief claimed is under-valued, and the plaintiff, on being required by the Court to correct the valuation within a time to be fixed by the Court, fails to do so; (c) where the relief claimed is properly valued, but the plaint is written upon paper insufficiently stamped, and the plaintiff, on being required by the Court to supply the requisite stamp paper within a time to be fixed by the Court, fails to do so; (d) where the suit appears from the statement in the plaint to be barred by any law. (2) Where a plaint is rejected, the Judge shall record an order to that effect with reasons for such order. (3) The rejection of the plaint on any of the grounds herein before mentioned shall not of its own force preclude the plaintiff from presenting a fresh plaint in respect of the same cause of action."
        },
        {
          "section_no": "8",
          "section_title": "Process fee",
          "body": "The plaintiff shall, alongwith the plaint, pay one time process fee of twenty five rupees for service of summons upon the defendants and postal stamps of the value of registered post acknowledgement due and where the Court orders for substituted service, deposit the charges of such substituted service, within three days of making such order failing which the suit may be dismissed."
        },
        {
          "section_no": "9",
          "section_title": "Summons",
          "body": "(1) The Court shall within two days of the presentation of the plaint, send to the defendant summons for final determination of the suit, through process server and by registered post, acknowledgement due, together with the copies of the plaint, schedule of witnesses, documents or list of documents relied upon. (2) Where in any suit the defendant cannot be found and has no agent empowered to accept service of the summons on his behalf, service may be made on any adult member of the family of the defendant who is residing with him. (3) Every summons and its accompaniments under sub-section (1) shall be served within fifteen days. (4) Where the Court has reasons to believe that the defendant is avoiding service, or that for any other reason the summons cannot be served in the ordinary way, the Court shall order for service of summons by- (a) affixing a copy of the summons at some conspicuous part of the house, if any, in which the defendant resides or is known to have last resided or carries or is known to have carried on business or personally works or is known to have worked for gain; or (b) any electronic device of communication which may include telegram, phonogram, telex, fax and e-mail; or (c) urgent mail service or public courier services; or (d) beat of drum in the locality where the defendant resides; or (e) publication in press; or (f) any other manner or mode as it may deem fit: Provided that the Court may order the use of all or any of the aforesaid manners and modes of service simultaneously. (5) Substituted service by order of the Court shall be as effectual as if it had been made on the defendant personally. (6) In case of substituted service, the Court shall fix such time for the appearance of the defendant, as the case may require, which shall not exceed fifteen days. (7) The summons sent under sub-section (1) shall contain direction to the effect that the defendant on his appearance on the date fixed shall file his written statement as provided by subsection (1) of section 11."
        },
        {
          "section_no": "10",
          "section_title": "Appearance through Advocate or recognized agent",
          "body": "(1) No Advocate shall act for any person in the Court, unless he has been appointed for the purpose by such person in writing signed by such person or by his recognized agent or by some other person authorised by or under a power of attorney to make such appointment. (2) Any appearance, application or action in or to the Court, required or authorised by law to be made or done by a party may, except where otherwise expressly provided by any law for the time being in force, be made or done by the party in person or by his recognised agent or by an Advocate on his behalf. (3) Any process served on the recognised agent of a party or an advocate shall be as effectual as if the same has been served on the party in person, unless the Court otherwise directs. (4) The provisions for the service of process on a party to a suit shall apply to the service of process on his recognised agent."
        },
        {
          "section_no": "11",
          "section_title": "Written statement",
          "body": "(1) The defendant shall on the date fixed, appear before the Court and file his written statement duly verified on oath or solemn affirmation and attach therewith a list of his witnesses as also a summary of the evidence that each witness is expected to give: Provided that the Court may, on sufficient cause being shown, permit to file written statement which shall not exceed fifteen days. (2) Where a defendant relies upon a document in his possession or power, he shall produce it in original or a copy thereof in the Court alongwith the written statement. (3) When the defendant relies on any other document, not in his possession or power, as evidence in support of his written statement, he shall enter such documents in a list to be appended to the written statement, giving reasons of relevancy to the defence in the written statement. (4) Copy of the written statement together with schedule of witnesses, documents and list of documents relied upon shall be given to the plaintiff, his agent or advocate present in the Court. (5) Where any party from whom a written statement is so required fails to present the same within the time fixed by the Court, the Court may pronounce judgment against him, or make such order in relation to the suit as it thinks fit."
        },
        {
          "section_no": "12",
          "section_title": "Appearance of parties and effect of non-appearance, etc.",
          "body": "(1) Where on the day fixed for the defendant to file written statement, it is found that the summons have been served but the defendant has failed to file written statement without sufficient cause, the Court may proceed ex-parte and pass decree."
        }
      ]
    }
  ],
  "source_file": "administrator369ef7980ab81e0b188703977998df5e.txt"
}