{
  "law_name": "THE LITERACY ORDINANCE",
  "year": 1985,
  "chapters": [
    {
      "chapter_title": "Contents",
      "sections": [
        {
          "section_no": "1",
          "section_title": "Short title, extent, application and commencement",
          "body": "(1) This Ordinance may be called the Literacy Ordinance, 1985. (2) It extends to the Islamabad Capital territory and also applies to the establishments and institutions under the control of the Federal Government throughout Pakistan. (3) It shall come into force on such date as the Federal Government may, by notification in the official Gazette, appoint."
        },
        {
          "section_no": "2",
          "section_title": "Definitions",
          "body": "In this Ordinance, unless there is anything repugnant in the subject or context, (a) “literate person” means a person who is certified by an authority to be able to read a newspaper and write a simple letter in any language; (b) “passport” has the same meaning as in the Passports Act, 1974 (XX of 1974); (c) “driving licence” means a licence issued under the Motor Vehicles Ordinance, 1965 (W. P. Ordinance XIX of 1965), which authorizes the holder thereof to drive a motor vehicle; (d) “arms licence” means a licence issued under the Pakistan Arms Ordinance, 1985 (W. P. Ordinance XX of 1965); (e) “authority” means the Headmaster of the Middle or High School of the District in which the applicant is residing; or an officer of the Literacy and Mass Education Commission or the Federal Ministry of Education or Federal Directorate of Education; or a person authorised to issue a passport or a driving license or an arms license; or the appointing authorities in the establishments or establishments under the control of the Federal Government."
        },
        {
          "section_no": "3",
          "section_title": "Issue of passports, etc., to and employment of, literate persons only",
          "body": "Notwithstanding anything contained in any other law for the time being in force, (a) a passport other than a Hajj passport a driving licence or an arms licence shall be issued only to a literate person; and (b) only a literate person shall be eligible for employment under a local body or an establishment or institution under the control of the Federal Government: Provided that this section not be deemed to apply to the renewal of licences or passports issued, or to appointments made, before the date on which this Ordinance comes into force."
        },
        {
          "section_no": "4",
          "section_title": "Savings",
          "body": "The provisions of section 3, so far as may be, shall not apply to a person who is physically or mentally handicapped."
        }
      ]
    }
  ],
  "source_file": "administrator416e6c94f52927a90e423f1ae3899e8c.txt"
}