{
  "error": "Expecting value: line 1 column 1 (char 0)",
  "raw": "THE CATTLE-TRESPASS ACT, 1871 CONTENTS PREAMBLE CHAPTER I PRELIMINARY 1. Title and Extent. 2. Repeal of Acts. References to repealed Acts. 3. Interpretation-clause. CHAPTER II POUNDS AND POUND-KEEPERS 4. Establishment of pounds. 5. Control of pounds. Rates of charge for feeding impounded cattle. 6. Appointment of Pound keepers. Pound-keepers may hold other offices. Pound-keepers to be “public servents”. DUTIES OF POUND-KEEPERS 7. To keep registers and furnish returns. 8. To register seizures. 9. To take charge of and feed cattle. CHAPTER III IMPOUNDING CATTLE 10. Cattle damaging land. Police to aid seizures. 11. Cattle damaging public roads, canals and embankments. 12. Fines for cattle impounded. List of fines and charges for feeding. CHAPTER IV DELIVERY OR SALE OF CATTLE 13. Procedure when owner claims the cattle and pays fines and charges. 14. Procedure if cattle be not claimed within a week. 15. Delivery to owner disputing legality of the seizure but making deposits. 16. procedure when owner refuses or omits to pay the fines and expenses. Deduction of fines and expenses. Delivery of unsold cattle and balance of proceeds. Receipt. 17. Disposal of fines, expenses and surplus proceeds of sales. 18. [Repealed.] 19. Officers and pound-keepers not to purchase cattle at sale under Act. Pound-keepers when not to release impounded cattle. CHAPTER V COMPLAINTS OF ILLEGAL SEIZURE OR DETENTION 20. Power to make complaints. 21. Procedure on complaints. 22. Compensation for illegal seizure or detention. Release of cattle. 23. Recovery of compensation. CHAPTER VI PENALTIES 24. Penalty for forcibly opposing the seizure of cattle or rescuing the same. 25. Recovery of penalty for mischief committed by causing cattle to trespass. 26. Penalty for damages caused to land or crops or public roads by pigs. 27. Penalty on pound-keeper failing to perform duties. 28. Application of fines recovered under sections 25, 26 or 27. CHAPTER VII SUITS FOR COMPENSATION 29. Saving of right to sue fo",
  "source_file": "administrator706a98a1deaabddd2a52d385536d0abd.txt",
  "law_name": "The Cattle-Trespass Act, 1871",
  "year": 1871
}