{
  "law_name": "THE COTTON TRANSPORT ACT",
  "year": 1923,
  "chapters": [
    {
      "chapter_title": "Contents",
      "sections": [
        {
          "section_no": "1",
          "section_title": "Short title and extent",
          "body": "(1) This Act may be called the Cotton Transport Act, 1923. (2) It extends to the whole of Pakistan."
        },
        {
          "section_no": "2",
          "section_title": "Definitions",
          "body": "In this Act, unless there is anything repugnant in the subject or context, (a) “certified copy”, in relation to a licence, means a copy of the licence certified in the manner described in section 76 of the Evidence Act, 1872 (I of 1872), by the authority by which the licence was granted; (b) “cotton” means every kind of unmanufactured cotton, that is to say, ginned and unginned cotton, cotton waste and cotton seed; (c) “cotton waste” means droppings, strippings, fly and other waste products of a cotton-mill other than yarn waste; (d) “licence” means a licence granted under this Act; (e) “notified station” means a railway station specified in a notification under section 3; (f) “prescribed” means prescribed by rules made under this Act; and (g) “protected area” means an area into which the import of cotton or of any kind of cotton has been prohibited wholly or partly by a notification under section 3; (h) “appropriate Government” means in relation to the transport of cotton across the customs frontiers and interprovincial trade and commerce, the Federal Government and, for other purposes, the Provincial Government."
        },
        {
          "section_no": "3",
          "section_title": "Power to issue notification prohibiting import of cotton into protected area",
          "body": "(1) The appropriate Government may, for the purpose of maintaining the quality or reputation of the cotton grown in any area in the Province, by notification in the official Gazette, prohibit the import of cotton or of any specified kind of cotton into that area by rail, road, river and sea, or by any one or more of such routes save under, and in accordance with the conditions of, a licence: Provided that no such notification shall be deemed to prohibit the import into any protected area of packages containing any kind of cotton and not exceeding ten pounds avoirdupois weight. (2) Any such notification may prohibit the delivery to, and the taking of delivery by, any person, at any specified railway station situated in the protected area, of any cotton, the import of which by rail into that area is prohibited when such cotton has been consigned from a railway station not situated in that area, unless such person holds a licence for the import by rail of the cotton into that area."
        },
        {
          "section_no": "4",
          "section_title": "Refusal to carry unlicensed cotton",
          "body": "(1) Notwithstanding anything contained in the Railways Act, 1890 (IX of 1890), or any other law for the time being in force, the station master of any railway station or any other railway servant responsible for the booking of goods or parcels at that station may refuse to receive for carriage at, or to forward or allow to be carried on the railway from, that station any cotton consigned to a notified station, being cotton of a kind of which the delivery at such notified station has been prohibited unless both stations are in the same protected area, or unless the consignor produces a certified copy of a licence for the import of the cotton by rail into the protected area in which such notified station is situated. (2) Every certified copy of a licence when so produced shall be attached to the invoice or way-bill, as the case may be, and shall accompany the consignment to its destination, and shall there be dealt with in the prescribed manner."
        },
        {
          "section_no": "5",
          "section_title": "Procedure where cotton arrives at notified station",
          "body": "(1) Where any cotton, the import of which by rail into any protected area has been prohibited, has been consigned to and arrives at a notified station in any such protected area, the station master or other railway servant responsible for the receipt and delivery to the consignee of goods or parcels, as the case may be, at that station shall, unless both the notified station and the railway station from which the cotton has been consigned are situated in the same protected area, refuse to deliver the cotton until he is satisfied that the consignee holds a licence for the import of the cotton by rail into the protected area in which such notified station is situated; and, if he is not so satisfied, or if within fourteen days the consignee or some person acting on his behalf does not appear in order to take delivery, shall return the cotton to the railway station from which it was consigned, together with an intimation that delivery of the cotton has been refused or has not been taken, as the case may be."
        },
        {
          "section_no": "6",
          "section_title": "Penalties",
          "body": "Any person who, in contravention of the provisions of this Act or of any notification or rule made hereunder, knowingly takes delivery of any cotton from a notified station or imports, or attempts to import, any cotton into a protected area, and any station master or other railway servant who, in contravention of the provisions of sub-section (1) of section 5, without reasonable excuse, the burden of proving which shall lie upon him, delivers any cotton to a consignee or other person, shall be liable to a fine not exceeding one thousand rupees, and upon any subsequent conviction to imprisonment which may extend to three months, or to fine which may extend to five thousand rupees, or to both."
        },
        {
          "section_no": "7",
          "section_title": "Power to make rules",
          "body": "(1) The appropriate Government may, by notification in the official Gazette, make rules to provide for any of the following matters, namely:- (a) the prevention of the import into a protected area by road, river or sea, save under and in accordance with the conditions of a licence, of cotton the import of which into that area has been prohibited wholly or partly by a notification under section 3; (b) the terms and conditions to be contained in licences and the authorities by which they may be granted; and (c) the manner in which licences and certified copies thereof shall be dealt with on and after the delivery of the cotton to which they relate. (2) Any such rules may provide that any contravention thereof or of the conditions of any licence, not otherwise made punishable by this Act, shall be punishable with fine which may extend to five hundred rupees."
        },
        {
          "section_no": "8",
          "section_title": "Previous approval of Provincial Legislature to issue of notifications and rules",
          "body": "No notification under section 3 or rule under section 7 shall be issued by the appropriate Government unless it has been laid in before the Parliament or, as the case may be, the Provincial Assembly, and has been approved by a Resolution of Parliament or of that Assembly, either with or without modification or addition, but upon such approval being given the notification or rule, as the case may be, may be issued in the form in which it has been so approved."
        },
        {
          "section_no": "9",
          "section_title": "Protection for acts done under Act",
          "body": "No suit or other legal proceeding shall be instituted against any person in respect of anything which is in good faith done or intended to be done under this Act."
        }
      ]
    }
  ],
  "source_file": "administrator6921382573969ea4699b13d3f4ad9969.txt"
}