{
  "law_name": "THE PUBLIC ORDER (MEETINGS) ORDINANCE",
  "year": 1958,
  "chapters": [
    {
      "chapter_title": "Public Order (Meetings) Ordinance, 1958",
      "sections": [
        {
          "section_no": "1",
          "section_title": "Short title, extent and commencement",
          "body": "(1) This Ordinance may be called the Public Order (Meetings) Ordinance, 1958. (2) It extends to the Karachi Division. (3) It shall come into force at once."
        },
        {
          "section_no": "2",
          "section_title": "Definitions",
          "body": "(a) “meeting” means a meeting held for the purpose of the discussion of matters of public interest or for the purpose of the expression of views on such matters; (b) “public meeting” includes any meeting in a public place and any meeting which the public or any section thereof are permitted to attend, whether on payment or otherwise; (c) “public place” means any highway, public park or garden, any sea beach, and any public bridge, road, lane, footway, square, court, alley or passage, whether a thoroughfare or not; and includes any open space to which, for the time being, the public have or are permitted to have access, whether on payment or otherwise; (d) “public servant” has the same meaning as assigned to it in section 21 of the Pakistan Penal Code (Act XLV of 1860)."
        },
        {
          "section_no": "3",
          "section_title": "Disorderly conduct at public meeting",
          "body": "(1) Any person who at a public meeting acts in a disorderly manner for the purpose of preventing the transaction of the business for which the meeting was called together shall be guilty of an offence. (2) Any person who incites others to commit an offence under this section shall be guilty of a like offence."
        },
        {
          "section_no": "4",
          "section_title": "Carrying of offensive weapons",
          "body": "Any person, not being a public servant acting in his capacity as such, who, while present in a public meeting, has with him any offensive weapon shall be guilty of an offence."
        },
        {
          "section_no": "5",
          "section_title": "Insulting language and incitement",
          "body": "Any person who in any public place or at any public meeting uses threatening, abusive or insulting words or behaviour with intent to provoke a breach of the peace or whereby a breach of the peace is likely to be occasioned shall be guilty of an offence under this Ordinance."
        },
        {
          "section_no": "6",
          "section_title": "Offences to be cognizable and non-bailable",
          "body": "Notwithstanding anything in the Code of Criminal Procedure, 1898 (Act V of 1898), an offence under this Ordinance shall be cognizable and non-bailable."
        },
        {
          "section_no": "7",
          "section_title": "Penalty",
          "body": "An offence under this Ordinance shall be punishable with rigorous imprisonment which may extend to two years, or with fine, or with both."
        }
      ]
    }
  ],
  "source_file": "administrator3713d47e24390ce8d2af2f60f121a670.txt"
}