{
  "law_name": "THE SOCIETIES REGISTRATION ACT",
  "year": 1860,
  "chapters": [
    {
      "chapter_title": "Contents",
      "sections": [
        {
          "section_no": "1",
          "section_title": "Societies formed by memorandum of association and registration",
          "body": "Any seven or more persons associated for any literary, scientific or charitable purpose, or for any such purpose as is described in section 20 of this Act, may, by subscribing their names to a memorandum of association and filing the same with the Registrar of Joint-stock Companies from themselves into a society under this Act."
        },
        {
          "section_no": "2",
          "section_title": "Memorandum of association",
          "body": "The memorandum of association shall contain the following things (that is to say):- the name of the society : the objects of the society : the names, addresses, and occupations of the governors, council, directors, committee or other governing body to whom, by the rules of the society, the management of its affairs is entrusted."
        },
        {
          "section_no": "3",
          "section_title": "Registration Fees",
          "body": "Upon such memorandum and certified copy being filed, the registrar shall certify under his hand that the society is registered under this Act. There shall be paid to the registrar for every such registration a fee of fifty rupees, or such smaller fee as the Provincial Government may, from time to time, direct; and all fees so paid shall be accounted for to the Provincial Government."
        },
        {
          "section_no": "4",
          "section_title": "Annual list of managing body to be filed",
          "body": "Once in every year, on or before the fourteenth day succeeding the day on which, according to the rules of the society, the annual general meeting of the society is held, or, if the rules do not provide for an annual general meeting, in the month of January, a list shall be filed with the Registrar of Joint-stock Companies of the names, addresses and occupations of the governors, council, directors, committee or other governing body then entrusted with the management of the affairs of the society."
        },
        {
          "section_no": "5",
          "section_title": "Property of society how vested",
          "body": "The property, moveable and immoveable, belonging to a society registered under this Act, if not vested in trustees, shall be deemed to be vested, for the time being, in the governing body of such society, and in all proceedings, civil and criminal, may be described as the property of the governing body of such society by their proper title."
        },
        {
          "section_no": "6",
          "section_title": "Suits by and against societies",
          "body": "Every society registered under this Act may sue or be sued in the name of the president, chairman, or principal secretary, or trustees, as shall be determined by the rules and regulations of the society, and, in default of such determination, in the name of such person as shall be appointed by the governing body for the occasion."
        },
        {
          "section_no": "7",
          "section_title": "Suits not to abate",
          "body": "No suit or proceeding in any Civil Court shall abate or discontinue by reason of the person by or against whom such suit or proceedings shall have been brought or continued, dying or ceasing to fill the character in the name whereof he shall have sued or been sued, but the same suit or proceedings shall be continued in the name of or against the successor of such person."
        },
        {
          "section_no": "8",
          "section_title": "Enforcement of judgment against society",
          "body": "If a judgment shall be recovered against the person or officer named on behalf of the society, such judgment shall not be put in force against the property, moveable or immoveable, or against the body of such person or officer, but against the property of the society."
        },
        {
          "section_no": "9",
          "section_title": "Recovery of penalty accruing under bye-law",
          "body": "Whenever by any bye-law duly made in accordance with the rules and regulations of the society, or, if the rules do not provide for the making of bye-laws, by any bye-law made at a general meeting of the members of the society convened for the purpose, any pecuniary penalty is imposed for the breach of any rule or bye-law of the society, such penalty, when accrued, may be recovered in any Court having jurisdiction where the defendant shall reside, or the society shall be situate."
        },
        {
          "section_no": "10",
          "section_title": "Members liable to be sued as strangers",
          "body": "Any member who may be in arrear of a subscription which, according to the rules of the society he is bound to pay, or who shall possess himself of or detain any property of the society in a manner or for a time contrary to such rules, or shall injure or destroy any property of the society, may be sued for such arrear or for the damage accruing from such detention, injury or destruction of property."
        },
        {
          "section_no": "11",
          "section_title": "Members guilty of offences punishable as strangers",
          "body": "Any member of the society who shall steal, purloin or embezzle any money or other property, or wilfully and maliciously destroy or injure any property of such society, or shall forge any deed, bond, security for money, receipt, or other instrument, whereby the funds of the society may be exposed to loss, shall be subject to the same prosecution."
        },
        {
          "section_no": "12",
          "section_title": "Societies enabled to alter, extend or abridge their purposes",
          "body": "Whenever it shall appear to the governing body of any society registered under this Act, which has been established for any particular purpose or purposes, that it is advisable to alter, extend or abridge such purpose to or for other purposes within the meaning of this Act, or to amalgamate such society either wholly or partially with any other society."
        },
        {
          "section_no": "13",
          "section_title": "Provision for dissolution of societies and adjustment of their affairs",
          "body": "Any number not less than three-fifths of the members of any society may determine that it shall be dissolved, and thereupon it shall be dissolved forthwith, or at the time then agreed upon."
        }
      ]
    }
  ],
  "source_file": "administrator0dc721bb2bef23db45633e35e344ae27.txt"
}