{
  "error": "Expecting value: line 1 column 1 (char 0)",
  "raw": "THE INVESTIGATION FOR FAIR TRIAL ACT, 2013 CONTENTS 1. Short title, extent, and commencement. 2. Application. CHAPTER 1 DEFINITIONS 3. Definitions CHAPTER-2 APPLICATION FOR WARRANT 4. Notification of authorized officer. 5. Record of Suspicious Conduct. 6. Material to be placed before the Minister. 7. Action by the Minister on the material presented to him. 8. Application for issuance of warrant. CHAPTER-3 ISSUE OF WARRANTS 9. Judge to issue warrant in Chambers. 10. Considerations for issuance of warrant. 11. Issuance of warrant of surveillance or interception. 12. Form of the warrant. 13. Record of the orders. 14. Duration of warrant of interception. 15. Sanction in case of arbitrary request for warrant. CHAPTER-4 EXECUTION OF WARRANTS 16. Authorization under the warrant. 17. Method of executing the Warrant. 18. Indemnity for service provider. 19. Immunity service provider. 20. Service provider to cooperate. 21. Service provider to ensure confidentiality. CHAPTER-5 ADMISSIBILITY OF MATERIAL OBTAINED UNDER THE WARRANT 22. Registration of case. 23. Admissibility of warrant based information. 24. Presumption of validity of warrant. 25. Report of expert. 26. Non-discloser. CHAPTER-6 REVIEW AND OVERSIGHT 27. Oversight by Review Committee. 28. Representation. 29. Complaints against misuse of warrant. 30. Powers of the Judge. CHAPTER 7 MUTUAL LEGAL ASSISTANCE 31. Warrants to be served outside Pakistan. 32. Warrants received from outside Pakistan. CHAPTER 8 CONFIDENTIALITY OF PROCEEDINGS 33. Confidentiality of proceedings. 34. Prohibition of misuse of intercepted material. 35. Unauthorized surveillance or interception. CHAPTER 9 MISCELLANEOUS 36. Power to make rules, issue guidelines and orders. 37. Power to amend the Schedule. 38. Act to have effect notwithstanding existing laws. 39. Removal of difficulty. THE INVESTIGATION FOR FAIR TRIAL ACT, 2013 ACT NO. I OF 2013 [20th February, 2013] An Act to provide for investigation for collection of evidence by means of modern tech",
  "source_file": "administrator289aee517e7b8512e341194f9e846738.txt",
  "law_name": "The Investigation For Fair Trial Act, 2013",
  "year": 2013
}