{
  "law_name": "THE NATIONAL AND PROVINCIAL ASSEMBLIES (ELECTIONS TO RESERVED SEATS) ACT",
  "year": 1976,
  "chapters": [
    {
      "chapter_title": "PRELIMINARY",
      "sections": [
        {
          "section_no": "1",
          "section_title": "Short title, extent and commencement.",
          "body": "(1) This Act may be called the National and Provincial Assemblies (Elections to Reserved Seats) Act, 1976. (2) It extends to the whole of Pakistan. (3) It shall come into force at once."
        },
        {
          "section_no": "2",
          "section_title": "Definitions.",
          "body": "In this Act, unless there is anything repugnant in the subject or context, (i) 'Article' means Article of the Constitution; (ii) 'Assembly' means the National Assembly or a Provincial Assembly for a Province; (iii) 'candidate' means a person seeking election as a member; (iv) 'Commission' means the Election Commission constituted under Article 218; (v) 'Commissioner' means the Chief Election Commissioner appointed under the Constitution; (vi) 'constituency' means a constituency delimited under the Delimitation of Constituencies Act, 1974; (vii) 'election' means election to a seat of a member held under this Act; (viii) 'election petition' means an election petition made under section 12; (ix) 'elector', in relation to an Assembly, means a person elected to a general seat in that Assembly; (x) 'member' means member of an Assembly; (xi) 'prescribed' means prescribed by rules made under this Act; (xii) 'returned candidate' means a candidate who has been declared elected as a member under this Act; (xiii) 'Tribunal' means an Election Tribunal appointed under section 17 for the trial of election petitions."
        }
      ]
    },
    {
      "chapter_title": "ELECTION COMMISSION",
      "sections": [
        {
          "section_no": "3",
          "section_title": "Procedure of the Commission.",
          "body": "(1) Subject to the provisions of this section, the Commission shall regulate its procedure. (2) If, upon any matter requiring a decision of the Commission, there is difference of opinion among its members, the opinion of the majority shall prevail. (3) The Commission may exercise its powers and perform its functions notwithstanding that there is a vacancy in the office of any one of its members."
        },
        {
          "section_no": "4",
          "section_title": "Power to punish for contempt.",
          "body": "The Commission, the Commissioner and the members of the Commission shall have the same powers to punish its or their contempt as are vested in a High Court under Article 204."
        },
        {
          "section_no": "5",
          "section_title": "Delegation of powers, etc.",
          "body": "The Commission may authorise its Chairman or any of its members or any of the officers of the Commission to exercise and perform all or any of its powers and functions under this Act."
        },
        {
          "section_no": "6",
          "section_title": "Assistance to the Commission.",
          "body": "(1) All executive authorities in the Federation and in the Provinces shall render such assistance to the Commissioner and the Commission in the discharge of his or their functions as may be required of them by the Commissioner or the Commission."
        }
      ]
    },
    {
      "chapter_title": "ELECTION TO SEATS RESERVED FOR WOMEN OR CERTAIN COMMUNITIES",
      "sections": [
        {
          "section_no": "7",
          "section_title": "Election to reserved seats.",
          "body": "(1) The members for seats reserved for women in an Assembly shall be elected by the persons elected to the general seats in that Assembly. (2) The members for seats reserved in an Assembly for persons belonging to certain communities shall be elected by the persons elected to the general seats in that Assembly."
        }
      ]
    },
    {
      "chapter_title": "ELECTION EXPENSES",
      "sections": [
        {
          "section_no": "8",
          "section_title": "Definition.",
          "body": "In this Chapter, 'election expenses' means any expenditure incurred before, during and after an election or payment made for the arrangement, conduct or benefit of or in connection with, or incidental to, the election of a candidate."
        },
        {
          "section_no": "9",
          "section_title": "Restriction on election expenses.",
          "body": "(1) No person shall make any payment towards the election expenses of a candidate except to such candidate. (2) The election expenses of a candidate shall not exceed certain amounts as specified."
        },
        {
          "section_no": "10",
          "section_title": "Return of election expenses.",
          "body": "(1) Every candidate shall submit to the returning Officer a return of election expenses within forty-five days after the publication of the name of the returned candidate."
        },
        {
          "section_no": "11",
          "section_title": "Inspection of returns, etc.",
          "body": "(1) The return and documents submitted under section 10 shall be kept by the Commissioner and shall be open to inspection by any person on payment of the prescribed fee."
        }
      ]
    },
    {
      "chapter_title": "ELECTION DISPUTES",
      "sections": [
        {
          "section_no": "12",
          "section_title": "Election Petition.",
          "body": "(1) No election shall be called in question except by an election petition made by a candidate for that election."
        }
      ]
    },
    {
      "chapter_title": "OFFENCES, PENALTY AND PROCEDURE",
      "sections": [
        {
          "section_no": "38",
          "section_title": "Corrupt practice.",
          "body": ""
        },
        {
          "section_no": "39",
          "section_title": "Bribery.",
          "body": ""
        },
        {
          "section_no": "40",
          "section_title": "Undue influence.",
          "body": ""
        },
        {
          "section_no": "41",
          "section_title": "Penalty for corrupt practice.",
          "body": ""
        },
        {
          "section_no": "42",
          "section_title": "Illegal practice.",
          "body": ""
        },
        {
          "section_no": "43",
          "section_title": "Assistance by Government servant.",
          "body": ""
        },
        {
          "section_no": "44",
          "section_title": "Certain offences cognizable.",
          "body": ""
        },
        {
          "section_no": "45",
          "section_title": "Court proceedings relating to election expenses.",
          "body": ""
        },
        {
          "section_no": "46",
          "section_title": "Court to report convictions to the Commission.",
          "body": ""
        },
        {
          "section_no": "47",
          "section_title": "Punishment under this chapter not in derogation of any other Liability.",
          "body": ""
        }
      ]
    },
    {
      "chapter_title": "DISQUALIFICATIONS",
      "sections": [
        {
          "section_no": "48",
          "section_title": "Disqualifications.",
          "body": ""
        },
        {
          "section_no": "49",
          "section_title": "Disqualification on account of certain offences.",
          "body": ""
        },
        {
          "section_no": "50",
          "section_title": "Removal and remission of disqualification.",
          "body": ""
        }
      ]
    },
    {
      "chapter_title": "MISCELLANEOUS",
      "sections": [
        {
          "section_no": "51",
          "section_title": "Commission to ensure fair election, etc.",
          "body": ""
        },
        {
          "section_no": "52",
          "section_title": "Directions of Commission in certain matters.",
          "body": ""
        },
        {
          "section_no": "53",
          "section_title": "Jurisdiction of courts barred.",
          "body": ""
        },
        {
          "section_no": "54",
          "section_title": "Protection of action taken in good faith.",
          "body": ""
        },
        {
          "section_no": "55",
          "section_title": "Power to make rules.",
          "body": ""
        },
        {
          "section_no": "56",
          "section_title": "Commission to be construed as Commissioner in certain cases.",
          "body": ""
        }
      ]
    }
  ],
  "source_file": "administrator5a9c96066664bf9644d063fc533acc48.txt"
}