{
  "error": "Expecting value: line 1 column 1 (char 0)",
  "raw": "THE CARRIAGE OF GOODS BY SEA ACT, 1925 CONTENTS 1. Short title and extent 2. Application of Rules 3. Absolute warranty of sea worthiness not to be implied in contracts to which Rules apply 4. Statement as to application of Rules to be included in bills of lading 5. Modification of Article VI of Rules in relation to goods carried in sailing ships and by prescribed routes 6. Modification of Rules 4 and 5 of Article III in relation to bulk cargoes 7. Saving and operation SCHEDULE THE CARRIAGE OF GOODS BY SEA ACT, 1925 ACT NO. XXVI OF 1925 [21st September, 1925] An Act to amend the law with respect to the carriage of goods by sea WHEREAS at the International Conference on Maritime Law held at Brussels in October, 1922, the delegates at the Conference, including the delegates representing His Majesty, agreed unanimously to recommend their respective Governments to adopt as the basis of a convention a  convention for the unification of certain rules relating to bills of lading; AND WHEREAS at a meeting held at Brussels in October, 1923, the rules contained in the said  convention were amended by the Committee appointed by the said Conference; AND WHEREAS provision has been made by the Carriage of Goods by Sea Act, 1924 (14 & 15 Geo, 5, c. 22.), that the said rules as so amended and as set out with modifications in the Schedule shall, subject to the provisions of that Act, have the force of law with a view to establishing the responsibilities, liabilities, rights and immunities attaching to carriers under bills of lading; AND WHEREAS it is expedient that like provision should be made in 1[Pakistan]; it is hereby enacted as follows: 1. Short title and extent. (1) This Act may be called the 2[*] Carriage of Goods by Sea Act, 1925. 1[(2) It extends to the whole of Pakistan.] 2. Application of Rules. Subject to the provisions of this Act, the rules set out in the schedule (hereinafter referred to as “the Rules”) shall have effect in relation to and in connection with the carri",
  "source_file": "administrator4a83245a574af5239b38c27738ae88ac.txt",
  "law_name": "The Carriage of Goods By Sea Act, 1925",
  "year": 1925
}