{
  "law_name": "THE CO-OPERATIVE FARMING ACT",
  "year": 1976,
  "chapters": [
    {
      "chapter_title": "PRELIMINARY",
      "sections": [
        {
          "section_no": "1",
          "section_title": "Short title, extent and commencement",
          "body": "(1) This Act may be called the Co-operative Farming Act, 1976. (2) It extends to the whole of Pakistan. (3) It shall come into force at once."
        },
        {
          "section_no": "2",
          "section_title": "Act to override other laws",
          "body": "The provisions of this Act and the rules shall have effect notwithstanding anything contained in the Co-operative Societies Act, 1925 (Act VII of 1925), or in any other law for the time being in force relating to the rights of landlords and tenants."
        },
        {
          "section_no": "3",
          "section_title": "Definitions",
          "body": "In this Act, unless there is anything repugnant in the subject or context, definitions for terms such as 'agricultural year', 'bye-laws', 'committee', 'co-operative farm', 'District Co-operative Council', 'District Co-operative Federation', 'member', 'National Co-operative Council', 'nation building department', 'net profits', 'office-bearers', 'prescribed', 'produce index units', 'produce income', 'Provincial Co-operative Council', 'Provincial Co-operative Federation', 'Registrar', 'rules', 'society', 'tenant', and 'value' in relation to land are provided."
        }
      ]
    },
    {
      "chapter_title": "REGISTRATION OF SOCIETIES",
      "sections": [
        {
          "section_no": "4",
          "section_title": "Conditions of registration",
          "body": "(1) A co-operative farming society which fulfils the following conditions may apply to the Registrar for registration under this Act: (a) it consists of not less than twenty members; (b) the total land pooled by its members is not less than five hundred acres in Baluchistan, Punjab, and Sind, and not less than three hundred acres in the North-West Frontier Province; (c) the land pooled by its members forms one contiguous farm. (2) An application under sub-section (1) shall be made in such form, and be accompanied by such documents, as may be prescribed."
        },
        {
          "section_no": "5",
          "section_title": "Procedure of registration",
          "body": "If, after making such enquiry as he considers necessary, the Registrar is satisfied that a co-operative farming society applying for registration is eligible for registration under this Act, and that the bye-laws proposed to be framed by it are not inconsistent with any of the provisions of this Act, or the rules, he shall register it, and its bye-laws, within fifteen days from the receipt of its application."
        },
        {
          "section_no": "6",
          "section_title": "Evidence of registration",
          "body": "A certificate of registration signed by the Registrar shall be conclusive evidence that the society mentioned therein is duly registered, unless it is proved that the registration of the society has been cancelled."
        },
        {
          "section_no": "7",
          "section_title": "Amendment of the bye-laws of a society",
          "body": "(1) No amendment of the bye-laws of a society shall be effective unless it is registered with the Registrar. (2) If the Registrar is satisfied that an amendment of the bye-laws proposed to be made by a society is not inconsistent with any of the provisions of this Act or the rules he shall register the amendment."
        }
      ]
    },
    {
      "chapter_title": "MEETINGS",
      "sections": [
        {
          "section_no": "8",
          "section_title": "General meeting",
          "body": "Every society shall call an annual general meeting of its members and not less than one other general meeting in an agricultural year."
        },
        {
          "section_no": "9",
          "section_title": "Special general meeting",
          "body": "(1) On a requisition signed by not less than one-fifth of the total number of members of a society, the Chairman shall call a special general meeting of the society within thirty days of the receipt of the requisition. (2) If the Chairman does not call the meeting within the time specified in sub-section (1), the Registrar shall direct the Chairman to call the meeting within a period of seven days and, if the Chairman fails to do so, may himself call the meeting."
        }
      ]
    },
    {
      "chapter_title": "MANAGING COMMITTEE AND RIGHTS AND LIABILITIES OF MEMBERS",
      "sections": [
        {
          "section_no": "10",
          "section_title": "Managing committee of a society",
          "body": "(1) Each member shall have one vote irrespective of the area of the land pooled by him; provided that in case of a deceased member all his heirs who want to remain members shall be registered and shall have the right to vote. (2) The members shall, in their annual general meeting, elect, by majority of votes, (a) a managing committee consisting of not less than seven and not more than eleven members, including the office-bearers; and (b) one representative for the District Co-operative Federation. (3) A member of a committee, including an office-bearer, and the representative shall, unless he resigns or is removed from office earlier, hold office for a term of two years. (4) No member of a committee or an office-bearer or the representative shall hold office for more than two consecutive terms. (5) Subject to such decisions, if any, as may be taken in a general meeting of a society, the management of the affairs of a society shall vest in the committee. (6) A member of a committee, including an office-bearer or the representative, may be removed from office by a resolution passed by a majority of the total number of members of a society in an annual general meeting or a meeting requisitioned for this purpose by not less than one-third of the total number of members. (7) Any member of a committee, including an office-bearer, may by writing under his hand addressed to the Chairman, resign his office."
        },
        {
          "section_no": "11",
          "section_title": "Pooling of land",
          "body": "(1) Every member shall, subject to the provisions of clause (c) of sub-section (1) of section 4, pool his entire holding without affecting his ownership of the holding in any way: Provided that a member or group of members owning a subsistence holding may retain for his or their personal use an area not exceeding (a) in the case of Baluchistan, two acres; and (b) in the case of the other Provinces, one acre: Provided further that a member or group of members pooling more than a subsistence holding may retain for his or their personal use such area not exceeding (a) in the case of Baluchistan, four acres, and (b) in the case of the other Provinces, two acres; as may be determined by the committee: Provided further that the location of the area to be so retained may be determined by the committee: Provided further that a member owning less than a subsistence holding shall not be entitled to retain any land for his personal use. Explanation. In this section, ‘subsistence holding’ shall have the same meaning as in the Land Reforms Regulation, 1972. (2) All land pooled for a co-operative farm by members shall, for the purposes of management, vest in the society."
        },
        {
          "section_no": "12",
          "section_title": "Liability of members",
          "body": "The liability of a member shall be limited to the value of the land pooled by him."
        },
        {
          "section_no": "13",
          "section_title": "Evaluation of land, etc.",
          "body": "(1) The land pooled by each member for a co-operative farm shall be evaluated by the Managing Committee according to its quality and area on the basis of produce index units."
        }
      ]
    },
    {
      "chapter_title": "PRIVILEGES AND LIABILITIES OF SOCIETIES",
      "sections": [
        {
          "section_no": "16",
          "section_title": "Societies to be bodies corporate",
          "body": ""
        },
        {
          "section_no": "17",
          "section_title": "Office of society",
          "body": ""
        },
        {
          "section_no": "18",
          "section_title": "Copy of Act, etc., to be open to inspection",
          "body": ""
        },
        {
          "section_no": "19",
          "section_title": "Liability in respect of encumbrances on land",
          "body": ""
        },
        {
          "section_no": "20",
          "section_title": "Audit and accounts",
          "body": ""
        },
        {
          "section_no": "21",
          "section_title": "Transfer of interest on death of a member",
          "body": ""
        }
      ]
    },
    {
      "chapter_title": "PROPERTY AND FUNDS OF THE SOCIETY",
      "sections": [
        {
          "section_no": "22",
          "section_title": "Assets of the Society",
          "body": ""
        },
        {
          "section_no": "23",
          "section_title": "Provisions for Reserve Fund, Development Fund and other expenses",
          "body": ""
        },
        {
          "section_no": "24",
          "section_title": "Distribution of produce income of co-operative farm",
          "body": ""
        },
        {
          "section_no": "25",
          "section_title": "Distribution of profits",
          "body": ""
        },
        {
          "section_no": "26",
          "section_title": "Rights of tenants, etc.",
          "body": ""
        }
      ]
    },
    {
      "chapter_title": "LIQUIDATION AND WINDING UP",
      "sections": [
        {
          "section_no": "27",
          "section_title": "Winding up",
          "body": ""
        },
        {
          "section_no": "28",
          "section_title": "Winding up if membership is reduced",
          "body": ""
        },
        {
          "section_no": "29",
          "section_title": "Effect of winding up",
          "body": ""
        },
        {
          "section_no": "30",
          "section_title": "Power of Chairman of District Co-operative Federation to assess damage",
          "body": ""
        },
        {
          "section_no": "31",
          "section_title": "Bar of suit",
          "body": ""
        },
        {
          "section_no": "32",
          "section_title": "Arbitration",
          "body": ""
        },
        {
          "section_no": "33",
          "section_title": "Attachment before award",
          "body": ""
        },
        {
          "section_no": "34",
          "section_title": "Recoveries of dues",
          "body": ""
        }
      ]
    },
    {
      "chapter_title": "FEDERATION OF THE SOCIETIES",
      "sections": [
        {
          "section_no": "35",
          "section_title": "District Co-operative Federation",
          "body": ""
        },
        {
          "section_no": "36",
          "section_title": "Fund and functions of District Co-operative Federation",
          "body": ""
        },
        {
          "section_no": "37",
          "section_title": "Provincial Co-operative Federation",
          "body": ""
        },
        {
          "section_no": "38",
          "section_title": "Fund and functions of the Provincial Co-operative Federation",
          "body": ""
        },
        {
          "section_no": "39",
          "section_title": "District Co-operative Council",
          "body": ""
        },
        {
          "section_no": "40",
          "section_title": "Functions of the District Co-operative Council",
          "body": ""
        },
        {
          "section_no": "41",
          "section_title": "Provincial Co-operative Council",
          "body": ""
        },
        {
          "section_no": "42",
          "section_title": "Functions of the Provincial Co-operative Council",
          "body": ""
        },
        {
          "section_no": "43",
          "section_title": "National Co-operative Council",
          "body": ""
        },
        {
          "section_no": "44",
          "section_title": "Functions of the National Co-operative Council",
          "body": ""
        }
      ]
    },
    {
      "chapter_title": "INSPECTION OF AFFAIRS",
      "sections": [
        {
          "section_no": "45",
          "section_title": "Inquiry by Chairman District Co-operative Federation",
          "body": ""
        },
        {
          "section_no": "46",
          "section_title": "Inspection of books of indebted society",
          "body": ""
        },
        {
          "section_no": "47",
          "section_title": "Power of Chairman, District Co-operative Federation to exercise powers under section 30 in the course of an inquiry or inspection",
          "body": ""
        },
        {
          "section_no": "48",
          "section_title": "Costs of inquiry",
          "body": ""
        },
        {
          "section_no": "49",
          "section_title": "Recovery of costs",
          "body": ""
        }
      ]
    },
    {
      "chapter_title": "MISCELLANEOUS",
      "sections": [
        {
          "section_no": "50",
          "section_title": "Amalgamation or transfer of societies",
          "body": ""
        },
        {
          "section_no": "51",
          "section_title": "Powers to exempt from stamp duty or registration fee, etc.",
          "body": ""
        },
        {
          "section_no": "52",
          "section_title": "Exemption from Income-tax",
          "body": ""
        },
        {
          "section_no": "53",
          "section_title": "Notice necessary in suits",
          "body": ""
        },
        {
          "section_no": "54",
          "section_title": "Power of revision",
          "body": ""
        },
        {
          "section_no": "55",
          "section_title": "Transitional provisions",
          "body": ""
        },
        {
          "section_no": "56",
          "section_title": "Power to make rules",
          "body": ""
        },
        {
          "section_no": "57",
          "section_title": "Repeal",
          "body": ""
        }
      ]
    }
  ],
  "source_file": "administratorf9c9cd95c3ebe5cc50e7b7f7a0f09a4d.txt"
}