{
  "law_name": "THE NATIONAL INSTITUTE OF CARDIOVASCULAR DISEASES (ADMINISTRATION) ORDINANCE",
  "year": 1979,
  "chapters": [
    {
      "chapter_title": "PRELIMINARY",
      "sections": [
        {
          "section_no": "1",
          "section_title": "Short title, extent and commencement",
          "body": "(1) This Ordinance may be called the National Institute of Cardiovascular Diseases (Administration) Ordinance, 1979. (2) It extends to the whole of Pakistan. (3) It shall come into force at once."
        },
        {
          "section_no": "2",
          "section_title": "Definitions",
          "body": "In this Ordinance, unless there is anything repugnant in the subject or context,- (a) “Chairman” means the Chairman of the Governing Body ; (b) “Executive Director” means the Executive Director of the Institute ; (c) “Governing Body” means the Governing Body of the Institute ; (d) “Institute” means the National institute of Cardiovascular Diseases set up in 1963 and registered as such under the Societies Registration Act, 1860 (XXI of 1860); and (e) “Trust” means the National institute of Cardiovascular Diseases Trust, Karachi."
        },
        {
          "section_no": "3",
          "section_title": "Ordinance to override other laws",
          "body": "This Ordinance shall have effect notwithstanding anything contained in any other law for the time being in force, or in the Trust Deed of the National Institute of Cardiovascular Diseases Trust, Karachi, dated the 8th May 1976."
        },
        {
          "section_no": "4",
          "section_title": "Vesting of powers, etc., of the Board of Trustees of the Trust in the Governing Body",
          "body": "All the powers and functions of the Board of Trustees of the Trust shall vest in, and be exercised and performed by, the Governing Body and every member of the said Board shall cease to hold office."
        },
        {
          "section_no": "5",
          "section_title": "Incorporation of the Institute",
          "body": "(1) The Institute shall be a body corporate, to be called the National Institute of Cardiovascular Diseases, having perpetual succession and a common seal with power, subject to the provisions of this Ordinance, to acquire, hold and dispose of property, both movable and immovable, and shall by the said name sue and be sued. (2) The Headquarters of the Institute shall be at Karachi."
        }
      ]
    },
    {
      "chapter_title": "GENERAL",
      "sections": [
        {
          "section_no": "6",
          "section_title": "Functions of the Institute",
          "body": "The functions of the Institute shall be- (1) to undertake modern treatment of cardiovascular diseases ; (2) to acquire latest physical facilities required for carrying out necessary investigation and treatment of cardiovascular diseases; (3) to seek and enter into cooperation with international and other foreign agencies with the prior approval of the Federal Government in furtherance of the objectives of the Institute; (4) to carry out research in Cardiovascular Diseases for prevention and control of cardiovascular diseases as well as for its treatment ; (5) to undertake training of medical students and nurses, both undergraduate and post-graduate, in cardiovascular diseases; and (6) to develop itself into a Centre of super excellence for the treatment of cardiovascular diseases."
        },
        {
          "section_no": "7",
          "section_title": "Governing Body",
          "body": "The general direction and administration of the affairs of the Institute shall vest in the Governing Body which shall consist of- 1. Minister for Health, Social Welfare and Population ……... Chairman. Secretary, Ministry of Health, Social Welfare and Population…………………………………………………. 2. Vice-Chairman 3. Director General, Health, Ministry of Health and Population………………………………………………… Member. 4. Executive Director, to be appointed by the Federal Government………………………………………………... Member/Secretary. 5. A nominee of the Pakistan Federation of Chambers of Commerce and Industry. ………………………………….. Member. 6. Two persons to be nominated by the Federal Government, of whom one shall be a person possessing medical qualifications………………………………………………. Member. 7. A nominee of the Auditor-General of Pakistan……………. Member. 8. The elected Mayor of the Karachi Metropolitan Corporation or, if there is no elected Mayor, a social worker of Karachi to be nominated by the Government of Sind……... Member. 9. A social worker of Sind, excluding Karachi, to be nominated by the Government of Sind……………………. Member."
        },
        {
          "section_no": "8",
          "section_title": "Powers of the Governing Body",
          "body": "(1) The Governing Body may,- (a) frame bye-laws to govern the working of the Institute and issue instructions to any committee or sub-committee of the Institute; and (b) generally supervise the administration and management of the affairs of the Institute and do all such acts and take all such steps as are necessary for the promotion and fulfilment of the objects and purpose of the Institute. (2) In the discharge of its functions, the Governing Body shall be guided on questions of policy by the instructions, if any, given to it from time to time by the Federal Government which shall be the sole judge as to whether a question is a question of policy, and the Governing Body shall be bound to carry out such directions."
        },
        {
          "section_no": "9",
          "section_title": "Term of office of members",
          "body": "(1) Unless earlier removed by the Federal Government, the term of members, other than ex-officio members, shall be three years. (2) A member, other than an ex-officio member, may resign his office by writing under his hand addressed to the Federal Government. (3) When a person is appointed to be a member of the Governing Body by virtue of his holding an office or appointment, he shall cease to be such member when he ceases to hold that office or appointment."
        },
        {
          "section_no": "10",
          "section_title": "Executive Director",
          "body": "(1) The Executive Director shall be the Secretary and Chief Executive Officer of the Institute and shall have the following functions and duties, namely :- (i) to keep in custody the records and seal of the Institute ; (ii) to appoint officers and staff upto Grade-17 and superintend and control the administration of the Institute ; (iii) to authorise payments of monthly salaries and allowances to the employees of the Institute ; (iv) to propose budget estimates and supplementary budget estimates and place the same before the Governing Body for approval ; (v) to pass payment of bills under any heads of the budget duly approved and authorised ; (vi) to issue notices of meetings of the Governing Body and its committees in consultation with the Chairman and to maintain proper record of minutes and proceedings thereof ; (vii) to take steps for the implementation of decisions of the Governing Body, committees and sub-committees ; (viii) to prepare and present the annual budget ; (ix) to carry on all the correspondence of the Institute ; (x) to execute deeds and documents on behalf of the Governing Body ; and (xi) to perform any other duties which may be assigned to him by the Governing Body. (2) The Executive Director shall be the ex-officio member of a committee or sub-committee set up by the Governing Body. (3) The Executive Director shall not, except with the previous approval of the Governing Body in each case or unless already approved in the Budget duly itemised, allow expenditure on items of civil works, or capital expenditure on equipment or automobiles."
        },
        {
          "section_no": "11",
          "section_title": "Meetings of the Governing Body",
          "body": "(1) The meetings of the Governing Body shall be convened by the Chairman on such date and at such time and place as may be specified by him: Provided that- (i) not less than four meetings shall be held every year ; (ii) not less than eight day’s notice shall be given to the members specifying the date, time and place of the meeting. (2) The Governing Body may regulate by regulations the procedure for its meetings. (3) No act or proceeding of the Governing Body shall be invalid merely on the ground of the existence of a vacancy in, or defect in the constitution of, the Governing Body."
        },
        {
          "section_no": "12",
          "section_title": "Setting up of working groups and Committees",
          "body": "The Governing Body may from time to time appoint such working groups or committees from amongst its members as it may consider necessary to assist it in the performance of its functions and to discharge such of its functions as it may assign to them."
        },
        {
          "section_no": "13",
          "section_title": "Funds",
          "body": "The funds of the Institute shall consist of- (a) grants made by the Federal Government ; (b) donations and endowments ; (c) income from investments and deposits ; (d) foreign aid and loans obtained with the approval of the Federal Government ; and (e) Trust Fund of the Institute."
        },
        {
          "section_no": "14",
          "section_title": "Audit and accounts",
          "body": "(1) The Executive Director shall prepare the annual budget of the Institute for the ensuing financial year and submit it for approval to the Governing Body. (2) The funds of the Institute, other than the Trust Fund, shall be kept in the personal ledger account of the Institute with the National Bank of Pakistan acting as an agent of the State Bank of Pakistan. (3) The Trust Fund shall be invested in Government and other approved securities and the income accruing therefrom shall be used for the purposes of the Institute. (4) The accounts of the Institute shall be maintained in such form and manner as the Auditor-General of Pakistan may determine in consultation with the Federal Government. (5) The accounts of the Institute shall be audited by one or more auditors who are chartered accountants within the meaning of the Chartered Accountants Ordinance, 1961 (X of 1961), and are appointed by the Institute in consultation with the Auditor-General of Pakistan."
        },
        {
          "section_no": "15",
          "section_title": "Appointments of officers, etc.",
          "body": "The Governing Body may appoint, subject to such general or special orders as the Federal Government may give from time to time, such officers in Grade-18 and above, and engage such consultants or expects, as it may consider necessary for the efficient performance of the functions of the Institute, on such terms and conditions as it may deem fit."
        },
        {
          "section_no": "16",
          "section_title": "International cooperation",
          "body": "The Institute may, with the approval of the Federal Government, cooperate with any foreign agency or International Organization for the further development of its technical capabilities and research activities, pursuant to an international agreement or arrangement made before or after the establishment of the Institute."
        }
      ]
    },
    {
      "chapter_title": "MISCELLANEOUS",
      "sections": [
        {
          "section_no": "17",
          "section_title": "Industrial relations ordinance, 1969, not to apply",
          "body": "The provisions of the Industrial Relations Ordinance 1969, (XXIII of 1969), shall not apply to or in relation to the Institute or any of the officers or employees of the Institute."
        },
        {
          "section_no": "18",
          "section_title": "Terms and conditions of service, etc., of Government servants working in the Institute",
          "body": "(1) All persons in the service of Pakistan and serving in connection with the affairs of the Institute in any capacity immediately before the commencement of this Ordinance shall stand transferred for service under the Institute."
        }
      ]
    }
  ],
  "source_file": "administratorb93e618520500701f18b8d6bfac22794.txt"
}