{
  "law_name": "The Karachi Essential Articles (Price Control and Anti-Hoarding) Act",
  "year": 1953,
  "chapters": [
    {
      "chapter_title": "Contents",
      "sections": [
        {
          "section_no": "1",
          "section_title": "Short title extent and commencement",
          "body": "This Act may be called the Karachi Essential Articles (Price Control and Anti-Hoarding) Act, 1953. It extends to the Karachi Division. It shall come into force at once."
        },
        {
          "section_no": "2",
          "section_title": "Definitions",
          "body": "In this Act, unless there is anything repugnant in the subject or context, (a) 'Commissioner' means the Commissioner of the Karachi Division; (b) 'essential article' means any article, other than an 'essential commodity' within the meaning of section 2 of the Essential Supplies (Temporary Powers) Act, 1946, which the Commissioner may, from time to time, declare by notification, to be an article to which the provisions of this Act shall apply; (c) 'notification' means a notification published in the official Gazette; (d) 'prescribed' means prescribed by rules made under this Act; (e) 'retailer' means a trader who sells any essential article directly to a consumer; (f) 'trader' means any person engaged in the purchases, sale, or storage for sale of any essential article; (g) 'wholesaler' means a trader other than a retailer."
        },
        {
          "section_no": "3",
          "section_title": "Power to fix prices and to require marking of prices",
          "body": "The Commissioner may, by notification, fix the maximum prices above which no essential article shall be sold by any wholesaler, retailer, trader or any other person, and the prices so fixed may be different in different localities. The Commissioner may, by notification, require any trader to mark essential articles with the sale prices fixed under sub-section (1), in such manner as may be prescribed. The Commissioner may, by order in writing, require any trader to exhibit a list of essential articles with prices fixed under sub-section (1) at convenient place of his shop premises as prescribed."
        },
        {
          "section_no": "4",
          "section_title": "Prohibition against purchase, sale, etc., at prices exceeding the maximum price",
          "body": "Notwithstanding anything contained in any contract, no wholesaler, retailer, trader or other person shall sell or purchase, or deliver or accept delivery of, any essential article at a price exceeding the maximum price fixed under sub-section (1) of section 3. No trader shall sell or offer or exhibit for sale any essential articles in respect of which marking of sale prices has been required under sub-section (2) of section 3 unless such article has been so marked."
        },
        {
          "section_no": "5",
          "section_title": "Power to control possession of essential article",
          "body": "The Commissioner may, by notification, direct that no wholesaler, retailer, trader or other person shall keep in his possession or under his control any essential article in excess of the quantity specified in such notification. If, on the date of issue of a notification under sub-section (1) in respect of any essential article, any wholesaler, retailer, trader or other person has in his possession any quantity of such essential article in excess of the quantity specified in such notification, he shall forthwith report the fact to the Commissioner or to such other officer as may be empowered in this behalf by the Commissioner, and shall take such action as to storage, distribution, or disposal of the excess quantity as the Commissioner or such other officer may direct."
        },
        {
          "section_no": "6",
          "section_title": "Power to require licence for trading",
          "body": "The Commissioner may, by notification, direct that no trader or class of traders shall deal in any essential article except under, and in accordance with the conditions of, a licence issued in this behalf by the Commissioner, on payment of such fees and in such manner and form as may be prescribed."
        },
        {
          "section_no": "7",
          "section_title": "Direction to sell to specified persons",
          "body": "The Commissioner may, by general or special order in writing, direct any wholesaler, retailer, or trader holding stocks of any essential article to sell the whole or a specified part thereof at prices not exceeding the maximum fixed under sub-section (1) of section 3, to such persons or class of persons and in such circumstances or against such permits as may be specified in the order."
        },
        {
          "section_no": "8",
          "section_title": "Prohibition against withholding of sales",
          "body": "No wholesaler, retailer or trader shall, unless previously authorised in writing to do so by the Commissioner, withhold from sale or refuse to sell to any person any essential article within the limits as to quantity imposed by or under this Act."
        },
        {
          "section_no": "9",
          "section_title": "Power to require maintenance of account etc., and registration of godowns",
          "body": "Any officer authorised in this behalf by the Commissioner may, by general or special order in writing, direct any wholesaler, retailer or trader: (a) to maintain accounts relating to any transaction in such manner and form as may be prescribed; (b) to submit such accounts, returns, reports or statements relating to any transaction in such manner and form as may be prescribed; (c) to cause his storage godown to be registered in such manner and within such period as may be prescribed. No person whose godown has been registered under clause (c) of sub-section (1) shall store any essential article in any place other than the godown so registered."
        },
        {
          "section_no": "10",
          "section_title": "Power to enter, inspect, search, etc.",
          "body": "Any officer authorised in this behalf by the Commissioner may (a) enter and inspect any premises, vessels, vehicles, or aircraft, used or believed to be used for the purchase, sale, transport, or storage for sale of any essential article; (b) enter and search any premises, vessels, vehicles, or aircraft, and seize any essential article, together with the containers thereof, in respect of which he has reasons to believe that a contravention of the provisions of this Act has been or is about to be committed; (c) direct the owner, occupier or other person in charge of such premises, vehicles, vessels or aircraft or any trader to produce any books, accounts, vouchers or other documents relating to the purchase, sale or storage for sale or transport of any essential article or to furnish such information relating to such transaction as the officer so authorised may require; (d) inspect or cause to be inspected any books, accounts, vouchers or other documents relating to any such transaction as aforesaid; and (e) take or cause to be taken extracts from or copies of any document relating to such transaction."
        },
        {
          "section_no": "11",
          "section_title": "Provisions of the Act not to apply in case of Government purchase, etc.",
          "body": "The provisions of this Act shall not apply to the purchase, storage or distribution of any essential article by or on behalf of the Federal Government or any Provincial Government."
        },
        {
          "section_no": "12",
          "section_title": "Power to exempt",
          "body": "The Commissioner may, by notification, exempt any person or class of persons from all or any of the provisions of this Act, subject to such conditions, if any, as may be specified in the notification."
        },
        {
          "section_no": "13",
          "section_title": "Penalty and procedure, etc.",
          "body": "If any person contravenes any of the provisions of this Act or any rule made thereunder, direction or order issued under any such provision he shall be deemed to have committed the offence of hoarding or, as the case may be, of dealing in the black market, under section 3 of the Hoarding and Black Market Act, 1948, and all the provisions of that Act, shall apply to such contravention as if such contravention were an offence under that Act."
        },
        {
          "section_no": "14",
          "section_title": "Delegation of power etc.",
          "body": "The Commissioner may, by notification, direct that any power or duty which is conferred or imposed by this Act on him shall, subject to such conditions, if any, as may be specified in the notification, be exercised or discharged also by any officer or authority subordinate to him."
        },
        {
          "section_no": "15",
          "section_title": "Public servant",
          "body": "Any person empowered or authorised to do anything under this Act shall be deemed to be a public servant within the meaning of section 21 of the Pakistan Penal Code."
        },
        {
          "section_no": "16",
          "section_title": "Power to make rules",
          "body": "The Commissioner may make rules for carrying out the provisions of this Act."
        },
        {
          "section_no": "17",
          "section_title": "Indemnity",
          "body": "(1) No suit, prosecution or other legal proceeding shall lie against any person for anything which is in good faith done or intended to be done in pursuance of any provision of this Act and the rules made thereunder. (2) No suit or other legal proceeding shall lie against the Commissioner for any damage caused or likely to be caused by anything which is in good faith done or intended to be done in pursuance of any provision of this Act or the rules made thereunder."
        },
        {
          "section_no": "18",
          "section_title": "Repeal and saving",
          "body": "(1) The Karachi Essential Articles (Price Control and Anti-Hoarding) Ordinance, 1953 is hereby repealed. (2) Any order, direction or rule made under the said Ordinance and in force immediately before the commencement of this Act shall be deemed to have been made under the provisions of this Act and shall have effect accordingly."
        }
      ]
    }
  ],
  "source_file": "administrator20d3803f6a700fda5191b9a29f11e7ac.txt"
}