{
  "law_name": "THE SPORTS (DEVELOPMENT AND CONTROL) ORDINANCE",
  "year": 1962,
  "chapters": [
    {
      "chapter_title": "Part I",
      "sections": [
        {
          "section_no": "1",
          "section_title": "Short title, extent and commencement",
          "body": "(1) This Ordinance shall be called the Sports (Development and Control) Ordinance, 1962. (2) It extends to the whole of Pakistan. (3) It shall come into force at once."
        },
        {
          "section_no": "2",
          "section_title": "Definitions",
          "body": "In this Ordinance, unless there is anything repugnant in the subject or context, (i) “Sports” shall include Hockey, Football, Athletics, Wrestling, Cricket, Weight-lifting, Squash Rackets, Swimming, Boxing, Cycling, Basketball, Golf, Volleyball, Rifle Shooting, Table Tennis, Badminton, Lawn Tennis, Polo, Racing, Body-Building, Skiing, Mountaineering, and any other activity which the 1[Federal Government] may, by notification in the official Gazette, specify. (ii) “Board” means a Board constituted under this Ordinance, for the control of Sports in Pakistan."
        }
      ]
    },
    {
      "chapter_title": "Part II",
      "sections": [
        {
          "section_no": "3",
          "section_title": "Establishment of the Board",
          "body": "(1) As soon as may be after the commencement of this Ordinance, the 1[Federal Government] may, for the purposes of promoting and developing uniform standards of competition in Sports in Pakistan comparable to the standards prevailing internationally, and regulating and controlling sports in Pakistan on a national basis, by notification in the official Gazette, constitute, one or more boards for the control of Sports in Pakistan. (2) A Board shall be a body corporate having perpetual succession and a common seal with power to acquire, hold and dispose of property, both movable and immovable."
        },
        {
          "section_no": "4",
          "section_title": "Name, Constitution, powers and functions of a Board",
          "body": "The name, Constitution, powers and functions of a Board shall be such as may be determined by the 1[Federal Government]."
        },
        {
          "section_no": "5",
          "section_title": "Exclusive right to make rules for the development, control and uniformity of Sports throughout Pakistan",
          "body": "A Board may make rules and regulations for carrying its objects into effect."
        }
      ]
    }
  ],
  "source_file": "administrator88869e029822dbe2b228f3584d46b6b8.txt"
}