{
  "law_name": "The Registered Layout-Designs of Integrated Circuits Ordinance",
  "year": 2000,
  "chapters": [
    {
      "chapter_title": "Contents",
      "sections": [
        {
          "section_no": "1",
          "section_title": "Short title, extent and commencement",
          "body": "(1) This Ordinance may be called the Registered Layout-Designs of integrated Circuits Ordinance, 2000. (2) It extends to the whole of Pakistan. (3) It shall come into force at once."
        },
        {
          "section_no": "2",
          "section_title": "Definitions",
          "body": "In this Ordinance, unless there is anything repugnant in the subject or context, various definitions are provided including 'Controller', 'District Court', 'integrated circuit', 'layout-design', 'Patent Office', 'prescribed', 'protection', 'registration', 'right-holder', and 'regulations'."
        },
        {
          "section_no": "3",
          "section_title": "Originality",
          "body": "(1) A layout-design shall be considered to be original if it is the result of its creator's own intellectual effort and is not commonplace among creators and manufacturers of layout-designs of integrated circuits at the time of its creation."
        },
        {
          "section_no": "4",
          "section_title": "Right to protection",
          "body": "(1) The right to layout design protection shall be available under this Ordinance if and to the extent, the layout-design is original within the meaning of section 3 and has been subject of application for registration."
        },
        {
          "section_no": "5",
          "section_title": "Effect of protection",
          "body": "(1) Subject to section 17, the protection shall have the effect that the following acts shall be unlawful if performed without the authorization of the right-holder."
        },
        {
          "section_no": "6",
          "section_title": "Commencement and duration of protection",
          "body": "The protection of a layout-design registered under this Ordinance shall commence on the date of the first commercial exploitation anywhere in the world and shall terminate at the end of the tenth calendar year from the date of such first commercial exploitation."
        },
        {
          "section_no": "7",
          "section_title": "Application for registration",
          "body": "(1) An application for the registration of a layout design shall be in writing and shall be filed with the Patent Office."
        },
        {
          "section_no": "8",
          "section_title": "Registration",
          "body": "(1) The Controller shall, where the application complies with the requirement of section 7, after such enquiry as he thinks fit, register the layout-design in the Register of Layout-Designs."
        },
        {
          "section_no": "9",
          "section_title": "Register of Layout-Designs",
          "body": "(1) The Patent Office shall maintain a register to be called the 'Register of Layout-Designs'."
        },
        {
          "section_no": "10",
          "section_title": "Right to transfer and subsequent rectification of Register of Layout-Designs",
          "body": "(1) Where the essential contents of an application have been taken from the layout-design of another person without his consent, such person may, in writing, request the Controller to transfer the application to him."
        },
        {
          "section_no": "11",
          "section_title": "Change in the ownership of a protected layout-design",
          "body": "Details regarding the change in ownership of a protected layout-design."
        },
        {
          "section_no": "12",
          "section_title": "Contractual licences",
          "body": "Provisions regarding contractual licenses related to layout-designs."
        },
        {
          "section_no": "13",
          "section_title": "Cancellation",
          "body": "Conditions under which a registration may be cancelled."
        },
        {
          "section_no": "14",
          "section_title": "Representation",
          "body": "Provisions regarding representation in matters related to layout-designs."
        },
        {
          "section_no": "15",
          "section_title": "Infringement and enforcement of right",
          "body": "Details regarding infringement and enforcement of rights related to layout-designs."
        },
        {
          "section_no": "16",
          "section_title": "Offences and penalties",
          "body": "Provisions regarding offences and penalties related to violations of this Ordinance."
        },
        {
          "section_no": "17",
          "section_title": "Exploitation by a Government agency or third person",
          "body": "Conditions under which exploitation by a government agency or third person is permissible."
        },
        {
          "section_no": "18",
          "section_title": "Exercise of discretionary power and extension of time",
          "body": "Provisions regarding the exercise of discretionary power and extension of time."
        },
        {
          "section_no": "19",
          "section_title": "Appeal",
          "body": "Provisions regarding appeals related to decisions made under this Ordinance."
        },
        {
          "section_no": "20",
          "section_title": "Surrender of right",
          "body": "Conditions under which a right may be surrendered."
        },
        {
          "section_no": "21",
          "section_title": "Power to make rules",
          "body": "Authority to make rules under this Ordinance."
        },
        {
          "section_no": "22",
          "section_title": "Power to make regulations",
          "body": "Authority to make regulations under this Ordinance."
        }
      ]
    }
  ],
  "source_file": "administrator47ec7e7d3843370d9621a07ae60ed9a4.txt"
}