{
  "error": "Expecting value: line 1 column 1 (char 0)",
  "raw": "THE LAND ACQUISITION (MINES) ACT, 1885 CONTENTS 1. Short title, commencement and local extent 2. Saving for mineral rights of the Government 3. Declaration that mines are not needed 4. Notice to be given before working mines lying under land 5. Power to prevent or restrict working 6. Mode of determining persons interested and amount of compensation 7. If Provincial Government does not offer to pay compensation, mines may be worked in a proper manner 8. Mining communications 9. Provincial Government to pay compensation for injury done to mines 10. And also for injury arising from any airway or other work 11. Power to officer of Provincial Government to enter and inspect the working of mines 12. Penalty for refusal to allow inspection 13. If mines worked contrary to provisions of this Act, Provincial Government may require means to be adopted for safety of land acquired 14. Construction of Act when land acquired has been transferred to a local authority or Company 15. [Repealed.] 16. Definition of local authority and Company 17. This Act to be read with Land Acquisition Act, 1870 THE LAND ACQUISITION (MINES) ACT, 1885 1ACT No. XVIII OF 1885 [16th October, 1885] An Act to provide for cases in which Mines or Minerals are situate under land which it is desired to acquire under the 2[Land Acquisition Act, 1894]. WHEREAS it is expedient to provide for cases in which mines or minerals are situate under land which it is desired to acquire under the 2[Land Acquisition Act, 1894(I of 1894)] ; it is hereby enacted as follows :- 1. Short title, commencement and local extent. (1) This Act may be called the Land Acquisition (Mines) Act, 1885 ; and (2) It shall come into force at once. 3[(3) The Provincial Government may, from time to time, by notification in the official Gazette, extend this Act to the whole or any specified part of the territory under its administration]. 2. Saving for mineral rights of the Government. Except as expressly provided by this Act, nothing in this Act",
  "source_file": "administrator8cfa246a000a71e94fd9f2bfbd7fdb84.txt",
  "law_name": "The Land Acquisition (Mines) Act, 1885",
  "year": 1885
}