{
  "error": "Expecting value: line 1 column 1 (char 0)",
  "raw": "THE EXTRADITION ACT, 1972 CONTENTS CHAPTER I PRELIMINARY 1. Short title, extent, commencement and application 2. Definitions 3. Treaty State 4. Application of Act to non-treaty States CHAPTER II SURRENDER OF FUGITIVE OFFENDERS 5. Liability of fugitive offenders to be surrendered 6. Requisition for surrender of fugitive offender 7. Order of Magisterial enquiry 8. Magisterial enquiry 9. Receipt in evidence of exhibits, depositions, etc. 10. Magistrate to report after enquiry 11. Removal and delivery of the fugitive offender 12. Discharge of person apprehended if not surrendered within two months 13. Power to the Federal Government to discharge a fugitive offender 14. Simultaneous requisitions CHAPTER III SURRENDER TO PAKISTAN OF PERSONS ACCUSED OF EXTRADITION OFFENCES 15. Requisition for surrender of persons to Pakistan 16. A person surrendered by a treaty State not to be tried for previous offence 17. Return of the persons surrendered to Pakistan CHAPTER IV MISCELLANEOUS 18. Jurisdiction as to offences committed at sea or in air 19. Release of persons arrested on bail 20. Property found on fugitive offender 21. Lawfulness of custody and re-taking under warrant issued under Act 22. Power to make rules. 23. Power to amend the Schedule 24. Repeal THE SCHEDULE THE EXTRADITION ACT, 1972 ACT No. XXI OF 1972 [25th September, 1972] An Act to consolidate and amend the law relating to the extradition of fugitive offenders. WHEREAS it is expedient to consolidate and amend the law relating to the extradition of fugitive offenders; It is hereby enacted as follows:- CHAPTER I PRELIMINARY 1. Short title, extent, commencement and application.-(1) This Act may be called the Extradition Act, 1972. (2) It extends to the whole of Pakistan. (3) It shall come into force on such date as the Federal Government may, by notification in the official Gazette, appoint. (4) It shall apply in relation to the return of persons to, and to persons returned from,- (a) a treaty State, subject to a decl",
  "source_file": "administrator3de374c43e9eb70f6a686ecedaa99aec.txt",
  "law_name": "The Extradition Act, 1972",
  "year": 1972
}