{
  "error": "Expecting value: line 1 column 1 (char 0)",
  "raw": "THE EXCISE DUTY ON MINERALS (LABOUR WELFARE) ACT, 1967 CONTENTS 1. Short title, extent and commencement 2. Definitions 3. Imposition and collection of duty 4. Mines Labour Housing and General Welfare Fund 5. Expenditure from the Fund 6. Constitution, etc., of the Mines Labour Housing Board 7. Provisions regarding housing accommodation 8. Constitution, etc., of the Miners Welfare Board 9. Appointment and powers of officers 10. Power to amend Schedule 11. Power to make rules 12. Repeal of Act XXXII of 1947 THE SHCEDULE THE EXCISE DUTY ON MINERALS (LABOUR WELFARE) ACT, 1967 ACT No. VIII of 1967 [10th June, 1967] An Act to impose a duty of excise on certain minerals for financing measures for promoting the welfare of labour employed in the mining industry. WHEREAS it is expendient to impose a duty of excise on certain minerals for financing measures for promoting the welfare of labour employed in the mining industry and to provide for the administration and utilisation of the proceeds of such duty and for matters ancillary thereto; It is hereby enacted as follows:- 1. Short title, extent and commencement.-(1) This Act may be called the Excise duty on Minerals (Labour Welfare) Act, 1967. (2) It extends to the whole of Pakistan. (3) It shall come into force on such date as the 1[Federal Government] may, by notification in the official Gazette, appoint. 2. Definitions.- In this Act, unless there is anything repugnant in the subject or context,- (a) “Commissioner” means the Mines Labour Welfare Commissioner appointed under section 9, and includes any officer authorised in writing by the Commissioner to exercise or perform any of his powers or functions under this Act; (b) “Fund” means the Mines Labour Housing and General Welfare Fund constituted under section 4; (c) “Housing Board” means the Mines Labour Housing Board constituted under section 6; (d) “Miners Welfare Board” means the Miners Welfare Board constituted under section 8; and (e) “prescribed” means prescribed by r",
  "source_file": "administrator4a4771b4b9e362dc9dbe2f1e7c16554f.txt",
  "law_name": "The Excise Duty On Minerals (Labour Welfare) Act, 1967",
  "year": 1967
}