{
  "law_name": "THE INVESTMENT CORPORATION OF PAKISTAN ORDINANCE",
  "year": 1966,
  "chapters": [
    {
      "chapter_title": "Contents",
      "sections": [
        {
          "section_no": "1",
          "section_title": "Short title, extent and commencement",
          "body": "(1) This Ordinance may be called the Investment Corporation of Pakistan Ordinance, 1966. (2) It shall extend to the whole of Pakistan and shall also apply to the business of the Corporation transacted outside Pakistan. (3) It shall come into force at once."
        },
        {
          "section_no": "2",
          "section_title": "Definitions",
          "body": "In this Ordinance, unless there is anything repugnant in the subject or context (a) 'advance' means a loan for purposes of investment; (b) 'Board' means the Board of Directors of the Corporation; (c) 'bond' means a bond of any description issued by any institution or by the Federal Government or a Provincial Government; (d) 'Chairman' means the Chairman of the Board; (e) 'company' means a company as defined in section 2 (2) of the Companies Act, 1913 (VII of 1913), and includes a body corporate established or incorporated under any other law for the time being in force in Pakistan; (f) 'constituent institution' means any scheduled bank or other investing institution which becomes a shareholder of the Corporation with the approval of the Federal Government; (g) 'Corporation' means the Investment Corporation of Pakistan established under this Ordinance; (h) 'debenture' means debenture issued by any company or institution in Pakistan in accordance with the rules for the time being applicable to the issue of debentures and includes debenture stock; (i) 'Deposit Account' means an account maintained by the Corporation of the cash deposits made with it for purposes of investment; (j) 'Director' means a Director of the Corporation; (jj) 'ICP Mutual Funds' means Mutual Funds from time to time constituted, issued and managed by the Corporation; (k) 'institution' means an organisation established under any law for the time being in force in Pakistan for the promotion of some public object; (l) 'investment' means investment in the equity or debentures and other securities of any company or institution; (m) 'Managing Director' means the Managing Director of the Corporation; (n) 'prescribed' means prescribed by rules; (o) 'prospectus' means a prospectus as defined in clause (14) of section 2 of the Companies Act, 1913 (VII of 1913); (p) 'regulations' means regulations made under this Ordinance; (q) 'rule' means a rule made under this Ordinance; (r) 'scheduled bank' has the same meaning as is assigned to it in the State Bank of Pakistan Act, 1956 (XXXIII of 1956); (s) 'securities' include any note, stock, bond, debenture, evidence of indebtedness, transferable share, investment contract, certificate of deposit for a security, a certificate of interest or participation in any profit sharing agreement; (t) 'share' means share of any joint stock company registered in Pakistan; (u) 'State Bank' means the State Bank of Pakistan; (v) 'underwriting' means contracting, with or without conditions, to purchase or subscribe for stocks, shares, bonds, debentures or other securities."
        },
        {
          "section_no": "3",
          "section_title": "Establishment and incorporation",
          "body": "(1) As soon as may be after the coming into force of this Ordinance, the Federal Government shall establish, by notification in the official Gazette, a Corporation to be called the Investment Corporation of Pakistan for the purposes of this Ordinance. (2) The Corporation shall be a body corporate by the name of the Investment Corporation of Pakistan, having perpetual succession and a common seal, with power, subject to the provisions of this Ordinance, to acquire, hold and dispose of any property and shall, by the said name, sue and be sued. (3) The Corporation shall not be deemed to be a banking company within the meaning of the Banking Companies Ordinance, 1962 (LVII of 1962)."
        },
        {
          "section_no": "4",
          "section_title": "Share capital",
          "body": "(1) The authorised share capital of the Corporation shall be twenty crores of rupees divided into twenty lakh ordinary shares of one hundred rupees each. (2) The paid-up share capital of the Corporation shall, in the first instance, be five crores of rupees fully paid-up, and may, with the approval of the Federal Government, be increased from time to time. (3) Shares of the Corporation shall be offered for subscription to the constituent institutions and general public as may be decided by the Federal Government. (4) The shares of the Corporation shall be listed on each Stock Exchange in Pakistan as the Board of Directors determines."
        },
        {
          "section_no": "5",
          "section_title": "Shares deemed to be securities under certain Acts",
          "body": "The shares of the Corporation shall be deemed to be included among the securities enumerated in section 20 of the Trust Act, 1882 (II of 1882), and to be approved securities for the purpose of the Insurance Act, 1938 (IV of 1938), and the Banking Companies Ordinance, 1962 (LVII of 1962)."
        },
        {
          "section_no": "6",
          "section_title": "Numbering of shares",
          "body": "Every share of the Corporation shall be assigned a number and shall be distinguished by such number."
        },
        {
          "section_no": "7",
          "section_title": "Register of shareholders",
          "body": "The Corporation shall maintain at its head office a register of shareholders."
        },
        {
          "section_no": "8",
          "section_title": "Qualification of shareholders",
          "body": "(1) No person shall be qualified to be registered as a shareholder who is not, under any law relating to contracts for the time being in force, competent to enter into a contract. (2) If at any time after the registration of a person as a shareholder, it is found that he was not, at the time of registration, qualified to be so registered, he shall not be entitled to exercise any of the rights of a share holder otherwise than for the purpose of sale of his shares under the orders of a competent Court."
        },
        {
          "section_no": "9",
          "section_title": "Notice regarding trust",
          "body": "The Corporation shall not enter in its register of shareholders any notice of any trust express, implied or constructive, nor be under any obligation to receive any such notice."
        },
        {
          "section_no": "10",
          "section_title": "Offices, branches, etc",
          "body": "(1) The head office of the Corporation shall be located at Karachi. (2) The Corporation may establish such regional and other offices, branches and agencies as the Board may think fit."
        },
        {
          "section_no": "11",
          "section_title": "Direction and superintendence",
          "body": "(1) The general direction and superintendence of the affairs and business of the Corporation shall vest in a Board of Directors constituted in accordance with section 12 which may exercise all such powers and do all such acts and things as may be exercised or done by the Corporation and are not, by this Ordinance, expressly directed or required to be done by the Corporation in general meeting. (2) The Board in discharging its functions shall act on commercial considerations with due regard to the investment climate and to the interests of the capital market and of its depositors and the public generally. (3) Where the Federal Government is satisfied that (a) in the public interest; or (b) to prevent the affairs of the Corporation being conducted in a manner detrimental to the interests of the depositors or in a manner prejudicial to the interests of the Corporation; or (c) to secure the proper management of the Corporation generally; it is necessary to issue directions to the Corporation generally or in any particular case, it may, from time to time, issue such directions as it deems fit, and the Corporation shall be bound to comply with such directions. (4) The Federal Government may, on representation made to it or on its own motion, modify or cancel any direction issued under sub-section (3) and in so modifying or cancelling any direction may impose such conditions as it thinks fit, subject to which the modification or cancellation shall have effect."
        },
        {
          "section_no": "12",
          "section_title": "Board",
          "body": "(1) The Board shall consist of the following Directors, namely: (a) the Chairman to be appointed by the Federal Government; (b) four persons to be appointed by the Federal Government of whom two shall be from amongst persons serving under the Federal Government and two from amongst the shareholders; (c) five persons to be elected by the shareholders in such manner as may be laid down in the regulations; and (d) the Managing Director to be appointed by the Federal Government. (2) Save as provided in sub-section (2) of section 13 in respect of the Chairman, and in sub-section (2) of section 14 in respect of the Managing Director a Director appointed by the Federal Government shall hold office during its pleasure. (3) A Director elected under clause (c) of sub-section (1) shall hold office for a term of three years and shall continue in office thereafter until his successor is elected and shall also be eligible for re-election: Provided that such Director may be removed before the expiration of his term by a special resolution passed by the vote of such shareholders as hold more than half of the shares of the Corporation."
        },
        {
          "section_no": "13",
          "section_title": "Chairman",
          "body": "The Chairman shall be appointed by the Federal Government and shall hold office during the pleasure of the Federal Government."
        },
        {
          "section_no": "14",
          "section_title": "Managing Director",
          "body": "The Managing Director shall be appointed by the Federal Government and shall hold office during the pleasure of the Federal Government."
        },
        {
          "section_no": "15",
          "section_title": "Qualifications and disqualifications of Directors",
          "body": "The qualifications and disqualifications of Directors shall be prescribed by regulations."
        },
        {
          "section_no": "16",
          "section_title": "Executive Committee",
          "body": "The Board may constitute an Executive Committee from amongst its members to exercise such powers and perform such functions as may be delegated to it by the Board."
        },
        {
          "section_no": "17",
          "section_title": "Annual general meetings and special meetings of the shareholders",
          "body": "The Corporation shall hold annual general meetings and special meetings of the shareholders as prescribed by regulations."
        },
        {
          "section_no": "18",
          "section_title": "Meeting of the Board and the Executive Committee",
          "body": "The meetings of the Board and the Executive Committee shall be held at such times and places as may be determined by the Board."
        },
        {
          "section_no": "19",
          "section_title": "Fees for attending meetings",
          "body": "The fees for attending meetings of the Board and the Executive Committee shall be prescribed by regulations."
        },
        {
          "section_no": "20",
          "section_title": "Appointment of officers, advisers, etc",
          "body": "The Corporation may appoint such officers, advisers and other employees as it may deem necessary for the efficient performance of its functions."
        },
        {
          "section_no": "21",
          "section_title": "Declaration of fidelity and secrecy",
          "body": "Every officer, employee and adviser of the Corporation shall, before entering upon his duties, make a declaration of fidelity and secrecy in such form as may be prescribed."
        },
        {
          "section_no": "22",
          "section_title": "Indemnity of Directors",
          "body": "The Corporation shall indemnify every Director against any loss or damage incurred by him in the discharge of his duties, except in cases of willful misconduct."
        },
        {
          "section_no": "23",
          "section_title": "Business which the Corporation is authorised to transact",
          "body": "The Corporation shall be authorised to transact such business as may be prescribed."
        },
        {
          "section_no": "24",
          "section_title": "Borrowing powers",
          "body": "The Corporation shall have the power to borrow money as may be prescribed."
        },
        {
          "section_no": "25",
          "section_title": "Special powers",
          "body": "The Corporation shall have such special powers as may be prescribed."
        },
        {
          "section_no": "26",
          "section_title": "Power to impose conditions",
          "body": "The Corporation shall have the power to impose conditions on the exercise of its powers."
        },
        {
          "section_no": "27",
          "section_title": "Disposal of profit",
          "body": "The Corporation shall dispose of its profits in such manner as may be prescribed."
        },
        {
          "section_no": "28",
          "section_title": "Auditors",
          "body": "The Corporation shall appoint auditors as may be prescribed."
        },
        {
          "section_no": "29",
          "section_title": "Return",
          "body": "The Corporation shall make such returns as may be prescribed."
        },
        {
          "section_no": "30",
          "section_title": "Power to call for payment before agreed period",
          "body": "The Corporation shall have the power to call for payment of dues before the agreed period."
        },
        {
          "section_no": "31",
          "section_title": "Recovery of Corporations dues",
          "body": "The Corporation shall have the power to recover its dues."
        },
        {
          "section_no": "32",
          "section_title": "Delegation of powers",
          "body": "The Corporation may delegate its powers as may be prescribed."
        },
        {
          "section_no": "33",
          "section_title": "Offences",
          "body": "Any person who contravenes any provision of this Ordinance shall be guilty of an offence."
        },
        {
          "section_no": "34",
          "section_title": "Liquidation of Corporation",
          "body": "The Corporation may be liquidated in accordance with the provisions of this Ordinance."
        },
        {
          "section_no": "35",
          "section_title": "Power of Federal Government to make rules",
          "body": "The Federal Government may make rules for carrying out the purposes of this Ordinance."
        },
        {
          "section_no": "36",
          "section_title": "Power of the Board to make regulations",
          "body": "The Board may make regulations for carrying out the purposes of this Ordinance."
        }
      ]
    }
  ],
  "source_file": "administratorb707db1d2210df3a0e929c5463715dce.txt"
}