{
  "law_name": "THE DISABLED PERSONS (EMPLOYMENT AND REHABILITATION) ORDINANCE",
  "year": 1981,
  "chapters": [
    {
      "chapter_title": "Contents",
      "sections": [
        {
          "section_no": "1",
          "section_title": "Short title, extent and commencement",
          "body": "This Ordinance may be called the Disabled Persons (Employment and Rehabilitation) Ordinance, 1981. It extends to the whole of Pakistan and shall come into force on such day as the Federal Government may, by notification in the official Gazette, appoint."
        },
        {
          "section_no": "2",
          "section_title": "Definitions",
          "body": "In this Ordinance unless there is anything repugnant in the subject or context, various definitions are provided including 'Chairman', 'disabled person', 'employee', 'establishment', and 'Fund'."
        },
        {
          "section_no": "3",
          "section_title": "National council",
          "body": "The Federal Government shall establish a Council called the National Council for the Rehabilitation of Disabled Persons consisting of various members including the Secretary, Ministry of Health and Social Welfare."
        },
        {
          "section_no": "4",
          "section_title": "Functions of the National Council",
          "body": "The National Council shall formulate policy for the employment, rehabilitation and welfare of disabled persons, evaluate and coordinate the execution of its policy by the Provincial Councils."
        },
        {
          "section_no": "5",
          "section_title": "Provincial Councils",
          "body": "Each Provincial Government shall establish a Council called the Provincial Council for the Rehabilitation of Disabled Persons consisting of various members including the Secretary, Social Welfare Department."
        },
        {
          "section_no": "6",
          "section_title": "Functions of the Provincial Councils",
          "body": "The Provincial Council shall execute the Policy made by the National Council and undertake appropriate projects for the employment, rehabilitation and welfare of disabled persons."
        },
        {
          "section_no": "7",
          "section_title": "Meetings of the Councils",
          "body": "Meetings of the National Council or a Provincial Council shall be held at such times and places as directed by the Chairman and shall be presided over by the Chairman."
        },
        {
          "section_no": "8",
          "section_title": "Duties of Secretary",
          "body": "The Secretary shall exercise such powers and perform such functions as may be assigned to him by the Chairman."
        },
        {
          "section_no": "9",
          "section_title": "Appointment of Committee",
          "body": "The National Council or a Provincial Council may appoint a Committee consisting of its members and may refer matters for consideration and report."
        },
        {
          "section_no": "10",
          "section_title": "Establishments to employ disabled persons",
          "body": "Not less than one percent of the total number of persons employed by an establishment shall be disabled persons registered with the employment Exchange."
        },
        {
          "section_no": "11",
          "section_title": "Establishment to pay to the Fund",
          "body": "An establishment which does not employ a disabled person as required shall pay into the Fund each month the sum of money it would have paid as salary to a disabled person."
        },
        {
          "section_no": "12",
          "section_title": "Registration of disabled persons",
          "body": "Any disabled person desirous of being employed may have his name registered in the register maintained by an Employment Exchange."
        },
        {
          "section_no": "13",
          "section_title": "Establishment of training centers",
          "body": "The Provincial Council shall arrange for the training of disabled persons in such trades or vocations."
        },
        {
          "section_no": "14",
          "section_title": "Establishments to furnish information",
          "body": "Establishments shall furnish information as required by the National Council or Provincial Councils."
        },
        {
          "section_no": "15",
          "section_title": "Power to debar further employment",
          "body": "The National Council or Provincial Councils may debar any establishment from further employment of disabled persons."
        },
        {
          "section_no": "16",
          "section_title": "Appeal",
          "body": "Any person aggrieved by any decision of the National Council or Provincial Councils may appeal to the Federal Government."
        },
        {
          "section_no": "17",
          "section_title": "Fund",
          "body": "The Rehabilitation of Disabled Persons Fund shall be established for the purposes of this Ordinance."
        },
        {
          "section_no": "18",
          "section_title": "Power to exempt",
          "body": "The Federal Government may exempt any establishment from the provisions of this Ordinance."
        },
        {
          "section_no": "19",
          "section_title": "Delegation of power",
          "body": "The National Council or Provincial Councils may delegate any of their powers to any member or officer."
        },
        {
          "section_no": "20",
          "section_title": "Penalty",
          "body": "Any person who contravenes any provision of this Ordinance shall be liable to penalty."
        },
        {
          "section_no": "21",
          "section_title": "Cognizance of offences, etc.",
          "body": "No court shall take cognizance of any offence under this Ordinance except on a complaint made by the National Council or Provincial Councils."
        },
        {
          "section_no": "22",
          "section_title": "Power to make rules",
          "body": "The Federal Government may make rules for carrying out the purposes of this Ordinance."
        }
      ]
    }
  ],
  "source_file": "administrator07d9e49158ba80ccd546ad885d7ec6c5.txt"
}