{
  "error": "Expecting value: line 1 column 1 (char 0)",
  "raw": "THE COURT-FEES ACT, 1870 CONTENTS CHAPTER I PRELIMINARY 1. Short title Extent of Act Commencement of Act 1A. Definition of “Appropriate Government” 2. [Repealed] 2. [Repealed] CHAPTER II FEES IN THE HIGH COURTS 3. Levy of fees in High Courts on their original sides Levy of fees in Presidency Small Cause Courts [Repealed] 4. Fees on documents filed, etc., in High Courts in their extraordinary jurisdiction in their appellate jurisdiction as Courts of reference and revision 5. Procedure in case of difference as to necessity or amount of fee CHAPTER III FEES IN OTHER COURTS AND IN PUBLIC OFFICES 6. Fees on documents filed, etc., in Mufassal Courts or in public offices 7. Computation of fees payable in certain suits : 8. Fee on memorandum of appeal against order relating to compensation 9. Power to ascertain net profits or market-value 10. Procedure where net profits or market-value wrongly estimated 11. Procedure in suits for mesne profits or account when amount decreed exceeds amount claimed Refund where amount decreed is less than amount claimed 12. Decision of question as to valuation 13. Refund of fee paid on memorandum of appeal 14. Refund of fee on application for review of judgment 15. Refund where Court reverses or modifies its former decision on ground of mistake 16. [Repealed] 17. Multifarious suits 18. Written examinations of complainants 19. Exemption of certain documents CHAPTER III-A PROBATES, LETTERS OF ADMINISTRATION AND CERTIFICATES OF ADMINISTRATION 19A. Relief where too high a Court-fee has been paid 19B. Relief where debts due from a deceased person have been paid out of his estate 19C. Relief in case of several grants 19D. Probates declared valid as to trust-property though not covered by court-fee 19E. Provision for case where too low a court-fee has been paid on probates, etc. 19F. Administrator to give proper security before letters stamped under section 19E 19G. Executors, etc., not paying full court-fee on probates, etc., within six months afte",
  "source_file": "administrator9d60b89fa3dd51147d677e764c8772e3.txt",
  "law_name": "The Court-Fees Act, 1870",
  "year": 1870
}