{
  "error": "Expecting value: line 1 column 1 (char 0)",
  "raw": "THE TREASURE-TROVE ACT, 1878 CONTENTS 1. Short title Extent 2. [Repealed.] 3. Interpretation-clause “Treasure” “Collector” “Owner” 4. Notice by finder of treasure 5. Notification requiring claimants to appear 6. Forfeiture of right on failure to appear 7. Matters to be enquired into and determined by the Collector 8. Time to be allowed for suit by person claiming the treasure 9. When treasure may be declared ownerless 10. Proceedings subsequent to declaration 11. When no other person claims as owner of place, treasure, to be given to finder 12. When only one such person claims and his claim is not disputed, treasure to be divided 13. In case of dispute as to ownership of place, proceedings to be stayed 14. Settlement of such dispute 15. and division thereupon 16. Power to acquire the treasure on behalf of Government 17. Decision of Collector final, and no suit to lie against him for acts done bona fide 18. Collector to exercise powers of Civil Court 19. Power to make rules 20. Penalty on finder failing to give notice, etc. 21. Penality on owner abetting offence under section 20 THE TREASURE-TROVE ACT, 1878 1ACT No. VI Of 1878 [13th February, 1878] An Act to amend the law relating to Treasure-trove Preamble. WHEREAS it is expedient to amend the law relating to treasure-trove; It is hereby enacted as follows:- PRELIMINARY Short title. This Act may be called the 2* Treasure-trove Act, 1878. Extent. It extends to 3[the whole of Pakistan.] 4* * * * * * * 2. [Repeal of enactments.] Rep. by the Amending Act, 1891 (XII of 1891). 3. Interpretation-clause. In this Act- “Treasure.” “treasure” means anything of any value hidden in the soil, or in anything affixed thereto: “Col1ector.” “Col1ector” means (1) any Revenue-officer in independent charge of a district, and (2) any officer appointed by the 3[Provincial Government] to perform the functions of a Collector under this Act. “Owner.” When any person is entitled, under any reservation in an instrument of transfer of any land ",
  "source_file": "administrator35664480c3a596849090e1db1a70d36d.txt",
  "law_name": "The Treasure-Trove Act, 1878",
  "year": 1878
}