{
  "error": "Expecting value: line 1 column 1 (char 0)",
  "raw": "THE PAKISTAN TOBACCO BOARD ORDINANCE, 1968 CONTENTS PREAMBLE 1 Short title, extent and commencement 2 Definitions 3 Constitution of the Pakistan Tobacco Board 4 Terms of members, etc 5 Vacancy, etc., not to invalidate the proceedings of the Board. 6 Functions of the Board 7 Control of the Board 8 Fixation of prices 9 Levy of cess 10 Power to borrow 11 Keeping of accounts and audit and annual reports 12 Constitution of the Tobacco Development Committee 13 Functions of the Committee 14 Grants and loans by Government to the Board 15 Keeping of accounts 16 Appointment of officers, etc 17 Export allotment and its distribution. 18 Control of export of tobacco and tobacco seeds 19 Registration of contracts 20 Power to prohibit transportation, storage or sale 20 A Power to direct Purchase 21 Power to call for information, etc 22 Delegation of powers 23 Power to exempt 24 Penalties 25 False statement 26 Protection of action taken in good faith 27 Cognizance of offences 28 Special provision regarding fines 29 Presumption as to orders 30 Power to make rules 31 Power to make bye-laws THE PAKISTAN TOBACCO BOARD ORDINANCE, 1968 1ORDINANCE NO. I OF 1968 [8th February, 1968] An Ordinance to provide for the establishment of Tobacco Board for the promotion of the cultivation, manufacture and export of tobacco and tobacco products. WHEREAS it is expedient to provide for the establishment of a Tobacco Board for the promotion of the cultivation, manufacture and export of tobacco and tobacco products and for matters ancillary thereto; AND WHEREAS the national interest of Pakistan in relation to economic and financial stability of Pakistan within the meaning of clause (2) of Article 131 of the Constitution requires Central legislation in the matter; AND WHEREAS the National Assembly is not in session and the President is satisfied that circumstances exist which render immediate legislation necessary; NOW, THEREFORE, in exercise of the powers conferred by clause (1) of Article 29 of the Co",
  "source_file": "administratore583ea1b36dbe2d3d2161083f905eb92.txt",
  "law_name": "The Pakistan Tobacco Board Ordinance, 1968",
  "year": 1968
}