{
  "law_name": "THE TEA PLANTATIONS LABOUR ORDINANCE",
  "year": 1962,
  "chapters": [
    {
      "chapter_title": "CHAPTER I",
      "sections": [
        {
          "section_no": "1",
          "section_title": "Short title, extent, commencement and application",
          "body": "(1) This Ordinance may be called the Tea Plantations Labour Ordinance, 1962. (2) It extends to the whole of Pakistan. (3) It shall come into force at once. (4) It applies in the first instance to all tea plantations, but the Provincial Government may, by notification in the official Gazette, apply it to any other area of land measuring twenty-five acres or more and used or intended to be used for growing tea whereon less than thirty persons are employed, or were employed on any day of the preceding twelve months."
        },
        {
          "section_no": "2",
          "section_title": "Definitions",
          "body": "In the Ordinance, unless there is anything repugnant in the subject or context, (a) “adolescent” means a person who has completed his fifteenth year but has not completed his seventeenth year; (b) “adult” means a person who has completed his seventeenth year; (c) “child” means a person who has not completed his fifteenth year; (d) “day” means a period of twenty four hours beginning at midnight; (e) “employer” when used in relation to a tea plantation means the person who has ultimate control over the affairs of the tea plantation, and where the affairs of any tea plantation are entrusted to any other person (whether called a managing agent, manager, superintendent or by any other name) such other person shall be deemed to be the employer in relation to that tea plantation; (f) “prescribed” means prescribed by rules made under this Ordinance; (g) “tea plantation” means any land used or intended to be used for growing tea which measures twenty five acres or more and whereon thirty or more persons are employed, or were employed on any day of the preceding twelve months; (h) “wages” has the meaning assigned to it in clause (vi) of section 2 of the Payment of Wages Act, 1936 (IV of 1936); (i) “week” means a period of seven days beginning at midnight on Saturday night or such other night as may be fixed by the Provincial Government in relation to tea plantations in any area after such consultation as may be prescribed with reference to the tea plantations concerned in that area; (j) “worker” means a person employed in a tea plantation for hire or reward, whether directly or through any agency, to do any work, skilled, unskilled, manual or clerical, but does not include- (i) a medical officer at the plantation; (ii) any person whose monthly wages exceed five hundred rupees; or (iii) a person employed in a tea plantation primarily in a managerial capacity notwithstanding that his monthly wages do not exceed five hundred rupees; (k) “young” person means a person who is either a child or an adolescent."
        }
      ]
    },
    {
      "chapter_title": "CHAPTER II",
      "sections": [
        {
          "section_no": "3",
          "section_title": "Chief Inspector and Inspectors",
          "body": "(1) The Provincial Government may, by notification in the official Gazette, appoint for the Province a duly qualified persons to be the chief inspector of tea plantations and so many duly qualified persons to be inspectors of tea plantations subordinate to the chief inspector as it thinks fit. (2) Subject to such rules as may be made in this behalf by the Provincial Government, the chief inspector may declare the local area or areas within which, are the tea plantations with respect to which, inspectors shall exercise their powers under this Ordinance, and may himself exercise the powers of an inspector within such limits as may be assigned to him by the Provincial Government. (3) The chief inspector and all inspectors shall be deemed to be public servants within the meaning of section 21 of the Pakistan Penal Code (Act XIV of 1860)."
        },
        {
          "section_no": "4",
          "section_title": "Powers and functions of inspectors",
          "body": "Subject to any rules made by the Provincial Government in this behalf, an inspector may within the local limits for which he is appointed- (a) make such examination and inquiry as he thinks fit in order to ascertain whether the provisions of this Ordinance and of the rules made thereunder are being observed in the case of any tea plantation; (b) with such assistants from amongst persons in the employment of Government or of any municipal body or other local authority, as he thinks fit, enter, inspect and examine any tea plantation or part thereof at any reasonable time for the purpose of carrying out the objects of this Ordinance; (c) examine any worker employed in any tea plantation or require the production of any register or other document maintained in pursuance of this Ordinance, and take on the spot or otherwise statement of any persons which he may consider necessary for carrying out the purposes of this Ordinance; and (d) exercise such other powers as may be prescribed: Provided that no person shall be compelled under this section to answer any question or make any statement tending to incriminate himself."
        },
        {
          "section_no": "5",
          "section_title": "Facilities to be provided to inspector",
          "body": "Every employer shall afford the inspector all reasonable facilities for making any entry, inspection, examination or inquiry under this Ordinance."
        },
        {
          "section_no": "6",
          "section_title": "Notice to inspector before commencement of work",
          "body": "Before work is begun in any tea plantation after the commencement of this Ordinance, the employer shall, send to the inspector a written notice containing- (a) the name of the tea plantation and its situation; (b) the address to which communications relating to the tea plantation should be sent; and (c) such other particulars as may be prescribed for the purposes of this Ordinance."
        },
        {
          "section_no": "7",
          "section_title": "Certifying surgeons",
          "body": "(1) The Provincial Government may appoint medical practitioners having the prescribed qualifications to be certifying surgeons for the purposes of this Ordinance within such local limits or for such tea plantation or class of tea plantations as it may assign to them respectively. (2) The certifying surgeon shall carry out such duties as may be prescribed in connection with- (a) the examination and certification of workers; and (b) the exercise of such medical supervision as may be prescribed where young persons are, or are to be, employed in any work in any tea plantation which is likely cause injury to their health."
        }
      ]
    },
    {
      "chapter_title": "CHAPTER III",
      "sections": [
        {
          "section_no": "8",
          "section_title": "Drinking water",
          "body": "In every tea plantation such arrangements as may be prescribed shall be made by the employer to provide and maintain at convenient places in the tea plantation a sufficient supply of wholesome drinking water for all workers."
        },
        {
          "section_no": "9",
          "section_title": "Conservancy",
          "body": "(1) There shall be provided separately for males and females in every tea plantation a sufficient number of latrines and unrinals of prescribed types and number so situated as to be convenient and accessible to workers employed therein. (2) All latrines and urinals provided under sub-section (1) shall be maintained in a clean and sanitary condition."
        },
        {
          "section_no": "10",
          "section_title": "Medical facilities",
          "body": "In every tea plantation there shall be provided and maintained so as to be readily available such medical facilities for the workers as may be prescribed."
        }
      ]
    },
    {
      "chapter_title": "CHAPTER IV",
      "sections": [
        {
          "section_no": "11",
          "section_title": "Canteens",
          "body": "(1) The Provincial Government may make rules requiring that in every tea plantation wherein one hundred and fifty or more workers are ordinarily employed, one or more canteens shall be provided and maintained by the employer for the use of the workers. (2) Without prejudice to the generality of the foregoing power, such rules may provide for- (a) the date by which the canteen shall be provided; (b) the number of canteens that shall be provided and the standards in respect of construction, accommodation, furniture and other equipment of the canteens; (c) the food-stuffs which may be served therein and the charges which may be made therefor; (d) the constitution of managing committee for the canteen and the representation of the workers in the management of the canteen; and (e) the delegation to the chief inspector, subject to such conditions as may be prescribed, of the power to make rules under clause (c)."
        },
        {
          "section_no": "12",
          "section_title": "Creches",
          "body": "The Provincial Government may make rules providing that in every tea plantation wherein forty or more women workers are employed or were employed on any day of the preceding twelve months the employer shall provide and maintain, in such manner and of such standard as may be prescribed, rooms for the use of such of the children of the women workers as are below the age of six years."
        },
        {
          "section_no": "13",
          "section_title": "Recreational facilities",
          "body": "The Provincial Government may make rules requiring every employer to make provision in his tea plantation for such recreational facilities for the workers and their children as may be prescribed."
        },
        {
          "section_no": "14",
          "section_title": "Educational facilities",
          "body": "Where the children between the ages of six and twelve of workers employed in any tea plantation exceed twenty five in number, the Provincial Government may make rules requiring every employer to provide educational facilities for the children in such manner and of such standard as may be prescribed."
        },
        {
          "section_no": "15",
          "section_title": "House building facilities",
          "body": "It shall be the duty of every employer to provide house-building facilities to every worker and his family residing in the tea plantation according to such scale as may be prescribed."
        },
        {
          "section_no": "16",
          "section_title": "Facilities for daily necessities, etc.",
          "body": "It shall be the duty of the employers to provide facilities within easy reach of the employees for obtaining the daily necessities of life through co-operative or other means and also to provide the employees with such amenities for protection from adverse weather conditions as may be prescribed."
        },
        {
          "section_no": "17",
          "section_title": "Welfare Officers",
          "body": "(1) In every tea plantation wherein three hundred or more workers are ordinarily employed the employer shall employ such number of Welfare Officers as may be prescribed. (2) The Provincial Government may prescribe the duties, qualifications and conditions of service of officers employed under sub-section (1)."
        }
      ]
    },
    {
      "chapter_title": "CHAPTER V",
      "sections": [
        {
          "section_no": "18",
          "section_title": "Weekly hours, spread-over and daily intervals for rest",
          "body": "The Provincial Government may make rules providing for the regulation of the weekly working hours, their spread-over per day, and the daily intervals for rest, for the workers."
        },
        {
          "section_no": "19",
          "section_title": "Weekly holidays",
          "body": "(1) T"
        }
      ]
    }
  ],
  "source_file": "administratorfb5b5de2c74da5146d5e23b94b3f4489.txt"
}