{
  "law_name": "THE PAKISTAN ANIMAL QUARANTINE (IMPORT AND EXPORT OF ANIMALS AND ANIMAL PRODUCTS) ORDINANCE",
  "year": 1979,
  "chapters": [
    {
      "chapter_title": "Contents",
      "sections": [
        {
          "section_no": "1",
          "section_title": "Short title, extent and commencement.",
          "body": "(1) This Ordinance may be called the Pakistan Animal Quarantine (Import and Export of Animals and Animal Products) Ordinance, 1979. (2) It extends to the whole of Pakistan. (3) It shall come into force at once."
        },
        {
          "section_no": "2",
          "section_title": "Definitions.",
          "body": "In this Ordinance, unless there is anything repugnant in the subject or context, various definitions are provided for terms such as 'animal', 'animal product', 'carcase', 'diseased', 'fodder', 'health certificate', 'import', 'export', 'litter', 'prescribed', 'points of entry', 'points of exit', 'quarantine', 'Quarantine Officer', and 'rules'."
        },
        {
          "section_no": "3",
          "section_title": "Power to regulate and prohibit import and export of animals and animal products.",
          "body": "(1) The Federal Government may, by notification in the official Gazette, prohibit, restrict or otherwise regulate, subject to such conditions as it may think fit to impose, the import or export of any animal or class of animals or animal products likely to introduce diseases to any other animal, animal product or man."
        },
        {
          "section_no": "4",
          "section_title": "Operation of notification under section 3.",
          "body": "A notification under section 3 shall operate as if it had been issued under section 16 of the Customs Act, 1969 (IV of 1969), and the officers of customs shall have the same powers in respect of any animal or animal product in respect of which such a notification has been issued."
        },
        {
          "section_no": "5",
          "section_title": "Control of animals and animal products in quarantine.",
          "body": "All animals and animal products detained in quarantine shall be under the control of the Quarantine Officer and shall be dealt with in the prescribed manner."
        },
        {
          "section_no": "6",
          "section_title": "Powers, duties and functions of Quarantine Officer.",
          "body": "Subject to the provisions of this Ordinance, the Quarantine Officer shall have the power to inspect animals and animal products, detain in and release from quarantine, issue health certificates, and order destruction of diseased animals or animal products."
        },
        {
          "section_no": "7",
          "section_title": "Cognizance of offence.",
          "body": "No Court shall take cognizance of any offence under this Ordinance, except upon complaint in writing made by an officer authorised by the Federal Government in this behalf."
        },
        {
          "section_no": "8",
          "section_title": "Penalties.",
          "body": "(1) Whoever contravenes or attempts to contravene any of the provisions of this Ordinance shall be punishable with imprisonment for a term which may extend to three years, or with fine which may extend to five thousand rupees, or with both."
        },
        {
          "section_no": "9",
          "section_title": "Appointment of officers and members of staff.",
          "body": "The Federal Government may appoint such number of officers and members of staff as it may deem fit for carrying out the purposes of this Ordinance."
        },
        {
          "section_no": "10",
          "section_title": "Revision.",
          "body": "(1) Any person aggrieved by an order passed by the Quarantine Officer under this Ordinance may apply for revision to the Federal Government within thirty days from the date of issue of such order."
        },
        {
          "section_no": "11",
          "section_title": "Indemnity.",
          "body": "No suit, prosecution or other legal proceedings shall lie against the Federal Government or the Quarantine Officer for anything in good faith done or intended to be done under this Ordinance."
        },
        {
          "section_no": "12",
          "section_title": "Exemption.",
          "body": "The Federal Government may, by notification in the official Gazette, exempt any animal or animal product from the operation of all or any of the provisions of this Ordinance."
        },
        {
          "section_no": "13",
          "section_title": "Delegation of powers.",
          "body": "The Federal Government may, by notification in the official Gazette, delegate to a Provincial Government, or to any officer or authority of such Government, any of its powers under this Ordinance."
        },
        {
          "section_no": "14",
          "section_title": "Power to make rules.",
          "body": "(1) The Federal Government may, by notification in the official Gazette, make rules for carrying out the purposes of the Ordinance."
        }
      ]
    }
  ],
  "source_file": "administratord50e1a1544614d7c09baf7d09783b1d2.txt"
}