{
  "error": "Expecting value: line 1 column 1 (char 0)",
  "raw": "THE REGISTRATION ACT, 1908 CONTENTS PART I PRELIMINARY 1 Short title, extent and commencement. 2 Definitions. PART II OF THE REGISTRATION-ESTABLISHMENT 3 Inspector-General of Registration. 4 [Repealed.] 5 Districts and sub-districts. 6 Registrars and Sub-Registrars. 7 Offices of Registrar and Sub-Registrar. 8 Inspectors of registration-offices. 9 [Repealed.] 10 Absence of Registrar or vacancy in his office. 11 Absence of Registrar on duty in his district. 12 Absence of Sub-Registrar or vacancy in his Office. 13 Report to Provincial Government of appointments under sections 10, 11 and 12. 14 Establishments of registering officers. 15 Seal of registering officers. 16 Register-books and fire-proof boxes. PART III OF REGISTRABLE DOCUMENTS 17 Documents of which registration is compulsory. 18 Documents of which registration is optional. 19 Documents in language not understood by registering Officer. 20 Documents containing interlineations, blanks, erasures or alterations. 21 Description of property and maps or plans. 22 Description of houses and land by reference to Government maps or surveys. PART IV OF THE TIME OF PRESENTATION 23 Time for presenting documents. 23A Re-registration of certain documents. 24 Documents executed by several persons at different times. 25 Provision where delay in presentation is unavoidable. 26 Documents executed out of Pakistan, etc. 27 Wills may be presented or deposited at any time. PART V OF THE PLACE OF REGISTRATION 28 Place for registering documents relating to land. 29 Place for Registering other documents. 30 Registration by Registrars in certain cases. 31 Registration or acceptance for deposit at private residence. PART VI OF PRESENTING DOCUMENTS FOR REGISTRATION 32 Persons to present documents for registration. 33 Power-of-attorney recognizable for purposes of section 32. 34 Enquiry before registration by registering officer. 35 Procedure on admission and denial of execution respectively. PART VII OF ENFORCING THE APPEARANCE OF EXECUT",
  "source_file": "administrator0f29bc9f1e3dfed37c0034eed1e29d53.txt",
  "law_name": "The Registration Act, 1908",
  "year": 1908
}