{
  "error": "Expecting value: line 1 column 1 (char 0)",
  "raw": "THE QUAID-E-AZAM UNIVERSITY ACT, 1973 CONTENTS 1. Short title and commencement. 2. Definitions. CHAPTER II. THE UNIVERSITY 3. Incorporation. 4. Powers of the University. 5. University open to all classes, creeds, etc. 6. Teaching in the University. 7. [Omitted]. CHAPTER III. OFFICERS OF THE UNIVERSITY 8. Officers of the University. 9. Chancellor. 10. Visitation. 11. Pro-Chancellor. 12. Vice-Chancellor. 13. Powers and duties of the Vice-Chancellor. 14. Registrar. 15. Treasurer. 16. Controller of Examinations. 17. University Auditors. CHAPTER IV. AUTHORITIES OF THE UNIVERSITY 18. Authorities. 19. [Omitted]. 20. [Omitted]. 21. The Syndicate. 22. Powers and duties of Syndicate. 23. Academic Council. 24. Powers and duties of Academic Council. 25. Constitution, functions and powers of other Authorities. 26. Appointment of Committees by the Authorities. CHAPTER V. STATUTES, REGULATIONS AND RULES 27. Statutes. 28. Regulations. 29. Amendment and repeal of Statutes and Regulations. 30. Rules. CHAPTER V A. AFFILIATION OF EDUCATIONAL INSTITUTIONS 30 A. Affiliation to be approved by Syndicate. 30 B. Application for affiliation. 30 C. Grant of affiliation. 30 D. Extension of affiliation. 30 E. Inspection and report. 30 F. Disaffiliation. 30 G. Appeal against decision of Syndicate. CHAPTER VI. UNIVERSITY FUND 31. University Fund. 32 Audit and Accounts CHAPTER VII. GENERAL PROVISIONS 33. Opportunity to show cause. 34. Appeal to and review by the Syndicate. 35. Pension, Insurance, gratuity, provident Fund and benevolent fund. 36. Commencement of term of office of members of Authorities. 36 A. Member of an Authority to cease to be member in certain circumstances. 37. Filling of casual vacancies in Authorities. 38. Filling of vacancies in Authorities in certain circumstances. 39. Disputes about membership of Authorities. 40. Proceedings of Authorities not invalidated by vacancies. 41. First Statutes. 42. [Omitted]. 43. [Omitted]. 43A. Tripartite mobility. 44. Removal of difficulties. ",
  "source_file": "administratord0007923181eb87781034d5da4a5f22e.txt",
  "law_name": "The Quaid-E-Azam University Act, 1973",
  "year": 1973
}