{
  "error": "Expecting value: line 1 column 1 (char 0)",
  "raw": "THE PAYMENT OF WAGES ACT, 1936 CONTENTS 1. Short title, extent, commencement and application. 2. Definitions. 3. Responsibility for payment of wages. 4. Fixation of wage-periods. 5. Time of payment of wages. 6. Wages to be paid in current coin or currency notes. 7. Deductions which may be made from wages. 8. Fines. 9. Deductions for absence from duty. 10. Deductions for damage or loss. 11. Deductions for services rendered. 12. Deductions for recovery of advances. 13. Deductions for payments to co-operative societies and insurance schemes. 14. Inspectors. 15. Claims arising out of deductions from wages or delay in payment of wages and penalty for malicious or vexatious claims. 16. Single application in respect of claims from unpaid group. 17. Appeal. 18. Powers of authorities appointed under section 15. 19. Power to recover from employer in certain cases. 20. Penalty for offences under the Act. 21. Procedure in trial of offences. 22. Bar of suits. 23. Contracting out. 24. [ Omitted.] 25. Display by notice of abstracts of the Act. 26. Rule-making power THE PAYMENT OF WAGES ACT, 1936 1ACT NO. IV OF 1936 [23rd April, 1936] An Act to regulate the payment of wages to certain classes of persons employed in industry. WHEREAS it is expedient to regulate the payment of wages to certain classes of persons employed in industry; It is hereby enacted as follows:- 1. Short title, extent, commencement and application.-(1) This Act may be called the Payment of Wages Act, 1936. 2[(2) It extends to the whole of Pakistan.] (3) It shall come into force on such date3 as the 4[Federal Government] may, by notification in the 5[official Gazette], appoint. (4) It applies to the payment of wages to persons employed in any factory 6[industrial establishment or commercial establishment] and to persons employed (otherwise than in a factory) upon any railway by a railway administration or, either directly or through a sub-contractor, by a person fulfilling a contract with a railway administration",
  "source_file": "administrator8820e88efaf7eedabf5c1d8c73b3dee5.txt",
  "law_name": "The Payment of Wages Act, 1936",
  "year": 1936
}