{
  "error": "Expecting value: line 1 column 1 (char 0)",
  "raw": "THE PAKISTAN COUNCIL OF ARCHITECTS AND TOWN PLANNER ORDINANCE, 1983 CONTENTS 1. Short title, extent and commencement 2. Definitions 3. Constitution and incorporation of the Pakistan Council of Architects and Town Planners 4. Chairman and Vice Chairman 5. Annual general meeting of the Council 6. Extraordinary general meeting of the Council 7. General provisions relating to meetings of the Council 8. Functions of the Council 9. Executive Committee 10. Recognition of architectural and town planning qualifications granted by institutions in Pakistan 11. Recognition of architectural and town planning qualifications granted by institutions abroad 12. Grant of temporary licenses 13. Power to require information as to courses of study and Examination 14. Inspection of Examination 15. Withdrawal of recognition 16. Maintenance of register, etc. 17. Registration 18. Appeal against refusal to permit registration 19. Revision of Register 20. Complaints against architects or town planners 21. Tribunals of inquiry 22. Procedure in inquiries, etc. 23. Review 24. Powers of the Tribunal 25. Fund of the Council, accounts and audit 26. Bye-laws of the Council 27. Proof of membership, etc. 28. Penalties and Procedure 29. Infringement of Code of Professional Conduct 30. Certain provisions to apply to unregistered architects and town planners 31. Power to exempt 32. Commission of inquiry THE FIRST SCHEDULE THE SECOND SCHEDULE THE PAKISTAN COUNCIL OF ARCHITECTS AND TOWN PLANNERS ORDINANCE, 1983 ORDINANCE No. IX OF 1983 [7th Mach, 1983] An Ordinance to make provisions for the regulation of architectural and town planning professions. WHEREAS it is expedient to make provision for the regulation of the architectural and town planning professions and for that purpose to constitute a Council of Architects and Town Planners; AND WHEREAS the President is satisfied that circumstances exist which render it necessary to take immediate action; NOW, THEREFORE, in pursuance of the Proclamation of the f",
  "source_file": "administrator34876031ae7438385933aa2c76f22c2e.txt",
  "law_name": "The Pakistan Council of Architects and Town Planner Ordinance, 1983",
  "year": 1983
}