{
  "error": "Expecting value: line 1 column 1 (char 0)",
  "raw": "Updated till 7.10.2022 THE CORPORATE AND INDUSTRIAL RESTRUCTURING CORPORATION ORDINANCE, 2000 CONTENTS CHAPTER I PRELIMINARY SECTIONS: 1. Short title, extent and commencement. 2. Definitions. 3. Ordinance not to derogate from other laws. CHAPTER II ESTABLISHMENT OF THE CORPORATION AND THE BOARD 4. Establishment of the Corporation. 5. Board and its powers. 6. Composition of the Board. 7. Chairman of the Board. 8. Chief Executive of the Corporation. 9. Committees. 10. Verification Committees. 11. Guidelines for Corporation and the Governor State Bank. SECTIONS: 12. Administration Committee. 13. Members, officers and servants of the Corporation. 14. Meeting of the Board and the Administration Committee. 15. Qualifications and disqualifications of directors. 16. Employees of the Corporation to be public servants. 17. Indemnity of members, directors, officers or servants. CHAPTER III POWERS AND FUNCTIONS OF THE CORPORATION 18. Business which the Corporation can transact. 19. Corporation not to be a banking company. 20. Financial institutions to which the provisions of this Ordinance shall apply. 21. Consideration for transfer of non-performing assets. 22. Bonds issued by the Corporation. 23. Certain rights and remedies. 24. Powers of the Corporation to seek assistance. CHAPTER IV FINANCE 25. Corporation Fund. 26. Accounts and audit. 27. Reserve Fund. CHAPTER V BUDGET STATEMENT AND ANNUAL REPORT 28. Budget statement. 29. Annual report to the Federal Government. CHAPTER VI RULES AND REGULATIONS 30. Power of Federal Government to make rules. 31. Power of the Board to make regulations. CHAPTER VII RIGHTS AND REMEDIES OF CORPORATION SECTIONS: 32. Rights and remedies available to Corporation. 33. Rights and remedies not exhaustive. 34. Exemption from taxes. 35. Liquidation of the Corporation. CHAPTER VIII GENERAL 36. Limitation of liability.. 37. Right of recovery as arrears of land revenue. 38. Power to obtain information and documents etc. 39. Removal of difficulties. SCHEDU",
  "source_file": "administratorbdccd7d3e7e218ad92ac90d69dee703a.txt",
  "law_name": "The Corporate and Industrial Restructuring Corporation Ordinance, 2000",
  "year": 2000
}