{
  "law_name": "THE REFORMATORY SCHOOLS ACT",
  "year": 1897,
  "chapters": [
    {
      "chapter_title": "PRELIMINARY",
      "sections": [
        {
          "section_no": "1",
          "section_title": "Title and extent",
          "body": "(1) This Act may be called the Reformatory Schools Act, 1897; (3) The Federal Government may, at any time, by notification in the official Gazette, extend this Act to the Islamabad Capital Territory from such day as may be fixed in such notification."
        },
        {
          "section_no": "4",
          "section_title": "Definitions",
          "body": "In this Act, unless there is anything repugnant in the subject or context, (a) 'youthful offender' means any boy who has been convicted of any offence punishable with imprisonment and who, at the time of such conviction, was under the age of fifteen years."
        }
      ]
    },
    {
      "chapter_title": "REFORMATORY SCHOOLS",
      "sections": [
        {
          "section_no": "5",
          "section_title": "Power to establish and discontinue Reformatory Schools",
          "body": "The Provincial Government may establish and maintain Reformatory Schools at such places as it may think fit."
        },
        {
          "section_no": "6",
          "section_title": "Requisites of schools",
          "body": "Every school so established or used must provide sufficient means of separating the inmates at night, proper sanitary arrangements, water-supply, food, clothing and bedding for the youthful offenders detained therein."
        },
        {
          "section_no": "7",
          "section_title": "Inspection of Reformatory Schools",
          "body": "Every school intended to be established or used as a Reformatory School shall, before being used as such, be inspected by the Inspector General."
        },
        {
          "section_no": "8",
          "section_title": "Power of Courts to direct youthful offenders to be sent to Reformatory Schools",
          "body": "Whenever any youthful offender is sentenced to imprisonment, and is, in the judgement of the Court by which he is sentenced, a proper person to be an inmate of a Reformatory School, the Court may direct that, instead of undergoing his sentence, he shall be sent to such a school."
        },
        {
          "section_no": "9",
          "section_title": "Procedure where Magistrate is not empowered to pass an order under section 8",
          "body": "When any Magistrate not empowered to pass an order under the last foregoing section is of opinion that a youthful offender convicted by him is a proper person to be an inmate of a Reformatory School, he may, without passing sentence, record such opinion and submit his proceedings."
        },
        {
          "section_no": "10",
          "section_title": "Power of Magistrates to direct boys under fifteen sentenced to imprisonment to be sent to Reformatory Schools",
          "body": "The officer in charge of a prison in which a youthful offender is confined may bring him before the District Magistrate, who may direct that, instead of undergoing the residue of his sentence, he shall be sent to a Reformatory School."
        },
        {
          "section_no": "11",
          "section_title": "Preliminary inquiry and finding as to age of youthful offender",
          "body": "Before directing any youthful offender to be sent to a Reformatory School, the Court or Magistrate shall inquire into the question of his age."
        },
        {
          "section_no": "12",
          "section_title": "Government to determine Reformatory School to which offenders shall be sent",
          "body": "Every youthful offender directed by a Court or Magistrate to be sent to a Reformatory School shall be sent to such Reformatory School as the Provincial Government may appoint."
        }
      ]
    },
    {
      "chapter_title": "MANAGEMENT OF REFORMATORY SCHOOLS",
      "sections": [
        {
          "section_no": "17",
          "section_title": "Appointment of Superintendent and Committee of Visitors or Board of Management",
          "body": "The Provincial Government shall appoint a Superintendent and a Committee of Visitors or Board of Management for each Reformatory School."
        },
        {
          "section_no": "18",
          "section_title": "Superintendent may license youthful offenders to employers of labour",
          "body": "The Superintendent may license youthful offenders to employers of labour."
        },
        {
          "section_no": "19",
          "section_title": "Cancellation of license",
          "body": "The Superintendent may cancel any license granted to a youthful offender."
        },
        {
          "section_no": "20",
          "section_title": "Determination of license",
          "body": "The Superintendent may determine the license of a youthful offender."
        },
        {
          "section_no": "21",
          "section_title": "Cancellation of license in case of ill-treatment",
          "body": "The Superintendent may cancel the license of a youthful offender in case of ill-treatment."
        },
        {
          "section_no": "22",
          "section_title": "Superintendent to be deemed guardian of youthful offenders",
          "body": "The Superintendent shall be deemed the guardian of youthful offenders."
        },
        {
          "section_no": "23",
          "section_title": "Duties of Committee of Visitors",
          "body": "The Committee of Visitors shall perform such duties as may be prescribed."
        },
        {
          "section_no": "24",
          "section_title": "Powers of Board of Management",
          "body": "The Board of Management shall have powers to manage the Reformatory School."
        },
        {
          "section_no": "25",
          "section_title": "Power to appoint Trustees or other Managers of a school to be a Board of Management",
          "body": "The Provincial Government may appoint Trustees or other Managers of a school to be a Board of Management."
        },
        {
          "section_no": "26",
          "section_title": "Power of board to make rules",
          "body": "The Board of Management shall have the power to make rules for the management of the Reformatory School."
        }
      ]
    },
    {
      "chapter_title": "OFFENCES IN RELATION TO REFORMATORY SCHOOLS",
      "sections": [
        {
          "section_no": "27",
          "section_title": "Penalty for introduction or removal or supply of prohibited articles and communication with youthful offenders",
          "body": "Any person introducing or removing prohibited articles or communicating with youthful offenders shall be liable to penalty."
        },
        {
          "section_no": "28",
          "section_title": "Penalty for abetting escape of youthful offender",
          "body": "Any person abetting the escape of a youthful offender shall be liable to penalty."
        },
        {
          "section_no": "29",
          "section_title": "Arrest of escaped youthful offender",
          "body": "Any escaped youthful offender may be arrested by any officer."
        }
      ]
    },
    {
      "chapter_title": "MISCELLANEOUS",
      "sections": [
        {
          "section_no": "31",
          "section_title": "Power to deal in other ways with youthful offenders, including girls",
          "body": "The Provincial Government may deal with youthful offenders, including girls, in other ways."
        },
        {
          "section_no": "32",
          "section_title": "Procedure when youthful offender under detention in a Reformatory School is again Convicted and sentenced",
          "body": "The procedure for dealing with a youthful offender under detention in a Reformatory School who is again convicted and sentenced shall be prescribed."
        }
      ]
    }
  ],
  "source_file": "administrator72c8d9d538a66742b84a728e1658ab73.txt"
}