{
  "error": "Expecting value: line 1 column 1 (char 0)",
  "raw": "THE ADMIRALTY JURISDICTION OF HIGH COURTS ORDINANCE, 1980 CONTENTS 1. Short title and commencement 2. Definitions 3. Admiralty jurisdiction of the High Court 4. Mode of exercise of Admiralty jurisdiction 5. Jurisdiction in personam of courts in collision and other similar cases. 6. Limitation of maritime lien 7. Appeals 8. Power to make rules 9. Repeal and saving THE ADMIRALTY JURISDICTION OF HIGH COURTS ORDINANCE, 1980 ORDINANCE No. XLII OF 1980 [2nd September, 1980] An Ordinance to consolidate and amend the law relating to Courts of Admiralty WHEREAS it is expedient to consolidate and amend the law relating to Courts of Admiralty; AND WHEREAS the President is satisfied that circumstances exist which render it necessary to take immediate action; NOW, THEREFORE, in pursuance of the Proclamation of the fifth day of July, 1977, read with the Laws (Continuance in Force) Order, 1977 (CMLA. Order No. 1 of 1977), and in exercise of all powers enabling him in that behalf, the President is pleased to make and promulgate the following Ordinance: 1. Short title and commencement. (1) This Ordinance may be called the Admiralty Jurisdiction of High Courts Ordinance, 1980. (2) It shall come into force at once. 2. Definitions. In this Ordinance, unless there is anything repugnant in the subject or context, (a) “aircraft” means any machine which can derive support in the atmosphere from reactions of the air, and includes balloons, whether captive or free, airships, kites, gliders and flying machines; (b) “charges” does not include light dues, local light dues or any other charges in respect of lighthouses, buoys, beacons or pilot age; (c) “cause” includes any cause, suit, action or other proceeding in the High Court in the exercise of its Admiralty jurisdiction; (d) “goods” includes baggage; (e) “internal waters” includes any part of the sea adjacent to the coast of Pakistan as may be notified by the Federal Government; (f) “master” includes every person, except a pilot or harbour ",
  "source_file": "administratorb34362be18405a0754066473ad4b3b23.txt",
  "law_name": "The Admiralty Jurisdiction of High Courts Ordinance, 1980",
  "year": 1980
}