{
  "law_name": "THE ORGANIZATION OF THE ISLAMIC CONFERENCE (IMMUNITIES AND PRIVILEGES) ACT",
  "year": 1977,
  "chapters": [
    {
      "chapter_title": "Chapter I Juridical Personality",
      "sections": [
        {
          "section_no": "1",
          "section_title": "Article 1",
          "body": "The Organization of the Islamic Conference shall possess juridical personality. It shall have the capacity: (a) To acquire and dispose of immovable and movable property. (b) To contract. (c) To institute legal proceedings."
        }
      ]
    },
    {
      "chapter_title": "Chapter II Property, Funds and Assets",
      "sections": [
        {
          "section_no": "2",
          "section_title": "Article 2",
          "body": "The Organization of the Islamic Conference, its property and assets, wherever located shall enjoy immunity from every form of legal process unless the Secretary General decides to waive it expressly."
        },
        {
          "section_no": "3",
          "section_title": "Article 3",
          "body": "The premises occupied by the Organization of the Islamic Conference shall be inviolable. Its property and assets wherever located shall be immune from search, requisition, confiscation, expropriation and any other form of interference, by executive action."
        },
        {
          "section_no": "4",
          "section_title": "Article 4",
          "body": "The archives of the organization of the Islamic Conference and in general, all documents belonging to it, or held by it, shall be inviolable."
        },
        {
          "section_no": "5",
          "section_title": "Article 5",
          "body": "The organization may, (1) Hold funds, gold or currency of any kind and operate accounts in any currency according to laws and regulations in force in Member States. (2) Be free to transfer its funds, gold or currency from one country to another, or within the country itself and to convert it to any currency according to the laws in force."
        },
        {
          "section_no": "6",
          "section_title": "Article 6",
          "body": "In exercising its rights under Article 5 above, the Organization of the Islamic Conference shall pay due regard to any representations made by Member States, in so far as is considered that effect can be given to such representations, without detriment to the interest of the Organization and Member States."
        },
        {
          "section_no": "7",
          "section_title": "Article 7",
          "body": "The Organization of the Islamic Conference, its movable or immovable property and its assets shall be: (a) Exempt from all direct taxes, except for those which are no more than charges for public utility services. (b) Exempt from custom duties, prohibitions and restrictions on imports and exports in respect of articles imported or exported by the Organization, for its official use."
        }
      ]
    },
    {
      "chapter_title": "Chapter III Facilities in Respect of Communications",
      "sections": [
        {
          "section_no": "8",
          "section_title": "Article 8",
          "body": "The Organization of the Islamic Conference shall enjoy, in the territory of each Member States, for its official communications, treatment not less favourable than that accorded by that State to the communications of any other Member State."
        },
        {
          "section_no": "9",
          "section_title": "Article 9",
          "body": "The Organization of the Islamic Conference may use codes and despatch its correspondence by couriers or bags, which shall have the same immunities and privileges as diplomatic couriers and bags."
        }
      ]
    },
    {
      "chapter_title": "Chapter IV The Representatives of Member States",
      "sections": [
        {
          "section_no": "10",
          "section_title": "Article 10",
          "body": "Representatives of Member States to the Principal and subsidiary organs and conferences convened by the organization, shall while exercising their functions and during the journey to and from the place of the meeting, enjoy the following immunities and privileges: (a) Immunity from personal arrest or detention and from seizure of their personal baggage."
        },
        {
          "section_no": "11",
          "section_title": "Article 11",
          "body": "Representatives of Member States in the Principal and subsidiary organs of the Organisation of the Islamic Conference and in conferences convened by the Organization, shall enjoy immunity from legal process in respect of words spoken or written."
        },
        {
          "section_no": "12",
          "section_title": "Article 12",
          "body": "Periods spent by the representatives of Member States to the Principal and Subsidiary organs of the Organization of the Islamic Conference and to conferences convened by it, in one of the territories of a Member State shall not be considered as periods of residence for the assessment of a tax."
        },
        {
          "section_no": "13",
          "section_title": "Article 13",
          "body": "Immunities and privileges are accorded to the representatives of Member States, not for their personal benefits, but in order to safeguard the independent exercise of their functions in connection with the Organization."
        },
        {
          "section_no": "14",
          "section_title": "Article 14",
          "body": "The provisions of Articles 10, 11 and 12 are not applicable as between a representative and the authorities of the State of which he is a national."
        },
        {
          "section_no": "15",
          "section_title": "Article 15",
          "body": "The expression 'representative' in this chapter shall be deemed to include all delegates of Members States, their deputies, advisers and technical experts and secretaries of delegations."
        },
        {
          "section_no": "16",
          "section_title": "Article 16",
          "body": "Permanent State representatives shall enjoy, during the period of their representing their State in the organs of the Organization of the Islamic Conference, such immunities and privileges as are enjoyed by diplomatic envoys."
        },
        {
          "section_no": "17",
          "section_title": "Article 17",
          "body": "The Secretary General shall notify Member States of the Organization, as well as their permanent delegates and members of permanent committees."
        }
      ]
    },
    {
      "chapter_title": "Chapter V Officials",
      "sections": [
        {
          "section_no": "18",
          "section_title": "Article 18",
          "body": "The Conference of the Organization of the Islamic Conference shall specify the categories of officials to which the provisions of Article 19 and the provisions of Chapter VII shall be applied."
        },
        {
          "section_no": "19",
          "section_title": "Article 19",
          "body": "Officials of the General Secretariat of the Organization of the Islamic Conference shall, regardless of their nationality, enjoy the following immunities and privileges: (a) Immunity from legal process, in respect of words spoken or written and all acts performed by them in their official capacity."
        },
        {
          "section_no": "20",
          "section_title": "Article 20",
          "body": "Further to the immunities and privileges provided for by the two preceding articles, the Secretary General, Assistant Secretary General and senior officials, together with their spouses and their minor children, shall enjoy immunities and privileges, which are accorded, in accordance with international law, to diplomatic envoys."
        }
      ]
    }
  ],
  "source_file": "administrator546f97580c4012deb22e096dd05242b4.txt"
}