{
  "law_name": "The Cost and Management Accountants Act",
  "year": 1966,
  "chapters": [
    {
      "chapter_title": "PRELIMINARY",
      "sections": [
        {
          "section_no": "1",
          "section_title": "Short title, extent and commencement",
          "body": "(1) This Act may be called the Cost and Management Accountants Act, 1966. (2) It extends to the whole of Pakistan. (3) It shall come into force on such date as the Federal Government may, by notification in the official Gazette, appoint in this behalf."
        },
        {
          "section_no": "2",
          "section_title": "Definitions",
          "body": "(1) In this Act, unless there is anything repugnant in the subject or context, (a) “associate” means an associate member of the Institute; (aa) “cost and management accountant” means a person who is an associate or a fellow member of the Institute; (b) “Council” means the Council of the Institute; (c) “dissolved company” means the company registered under the Companies Act, 1913, as the Pakistan Institute of Industrial Accountants; (d) “fellow” means a fellow member of the Institute; (f) “Institute” means the Institute of Cost and Management Accountants of Pakistan constituted under this Act; (g) “prescribed” means prescribed by regulations made under this Act; (h) “President” means the President of the Council; (i) “Register” means the Register of members of the Institute maintained under this Act; (j) “Vice-President” means the Vice-President of the Council; (k) “year” means the financial year."
        }
      ]
    },
    {
      "chapter_title": "INSTITUTE OF COST AND MANAGEMENT ACCOUNTANTS OF PAKISTAN",
      "sections": [
        {
          "section_no": "3",
          "section_title": "In Corporation of the Institute",
          "body": "(1) All persons whose names are entered in the Register at the commencement of this Act and all persons who may hereafter have their names entered in the Register under the provisions of this Act, so long as they continue to have their names borne on the said Register are hereby constituted a body corporate by the name of the Institute of Cost and Management Accountants of Pakistan and all such persons shall be known as members of the Institute. (2) The Institute shall have perpetual succession and a common seal, and shall have power to acquire, hold and dispose of property, both movable and immovable, and shall by its name sue or be sued."
        },
        {
          "section_no": "4",
          "section_title": "Entry of names in the Register",
          "body": "(1) The following persons shall be entitled to have their names entered in the Register, namely: (a) any person who was, immediately before the commencement of this Act, a fellow or associate of the dissolved company; (b) any person who has passed such examination and completed such training as may be prescribed for membership of the Institute; (c) any person who has passed such other examination and completed such other training outside Pakistan as is recognised by the Federal Government, or by the Council with the approval of the Federal Government, as being equivalent to the examination and training prescribed for membership of the Institute; (d) any person domiciled in Pakistan, who is, at the commencement of this Act, whether within or without Pakistan, studying for any foreign examination and also undergoing training and passes such examination and completes such training within three years of such commencement."
        },
        {
          "section_no": "5",
          "section_title": "Associates and fellows",
          "body": "(1) Save as otherwise provided in the Act, the members of the Institute shall be divided into two classes designated as fellows and associates. (2) A person, other than a person mentioned in sub-section (3), shall, on his name being entered in the Register, be an associate and, so long as his name remains so entered, shall be entitled to use the letters A.C.M.A. after his name to indicate that he is an associate of the Institute."
        },
        {
          "section_no": "6",
          "section_title": "Certificate of practice",
          "body": "(1) No member of the Institute shall be entitled to practice within Pakistan unless he holds a certificate of practice granted by the Council. (2) The Council may grant a certificate of practice to a member of the Institute who applies in the prescribed form and pays the prescribed annual fee for such certificate."
        },
        {
          "section_no": "7",
          "section_title": "Members to be known as Cost and Management Accountants",
          "body": "(1) Every member of the Institute in practice shall, and every other member may, use the designation of Cost and Management Accountant."
        }
      ]
    },
    {
      "chapter_title": "COUNCIL OF INSTITUTE",
      "sections": [
        {
          "section_no": "9",
          "section_title": "Constitution of the Council",
          "body": ""
        },
        {
          "section_no": "10",
          "section_title": "Election of the Council",
          "body": ""
        },
        {
          "section_no": "11",
          "section_title": "President, Vice-president, Secretary and Treasurer",
          "body": ""
        },
        {
          "section_no": "12",
          "section_title": "Resignation of membership and casual vacancies",
          "body": ""
        },
        {
          "section_no": "13",
          "section_title": "Duration and dissolution of Council",
          "body": ""
        },
        {
          "section_no": "14",
          "section_title": "Functions of the Council",
          "body": ""
        },
        {
          "section_no": "15",
          "section_title": "Staff, remuneration and allowances",
          "body": ""
        },
        {
          "section_no": "16",
          "section_title": "Committees of the Council",
          "body": ""
        },
        {
          "section_no": "17",
          "section_title": "Branch Councils",
          "body": ""
        },
        {
          "section_no": "18",
          "section_title": "Finances of the Council",
          "body": ""
        }
      ]
    },
    {
      "chapter_title": "REGISTER OF MEMBERS",
      "sections": [
        {
          "section_no": "19",
          "section_title": "Register",
          "body": ""
        },
        {
          "section_no": "20",
          "section_title": "Removal of name from the Register",
          "body": ""
        }
      ]
    },
    {
      "chapter_title": "PENALTIES",
      "sections": [
        {
          "section_no": "21",
          "section_title": "Penalty for falsely claiming to be a member, etc.",
          "body": ""
        },
        {
          "section_no": "22",
          "section_title": "Penalty for using the name of the Council etc.",
          "body": ""
        },
        {
          "section_no": "23",
          "section_title": "Companies not to engage in Cost and Management Accountancy in Pakistan",
          "body": ""
        },
        {
          "section_no": "24",
          "section_title": "Unqualified persons not to sign documents",
          "body": ""
        },
        {
          "section_no": "25",
          "section_title": "Offences by companies",
          "body": ""
        },
        {
          "section_no": "26",
          "section_title": "Sanction to prosecute",
          "body": ""
        }
      ]
    },
    {
      "chapter_title": "DISSOLUTION OF THE EXISTING INSTITUTE OF INDUSTRIAL ACCOUNTANTS",
      "sections": [
        {
          "section_no": "27",
          "section_title": "Dissolution of the institute registered under Act VII of 1913",
          "body": ""
        },
        {
          "section_no": "28",
          "section_title": "Assets and liabilities of the dissolved company",
          "body": ""
        },
        {
          "section_no": "29",
          "section_title": "Employees of the dissolved Company",
          "body": ""
        }
      ]
    },
    {
      "chapter_title": "MISCELLANEOUS",
      "sections": [
        {
          "section_no": "30",
          "section_title": "Alteration in the Register and cancellation of certificate",
          "body": ""
        },
        {
          "section_no": "31",
          "section_title": "Protection of action taken in good faith",
          "body": ""
        },
        {
          "section_no": "32",
          "section_title": "Maintenance of branch offices",
          "body": ""
        },
        {
          "section_no": "33",
          "section_title": "Reciprocity",
          "body": ""
        },
        {
          "section_no": "34",
          "section_title": "Power to make regulations",
          "body": ""
        },
        {
          "section_no": "35",
          "section_title": "Power to give directions for making regulations, etc.",
          "body": ""
        }
      ]
    }
  ],
  "source_file": "administratora6831a1472047810612c3e268cf4968a.txt"
}