{
  "error": "Expecting value: line 1 column 1 (char 0)",
  "raw": "THE PRICE CONTROL AND PREVENTION OF PROFITEERING AND HOARDING ACT, 1977 CONTENTS 1. Short title, extent and commencement 2. Definitions 3. Powers to make orders etc. 4. Delegation of powers 5. Effect of orders inconsistent with other enactments 6. Fixation of prices 6A. Appeal 7. Penalties 8. Attempts and abetments 9. Offences by corporations 10. False statements 11. Power to try offences summarily 12. Power to amend Schedule 13. Presumption as to order 14. Burden of proof in certain cases 15. Protection of action taken under the Act 16. Repeal THE PRICE CONTROL AND PREVENTION OF PROFITEERING AND HOARDING ACT, 1977 1ACT No. XXIX OF 1977 [21st May, 1977] An Act to provide for price control and prevention of profiteering and hoarding. WHEREAS it is expedient to provide for price control and prevention of profiteering and hoarding; It is hereby enacted as follows:- 1. Short title, extent and commencement.―(1) This Act may be called the Price Control and Prevention of Profiteering and Hoarding Act, 1977. (2) It extends to the whole of Pakistan. (3) It shall come into force at once 2. Definitions. In this Act, unless there is anything repugnant in the subject or context,- (a) “Controller-General” means the Controller-General of Prices and Supplies appointed by the Federal Government, and includes any Deputy or Assistant Controller-General of Prices and Supplies so appointed, and any other officer authorised by the Federal Government to exercise all or any of the powers of the Controller-General under this Act; (b) “dealer” means a person carrying on, whether in conjunction with any other business or not, the business of selling any essential commodity, whether wholesale or retail; (c) “essential commodity” means any of the commodities or classes of commodities mentioned in the Schedule; (d) “importer” means a person importing into Pakistan, whether under an import licence granted by the Federal Government or otherwise, any essential commodity from outside Pakistan, but d",
  "source_file": "administrator27d951fd230e0234282d0133cb695b0e.txt",
  "law_name": "The Price Control and Prevention of Profiteering and Hoarding Act, 1977",
  "year": 1977
}