{
  "error": "Expecting value: line 1 column 1 (char 0)",
  "raw": "THE LIGHT HOUSE ACT, 1927 CONTENTS PRELIMINARY 1. Short title, extent and commencement 2. Definitions 3. Appointment of officers 4. Advisory committees 5. Management of general lighthouses by the Federal Government and delegation of management LOCAL LIGHT HOUSES 6. Power to inspect local lighthouses 7. Control of local lighthouses by the Federal Government 8. Management of local lighthouses by the Federal Government LIGHT-DUES 9. Levy and collection of light-dues 10. Rates of light-dues leviable 11. Receipts for light-dues 12. Ascertainment of tonnage 13. Recovery of light dues, expenses and costs 14. Refusal of port-clearance 15. Determination of disputes as to liability for payment 16. Light-dues payable at one port recoverable at another 17. Penalty for evading payment of light-dues 18. Exemption from payment of light-dues 19. Refund of excess payments ACCOUNTS 20. Accounts, etc RULES 21. Power to make rules REPEALS 22. [Repeales.] THE SCHEDULE. [Repealed.] THE LIGHT HOUSE ACT, 1927 1Act No. XVII OF 1927 [21st September, 1927] An Act to consolidate and amend the law relating to the provision, maintenance and control of lighthouses by the Government in 2[Pakistan]. WHEREAS it is expedient to consolidate and amend the law relating to the provision, maintenance and control of lighthouses by the Government in 2[Pakistan] ; it is hereby enacted as follows :_ PRELIMINARY 1. Short title, extent and commencement. (1)This Act may be called the 3*Lighthouse Act, 1927. 4[(2) It extends to the whole of Pakistan.] (3) It shall come into force on such date5 as the 6[Federal Government] may, by notification in the 7[official Gazette] appoint. 2. Definitions. In this Act unless there is anything repugnant in the subject or context :‑ 8(a) 9[Collector of Customs] means an officer of customs exercising the powers of a Customs‑collector under the 10[Customs Act 1969 (IV of 1969)], and includes any person appointed by the 6[Federal Government] to discharge the functions of a Customs",
  "source_file": "administrator522b16a42c22b962dc086dc4fa150fea.txt",
  "law_name": "The Light House Act, 1927",
  "year": 1927
}