{
  "law_name": "THE ELECTRICITY CONTROL ORDINANCE",
  "year": 1965,
  "chapters": [
    {
      "chapter_title": "Contents",
      "sections": [
        {
          "section_no": "1",
          "section_title": "Short title, extent and commencement",
          "body": "(1) This Ordinance may be called the Electricity Control Ordinance, 1965. (2) It extends to the whole of Pakistan. (3) It shall come into force at once."
        },
        {
          "section_no": "2",
          "section_title": "Control of production, distribution, etc. of electrical energy",
          "body": "(1) The Federal Government so far as it appears to it to be necessary or expedient for maintaining supplies and services essential to the life of the community in an emergency, may, by order in writing, provide for: (a) regulating or prohibiting the production, distribution, use or consumption, of electrical energy; (b) collecting any information or statistics for the purpose of any of the matters mentioned in clause (a); (c) any incidental or supplementary matter including, in particular, (i) the entering and inspection of premises to which the order relates with a view to securing compliance therewith; and (ii) the grant or issue of a licence, permit, certificate or other document. (2) An order made under sub-section (1) may apply either to persons or undertakings generally or to any particular person or undertaking or class of persons or undertakings, and either to the whole or any part of any undertaking, and may have effect either generally or in any particular area."
        },
        {
          "section_no": "3",
          "section_title": "Penalty, etc.",
          "body": "(1) Whoever contravenes any order made under section 2, shall be punishable with imprisonment for a term which may extend to six months, or with fine, or with both. (2) Where the person, guilty of an offence under sub-section (1), is a company or other body corporate, every director, manager, secretary, agent, or other officer or person concerned with the management of its business shall, unless he proves that the offence was committed without his knowledge or consent or that he exercised due diligence to prevent its commission be deemed to be guilty of such offence and be punishable accordingly."
        },
        {
          "section_no": "4",
          "section_title": "Saving as to orders",
          "body": "No order, made under section 2, shall be called in question in any court."
        },
        {
          "section_no": "5",
          "section_title": "Indemnity",
          "body": "(1) No suit, prosecution or other legal proceeding shall lie against any person for anything in good faith done or intended to be done, in pursuance of any order made under this Ordinance. (2) No suit or other legal proceeding shall lie against the Federal Government for any damage caused or likely to be caused by anything in good faith done or intended to be done, in pursuance of any order made under this Ordinance."
        },
        {
          "section_no": "6",
          "section_title": "Cognizance of offences",
          "body": "No court shall take cognizance of any offence punishable under this Ordinance except on a report in writing of the facts constituting the offence made by an officer authorized in this behalf by the Federal Government."
        },
        {
          "section_no": "7",
          "section_title": "Delegation of powers",
          "body": "The Federal Government may, by notification in the official Gazette, direct that any power conferred on it by this Ordinance shall, in such circumstances and under such conditions, if any, as may be specified in the notification, be exercisable also by a Provincial Government or by any officer or authority subordinate to the Federal Government or to the Provincial Government."
        },
        {
          "section_no": "8",
          "section_title": "Effect of provisions inconsistent with other enactments",
          "body": "The provisions of this Ordinance or any order made thereunder shall have effect notwithstanding anything inconsistent therewith contained in any other law."
        },
        {
          "section_no": "9",
          "section_title": "Service of Order (IX of 1910)",
          "body": "Every order made under this Ordinance shall, so far as may be, be served in the manner prescribed under section 53 of the Electricity Act, 1910."
        }
      ]
    }
  ],
  "source_file": "administratorf8d126d8b4f2dac388965693040bda27.txt"
}