{
  "error": "Expecting value: line 1 column 1 (char 0)",
  "raw": "THE CHARITABLE AND RELIGIOUS TRUSTS ACT, 1920 CONTENTS 1 Short title and extent. 2 Interpretation. 3 Power to apply to the Court in respect of trusts of a charitable or religious nature. 4 Contents and verification of petition. 5 Procedure on petition. 6 Failure of trustee to comply with order under section 5. 7 Powers of trustee to apply for directions. 8 Costs of petition under this Act. 9 Savings. 10 Power of Courts as to costs in certain suits against trustees of charitable and religious trusts. 11 Provisions of the code of Civil Procedure to apply. 12 Appeal. THE CHARITABLE AND RELIGIOUS TRUSTS ACT, 1920 1ACT No. XIV OF 1920 [20th March, 1920] An Act to provide more effectual control over the administration of Charitable and Religious Trusts. WHEREAS it is expedient to provide facilities for the obtaining of information regarding trusts created for public purposes of a charitable or religious nature, and to enable the trustees of such trusts to obtain the directions of a Court on certain matters, and to make special provision for the payment of the expenditure incurred in certain suits against the trustees of such trusts; It is hereby enacted as follows: 1. Short title and extent.-(1) This Act may be called the Charitable and Religious Trusts Act, 1920. (2) It extends to 2[the whole of the Pakistan]: Provided that the 3[Government of any Province] may, by notification in the 4[official Gazette] direct that this Act, or any specified part thereof, shall 5not extend to 6[that Province or any specified area therein] or to any specified trust or class of trusts. 2. Interpretation. In this Act, unless there is anything repugnant in the subject or context, “the Court” means the Court of the District Judge 7[or any other Court empowered in that behalf by the 8[Provincial Government]] and includes the High Court in the exercise of its ordinary original civil jurisdiction. 3. Power to apply to the Court in respect of trusts of a charitable or religious nature. Save as h",
  "source_file": "administrator4813a5fb8905b60eda98ebb361bd9e4e.txt",
  "law_name": "The Charitable and Religious Trusts Act, 1920",
  "year": 1920
}