{
  "error": "Expecting value: line 1 column 1 (char 0)",
  "raw": "Updated till 31.8.2022 THE MODARABA COMPANIES AND MODARABA (FLOATATION AND CONTROL) ORDINANCE, 1980. CONTENTS PART I SECTIONS: PRELIMEARY 1. Short title, extent and commencement. 2. Definitions. 3. Appointment of Registrar. PART II REGISTRATION OF MODARBA COMPANIES 4. No company to operate without registration. 5. Eligibility for registration. 6. Application for registration. PART III PROVISIONS APPLICABLE TO MODARBA 7. Types of modaraba. 8. Creation and maintenance of modaraba. 9. Religious Board. 10. Business of modaraba. 11. Authorization. 12. Modaraba to be a legal persons. 13. Conditions applicable to modaraba. 14. Preparation and circulation of annual accounts, reports, etc. 15. Audit of accounts. 16. Prohibition of false statements, etc. 17. Conditions applicable to modaraba company. 18. Remuneration of modaraba company. 18A. Power to issue directions. 19. Cancellation of registration. 20. Appointment of administrator. 21. Enquiries. WINDING UP 22. Circumstances in which modaraba may be wound up voluntarily. 23. Circumstances in which modaraba may be wound up by the Tribunal. 24. Constitution of Tribunal. 25. Powers of a Tribunal. 26. Procedure of the Tribunal. 27. Powers of Tribunal on hearing application for winding up of modaraba. 28. Judgment and decree. 29. Finality of orders. 30. Appeals. 31. Punishment. 32. Penalty. 33. Liability of director manager or officer of a company. 34. Powers of the Registrar in relation to certain proceedings. 35. Application of fine. 36. Enforcement of provisions of the Ordinance, etc. 37. Exemption from tax. 38. Power of Federal Government to exempt, etc. 39. Delegation of powers. 40. Indemnity. 41. Power to make rules. 42. Act to override other laws. 43. Removal of difficulties. THE MODARABA COMPANIES AND MODARABA (FLOATATION AND CONTROL) ORDINANCE, 1980 ORDINANCE No. XXXI OF 1980 [26th June, 1980] An Ordinance to provide for matters relating to registration of modaraba companies and the floatation, management and regulati",
  "source_file": "administratorc3c2d650c60a91b19394127ca461b283.txt",
  "law_name": "The Modaraba Companies and Modaraba (Floatation and Control) Ordinance, 1980",
  "year": 1980
}