{
  "error": "Expecting value: line 1 column 1 (char 0)",
  "raw": "THE LEPERS ACT, 1898 CONTENTS 1. Title, extent and commencement. 2. Definitions. 3. Appointment of leper asylums by Provincial Government 4. Appointment of Inspectors of Lepers and Superintendents of Asylums. 5. Constitution of Board. 6. Arrest of pauper lepers. 7. Person arrested how to be dealt with. 8. Procedure with regard to pauper lepers. 9. Power to prohibit lepers from following certain trades and doing certain acts. 10. Conviction after previous conviction. 11. Penalty on person employing lepers in prohibited trade. 12. Re-arrest of escaped lepers. 13. Inspection by Board. 14. Order of discharge by Board. 15. Appeals. 16. Power of the Provincial Government to make rules. 17. Power to local authorities to expend funds and appropriate property to asylums. 18. Protection to persons acting bona-fide under Act. 19. Lepers from Acceding States. SCHEDULE A. CERTIFICATE B. CERTIFICATE C. WARRANT OF DETENTION D. WARRANT OF DETENTION THE LEPERS ACT, 1898 1ACT NO. III OF 1898 [4th February, 1898] An Act to provide for the segregation and medical treatment of pauper lepers and the control of lepers following certain callings. WHEREAS it is expedient to provide for the segregation and medical treatment of pauper lepers and the control of lepers following certain callings; It is hereby enacted as follows:- 1. Title, extent and commencement.- (1) This Act may be called the Lepers Act, 1898. 2[(2) It extends to the whole of Pakistan.] (3) It shall not come into force in any part thereof until the 3[Provincial Government], as hereinafter provided, has declared it applicable thereto. (4) The 3[Provincial Government] may, by notification4 in the official Gazette, apply this Act or any part thereof to the whole or any portion of the territories for the time being under its ad- ministration 5* * *. 2. Definitions.- In this Act, unless there is anything repugnant in the subject or context,- (1) “leper” means any person suffering from any variety of leprosy 6* * *; (2) “pauper le",
  "source_file": "administrator3cdf079d6ed582481656a94465e64c12.txt",
  "law_name": "The Lepers Act, 1898",
  "year": 1898
}