{
  "error": "Expecting value: line 1 column 1 (char 0)",
  "raw": "THE CENTRAL DEPOSITORIES ACT, 1997 CONTENTS 1. Short title, extent and commencement. 2. Definitions. 3. Overriding effect. 4. Central depository system. 5. Central depository not to be a member of an issuer, etc. 6. Transfers under book entry system. 7. Effect of book-entry transfer on transferee. 8. Central depository discharged from liability if acting on instructions. 9. Central depository to supply information. 10. Bonus issue by an issuer. 11. Bar on rectification of central depository register. 12. Pledge of book entry securities. 13. Consolidation or subdivision of securities by an issuer. 14. Regulations for issue or offer for sale of securities. 15. Conversion of non-equity securities into equity securities. 16. Issuance of jumbo Certificates. 17. Inspection of the central depository register. 18. Record ot an entry prima facie evidence. 19. Borrowing or lending of securities. 20. Duty to maintain secrecy. 21. Permitted disclosures. 22. Regualtion of access to the computer system. 23. Central depository to provide assistance to the Registrar, the Authority, the State Bank of Pakistan and the stock exchanges. 24. Handing book-entry securities without authority 25. Nomination and transmission. 26. Settlement of securities transactions using the central depository system. 27. Power of Registrar and Authority to call for information or appoint inspectors. 28. Offences. 29. Cognizance of offences by courts. 30. Offences to be non-cognizable. 31. Punishment and adjudication of fine or penalty. 32. Review and appeal. 33. Powers of the Authority in relation to proceedings. 34. Amendment of Ordinance XLVII of 1984. 35. Central depository to have power to make regulations. 36. Removal of difficulties. THE CENTRAL DEPOSITORIES ACT, 1997 ACT NO. XIX OF 1997 An Act to make provision for the establishment and operation of book‑entry systems for the transfer of securities by central depository companies WHEREAS it is expedient to make provisions for the establishment and ",
  "source_file": "administratoradaacbf03195f8ecadcf31db4a69c76d.txt",
  "law_name": "The Central Depositories Act, 1997",
  "year": 1997
}