{
  "law_name": "The Public Debt Act",
  "year": 1944,
  "chapters": [
    {
      "chapter_title": "Contents",
      "sections": [
        {
          "section_no": "1",
          "section_title": "Short title, extent and commencement",
          "body": "(1) This Act may be called the Public Debt Act, 1944. (2) It extends to the whole of Pakistan. (3) It shall come into force on such date as the Federal Government may, by notification in the official Gazette, appoint in this behalf."
        },
        {
          "section_no": "2",
          "section_title": "Definitions",
          "body": "In this Act, unless there is anything repugnant in the subject or context, - (1) 'the Bank' means the State Bank of Pakistan. (1A) 'Government', in relation to Government security, means the Federal or Provincial Government by whom the security is created and issued; (2) 'Government security' means a security, created and issued, whether before or after the commencement of this Act, by Government for the purpose of raising a public loan."
        },
        {
          "section_no": "3",
          "section_title": "Transfer of Government securities",
          "body": "(1) Subject to the provisions of section 5, a transfer of a Government security shall be made only in the manner prescribed for the making of transfers of securities of the class to which it belongs."
        },
        {
          "section_no": "4",
          "section_title": "Transferor of Government securities not liable for amount thereof",
          "body": "Notwithstanding anything contained in the Negotiable Instruments Act, 1881, a person shall not, by reason only of his having transferred a Government security, be liable to pay any money due either as Principal or as interest there under."
        },
        {
          "section_no": "5",
          "section_title": "Holding of Government securities by holders of public offices",
          "body": "(1) In the case of any public office to which Government may, by notification in the official Gazette, declare this sub-section to apply, a Government security in the form of stock or of a promissory note may be held in the name of the office."
        },
        {
          "section_no": "6",
          "section_title": "Notice of trust not receivable",
          "body": "(1) No notice of any trust in respect of any Government security shall be receivable by Government nor shall Government be bound by any such notice even though expressly given."
        },
        {
          "section_no": "7",
          "section_title": "Persons whose title to a Government security of a deceased sole holder may be recognised by the Bank",
          "body": "Subject to the provisions of section 9 the executors or administrators of a deceased sole holder of a Government security and the holder of a succession certificate issued under Part X of the Succession Act, 1925, shall be the only persons who may be recognised by the Bank as having any title to the Government security."
        },
        {
          "section_no": "8",
          "section_title": "Right of survivors of joint holders of several payees",
          "body": "Notwithstanding anything contained in section 45 of the Contract Act, when a Government security is held by two or more persons jointly and either or any of them dies, the title to the security shall vest in the survivor or survivors of those persons."
        },
        {
          "section_no": "9",
          "section_title": "Summary procedure on death of holder of Government securities",
          "body": "The procedure for handling the death of a holder of Government securities shall be as prescribed."
        },
        {
          "section_no": "10",
          "section_title": "Government securities not exceeding five thousand rupees face value belonging to minor or insane person",
          "body": "Provisions regarding Government securities held by minors or insane persons."
        },
        {
          "section_no": "11",
          "section_title": "Issue of duplicate securities and of new securities on conversion, consolidation, sub-division or renewal",
          "body": "Provisions regarding the issuance of duplicate securities."
        },
        {
          "section_no": "12",
          "section_title": "Summary determination by the Bank of title to Government security in case of dispute",
          "body": "The Bank shall have the authority to determine title in case of disputes."
        },
        {
          "section_no": "13",
          "section_title": "Law applicable in regard to Government securities",
          "body": "Applicable laws regarding Government securities."
        },
        {
          "section_no": "14",
          "section_title": "Recording of evidence",
          "body": "Provisions regarding the recording of evidence."
        },
        {
          "section_no": "15",
          "section_title": "Postponement of payments and registration of transfers pending the making of a vesting order",
          "body": "Provisions regarding postponement of payments."
        },
        {
          "section_no": "16",
          "section_title": "Power of Bank to require bonds",
          "body": "The Bank has the power to require bonds."
        },
        {
          "section_no": "17",
          "section_title": "Publication of notices in official Gazette",
          "body": "Provisions regarding the publication of notices."
        },
        {
          "section_no": "18",
          "section_title": "Scope of vesting order",
          "body": "Provisions regarding the scope of vesting orders."
        },
        {
          "section_no": "19",
          "section_title": "Legal effect of orders made by the Bank",
          "body": "Legal effects of orders made by the Bank."
        },
        {
          "section_no": "20",
          "section_title": "Stay of proceedings on order of Court",
          "body": "Provisions regarding stay of proceedings."
        },
        {
          "section_no": "21",
          "section_title": "Cancellation by the Bank of vesting proceedings",
          "body": "Provisions regarding cancellation of vesting proceedings."
        },
        {
          "section_no": "22",
          "section_title": "Discharge in respect of interest on Government securities",
          "body": "Provisions regarding discharge of interest."
        },
        {
          "section_no": "23",
          "section_title": "Discharge in respect of bearer bonds",
          "body": "Provisions regarding discharge of bearer bonds."
        },
        {
          "section_no": "24",
          "section_title": "Period of limitation of Government’s liability in respect of interest",
          "body": "Provisions regarding limitation periods."
        },
        {
          "section_no": "25",
          "section_title": "Inspection of documents",
          "body": "Provisions regarding inspection of documents."
        },
        {
          "section_no": "26",
          "section_title": "The Bank and its officers to be deemed public officers",
          "body": "Provisions regarding the status of the Bank and its officers."
        },
        {
          "section_no": "27",
          "section_title": "Penalty",
          "body": "Provisions regarding penalties."
        },
        {
          "section_no": "28",
          "section_title": "Power to make rules",
          "body": "Provisions regarding rule-making authority."
        },
        {
          "section_no": "29",
          "section_title": "Act X of 1920 not to apply to Government securities",
          "body": "Provisions regarding the applicability of Act X of 1920."
        }
      ]
    }
  ],
  "source_file": "administrator2bf46ebacdc8899d104188e8d1bd16f9.txt"
}