{
  "error": "Expecting value: line 1 column 1 (char 0)",
  "raw": "THE PAKISTAN (EXCHANGE OF PRISONERS) ORDINANCE, 1948 CONTENTS PART I PRELIMINARY 1. Short title, extent and commencement 2. PART II OF THE TRANSFER OF PRISONERS 3. Power of the Provincial Government to order removal of transferable prisoners 4. Officer-in-Charge of prison or place of detention to deliver custody of transferable prisoner 5. Avoidance of jurisdiction of Courts and authorities over transferable prisoners 6. Examination of witnesses on commission PART III OF THE REPATRIATION OF PRISONERS 7. Custody and removal of repatriated prisoners 8. Delivery of repatriated prisoner at prison Detention where warrant is received with prisoner Detention where no warrant is received with prisoner 9. Missing warrant to be reconstructed Report to High Court. Bail in case of delay 10. High Court's jurisdiction 11. Entrustment of cases to Courts subordinate to the high court Evidence already recorded to be evidence in the case 12. Treatment of prisoners who are repatriated while in police custody 13. Bar to proceedings Prior sanction for prosecution 14. Power of Provincial Governments in relation to prisoners detained for reasons security 15. Power of Government to suspend, remit or commute sentences 16. Power of Courts to grant bail PART IV GENERAL 17. Lawfulness of custody and retaking upon escape 18. Power to make rules 19. Definitions SCHEDULE THE PAKISTAN (EXCHANGE OF PRISONERS) ORDINANCE, 1948 ORDINANCE NO. XII OF 1948 [19th March, 1948] An Ordinance to implement an agreement with 1* * * India regarding the exchange of certain classes of prisoners between 1* * * Pakistan and 1* * * India. WHEREAS an agreement has been reached between the two 1[countries] to exchange certain classes of prisoners; AND WHEREAS an emergency has arisen which makes it necessary immediately to implement the said agreement in so far as Pakistan is concerned; NOW, THEREFORE, in exercise of the powers conferred by section 42 of the Government of India Act, 1935 (26 Geo. 5, c. 2.), as adapted b",
  "source_file": "administrator6944b1a3609700c11be00753cacfc993.txt",
  "law_name": "The Pakistan (Exchange of Prisoners) Ordinance, 1948",
  "year": 1948
}