{
  "law_name": "THE REGISTRATION OF FOREIGNERS ACT",
  "year": 1939,
  "chapters": [
    {
      "chapter_title": "Contents",
      "sections": [
        {
          "section_no": "1",
          "section_title": "Short title and extent",
          "body": "(1) This Act may be called the Registration of Foreigners Act, 1939. (2) It extends to the whole of Pakistan."
        },
        {
          "section_no": "2",
          "section_title": "Definitions",
          "body": "In this Act (a) “foreigner” means a person who is not a citizen of Pakistan; (b) “prescribed” means prescribed by rules made under this Act."
        },
        {
          "section_no": "3",
          "section_title": "Power to make rules",
          "body": "The Federal Government may after previous publication, by notification in the official Gazette, make rules with respect to foreigners for any or all of the following purposes: (a) for requiring any foreigner entering, or being present in, Pakistan to report his presence to a prescribed authority within such time and in such manner and with such particulars as may be prescribed; (b) for requiring any foreigner moving from one place to another place in Pakistan to report, on arrival at such other place, his presence to a prescribed authority within such time and in such manner and with such particulars as may be prescribed; (c) for requiring any foreigner who is about to leave Pakistan to report the date of his intended departure and such other particulars as may be prescribed to such authority and within such period before departure as may be prescribed; (d) for requiring any foreigner entering, being present in, or departing from, Pakistan to produce, on demand by a prescribed authority, such proof of his identity as may be prescribed; (e) for requiring any person having the management of any hotel, boarding-house, sarai or any other premises of like nature to report the name of any foreigner residing therein for whatever duration, to a prescribed authority within such time and in such manner and with such particulars as may be prescribed; (f) for requiring any person having the management or control of any vessel or aircraft to furnish to a prescribed authority such information as may be prescribed regarding any foreigner entering, or intending to depart from, Pakistan in such vessel or aircraft, and to furnish to such authority such assistance as may be necessary or prescribed for giving effect to this Act; (g) for providing for such other incidental or supplementary matters as may appear to the Federal Government necessary or expedient for giving effect to this Act."
        },
        {
          "section_no": "4",
          "section_title": "Burden of proof",
          "body": "If any question arises with reference to this Act or any rule made there under, whether any person is or is not a foreigner, or is or is not a foreigner of a particular class or description, the onus of proving that such person is not a foreigner or is not a foreigner of such particular class or description, as the case may be, shall, notwithstanding anything contained in the Evidence Act, 1872 (I of 1872), lie upon such person."
        },
        {
          "section_no": "5",
          "section_title": "Penalties",
          "body": "Any person who contravenes, or attempts to contravene, or fails to comply with, any provision of any rule made under this Act shall be punished, if a foreigner, with imprisonment for a term which may extend to one year or with fine which may extend to one thousand rupees or with both, or if not a foreigner, with fine which may extend to five hundred rupees."
        },
        {
          "section_no": "6",
          "section_title": "Power to exempt from application of Act",
          "body": "The Federal Government may, by order, declare that any or all of the provisions of the rules made under this Act shall not apply, or shall apply only with such modifications or subject to such conditions as may be specified in the said order, to or in relation to any individual foreigner or any class or description of foreigner: Provided that a copy of every such order shall be placed on the table of the Federal Legislature as soon as may be after its promulgation."
        },
        {
          "section_no": "7",
          "section_title": "Protection to persons acting under this Act",
          "body": "No suit, prosecution or other legal proceeding shall lie against any person for anything which is in good faith done or intended to be done under this Act."
        },
        {
          "section_no": "8",
          "section_title": "Application of other laws not barred",
          "body": "The provisions of this Act shall be in addition to, and not in derogation of, the provisions of the Foreigner Act, 1946 (XXXI of 1946) and any other law for the time being in force."
        },
        {
          "section_no": "9",
          "section_title": "[Omitted]",
          "body": ""
        }
      ]
    }
  ],
  "source_file": "administratorc54694b004c4dbc6b8cc8b4b0c935e8a.txt"
}