{
  "law_name": "The Surrender of Illicit Arms Act",
  "year": 1991,
  "chapters": [
    {
      "chapter_title": "Contents",
      "sections": [
        {
          "section_no": "1",
          "section_title": "Short title, extent and commencement",
          "body": "(1) This Act may be called the Surrender of Illicit Arms Act, 1991. (2) It extends to the whole of Pakistan. (3) It shall come into force in such areas and on such date as the Federal Government may, on recommendation of the respective Provincial Governments, by notification in the official Gazette appoint; and different date may be so appointed in respect of different areas."
        },
        {
          "section_no": "2",
          "section_title": "Definitions",
          "body": "(1) In this Act, unless there is anything repugnant in the subject or context, (a) “illicit arms” includes— (i) cannon as defined in the Pakistan Arms Ordinance, 1965 (W.P. Ordinance No. XX of 1965), excluding sub-machine guns and their silencers revolvers or pistols of over 46 inches bore; (ii) all types of explosive substances as defined in the Explosive Substances Act, 1908 (VI of 1908), and the Explosive Act, 1884 (IV of 1884), including mines of all types; (iii) all types of containers, grenades bombs and shells that discharge poisonous or noxious gases or other chemicals or substances which cause damage to human body; (iv) fire-arms comprising automatic weapons (other than machine guns) including sub-machine guns, automatic rifles and machine pistols; and (v) rifles, carbines muskets, shortguns, revolvers, pistols and appliances the object of which is the silencing of fire-arms and all other fire-arms not included in sub-clause (iv), which are held or possessed in contravention of the provisions of the Arms Act, 1878 (XI of 1878), the Explosives Act, 1884 (IV of 1884), the Explosive Substances Act, 1908 (IV of 1908), the Pakistan Arms Act, 1965 (W.P. Ord. XX of 1965), or any other law for the time being in force; (b) “prescribed” means prescribed by rules made under this Act. (2) The Federal Government may, by notification in the official Gazette, declare any article, substance, arms, ammunition or military stores not, specified hereinbefore which is held or possessed in contravention of any law as illicit arms, ammunition or explosives, for the purpose of this Act."
        },
        {
          "section_no": "3",
          "section_title": "Act not to derogate from other laws",
          "body": "The provisions of this Act shall be in addition to, and not in derogation of, any other law for the time being in force, and nothing contained herein shall exempt any person from any proceedings which may be instituted against him under such law."
        },
        {
          "section_no": "4",
          "section_title": "Surrender of illicit arms",
          "body": "(1) On the commencement of this Act, all persons in possession or control of any illicit arms shall surrender such arms to the District Co-ordination Officer, Deputy District Officer (Revenue) or officer-in-charge of a police-station within whose jurisdiction such persons ordinarily reside or to such other authority as may be specified by the Federal Government by notification in the official Gazette. (2) The authority receiving any illicit arms shall issue a receipt for the same."
        },
        {
          "section_no": "5",
          "section_title": "Surrender of arms, etc., by persons on visit abroad",
          "body": "A person on a lawful visit abroad at the commencement of this Act shall, within sixty days of his return to Pakistan, through an authorized route or port of entry surrender and deposit all illicit arms in his possession or control to one of the authorities specified in section 4."
        },
        {
          "section_no": "6",
          "section_title": "Publicity for surrender of illicit arms",
          "body": "(1) The Federal Government and the Provincial Government shall give wide publicity to the provisions of this Act on the media, including television, radio, national and regional press, in Urdu, English and regional languages or by any other mode as may be prescribed. (2) There shall be publicly displayed a count-down of every expired day of the period allowed for surrender of illicit arms under this Act and the number of days left for such surrender."
        },
        {
          "section_no": "7",
          "section_title": "Punishments",
          "body": "(1) Whoever contravenes the provisions of section 4 or section 5 or fails to surrender illicit arms shall, (a) in respect of illicit arms defined in sub-clauses (i) to (iii) of clause (a) of section 2, be punished with imprisonment for life and forfeiture of property, both movable and immovable; (b) in respect of illicit arms defined in sub-clause (iv) of clause (a) of section 2, be punished with imprisonment for life or with imprisonment for a term which shall not be less than ten years having regard to the antecedents of the accused; and (c) in respect of illicit arms defined in sub-clause (v) of clause (a) of section 2, be punished with imprisonment for a term which may extend to fourteen years but shall not be less than three years, having regard to the antecedents of the accused. (2) Any illicit arms in respect of which a person is convicted and sentenced under sub-section (1) shall stand forfeited to the Federal Government. (3) Any conveyance used for the transportation of any illicit arms shall also be liable to confiscation. Explanation. In this section, “conveyance” includes a vessel, aircraft, vehicle or animal."
        },
        {
          "section_no": "8",
          "section_title": "Indemnity",
          "body": "A person surrendering or depositing illicit arms under section 4 or section 5 shall stand indemnified against any legal or penal action for having previously possessed such illicit arms: Provided that any person who had committed any offence with such arms shall not be exempted from criminal liability for any such offence."
        },
        {
          "section_no": "9",
          "section_title": "Search for illicit arms, etc.",
          "body": "(1) The Federal Government may, from time to time, launch campaign for recovery of illicit arms in a coordinated manner and the Provincial Governments and all other agencies of the State which may be called upon shall act in aid of the Federal Government and Provincial Governments. (2) Search for illicit arms, ammunition or explosives shall be carried out, as nearly as may be, in accordance with Chapter V of the Code of Criminal Procedure, 1898 (Act V of 1898): Provided that, where in case of an extreme urgency a departure from the provisions of the Code is made, the District Superintendent of Police or any other officer authorizing the search shall record reasons for such departure."
        },
        {
          "section_no": "10",
          "section_title": "Reward for successful recovery",
          "body": "Any person providing information for successful recovery of illicit arms may, in the prescribed manner, be appropriately rewarded by the Federal Government or, as the case may be, by the Provincial Government to whom such information is provided, keeping in view the number of illicit arms recovered on the basis of such information."
        },
        {
          "section_no": "11",
          "section_title": "Scrutiny of licences, etc.",
          "body": "(1) Whenever the Federal Government or, if so required by it, the Provincial Government deems fit, it may, notwithstanding anything contained in the Pakistan Arms Ordinance, 1965 (W.P. Ordinance No. XX of 1965), the Explosive Substances Act, 1908 (VI of 1908), the Explosives Act, 1884 (IV of 1884), the Arms Act, 1878 (XI of 1878), or any other law, by notification in the official Gazette, direct every person possessing or keeping in his control any arms, ammunition or explosives under any licence issued by any authority appointed under any law for the time being in force, to present such licence to the authority specified in the notification, by the Federal Government or, as the case may be, the Provincial Government, for scrutiny. (2) Where, on scrutiny of a license, the authority referred to in sub-section (1) is satisfied that it was not in the public interest or conducive for maintenance of law and order or the public peace to allow retention of the licence or any arms, ammunition or explosives, it may, after providing an opportunity of being heard, cancel the licence issued to a person to possess or keep any arms, ammunition or explosives. (3) Where a licence is cancelled under sub-section (2), the person possessing or keeping any arms, ammunition or explosives shall deposit such arms, ammunition or explosives with the authority specified by the Federal Government."
        },
        {
          "section_no": "12",
          "section_title": "Punishment for failure to present licence for scrutiny",
          "body": "Whoever fails to present his licence for possessing or keeping any arms, ammunition or explosives as required under section 11 shall be punished with imprisonment which may extend to ten years but shall not be less than three years and confiscation of such arms, ammunition or explosives."
        },
        {
          "section_no": "13",
          "section_title": "Exemption",
          "body": "Nothing contained in this Act shall apply to a person who is exempt by virtue of the provisions of the Pakistan Arms Ordinance, 1965 (W.P. Ordinance No. XX of 1965), and the rules framed thereunder from holding a licence for possessing any arms and ammunition, including those of prohibited bore, by virtue of his office or otherwise."
        },
        {
          "section_no": "14",
          "section_title": "Rules",
          "body": "The Federal Government may make rules for carrying out the purposes of this Act."
        },
        {
          "section_no": "15",
          "section_title": "Removal of difficulties",
          "body": "If any difficulty arises in giving effect to any provision of this Act, the Federal Government may make such order or direction, not inconsistent with the provisions of this Act, as may appear to it to be necessary for the purpose of removing such difficulty."
        }
      ]
    }
  ],
  "source_file": "administrator804ffa6d8c86db47686d4d86995275bc.txt"
}