{
  "law_name": "THE CAPITAL DEVELOPMENT AUTHORITY (ABATEMENT OF ARBITRATION PROCEEDINGS) ACT",
  "year": 1975,
  "chapters": [
    {
      "chapter_title": "Contents",
      "sections": [
        {
          "section_no": "1",
          "section_title": "Short title and commencement",
          "body": "(1) This act may be called the Capital Development Authority (Abatement of Arbitration Proceedings) Act, 1975. (2) It shall come into force at once."
        },
        {
          "section_no": "2",
          "section_title": "Definitions",
          "body": "(1) In this Act unless there is anything repugnant in the subject or context, (a) “Authority” means the Capital Development Authority established under the Capital Development Authority Ordinance, 1960 (XXIII of 1960); and (b) “contractor” means any person, firm or company, not being a foreigner or a foreign firm or company, who or which has entered into an agreement with the Authority for the execution of any projects or works, or for the supply of any goods or labour or for the performance of any obligation, and includes a sub-contractor. (2) Words used but not defined in this Act shall respectively have the same meanings as are assigned to them in the Arbitration Act, 1940 (X of 1940)."
        },
        {
          "section_no": "3",
          "section_title": "Abatement of proceedings before arbitrators, etc.",
          "body": "(1) Notwithstanding anything contained in any law for the time being in force, or any order of a Court or any agreement,- (a) any provision in an agreement entered into before the coming into force of this Act by or on behalf of the Authority and a contractor relating to the execution of any project or works or to the supply of any goods or labour or to the performance of any obligation, providing for reference to arbitration of any dispute arising out of the agreement or any term or condition thereof shall stand abrogated and annulled and be of no effect; (b) all arbitration proceedings in pursuance of any such agreement as is referred to in clause (a), whether the reference to arbitration was made by consent of the parties thereto, by order of a Court or otherwise, pending before an arbitrator or arbitrators or an umpire immediately before the coming into force of this Act shall forthwith abate and, save as hereinafter provided, shall be of no effect; (c) any award made by an arbitrator, arbitrators, or umpire in pursuance of any such agreement as is referred to in clause (a) shall, unless the award has been made the rule of the Court, or partly or wholly implemented or acted upon, stand annulled and be of no effect, and any proceedings in respect of such award, if pending immediately before the coming into force of this Act, shall abate; (d) all proceedings in relation to an application made to a Court for referring a dispute to arbitration pursuant to an agreement referred to in clause (a) shall abate, and any order made by a Court on such application referring the dispute to arbitration shall be of no effect; and (e) any dispute referred to arbitration the proceedings whereof have abated by reason of the provisions of this section shall be decided in accordance with the provisions of the law for the time being in force. (2) The fees to be paid to an arbitrator, arbitrators or an umpire in respect of the proceedings which have abated or an award which has been annulled, under sub-section (1) shall, unless mutually agreed to by such arbitrator or arbitrators or umpire, the Authority and the contractors, be of such amount, and shall be payable by the Authority or the contractors, or in such proportion by the Authority and the contractors, as the Court having jurisdiction to adjudicate in the matter of the dispute referred to arbitration may determine on application made to it in this behalf by the arbitrator, arbitrators or umpire, as the case may be. (3) In determining the fees to be paid to an arbitrator, arbitrators or an umpire under sub-section (2), the Court shall take into consideration the stage of the proceedings before the arbitrator, arbitrators or the umpire, as the case may be, at which such proceedings abated under this section: Provided that the fees so determined shall in no case exceed the fees agreed upon by the Authority and the contractors at the time of making the reference to arbitration or at any time thereafter and consented to by the arbitrator, arbitrators or umpire, as the case may be."
        },
        {
          "section_no": "4",
          "section_title": "Limitation",
          "body": "In computing the period of limitation prescribed for a suit or application relating to any dispute to which the provisions of sub-section (1) of section 3 apply, the time commencing on the date- (a) of the execution of an agreement of reference to arbitration by the Authority and the contractor; (b) of the making of a reference to arbitration; or (c) of the making of an application to a Court for referring dispute to arbitration; and ending immediately before the coming into force of this Act shall be excluded : Provided that nothing in this section shall be deemed to have the effect of extending the period of limitation for a suit or an application where such period had expired prior to the execution of an agreement or the making of a reference or an application as is referred to in clause (a), clause (b) or clause (c)."
        }
      ]
    }
  ],
  "source_file": "administrator33ce6d0c4ac8fe50ae07bef7f1b998ec.txt"
}