{
  "law_name": "THE EXIT FROM PAKISTAN (CONTROL) ORDINANCE",
  "year": 1981,
  "chapters": [
    {
      "chapter_title": "Contents",
      "sections": [
        {
          "section_no": "1",
          "section_title": "Short title, extent and commencement",
          "body": "(1) This Ordinance may be called the Exit from Pakistan (Control) Ordinance, 1981. (2) It extends to the whole of Pakistan. (3) It shall come into force at once."
        },
        {
          "section_no": "2",
          "section_title": "Power to prohibit exit from Pakistan",
          "body": "(1) The Federal Government may, by order, prohibit any person or class of persons from proceeding from Pakistan to a destination outside Pakistan, notwithstanding the fact that such person is in possession of valid travel documents. (2) Before making an order under sub-section (1), it shall not be necessary to afford an opportunity of showing cause against the order. (3) If, while making an order under sub-section (1) it appears to the Federal Government that it will not be in the public interest to specify the grounds on which the order is proposed to be made, it shall not be necessary for the Federal Government to specify such grounds."
        },
        {
          "section_no": "3",
          "section_title": "Review",
          "body": "(1) Any person aggrieved by an order of the Federal Government under sub-section (1) of section 2 may, within fifteenth days of the making of the order, make a representation to the Federal Government for a review of the order, setting out in the representation the grounds on which he seeks the review. (2) The Federal Government may, after giving the person making a representation an opportunity of being heard, make such order as it may deem fit. (3) Subject to the order of the Federal Government in review, an order under sub-section (1) of section 2 shall be final and shall not be called in question before any court or other authority."
        },
        {
          "section_no": "4",
          "section_title": "Punishment",
          "body": "Whoever contravenes, or attempts or conspires to contravene, or abets the contravention of, any order made under sub-section (1) of section 2 shall be punishable with imprisonment for a term which may extend to five years."
        },
        {
          "section_no": "5",
          "section_title": "Power to make rules",
          "body": "The Federal Government may, by notification in the official Gazette, make rules for carrying out the purposes of this Ordinance."
        }
      ]
    }
  ],
  "source_file": "administratorbd77c05f4a3969b21836d95342e5fc34.txt"
}