{
  "law_name": "THE PAKISTAN ELECTRONIC MEDIA REGULATORY AUTHORITY ORDINANCE",
  "year": 2002,
  "chapters": [
    {
      "chapter_title": "Preliminary",
      "sections": [
        {
          "section_no": "1",
          "section_title": "Short title, extent and commencement",
          "body": "(1) This Ordinance shall be called the Pakistan Electronic Media Regulatory Authority Ordinance, 2002. (2) It extends to the whole of Islamic Republic of Pakistan. (3) It shall come into force at once."
        },
        {
          "section_no": "2",
          "section_title": "Definitions",
          "body": "In this Ordinance, unless there is anything repugnant in the subject or context, (a) 'advertisement' means a set of visual and audio messages for the projection of a product, service, or idea with the object of propagating sale, purchase or hire of the product, service or idea for creating other related effects; (b) 'Authority' means the Pakistan Electronic Media Regulatory Authority (PEMRA) established under section 3; (c) 'broadcast media' means such media which originate and propagate broadcast and pre-recorded signals by terrestrial means or through satellite for radio or television and includes teleporting, provision of access to broadcast signals by channel providers and such other forms of broadcast media as the Authority may, with the approval of the Federal Government, by notification in the official Gazette, specify; (d) 'broadcaster' means a person engaged in broadcast media; (e) 'Chairman' means the Chairman of the Authority; (f) 'channel' means the set of frequencies that a broadcast station occupies for broadcasting; (g) 'company' a company as defined in the Companies Act, 2017 (XIX of 2017); (h) 'copyright' means copyright as defined in the Copyright Ordinance, 1962 (XXXIV of 1962); (i) 'frequency' means the frequency of the electromagnetic wave number measured in Hertz per second and used for transmission; (j) 'licence' means a licence issued by the Authority to establish and operate a broadcast media or distribution service; (k) 'licensee' means a person to whom the Authority has issued a licence; (l) 'member' means a member of the Authority; (m) 'person' includes an individual, partnership, association, company, trust or corporation or public body; (n) 'programme' means the systematic broadcasting of visual or sound images by a broadcast station but does not include an advertisement."
        }
      ]
    },
    {
      "chapter_title": "Establishment of the Authority",
      "sections": [
        {
          "section_no": "3",
          "section_title": "Establishment of the Authority",
          "body": "(1) As soon as may be, after the commencement of this Ordinance, the Federal Government shall, by notification in the official Gazette, establish an authority to be known as the Pakistan Electronic Media Regulatory Authority (PEMRA) for carrying out the purposes of this Ordinance. (2) The Authority shall be a body corporate having perpetual succession and a common seal with powers subject to the provision of this Ordinance to hold and dispose of property by the said name, sue and be sued. (3) The principal office of the Authority shall be at Islamabad and it may set up offices at such place or places in the country as it may deem appropriate."
        }
      ]
    },
    {
      "chapter_title": "Functions of the Authority",
      "sections": [
        {
          "section_no": "4",
          "section_title": "Functions of the Authority",
          "body": "The Authority shall be responsible for regulating the establishment and operation of all broadcast media and distribution services in Pakistan established for the purpose of international, national, provincial, district, local."
        }
      ]
    }
  ],
  "source_file": "administrator0d8373dfae195c4de13b0bd012416abb.txt"
}