{
  "file": "administrator0514adf6314402fef39409941c94e967.pdf",
  "law_name": "THE ENFORCEMENT OF SHARI’AH ACT, 1991 CONTETNS 1.",
  "text": "THE ENFORCEMENT OF SHARI’AH ACT, 1991 CONTETNS 1. Short title, extent and commencement 2. Definition 3. Supremacy of Shari’ah 4. Laws to be interpreted in the light of Shari’ah 5. Observance of Shari’ah by Muslim citizens 6. Teaching of, and training in, Shari’ah etc. 7. Islamization of education 8. Islamization of economy 9. Mass media to promote Islamic values 10. Protection of life, liberty, property, etc. 11. Elimination of bribery and corruption 12. Eradication of obscenity, vulgarity, etc. 13. Eradication of social evils 14. Nizam-i-adl 15. Bait-ul-Mal (Welfare Fund) 16. Protection of the ideology of Pakistan, etc. 17. Safeguard against false imputations, etc. 18. International financial obligations, etc. 19. Fulfillment of existing obligations 20. Rights of women not to be affected 21. Laws to be enacted by Majlis-e-Shoora (Parliament) and Provincial Assembly only 22. Rules THE ENFORCEMENT OF SHARI’AH ACT, 1991 ACT NO. X of 1991 [5th June, 1991] An Act for the enforcement of the Shari’ah WHEREAS sovereignty over the entire Universe belongs to Almighty Allah alone, and the authority to be exercised by the people of Pakistan through their chosen representatives within the limits prescribed by Him is a sacred trust; AND WHEREAS Islam has been declared to be the State religion of Pakistan and it is obligatory for all Muslims to follow the Injunctions of the Holy Quran and Sunnah to regulate and order their lives in complete submission to the Divine law; AND WHEREAS the Objectives Resolution has been incorporated in the Constitution of the Islamic Republic of Pakistan as a substantive part thereof; AND WHEREAS it is one of the fundamental obligations of the Islamic State to protect the honour, life, liberty and the fundamental rights of the citizens as guaranteed under the Constitution and to ensure peace and provide inexpensive and speedy justice to people through an independent Islamic system of justice without any discrimination ; AND WHEREAS Islam enjoins establishment of social order based on the Islamic values of bidding what is right and forbidding what is wrong (amr bil Ma’roof wa nahi anil Munkar); AND WHEREAS in order to achieve the aforesaid objectives and goals, it is necessary to give to these measures constitutional and legal backing; It is hereby enacted as follows: 1. Short title, extent and commencement.— (1) This Act may be called the Enforcement of Shari’ah Act, 1991. (2) It extends to the whole of Pakistan. (3) It shall come into force at once. (4) Nothing contained in this Act shall affect the personal laws, religious freedom, traditions, customs and way of life of the non-Muslims. 2. Definition.—In this Act “Shari’ah” means the Injunctions of Islam as laid down in the Holy Quran and Sunnah. Explanation.—While interpreting and explaining the Shari’ah the recognized principles of interpretation and explanation of the Holy Quran and Sunnah shall be followed and the expositions and opinions of recognised jurists of Islam belonging to prevalent Islamic schools of jurisprudence may be taken into consideration. 3. Supremacy of Shari’ah.— (1) The Shari’ah that is to say, the Injunctions of Islam as laid down in the Holy Quran and Sunnah, shall be the supreme law of Pakistan. (2) Notwithstanding anything contained in this Act, the Judgement of any court or any other law for the time being in force, the present political system, including the Majlis-e-Shoora (Parliament) and Provincial Assemblies and the existing system of Government, shall not be challenged in any court, including Supreme Court, the Federal Shariat Court or any authority or tribunal: Provided that nothing contained herein shall affect the rights of the non-Muslims guaranteed by or under the Constitution. 4. Laws to be interpreted in the light of Shari’ah.—For the purpose of this Act— (a) while interpreting the statute-law, if more than one interpretation is possible, the one consistent with the Islamic principles and jurisprudence shall be adopted by the Court; and (b) where two or more interpretations are equally possible, the interpretation which advances the Principles of Policy and Islamic provisions in the Constitution shall be adopted by the Court. 5. Observance of Shari’ah by Muslim citizens.—All Muslim citizens of Pakistan shall observe Shari'ah and act accordingly and in this regard the Majlis-e-Shoora (Parliament) shall formulate code of conduct for Government functionaries. 6. Teaching of, and training in, Shari’ah etc.—The State shall make effective arrangements— (a) for the teaching of, and training in, the Shari’ah, Islamic jurisprudence and all other branches of Islamic law at appropriate levels of education and professional training; (b) to include courses on the Shari’ah in the syllabi of the law colleges ; (c) for the teaching of the Arabic language ; and (d) to avail the services of persons duly qualified in Shari’ah, Islamic jurisprudence and Ifta in judicial system. 7. Islamization of education.—(1) The State shall take necessary steps to ensure that the educational system of Pakistan is based on Islamic values of learning, teaching and character building. (2) The Federal Government shall, within thirty days from the commencement of this Act, appoint a Commission consisting of educationists, jurists, experts, ulema and elected representatives as it may deem fit and appoint one of them to be its Chairman. (3) The functions of the Commission shall be to examine the educational system of Pakistan to achieve the objectives referred to in sub-section (1) and make recommendations in this behalf. (4) A report containing the recommendations of the Commission shall be submitted to the Federal Government which shall cause it to be placed before both the Houses of Majlis-e-Shoora (Parliament). (5) The Commission shall have the power to conduct its proceedings and regulate its procedure in all respects as it may deem fit. (6) All executive authorities, institutions and local authorities shall act in aid of the Commission. (7) The Ministry of Education in the Government of Pakistan shall be responsible for the administrative matters relating to the Commission. 8. Islamization of economy.—(1) The State shall take steps to ensure that the economic system of Pakistan is constructed on the basis of Islamic economic objectives, principles, and priorities. (2) The Federal Government shall, within thirty days from the commencement of this Act, appoint a Commission consisting of economists, bankers, jurists, ulema, elected representatives and such other persons as it may deem fit and appoint one of them to be its Chairman. (3) The functions of the Commission shall be— (a) to recommend measures and steps, including suitable alternatives, by which the economic system enunciated by Islam could be established ; (b) to recommend the ways, means and strategy for such changes in the economic system of Pakistan so as to achieve the social and economic well being of the people as envisaged by Article 38 of the Constitution ; (c) to undertake the examination of any fiscal law or any law relating to the levy and collection of taxes and fees or banking or insurance law or practice and procedure to determine whether or not these are repugnant to the Shari’ah and to make recommendations to bring such laws, practices and procedure in conformity with the Shari’ah ; and (d) to monitor progress in respect of the Islamization of economy, identifying lapses and bottlenecks if any and suggest alternatives to remove any difficulty. (4) The Commission shall oversee the process of elimination of riba from every sphere of economic activity in the shortest possible time and also recommend such measures to the Government as would ensure the total elimination of riba from the economy. (5) The Commission shall submit its reports on a regular basis and at suitable intervals to the Federal Government which shall place the same before both the Houses of Majlis-e-Shoora (Parliament) and shall also respond to any queries sent to it by the Federal Government in respect of establishment of the Islamic economic order. (6) The Commission shall have the power to conduct its proceedings and regulate its procedure in all respects as it may deem fit. (7) All executive authorities, institutions and local authorities shall act in aid of the Commission. (8) The Ministry of Finance in the Government of Pakistan shall be responsible for the administrative matters relating to the Commission. 9. Mass media to promote Islamic values.— (1) The State shall take steps to promote Islamic values through the mass media. (2) The publication and promotion of programmes against or in derogation to the Shari’ah, including obscene material shall be forbidden. 10. Protection of life, liberty, property, etc.—In order to protect the life, honour, liberty, property and the rights of the citizens, the State shall take legislative and administrative measures to— (a) introduce administrative and police reforms; (b) prevent acts of terrorism and sabotage and disruptive activities ; and (c) prevent the possession and display of illicit arms. 11. Elimination of bribery and corruption.—The State shall take legislative and administrative measures, to eliminate bribery, corruption and malpractices and provide for exemplary punishment for such offences. 12. Eradication of obscenity, vulgarity, etc.—Effective legal and administrative measures shall be taken by the State to eradicate obscenity, vulgarity and other moral vices. 13. Eradication of social evils.—The State shall take effective measures for enactment of law eradicating social evils and promoting Islamic virtues on the principles of amr bil Ma’roof wa nahi’anil Munkar as laid down in the Holy Quran. 14. Nizam-i-adl.—The State shall take adequate measures for the Islamisation of the Judicial system by eliminating laws delays, multiplicity of proceedings in different courts, litigation expenses and ensuring the quest for truth by the court. 15. Bait-ul-Mal (Welfare Fund).—The State shall take steps to set-up a Bait-ul-Mal for providing assistance to the poor, needy, helpless, handicapped, invalids, widows, orphans and the destitute. 16. Protection of the ideology of Pakistan, etc.—The State shall enact laws to protect the ideology, solidarity and integrity of Pakistan as an Islamic State. 17. Safeguard against false imputations, etc.—The State shall take legislative and administrative measures to protect the honour and reputation of the citizens against false imputations, character assassination and violation of privacy. 18. International financial obligations, etc.—Notwithstanding anything contained in this Act or any decision of any court, till an alternative economic system is introduced, financial obligations incurred and contracts made between a National Institution and a Foreign Agency shall continue to, remain, and be, valid, binding and operative. Explanation.—In this section, the expression “National Institution” shall include the Federal Government or a Provincial Government, a statutory corporation, company, institution, body, enterprise or any person in Pakistan and the expression “Foreign Agency” shall include a foreign government, a foreign financial institution, foreign capital market, including a bank and any foreign lending agency, including an individual and a supplier of goods and services. 19. Fulfillment of existing obligations.—Nothing contained in this Act or any decision made thereunder shall affect the validity of any financial obligations incurred, including under any instruments, whether contractual or otherwise, promise to pay, or any other financial commitments made by or on behalf of the Federal Government or a Provincial Government or a financial or statutory corporation or other institution to make payments envisaged therein, and all such obligations promises and commitments shall be valid, binding and operative till an alternative economic system is evolved. 20. Rights of women not to be affected.—Notwithstanding anything contained in this Act, the rights of women as guaranteed by the Constitution shall not be affected. 21. Laws to be enacted by Majlis-e-Shoora (Parliament) and Provincial Assembly only.— Notwithstanding anything contained in this Act or the judgement of any court, including the Supreme Court, all laws shall be enacted exclusively by the Majlis-e-Shoora (Parliament) and the Provincial Assembly, as the case may be, and no law shall be made or be deemed to have been made unless it is made in the manner laid down in the Constitution. 22. Rules.—The Federal Government may, by notification in the official gazette, make rules for carrying out the purposes of this Act. ________ 71994 RGN Date: 17-01-2025"
}