{
  "file": "administrator5041ac28656c3fb28458b9dea67d7702.pdf",
  "law_name": "The Pakistan Institute Of Engineering And Applied Sciences Ordinance, 2000",
  "text": "THE PAKISTAN INSTITUTE OF ENGINEERING AND APPLIED SCIENCES ORDINANCE, 2000 CONTENTS 1. Short title and commencement 2. Definition 3. Establishment of the Institute 4. Powers of the Institute 5. Officers of the Institute 6. Chancellor 7. Rector 8. Pro-Rector 9. Board of Governors 10. Powers and functions of the Board 11. Meetings of the Boards 12. Delegation of Powers 13. Committees 14. Academic and Administrative employees 15. Fund of the Institute 16. Audit and accounts 17. Declaration of fidelity and secrecy 18. Institute open to all classes, creeds etc. 19. Discoveries and inventions to vest in the Institute 20. Budget 21. Indemnity 22. Transfer of assets and liabilities etc. 23. Removal of difficulties etc. 24. Power to make rules THE PAKISTAN INSTITUTE OF ENGINEERING AND APPLIED SCIENCES ORDINANCE, 2000 ORDINANCE No. X of 2000 [22nd March, 2000] An Ordinance to confer on the Pakistan Institute of Engineering and Applied Sciences, Islamabad, the power to award degrees WHEREAS it is expedient to confer on the Pakistan Institute of Engineering and Applied Sciences, Islamabad, the power to award degrees and to provide for matters connected there with or ancillary thereto; AND WHEREAS the National Assembly and the Senate stand suspended in pursuance of the Proclamation of Emergency of the Fourteenth day of October, 1999, and the Provisional Constitution Order No. 1 as amended; AND WHEREAS the President is satisfied that circumstances exist which render it necessary to take immediate action; NOW, THEREFORE, in pursuance of Proclamation of the fourteenth day of October, 1999, and Provisional Constitution Order No. 1 of 1999, as amended, as well as Order No. 9 of 1999, and in exercise of all powers enabling him in that behalf, the President of the Islamic Republic of Pakistan is pleased to make and promulgate the following Ordinance:― 1. Short title and commencement:___ (1) This Ordinance may be called the Pakistan Institute of Engineering and Applied Sciences Ordinance, 2000. (2) It shall come into force at once. 2. Definition:___ In this Ordinance, unless there is anything repugnant in the subject or context,— (a) “Board” means the Board of Governors of the Institute constituted under section 9; (b) “Chairman” means the Chairman of the Board; (c) “Chancellor” means the Chancellor of the Institute; (d) “Commission” means the Pakistan Atomic Energy Commission established under the Pakistan Atomic Energy Commission Ordinance, 1965; (XVII of 1965) (e) “Institute” means the Pakistan Institute of Engineering and Applied Sciences notified as such vide Pakistan Atomic Energy Commission's Circular No. 19(116)/97-l, dated the 5th December, 1997; (f) “prescribed” means prescribed by Rules; (g) “Pro-Rector” means the Pro-Rector of the Institute appointed under section 8; (h) “Rector” means the Rector of the Institute appointed under section 7; and (i) “Rules” means the Rules made under this Ordinance. 3. Establishment of the Institute:___ The Pakistan Institute of Engineering and Applied Sciences, Islamabad, as reconstituted in accordance with the provisions of this Ordinance shall be a body corporate having perpetual succession and a common seal with power to acquire, hold and dispose off property, both movable and immovable and shall by the said name sue and be sued. 4. Powers of the Institute:___ The Institute shall have powers― (a) to provide for instruction and training in engineering and applied sciences including medicine and any other discipline; (b) to prescribe courses of study for all the educational and training programmes offered at the Institute, and approve courses of study offered by its affiliates; (c) to decide teaching methods and strategies in order to ensure the most effective educational and training programmes; (d) to specify selection criteria, admit and examine students, hold examinations and confer or award degrees, diplomas, certificates, academic and research prizes and distinctions on and to persons who fulfil the requirements or have passed its examinations in accordance with such conditions as may be prescribed by rules; (e) to provide for the teaching of specified courses and training for persons not being the students of the Institute and grant certificates and diplomas to such persons, pursue and make provisions for research, innovations, inventions, demonstrations and other services as it may deem fit; (f) to ensure technical excellence and promote humanitarian values among its students; (g) to establish and maintain campuses for the effective discharge of its functions and responsibilities anywhere in Pakistan; (h) to undertake joint investigation and collaborative research in the field of engineering, applied sciences and other allied disciplines; (i) to provide assistance to industry, Government institutions and organisations in the country and abroad through expert advice, consultation or in any other manner as it may deem fit; (j) to promote contact, establish liaison and enter into agreements, contracts and arrangements with national and international universities, institutions and other research and development organisations within the country and abroad for effective discharge of its functions and responsibilities; (k) to affiliate or associate itself with other institutions in Pakistan or abroad and allow affiliation to other institutions with itself; (l) to print, publish and circulate periodicals, journals, magazines, monographs, books, and disseminate scientific, technological and other related knowledge and information conducive to the attainment of any of the objectives of the Institute; (m) to award fellowships, scholarships, stipends, bursaries, medals and prizes; (n) to confer, in the prescribed manner, honorary degrees; (o) to confer, in the prescribed manner, the status of 'professor emeritus' on distinguished scholars and determine appropriate remuneration for them; (p) to establish Chairs in various disciplines within the Institute that may be funded through its own resources or by individuals or organisations from within the country or abroad; (q) to supervise and control the discipline of the students of the Institute; (r) to promote extra-curricular and recreational activities of its students, and to make arrangements for promoting their health and general welfare; (s) to perform internal security functions within its premises; (t) to charge and receive such fees and other payments as it may determine; (u) to accept and receive donations, contributions, subscriptions, aid and grants made by individuals and organisations, both national and foreign; (v) to use its financial and other resources to the fullest extent for the execution of its programmes; and (w) to do all such acts and things as may be required to improve its objectives and perform its functions. 5. Officers of the Institute:___ The following shall be the officers of the Institute, namely:— (i) the Chancellor; (ii) the Rector; (iii) the Pro-Rector; and (iv) such other officers as may be appointed by the Board. 6. Chancellor:___ (1) The President of the Islamic Republic of Pakistan shall be the Chancellor of the institute. (2) The Chancellor shall preside over the convocations of the Institute and, in his absence, the Chairman shall preside. (3) Every proposal to confer an honorary degree shall be subject to confirmation by the Chancellor. 7. Rector:___ (1) The Chancellor shall, on the recommendation of the Chairman, appoint an educationist of distinction as Rector for such period and on such terms and conditions as he may determine. (2) The Rector shall be the executive and academic head of the Institute and shall exercise general control and supervision over its affairs. (3) The Rector shall be the executive and academic head of the Institute and shall exercise general control and supervision over its affairs. 8. Pro-Rector:___ (1) The Pro-Rector shall be appointed by the Board, and shall act as the Secretary of the Board. (2) In the absence of the Rector he shall act as Rector. (3) The Pro-Rector shall assist the Rector in particular, on matters relating to teaching, research, academic programme and development projects. 9. Board of Governors:___ (1) The overall control of the Institute shall vest in the Board of Governors subject to such conditions and restrictions as the Commission may deem fit. (2) The Board shall consist of the following ex-officio members, namely:— (i) Chairman, Pakistan Atomic Energy Commission, who shall also be the Chairman of the Board; (ii) all full-time members of the Pakistan Atomic Energy Commission; (iii) Secretary, Ministry of Education; (iv) Secretary, Ministry of Science and Technology; (v) Chairman, University Grants Commission, or his nominee of the rank of a full time member; (vi) Vice-Chancellor, Quaid-i-Azam University; (vii) Rector, National University of Science and Technology; (viii) Chairman, Pakistan Engineering Council; (ix) Chairman, Pakistan Medical and Dental Council; and (x) Rector. (3) The following shall be nominated members of the Board, namely:— (a) two eminent engineers; (b) two prominent scientists; (c) two distinguished persons known for their learning and experience in the field of management, industry or related fields of interest; and (d) two faculty members of the Institute. (4) A nominated member of the Board shall be nominated by the Chairman in consultation with the Rector. (5) A nominated member of the Board shall, unless the Chairman, with the approval of the Commission, terminates his membership earlier, hold office for a term of three years and shall be eligible for renomination on the expiry of his term. (6) The office of a nominated member of the Board shall become vacant if he resigns or fails to attend three consecutive meetings of the Board without sufficient cause or leave of absence. (7) A casual vacancy in the office of a nominated member of the Board shall be filled by a person nominated by the Chairman with approval of the Commission. (8) No act or proceedings of the Board shall be invalid by reason only of the existence of a vacancy in, or any defect in the constitution of, the Board. 10. Powers and functions of the Board:___ The Board shall exercise and perform the following powers and functions, namely:— (a) to recommend all such activities as may be required for the furtherance of the objectives; (b) to approve the creation of new components of the Institute such as school, department, faculty, division, centre or any other teaching or research unit with the approval of the Commission; (c) to undertake responsibility for the financial integrity of the Institute, for ensuring effectiveness of its future operations; (d) to formulate or approve long-term strategies, policies and plans governing the activities and operation of the Institute so as to ensure its autonomy in teaching, research and other academic work; (e) to approve the annual budget of the Institute; (f) to call for annual, bi-annual or quarterly progress reports relating to the activities of the Institute and execution of the approved work plans to review the progress and direct the Rector to furnish information relating to any matter; (g) to recommend to the Commission the creation of such administrative and academic posts on specified terms and conditions as may be deemed necessary for the performance of its function and to approve appointment to such posts on the recommendations of a duly constituted Selection Committee; (h) to approve all affiliations and other arrangements through which universities and other research and development organizations may become associated with the Institute; (i) to authorise when required, the mobility of qualified staff among universities, research organisations and other bodies, provided that the rights and privileges of the staff under this arrangement shall be protected; (j) to perform such other functions and exercise such other powers as may be specified by the Commission. 11. Meetings of the Boards:___ (1) The Board shall meet at least twice in a year on dates to be fixed by the Chairman: Provided that a special meeting may be called at any time at the request of not less than five members of the Board to consider any matter of an urgent nature. (2) The Chairman shall, preside over the meeting of the Board and in his absence, a member nominated by him shall preside. (3) The quorum for a meeting of the Board shall be one half of its members, a fraction being counted as one, and out of which not less than four shall be the nominated members. (4) The decision of the Board shall be expressed in terms of the views of the majority of the members present and voting and, if the members are equally divided, the Presiding Officer of the Board shall have and exercise a casting vote. 12. Delegation of Powers:___The Board may, by general or special order in writing, direct that such of its powers shall, in such circumstances and under such conditions, if any, as may be specified in the order, be exercisable by members of the Board or officers of the Institute as it may specify. 13. Committees:___ (1) The Board may constitute the following committees, namely:— (i) the Executive Committee; (ii) the Academic Committee; (iii) the Finance Committee; and (iv) any other committee that may be needed (2) The constitution, function and powers of the committees shall be such as may be prescribed. (3) The decision of the Committees shall be subject to the approval of the Board. 14. Academic and Administrative employees:___(1) The regular technical, academic and administrative employees of the Commission may be transferred to work at the Institute as may be prescribed by rules and such employees shall be governed by the service regulations of the Commission. (2) The Board may authorise grant of additional remuneration and privileges to the employees working at the Institute as it may deem fit. (3) The Institute may continue to exercise such powers of recruitment, appointments and promotion as may be prescribed by the Commission from time to time. (4) The Board may make appointment on contract basis on such terms and conditions as may be prescribed by rules. 15. Fund of the Institute:___ The Institute shall have a fund to which shall be credited:— (i) all grants and contributions made by the Commission; (ii) donations, subscriptions, aid and grants made by the donors; (iii) aid, grants and other forms of assistance by the Federal Government, Provincial Governments and local bodies, national and international institutions, organisations and agencies; and (iv) fees, remuneration, charges for any service rendered, sale proceeds, royalties on publications, commission and receipts from any other source. 16. Audit and accounts:___ (I) The accounts of the Institute shall be maintained in such form and manner as the Federal Government in consultation with the Auditor General of Pakistan, determine. (2) The accounts of the Institute shall be audited by an Auditor who is a Chartered Accountant within the meaning of the Chartered Accountants Ordinance, 1961, (X of 1961) and is appointed by the Federal Government in consultation with Auditor General of Pakistan on such remuneration, to be paid by the Institute, as the Federal Government may fix. 17. Declaration of fidelity and secrecy:___ Every member of the Board, officer or other employee of the Institute shall make such declaration of fidelity and secrecy as may be prescribed by rules. 18. Institute open to all classes, creeds etc.:___The Institute shall be open to all persons of either sex of whatever religion, race, colour or domicile who are academically qualified for admission to the courses of study offered by the Institute based on the criteria and policy determined by the Board and no person shall be denied the privileges of the Institute on the ground only of sex, religion, race, class, colour or domicile. 19. Discoveries and inventions to vest in the Institute:___ All rights relating to discoveries and inventions and any improvements in materials, methods, processes, apparatus or equipment made by any officer or employee of the Institute in the course of his employment shall vest in the Institute. 20. Budget:___ (1) The Institute shall, in each year, submit to the Board for approval a budget by such date and in the form as may be prescribed by rules, for each financial year, showing the estimated receipts and expenditure and the sums which are likely to be required from the Federal Government during the financial year. (2) The Institute may open accounts in any scheduled bank in Pakistan. 21. Indemnity:___ No suit, prosecution or other legal proceeding shall lie against the Institute, Commission or any officer of the Institute for anything which is done or intended to be done in good faith under this Ordinance. 22. Transfer of assets and liabilities etc.:___ Upon the commencement of this Ordinance,— (a) everything done, action taken, obligations and liabilities incurred, persons appointed or authorised, fellowships or scholarships instituted and orders issued prior to such commencement shall be continued and, so far as may be, be deemed to have been respectively done, taken, incurred, appointed or authorised, instituted or issued by the Institute; (b) all monies and properties held by the Institute immediately before such commencement shall stand transferred to, and vest in, the Institute; and (c) all laws, rules, regulations and bye-laws applicable to the Institute shall, in so far as they are not inconsistent with the provisions of this Ordinance, continue to be in force until they are repealed, rescinded or modified under this Ordinance. 23. Removal of difficulties, etc.:___If any difficulty arises in giving effect to any of the provisions of this Ordinance, the Commission may make such order, not inconsistent with the provisions of this Ordinance, as may appear to be necessary for removing such difficulty. 24. Power to make rules:___The Board may, with approval of the Commission, make rules for carrying out the purposes of this Ordinance. ___________"
}