{
  "file": "administratorfd19eec0a97080f151dac2a8406dea88.pdf",
  "law_name": "The Zakat And Ushr Ordinance, 1980",
  "text": "THE ZAKAT AND USHR ORDINANCE, 1980 CONTENTS __________ CHAPTER-I PRELIMINARY 1. Short title, extent, application and commencement. 2. Definitions. CHAPTER-II ZAKAT 3. Charge and Collection of Zakat. 4. Secretary of information. CHAPTER-III USHR 5. Charge and collection of Ushr. 6. Mode of assessment and collection of Ushr. CHAPTER-IV ZAKAT FUNDS 7. Establishment of Zakat Funds. 8. Utilization of Zakat Funds. 9. Disbursement from Zakat Funds. 10. Accounts. 11. Audit. CHAPTER-V ORGANIZATION AND ADMINISTRATION 12. Central Zakat Council. 13. Administrator-General. 14. Provincial Zakat Council. 15. Chief Administrator. 16. District Zakat and Ushr Committee. 17. Tehsil, Taluqa or Sub-divisional Zakat and Ushr Committee or Town Zakat and Ushr committee. 18. Local Zakat and Ushr Committee. 19. Vacancy etc., not to invalidate acts or proceedings. 19A. Members of Council and other Committees to be Muslims. 20. Person to preside at meetings in the absence of Chairman. 21. Power of supersession and removal. 21-A. Vote of no confidence. 22. Administrative orginazation. 23. Certain persons to be public servants. CHAPTER-VI MISCELLANEOUS 24. Exemption. 25. Certain tax concessions. 26. Power to make rules. 27. Power to call for information and issue directions. 28. Indemnity and bar of jurisdiction. 29. Removal of difficulties. 29A. Dissolution and reconstitution of Committees. 30. Repeal. FIRST SCHEDULE SECOND SCHEDULE _________________________ THE ZAKAT AND USHR ORDINANCE, 1980 1ORDINANCE No.XVIII OF 1980 [20th June, 1980] An Ordinance to make provisions relating to the assessment collection and disbursement of Zakat and Ushr WHEREAS it is necessary to make provisions relating to the assessment, collection and disbursement of Zakat and Ushr and matters connected therewith or incidental thereto; AND WHEREAS Pakistan, Being an Islamic State, must provide for the implementation of Islamic precepts; AND WHEREAS the Constitution of the Islamic Republic of Pakistan lays down that the Muslims of Pakistan shall be enabled to order their lives in the individual and collective spheres, in accordance with the tenets of Islam ; AND WHEREAS Zakat, including Ushr, is one of the fundamental pillars (arkan) of Islam; AND WHEREAS the prime objective of the collection of Zakat and Ushr and disbursements therefrom, is to assist the needy, the indigent and the poor; AND WHEREAS the rates of Zakat and Ushr, as also the purposes for the utilization of Zakat and Ushr, are specified in Shariah; AND WHEREAS Shariah enjoins all Muslims who are Sahib-e-Nisab to pay, and the State to arrange for the proper collection, disbursement and utilization of, Zakat and Ushr, and also allows such Muslims to disburse for the purposes authorized by Shariah the part thereof not collected by the State; AND WHEREAS the Constitution also provides, in Article 31, that the State shall endeavour, as respects the Muslims of Pakistan, to secure, inter alia, the proper organisation of Zakat. AND WHEREAS the President is satisfied that circumstances exist which render it necessary to take immediate action; NOW, THEREFORE, in pursuance of the proclamation of the fifth day of July, 1977, read with the Laws (Continuance in Force) Order, 1977 (C. M. L. A. Order No. 1 of 1977), and in exercise of all powers enabling him in that behalf, the President is pleased to make and promulgate the following Ordinance : — 1This Ordinance has been applied to the-Provincially Administered Tribal Areas of the Province of Baluchistan, see Notification No. S.O. (TA-3/46/79, dated 5-7-1980, see Gaz., of Baluchistan, Ext.. dated 5-7-1980 (Issue No. 152). This Ordinance (The Zakat and Ushr Ordinance) has been applied to the Provincially Administered Tribal Areas of the N.W.F.P., by Notification No. Legis : l(9)/70, vol, IV, dated 9-10-1980, see N.W.F.P.Gaz., Ext., dated, 13-10-1980, page 212. This Ordinance has been applied to the Northern Areas, vide S.R.0.951 (1 )/91, dated 23-9-1991, see Gaz., of P., 1991. Ext. Pt. II, p. 2462. CHAPTER-I PRELIMINARY 1. Short title, extent, application and commencement. —(1) This Ordinance may be called the Zakat and Ushr Ordinance, 1980. (2) It extends to the whole of Pakistan, but 1[as regards payment and recovery of Zakat and Ushr] applies only to Muslim citizens of Pakistan and a company, or other association of persons, or body of individuals, whether incorporated or not, majority of the shares of which is owned, or the beneficial ownership of which is held, by such citizens. 2[2A) The Federal Government may, by notification in the official Gazette, direct that this Ordinance shall also apply to any other territories or areas specified in the notification, subject to such exceptions and modification as may be so specified]. (3) In respect of a person who may believe that the whole or any part of the recoveries effected from him in the manner laid down in this Ordinance are not according to his belief, such recoveries shall nevertheless be made, but shall be deemed to be contribution to Zakat Fund on the part of that person 3[:] 4[Provided that— (a) no Zakat or Ushr shall be charged or collected on compulsory basis in respect of the assets or the produce of a person who, not less than thirty days preceding the Valuation Date in the case of Zakat, and at any time before the Valuation Date in the case of Ushr, files with the Deducting Agency, or with the Local Committee in the case of Ushr, a declaration, or an attested copy thereof, in the prescribed form, sworn by him before a magistrate, on Oath Commissioner, a notary public, or any other person authorised to administer oath, in the presence of two witnesses who identify him, to the effect that he is a Muslim and a follower of one of the recognised fiqhs which he shall specify in the declaration, and that his faith and the said fiqh do not oblige him to pay the whole or any part of Zakat or Ushr in the manner laid down in this Ordinance ; and (b) a declaration, or an attested copy thereof, filed as aforesaid in one Zakat year, whether before or after the commencement of the Zakat and Ushr (Third Amendment) Ordinance, 1983, shall continue to be valid for so long as— (i) the declaration or copy, and the asset liable to Zakat to which it relates, remain in the custody of the Deducting Agency ;or (ii) the person filing the declaration or copy continues to hold, in respect of the land to the produce of which it relates, the same status as he held at the time of filing the declaration, and the declaration or copy remains in the custody of the Local Committee.] ; _________________________________________________________________________________ 1Ins. by the Zakat and Ushr (Amdt.) Ordinance, 1980 (52 of 1980), s. 2. 2Ins. by the Finance Act, 1990 (7 of 1990),s.8. 3Subs, by the Zakat and Ushr (Amdt.) Ordinance 1980, (52 of 1980), s. 2. for the full-stop. 4Provisos which was previously added ibid., has been subs. by the Zakat and Ushr (Third Amendment) Ordinance, 1983 (26 of 1983), s. 2. Provided further that where for any reason Zakat or Ushr is collected on compulsory basis from such a person and he does not wish to leave it in the Zakat Fund as saddaqah or khairat in the name of Allah as a manifestation of the unity of the Ummah and claims refund, on the basis of a declaration as aforesaid filed by him within the period specified in first proviso or within such further period as may be prescribed, the amount so collected shall be refunded to him in the prescribed manner.] Explanation.—In this Ordinance, reference to Zakat deductible at source or to Ushr realizable on compulsory basis shall be construed to imply a reference to contributions to Zakat Fund also. 1[3A) The Federal Shariat Court may, on the application of any person, decide the question whether a declaration such as is referred to in the first or second proviso to sub-section (3) made by any person is valid according to the fiqh he professes to follow ; and, if the Federal Shariat Court decides that the declaration is not valid, such person shall, without prejudice to any other action that may be taken against him under anyother law, be liable to pay Zakat or Ushr, as the case may be, in the manner laid down in this Ordinance.] (4) It shall come into force on such date2 as the Federal Government may, by notification in the official Gazette, appoint, and different dates may be appointed for different provisions of this Ordinance. 2. Definitions. In this Ordinance, unless there is anything repugnant in the subject or context,— (i) “Administrator-General” means the person appointed as such under section 13, and includes an officer authorised by him to exercise or perform any power or function of Administrator-General under this Ordinance; (ii) “annuity” means the sum payable periodically, according to the annuity policy conditions, to an annuitant during his life-time, or for a fixed number of years, as the case may be, and includes the scheme of postal annuities as notified by the Government; (iii) “assets” means assets liable to Zakat as provided in this Ordinance; (iv) “attiyat” means voluntary donations to the Zakat Funds, otherwise than on account of Zakat or Ushr, and includes sadaqat-e-nafilah ; (v) “Central Council” means the Council established under section 12; (vi) “Chief Administrator” means a person appoint as such under section 15, and includes an officer authorised by him to exercise or perform any power or function of Chief Administrator under this Ordinance; _________________________________________________________________________________ 1New sub-section (3A) was ins. by the Zakat and Ushr (Amdt.) Ordinance, 1980 (52 of 1980), s. 2. 2I.e 20-6-1980 (except the provisions of Ushr) “see Notification No. 395 A- 18, dated, 20-6 -1980, Gaz. of Pakistan, Ext., Part-Ill, page 171. 3For provisions of Ushr w.e.f. 15th day of March, 1983 (excluding the sugarcane crop of the year 1982 which is harvested after the aforesaid date) see the Gazelle of Pakistan, 1983, Islamabad Part-1II, dated, 5-2-1983. (vii) “company” means a company as defined in Companies Act, 1913 (VII of 1913); (viii) “Deducting Agency” means a bank, post office or other institution referred to in the sixth column of the First Schedule; (ix) “Deduction Date” means, in respect of the assets mentioned in the First Schedule, the date or dates on which Zakat is to be deducted at source and which is or are specified in the fifth column of that Schedule; (x) “District Committee means a Committee constituted under section 16 1[or, in the case of the Islamabad Capital Territory, the Islamabad Zakat and Ushr Committee] ; (xi) “Government security” has the same meaning as in the Securities Act, 1920 (X of 1920); 2[(xia) “Institution” “means deeni-madaris, educational, vocational and social welfare institutions, public hospitals, charitable institutions and other institutions providing health-care;]; (xii) “insurer” means the State Life Insurance Corporation of Pakistan or Postal Life Insurance ; (xiii) “Local Committee” means a Committee constituted under section 18 ; (xiv) “locality” means the area within the jurisdiction of a Local Committee; (xv) “maturity value” means the sum payable, according to stipulated conditions, on survival of the life assured to the specified age or to the end of the term of the policy; 3[(xva) “nisab”, in relation to assets liable to Zakat, except agricultural produce and animals fed free in pastures, means 612.32 grams of silver, or cash or gold, or goods for trade, or any assets liable to Zakat under Shariah, the aggregate value of which is equal to the value of 612.32 grams of silver, as notified by the Administrator-General for each Zakat year or, in the case of a person whose assets liable to Zakat consist only of gold, 87.48 grams of gold;] (xvi) “prescribed” means prescribed by rules; (xvii) “produce” means gross agricultural, horticultural or forest produce; (xviii) “Provident Fund” has the same meaning as in the Provident Funds Act, 1925 (XIX of 1925); _________________________________________________________________________________ 1Added by the Finance Act, 1994, (12 of 1994) s. 8. 2Ins. ibid., s. 8. 3New cl. (xva) was ins. by the Zakat and Ushr (Amdt.) Ordinance, 1980 (52 of 1980). s.3. 1[(xix) “Provincial Council” means a Council constituted under section 14;] (xx) “recognised Provident Fund” means a Provident Fund recognised as such, by the competent authority, under the Income-Tax Ordinance, 1979 (XXXI of 1979); (xxi) “return” means income, howsoever described, accruing on an asset; (xxii) “rules” means rules made under this Ordinance; 2[(xxiii) “sahib-e-nisab” means a person who owns or possesses assets not less than nisab, but does not include— (a) the Federal Government, a Provincial Government or a local authority; (b) a statutory corporation, a company or other enterprise, owned wholly, directly or indirectly, by the Federal Government, a Provincial Government, a local authority or a corporation owned by the Federal Government or a Provincial Government, either singly or jointly with one or more of the other three; (c) a subsidiary of a statutory corporation, a company or other enterprise referred to in sub-clause (b) and wholly owned by it; (d) the National Investment (Unit) Trust; (e) an ICP Mutual Fund; (f) a recognised Provident Fund; (g) any Unit Fund maintained by the Defence Services, including the Civil Armed Forces; (h) a Zakat Fund; (i) an institution, fund, trust, endowment or society___ (a) registered as a charitable organization under the Societies Registration Act, 1860, or as a company under section 26 of the Companies Act, 1913, or registered or approved as a charitable or social welfare organisation under any other law for the time being in force, and (b) approved by the Central Board of Revenue for the purposes of section 47 of the Income Tax Ordinance, 1979 (XXXI of 1979); 1Added by the Zakat and Ushr (Amdt.) Act, 1997 (10 of 1997) s. 2, which was previously omitted by Act, 12 of 1994, s. 6. 2Subs, by the Zakat and Ushr (Amdt.) Ordinance, 1980 (52 of 1980), s. 3, for the original cl. (xxiii). (j) a deeni madrasah registered as such by the Auqaf Department; (k) a mosque ; (l) an orphanage registered as such under the law relating to orphanages ; (m) a Workers Participation Fund established under the Companies Profits (Workers Participation) Act, 1968 (XII of 1968); or (n) amount of a party to a suit or case kept with or under the orders of a court pending decision of the suit or case ;] (xxiv) “security” means any stock, share, scrip, debenture, bond, pre-organisation certificate, or instrument commonly known as security; (xxv) “share” means a share in the share-capital of a company, or in any body corporate established by or under a Federal law or a Provincial law, and includes stock; 1[(xxvi) “sub-division” means a sub-division of a district as notified by the Provincial Government] (xxvii) “surrender value” means the sum payable by an insurer on cancellation of a life-insurance policy or annuity, according to stipulated terms and conditions, at any time before maturity benefits become available; (xxviii) “survival benefit” means the amount payable according to life-insurance policy conditions, during the currency of a policy, on survival of the life assured to the specified date as stipulated in the policy; 2[(xxix) “Taluqa Committee” or “Sub-divisional Committee” 3[or Town committee] means a committee constituted under section 17 ;] 4[(xxixa) “Tehsil Committee” means a Tehsil committee constituted under section 17 or, in the case of the Islamabad Capital Territory, the Islamabad Zakat and Ushr Committee;] 5[(xxx) “Valuation Date” means— (a) in respect of assets liable to Zakat, the first day of the Zakat year ; and (b) in respect of produce liable to Ushr, such date or dates as may be prescribed or as may be notified by the Administrator-General or by a Chief Administrator within his jurisdiction ; 1Subs by the Finance Act 1994, (12 of 1994) s. 8, for the original clause (xxvi). 2Added by the Zakat and Ushr (Amdt.) Act 1997. (10 of 1997) s. 2, which was previously omitted by Act 12 of 1994, s. 8. 3Inserted by ord. 35 of 2002,s.2.(except ICT). 4Added by the zakat and Ushar (Amdt.) Act, 1997,(10 of 1997), s. 2. 5Subs. by the Zakat and Ushr (Amdt.) Ordinance, 1980 (52 of 1980), s. 3, for “ the original cl. (xxx). (xxxi) “Zakat Fund” means a Fund established under section 7 ; and (xxxii) “Zakat year” means year according to the Hijra calendar for which Zakat is chargeable, commencing on the first day of Ramadhan-ul-Mubarak and ending with the last day of the following Sha”ban-ul-Moazzam; Provided that the first Zakat year shall commence with the com- mencement of this Ordinance and end with the last day of Sha”ban-ul- Moazzam, 1401 A. H. __________ CHAPTER-II ZAKAT 3. Charge and collection of Zakat.— (1) Subject to the other provisions of this Ordinance, Zakat in respect of assets mentioned in the First Schedule shall be charged and collected, on compulsory basis, for each Zakat year, at the rates and in the manner specified therein, and as may be prescribed, from every person 1[who is on the valuation Date, and has for the preceding Zakat year been, sahib-e-nisab] : Provided that where an asset mentioned in the First Schedule has been assigned by the person owning or possessing it, in favour of another person, Zakat in respect of that asset shall be charged and collected on compulsory basis as if the asset had not been so assigned [:]2 3[Provided further that, if an asset was owned or possessed by a person on the Valuation Date but is owned or possessed by some other person on the Deduction Date, the Zakat on such asset shall be charged and collected from such other person on behalf of the person owning or possessing it on the Valuation Date : Provided further that, if a person proves in the prescribed manner to the satisfaction of the Local Committee of the locality where he ordinarily resides that he was not a sahib-e-nisab on the Valuation Date or was not in ownership or possession of assets of the value of nisab for the whole of the preceding Zakat year, Zakat shall not be so charged and collected from him, or if collected shall be refunded to him in the prescribed manner : Provided further that no Zakat shall be charged and collected from the assets of a person who died on or before the Deduction Date 4[:] 4[Provided further that no Zakat shall be charged or collected on compulsory basis in respect of any of the assets mentioned in the First Schedule which— (a) have been acquired against payment in foreign currency; or ________________________________________________________________________ 1Subs, by the Zakat and Ushr (Amdt.) Ordinance, 1980 (52 of 1980), s. 4, for certain original words. 2Subs. ibid., for full-stop. 3Provisos added ibid., 4Subs, and added by the Zakat and Ushr (Amdt.) Ordinance, 1984 (46 of 1984), s. 2. (b) are maintained in foreign currency ; and the return on which, and the value on encashment, redemption or withdrawal of which, is payable in foreign currency 1[:] 1[Provided further that the Federal Government may, by notification in the official Gazette, exempt any class of bonds or certificates issued by the Federal Government or a statutory corporation a company or other enterprise, owned, directly or indirectly by the Federal Government, a Provincial government, a Local authority or a corporation owned by the Federal Government or a Provincial Government, either singly or jointly with one or more of the other three, from deduction of Zakat on compulsory basis.] (2) In determining the amount to be collected as Zakat on compulsory basis, the value of an asset on which Zakat is deductible at source may be reduced, to the extent and in the manner prescribed, only on account of debts which have been— (a) primarily secured by that asset ; (b) used for the creation of an asset on which Zakat is deductible at source ; and (c) obtained from the Deducting Agency having custody of the asset securing the debt 2* * * and of the asset created under clause (b). 3[(3) Where a person from whom Zakat has been deducted at source— (a) proves that— (i) he is not a Muslim, or (ii) he is not a citizen of Pakistan, or- (iii) the amount deducted from him is more than what is due under this Ordinance, either on account of an error apparent from the record, or on account of reduction provided for in sub-section (2) not having been duly allowed to him, or (iv) he falls under any of the exclusion given in sub clauses (a) to (n) of clause (xxiii) of section 2, or (b) proves, as laid down in the third proviso to sub-section (1), that he is not a sahib-e-nisab or was not in ownership or possession of nisab for the whole of the preceding Zakat year, or (c) files-a declaration such as is refereed to in the second proviso to sub-section (3) of section 1, which has not been challenged in the Federal Shariat Court under subsection (3A) of that section, and claims refund, the amount so deducted or, as the case may be, the amount so deducted in excess shall be refunded to him in the prescribed manner.]; and (4) Where the recovery of Zakat deductible at source in respect of any of the assets mentioned in the First Schedule, falls into arrears, the Administrator-General may forward to the Collector of the district concerned a duly signed certificate specifying the amount of arrears due and the particulars of the person from whom, due, and the Collector shall, on receipt of such certificate, proceed to recover the amount so specified, as if it were an arrears of land revenue. 1Subs. and added by the Finance Act, 1987 (6 of 1987), s. 11. 2The words and brackets “in clause (a),” omitted by the Zakat and Ushr (Amdt.) Ordinance, 1980 (52 of 1980), s. 4. 3Subs. ibid., for sub-section (3). (5) A Sahib-e-nisab may pay either to a Zakat Fund or directly to those eligible under Shariah to receive Zakat so much of the Zakat due under Shariah as is not deductible at source under this Ordinance, for example, that due in respect of assets mentioned in the Second Schedule. 1[(6) Any amount deducted at source by the Deducting Agency from any person shall be treated as payment of Zakat on behalf of such person or, in the case of a person referred to in sub-- section (3) of section 1, as contribution to Zakat Fund or Sadqah or khairat in the name of Allah, as the case may be, on the part of that person.] 4. Secretary of information.— Any information furnished or collected in connection with the deduction of Zakat at source under this Ordinance shall be treated as secret and shall not be used for any other purpose, including the assessment or collection of any tax. __________ CHAPTER-III USHR 5. Charge and collection of Ushr.— (1) Subject to the other provisions of this Ordinance, there shall be charged and collected, on compulsory basis, in such manner as is laid down in section 6, and as may be prescribed, from every land-owner, grantee, allottee, lessee, lease holder or land- holder (other than a person excluded from the definition of sahib-e-nisab) Ushr at the rate of five per cent of his share of the produce, as on the Valuation Date: Provided that if any plot of land is used principally for growing one crop and a small portion thereof, not exceeding one-fourth of an acre, is used for growing another crop, Ushr shall not be charged in respect of the produce of such small portion. Explanation.— In this section and section 6, “land-owner”, “grantee”, allottee” “lessee”, “lease-holder” and “land-holder” shall have the same meaning as in the laws relating to land administration and “land-holder” includes a person in possession of any plot of land who has grown a crop on such plot. (2) An individual land-owner, grantee, allotee, lessee, lease-holder or landholder shall be exempt from the compulsory levy of Ushr if— (a) he is eligible under Shariah to receive “Zakat” ; or (b) the produce from his land is less than five wasqs — 948 kilograms) of wheat, or its equivalent in value in the case of other crops liable to Ushr. (3) The currency equivalent of five wasqs of wheat in value shall be such as may be notified for each Zakat year by the Administrator-General. (4) Ushr shall be the first charge on the produce. (5) Ushr shall be collected in cash : _________________________________________________________________________________ 1Subs. by the Zakat and Ushr (Amdt.) Ordinance, 1980 (52 of 1980), s. 4 for sub-section (6). Provided that, where the produce consists of wheat or paddy, Ushr, at the option of the 1[Provincial Council] may be collected in kind. (6) A Sahib-e-nisab may pay either to the Local Zakat Fund or directly to those eligible under Shariah to receive Zakat, so much of the Ushr due under Shariah as is not compulsorily realizable under this Ordinance, for example, in respect of item 9 of the Second Schedule. *2[6. Mode of assessment and collection of ushr.—(1) The Provincial Revenue Department shall assess and collect Ushr in respect of a landowner, guarantee, lessee, lease-holder or land holder in the prescribed manner, and maintain the record containing such information for a crop season as may be required for the purposes of this Ordinance. (2) In the case of lease in force immediately before the commencement of this Ordinance, or, after the commencement of the Finance Act, 1990, the liability of the lessor and lessee to pay Ushr shall be equitably apportioned between them by the Tehsildar or, as the case may be, Mukhtiarkar. (3) An assessee aggrieved by the assessment under subsection (1), or as the case may be, a lessor or lessee aggrieved by the apportionment under sub-section (2), may, within thirty days of the Provincial Revenue Department announcing the assessment, or, as the case may be, apportionment, apply, in the prescribed form and manner to the 3[Deputy District officer Revenue] for a revision of the assessment or apportionment: Provided that no such application shall be admitted unless the applicant has deposited into the 4[District] Zakat Fund not less than fifty per cent of his liability as assessed or apportioned by the Provincial Revenue Department. (4) The 3[Deputy District officer Revenue] may, at any time, either of his own motion or on the application of an adult Muslim residing within his jurisdiction, make an order enhancing the liability assessed under sub-section (1) or apportioned under sub-section (2) : Provided that no such order shall be made unless the person affected has been given an opportunity of showing cause against it and of being heard. (5) The 3[Deputy District officer Revenue] to whom an application is made under sub-section (3) or sub-section (4), or who takes up a matter under sub-section (4) of his own motion, shall give his decision within a period not exceeding one month counted from the date on which he receives the application or, as the case may be, so takes up the matter; and such decision shall be final and shall not be questioned before any Court or other authority. (6) The demand as determined under sub-section (1) or, as the case may be, under sub- section (4) or sub-section (5), shall be paid by the assessee and collected by the Provincial Revenue Department in such manner as may be prescribed and deposited into the 4[District] Zakat Fund. (7) Where the recovery of Ushr compulsorily realizable under this Ordinance falls into arrears, the Tehsildar or, as the case may be, Mukhtiarkar shall proceed to recover the amount so specified as if it were an arrears of land revenue.] 1Subs by the Zakat and Ushr (Amdt.) Act 1997, (10 of 1997) s. 3, for,”District Committee” which was previously subs by Act 12 of 1994, s. 8. *Section 6 shall come into force and have effect from Kharif, 1993, vide S.R.O. No. 762(l)/93. dated 5-9-1993. 2Subs by the Finance Act 1990. (7 of 1990) s. 8, which was amended by various enactments. 3Subs. by ord. 35 of 2002, s.3(except ICT) 4Subs by the Finance Act 1994, (12 of 1994) s. 8 for “Local”. CHAPTER-IV ZAKAT FUNDS 1[7. Establishment of Zakat Funds. —There shall be established the following Zakat Funds, namely: — (a) a Central Zakat Fund to which shall be credited— (i) the Zakat deducted at source ; (ii) the Zakat paid into it voluntarily including voluntary contribution made by Pakistani citizens an other persons residing abroad ; (iii) the transfers, if any, from the Provincial Zakat Funds ; and (iv) the grants atiyyat and any other receipts including voluntary contributions made by Pakistani citizens and other persons residing abroad ; (b) a Provincial Zakat Fund for each Province to which shall be credited__ (i) the transfers to it from the Central Zakat fund ; (ii) the Zakat paid into it voluntarily ; (iii) the transfers, if any, from the District Zakat Funds ; and (iv) the transfers, if any, for the Local Zakat Fund; and (v) the grants, atiyyat and any other receipts ; and (c) a District Zakat Fund for each District to which shall be credited,— (i) the transfers to it from the Provincial Fund ; (ii) the proceeds of Ushr to be deposited in the personal ledger account of District Zakat Fund ; (iii) the Zakat paid into it voluntarily ; (iv) the transfers, if any, from the Local Zakat Funds ; and (v) the grant atiyyat and any other receipts ; and (d) a Local Zakat Fund for each Local Committee to which shall be credited — (i) the Zakat paid into it voluntarily ; (ii) the transfers to it from the District Zakat Fund ; (iii) the transfer to it from the Provincial Zakat Fund ; and (iv) the grants, atiyyat and any other receipts.] _________________________________________________________________________________ 1Subs. by the Zakat and Ushr (Amdt.) Act, 1997 (10 of 1997) s. 4 for s. 7 which was previously amended by various enactments. 1[8. Utilization of Zakat Funds.-The moneys in a Zakat Fund shall be utilized for the following purposes, namely,— (a) assistance to the needy, the indigent and the poor particularly orphans and widows, the handicapped and the disabled, eligible to receive Zakat under Shariah for their subsistence or rehabilitation, either directly or indirectly through deeni madaris or educational, vocational or social institution”s public hospitals, charitable institutions and other institution providing health care: Provided that the lists of the individuals to be assisted directly and of the institutions through which assistance is to be given from a Zakat Fund shall be prepared and maintained in such form and manner as may be prescribed ; (b) assistance to the needy persons affected or rendered homeless due to natural calamities like floods and earthquakes and for their rehabilitation ; (c) expenditure on the collection, disbursement and administration of Zakat and Ushr ; Provided that— (i) the expenditure on the administrative Division and the Central Council shall be met by the Federal Government; (ii) the expenditure on the administrative organization of a Chief Administrator, the Provincial Council, and a District Committee shall be met by the Provincial Government 2[:] 2[Provided that where expenditure on the administrative organization of a District Zakat Committee is not fully met by the Provincial Govertement due to paucity of funds during a financial year, the Central Zakat Council may provide supplementary funds not exceeding two percent from within the limit specified in clause (iii) and] (iii) the funds not exceeding ten per cent approved in the budget shall be retained in the Provincial Zakat Fund to meet such additional expenditure of a Local Committee as may be approved by the Central Zakat Council: Provided also that the banking services and the services connected with the assessment, collection or disbursement of Zakat and Ushr realizable on compulsory basis under this Ordinance shall be rendered free of charge, except that the Administrator General, in regard to Ushr, may authorise payment of remuneration for any specified services ; (d) investment in any non-interest bearing instruments as it permitted under Shariah ; and (e) any other purpose permitted by Shariah.] 1Subs. by the Zakat and Ushr (Amdt.) Act 1997, (10 of 1997) s. 5, for s. 8, which was previously amended by various enactments. 2Subs. and added by ord. 38 of 2002, s.2. 1[9. Disbursement from Zakat Funds.— (1) The Central Zakat Council shall prepare budget for each financial year and may, from the Central Zakat Fund, make disbursements and transfer funds to Provincial Zakat Fund in such form and manner as maybe prescribed and as would help in ensuring satisfaction of the needs of the needy and the poor throughout the country as for as possible, on a uniform basis. (2) A Provincial Council may from the Provincial Zakat Fund make disbursements and transfer funds to 2[the personal ledger Account of the] District Zakat Fund on the basis of population in such form and manner as may be prescribed and as would help in ensuring satisfaction of the needs of the needy and the poor throughout its jurisdiction, as for as possible, on a uniform basis : Provided that a Provincial Council may, in exceptional circumstances, transfer funds from the Provincial Zakat Fund to the Central Zakat Fund. (3) A District Committee may make disbursements and transfer funds 2[through crossed cheques] from District Zakat Fund to a Local Zakat Fund or to an institution or incur other administrative expenditure subject to such conditions as may be prescribed and may, whenever directed by the Central Council, transfer any funds surplus to its needs to the Provincial Zakat Fund. (4) A Local Committee may disburse or incur expenditure from the Local Zakat Fund 2[through crossed cheques] as may be prescribed : Provided that a Local Committee may, if so required by the Provincial Council or the District Committee, transfer any funds surplus to its needs from the Local Zakat Fund to the Provincial Zakat Fund or,as the case may be, District Zakat Fund surplus to its needs: Provided further that the Central Council or Provincial Council or a District Committee shall disburse Zakat through a Bank or a Post Office or any other financial institution as may be determined by the Central Zakat Council in such form and manner as may be prescribed.] 3[10. Accounts.— (1) The accounts of the Central Zakat Fund, a Provincial Zakat Fund, a District Zakat Fund, and Local Zakat Fund shall be maintained and operated, respectively, by the Administrator-General, the Chief Administrator, the District Committee and the Local Committee, in such form and manner as may be prescribed.] (2) The records of the accounts of the Zakat Funds shall be preserved for such period, and shall be made available for audit or inspection to such persons or agencies, and in such manner, as may be prescribed. 4[11. Audit.— (1) To carry out audit of the Central Zakat Fund annually or at shorter intervals, the Central Council, and to carry out audit of a Provincial Zakat Fund annually or at shorter intervals, the Provincial Council, shall request the Auditor-General of Pakistan and Local fund audit to conduct the audit. (2) To carry out audit of a District Zakat Fund within a Province annually or at shorter intervals, the Provincial Council shall request the Auditor-General of Pakistan to conduct the audit. (3) To carry out audit of the Local Zakat Funds within a district annually or at shorter intervals, the District Committee shall request the Auditor-General of Pakistan to conduct audit of the local fund. (4) The audit performed by Auditor-General under sub-sections (1), (2) and (3) shall include propriety audit. _________________________________________________________________________________ 1Subs. by the Zakat and Ushr (Amdt.) Act 1997, (10 of 1997) s. 6, for section 9, which was previously amended by various enactments. 2Ins. by ord. 59 of 2000,s.3. 3Subs. by the Zakat and Ushr (Amdt.) Act 1997, (10 of 1997., s. 7, for sub-section (1) which was previously amended by various enactments. 4Subs. by the Zakat and Ushr (Amdt.) Act, 1997, (10 of 1997), s. 8 for “section 11” (5) The annual report of the Auditor-General on the Central Zakat Fund shall be laid before the Majlis-e-Shoora (Parliament), that on a Provincial Zakat Fund before the Provincial Assembly concerned, and that on a District Zakat Fund or a Local Zakat Fund before the 1[District Assembly] concerned established under the law relating to local government. (6) Nothing in this section shall be deemed to prevent— (a) the Central Council from getting audited any of the Provincial, District of Local Zakat Funds ; (b) the Provincial Council from getting audited any of the District or Local Zakat Funds within its jurisdiction ; or (c) a Local Committee from getting its own Local Zakat Fund audited. (7) Notwithstanding anything contained in the preceding sub-sections, the Auditor General shall conduct annual audit of the Central Zakat Fund, the Provincial Zakat Fund, District Zakat Funds and Local Zakat Funds including the accounts of a Deducting Agency or an institution receiving Zakat.] _________ CHAPTER-V ORGANIZATION AND ADMINISTRATION 12. Central Zakat Council.— (1) The Federal Government shall, by notification in the official Gazette, establish a Central Zakat Council to provide policy guide lines for, and to exercise general superintendence and control over matters relating to Zakat and Ushr, particularly the Zakat Funds and maintenance of their accounts. 2[(2) The Central Council shall consist of— (a) a Chairman; (b) four persons to be nominated by the President, of whom three shall be Ulema nominated in consultation with the Council of Islamic Ideology ; (c) one person from each Province, to be nominated by the President ; (d) two women, who shall not be less than forty five years of age, to be nominated by the President; (e) the Chief Administrators ; (f) the Secretary to the Government of Pakistan in the Ministry of Finance ; 1Subs. by ord. 35 of 2002, S.4 (Except in ICT) 2Subs. by the Zakat and Ushr (Amdt.) Act 1997, (10 of 1997) s. 9. for sub-sections (2), (3) and (4) which was previously amended by various enactments. (g) the Secretary to the Government of Pakistan in the Ministry of Religious Affairs, Zakat, Ushar and Minorities Affairs; (h) the Secretary to the Government of Pakistan in the Ministry of Health ; (i) the Secretary to the Government of Pakistan in the Ministry of Education ; and (j) the Administrator-General, who shall also be the Secretary General of the Council. (3) The Chairman of the Central Council shall be a person who is, or has been, a judge of the Supreme Court of Pakistan, to be nominated by the President in consultation with the Chief Justice of Pakistan. (4) The Chairman and members of the Central Council, other than ex-officio members, shall hold office during the pleasure of the President for a term of three years, and shall be eligible for reappointment for another term.] (5) The Chairman or a member, not being an ex-officio member, may, by writing under his hand addressed to the President resign his office: Provided that he shall continue to hold office until his resignation is accepted by the President. (6) Any vacancy in the office of Chairman or member, other than an ex-officio member, shall be filled by the nomination, in accordance with sub-section (2) or sub-section (3), as the case may be, of a person qualified to hold the office. (7) The Chairman or the member nominated under subsection (6) shall hold office for the unexpired term of his predecessor. 1[13. Administrator-General.—(1) For carrying out the purpose of this Ordinance, the Secretary, Religious Affairs, Zakat, Ushr and Minorities Affairs Division, Government of Pakistan, shall perform the functions of the Administrator-General under this Ordinance. (2) The Administrator-General shall be the Chief Executive in respect of matters relating to Zakat and Ushr and shall act under the general superintendence and control of, and in accordance with the policy guidelines given by, the Central Council.] 2[14. Provincial Zakat Council.—(1) In each Province, the Provincial Government shall, by notification in the official Gazette, establish a Provincial Zakat Council, to exercise general superintendence and control over matters relating to Zakat and Ushr, particularly the Zakat Funds in the Province and the maintenance of their accounts, in accordance with the policy guidelines given by the Central Council. (2) The Provincial Council shall consist of— (a) a Chairman ; 1Subs. by the Zakat and Ushr (Amdt.) Act 1997, (10 of 1997) s. 10, for s.13, which was previously amended by various enactments. 2Subs. ibid., s.11 for section 14. (b) five persons, of whom three shall be ulema, to be nominated by the Governor ; (c) two women, who shall not be less than forty-five years of age, to be nominated by the Federal Government; (d) the Secretary to the Provincial Government in the Finance Department; (e) the Secretary to the Provincial Government in the Local Government Department; (f) the Secretary to the Provincial Government in the Social Welfare Department; and (g) the Chief Administrator, who shall also be the Secretary of the Council. (3) The Chairman of the Provincial Council shall be a person who is, or has been, a Judge of a High Court, to be nominated by the Governor in consultation with the Chief Justice of the High Court. (4) The Chairman and members of the Provincial Council, not being an ex-officio member, shall hold office for a term of three years and shall be eligible for re-appointment. (5) The Chairman or a member, not being an ex-officio member, may, by writing under his hand addressed to the Governor resign his office. (6) Subject to sub-section (5) the Chairman or, as the case may be, a member shall continue to hold office until his resignation is accepted by the Governor. (7) Any vacancy in the office of Chairman or member, other than an ex-officio member, shall be filled by the nomination, in accordance with sub-section (2) or sub-section (3) as the case may be, of a person qualified to hold the office. (8) The Chairman or the member nominated under sub-section (7) shall hold office for the unexpired term of his predecessor. (9) In the Islamabad Capital Territory, the functions of the Provincial Council shall be performed by the Central Council]. 1[15. Chief Administrator.—(1) In each Province, for carrying out the purposes of this Ordinance, there shall be appointed by the Governor, in consultation with the Federal Government, a Chief Administrator. (2) The Chief Administrator shall have the status and grade of and be ex officio, Member, Board of Revenue and his tenure and other terms and conditions of service shall be such as may be determined by the Provincial Government. (3) The Chief Administrator shall act under the general superintendence and control of the Provincial Council and perform, as the Chief Executive of the Council, such functions as are assigned to him by or under this Ordinance.] 1Subs.by the Zakat and Ushr (Amdt.) Act 1997, (10 of 1997) s. 12, for section 15 which was previously amended by various enactments. 1[16. District Zakat and Ushr Committee.—2[(1) In each district, a District Zakat and Ushr Committee, in the Islamabad Capital Territory, the Islamabad Zakat and Ushr Committee and in Karachi, Karachi City District Government Zakat and Ushr Committee shall be constituted by the Provincial Council concerned.] (2) The District Committee shall, subject to such guidelines as may be given by the Central Council or the Provincial Council, — (a) Oversee, generally, the functioning of administrative organization of Zakat and, more particularly, the assessment of Ushr and atiyyat and the disbursement and utilization of the moneys in the District Zakat Fund and the Local Zakat Fund ; (b) for the purposes mentioned in clause (a), make plans for the district, in such form and manner as may be prescribed ; (c) prepare and maintain accounts of the District Zakat Fund in such form and manner as may be prescribed ; (d) compile accounts of the Local Zakat Funds, for the district, in such form and manner as may be prescribed; (e) arrange, in the prescribed manner, audit of the Local Zakat Funds in the district; and (f) tender to the provincial Council advice on any matter specified by it. Explanation.—In this sub-section and in the succeeding provisions of this Ordinance, reference to “District Committee” shall be deemed to include a reference to the Islamabad Zakat and Ushr Committee. (3) The District Committee shall consist of.— (a) a Chairman, who shall be non-official, the 2[District Officer (Revenue)] of the district and two women from within the district who shall not be less than forty-five years of age and one non-official member from each tehsil, taluqa or sub-division in the district: Provided that where the number of tehsils, taluqas or sub-divisions in a district is less than five, the number of members other than the Chairman and the women members shall be raised to seven : Provided further that, in any district where there is a District Social Welfare Officer appointed by the government, the District Committee may co- opt him as a member of the Committee, ex-officio. 1Subs. by the Zakat and Ushr (Amdt.) Act 1997, (10 of 1997) S.13 for Section 16 which was previously amended by various enactments. 2Subs. by ord. 35 of 2002,s.5 (except in ICT) (b) The District Zakat Officer, who shall also be the Secretary of the Committee ; Explanation.—Subject to sub-section (7), the District Committees existing before the 5th November, 1996 shall cease to function and new District Committees shall be constituted under this section. (4) The Chairman shall be nominated by the Provincial Council and the members shall be nominated by the Provincial council in consultation with the Chairman : Provided that the Chairman shall be an adult Muslim who ordinarily resides in the district and the member from a tehsil, taluqa or sub-division shall be an adult Muslim who ordinarily resides in that tehsil, taluqa or sub-division 1[:] 1[Provided further that the Chairman and members of the District Committee shall be the persons who are of good moral character and are not commonly known as persons who violate Islamic Injunctions and are of financial integrity and do not engage in political activities.] (5) The District Committee so constituted shall be duly notified by the Provincial Council concerned. (6) The Chairman and members of the District Committee, not being an ex-officio member, shall hold office for a term of three years and shall be eligible for re-appointment: Provided that in the event of delay in the constitution of the new Committee under sub- section (3), the Provincial Council may ask a District Committee to continue to function for a period not exceeding six months after the expiry of the term of its office. (7) The Chairman or a member, not being an ex-officio member, may, by writing under his hand addressed to the Provincial Council, resign his office. (8) Subject to sub-section (7) the Chairman or, as the case may be, a member shall continue to hold office until his resignation is accepted by the Provincial Council. (9) Any vacancy in the office of chairman or member, other than an ex-officio member, shall be filled by the nomination, in accordance with sub-section (4), of a person qualified to hold the office. (10) The Chairman or member nominated under sub-section (9) shall hold office for the unexpired term of his predecessor. (11) The District Committee shall hold meetings of the Committee at least once in every three months.] 2[17. Tehsil, Taluqa or Sub-divisional Zakat and Ushr Committee 3[or Town Zakat and Ushr Committee].— (1) There shall be constituted— (a) a Tehsil or Taluqa Zakat and Ushr Committee in each tehsil or taluqa: _____________________________________________________________________________ 1Subs. and added by ord. 59 of 2000,s.4. 2Subs. by the Zakat and Ushr (amdt) Act 1997, (10 of 1997) S.14 for Section 17 which was previously amended by various enactments. 3Added by ord. 35 of 2002, S.6 (except ICT) Provided that, if the Provincial Council so directs in respect of any sub-tehsil, a Tehsil Zakat and Ushr Committee may be constituted in the sub- tehsil: and, where a Committee is constituted in a sub-tehsil, such Committee and such sub-tehsil shall be deemed to be a Tehsil Zakat and Ushr Committee and a tehsil, respectively, for the purposes of this Ordinance ; and (b) a Sub-divisional Zakat and Ushr Committee in each sub-divisional of the district of Lahore and 1[a Town Zakat and Ushar Committee in each town of Karachi City District Government, Karachi] (2) The Tehsil Committee, Taluqa Committee or sub-divisional Committee shall, subject to such guidelines as may be given by the central council, the Provincial Council or the District Committee, — (a) oversee assessment of Ushr and collection of Zakat, Ushr and attiyat, and the disbursement and utilization of the moneys in the Local Zakat Funds, by the Local Committees in the tehsil, taluqa or sub-division ; (b) for the purposes mentioned in clause (a) make plans for the tehsil, taluqa or sub-division, as the case may be, in such form and manner as may be prescribed; (c) compile accounts of the Local Zakat Funds for the tehsil, taluqa or sub-division, as the case may be, in such form and manner as maybe prescribed ; and (d) tender to the District Committee advice on any matter connected with the collection, disbursement or utilization of Zakat or Ushr. (3) The Tehsil Committee, Taluqa committee or Sub-divisional Committee shall consist of the 1[Deputy District Officer (Revenue)], two women members and six members to be elected, in the prescribed manner, by the Chairmen of the Local Committees of the tehsil, taluqa or sub-division, from amongst themselves : Provided that, if there are more than two tehsil Committees or Taluqa Committees within the jurisdiction of an 1[Dy. Distt. Officer (Revenue)], he shall be a member of only such of the Committees as the Provincial Council may specify and the Provincial Council may nominate the Tehsildar or Mukhtiarkar of the tehsil or taluqa concerned, as the case may be, to be the member of any other of the said Tehsil Committees or Taluqa Committees. Provided further that the two women members shall be nominated by the District Committee in consultation with the Chairman of the Tehsil, Taluqa or Sub-divisional Committee concerned and shall not be less than forty-five years of age. (4) The members of the Committee shall elect one of their member to be the Chairman of the Committee; and, if two or more persons secure an equal number of votes, the result of the election shall be determined by drawing lots. 1Subs. by ord. 35 of 2002, S.6 (except ICT) (5) The Tehsil, Taluqa or Sub-divisional Committee so constituted shall be duly notified by the District Committee concerned. (6) The Chairman and members of a Tehsil Committee, Taluqa Committee or Sub-divisional Committee, not being an ex officio member, shall hold office for a term of three years and shall be eligible for re-election. (7) The Chairman or a member, not being an ex officio member, may by writing under his hand addressed to the Tehsil Committee or, as the case may be, Taluqa Committee or, as the case may be, Taluqa Committee or Sub-divisional committee, resign his office. (8) Subject to sub-section (7), the Chairman or a member shall continue to hold office until his resignation is accepted by the Tehsil Committee or, as the case may be, Taluqa Committee or Sub-divisional Committee. (9) Any vacancy in the office of Chairman or member, other than an ex-officio member, shall be filled by the election, in accordance with sub-section (3), or, as the case may be, sub-section (4), of a person qualified to hold the office. (10) The Chairman or member elected under sub-section (9) shall hold office for the unexpired term of his predecessor.] 1[18. Local Zakat and Ushr Committee. — (1) A Local Zakat and Ushr Committee shall be constituted for, (a) each revenue estate in settled rural area ; (b) each deh or village in non-settled rural area ; and (c) each ward in urban area: Provided that, if in the opinion of the Provincial Council the population of a revenue estate, deh or village is too large, or too small, to have one local Zakat and Ushr Committee, such revenue estate, deh or village may, if too large, be divided into two or more localities, or if too small, grouped with any other revenue estate, deh or village to form one locality, and where a revenue estate, deh or village is so divided or grouped after the constitution of a local Committee that it covers a population of ten thousand persons the Provincial Council may make such consequential orders as may be necessary for the purposes of this Ordinance. Explanation. — In this sub-section,— (a) “urban area” means area within the local limits of a Municipal Corporation, Municipal Committee, Cantonment Board or Town Committee; (b) “rural area” means area other than urban area; (c) “settled rural area” means rural area for which revenue settlement record exists; (d) “non-settled rural area” means rural area other than settled rural area; and 1Subs. by the Zakat and Ushr (Amdt.) Act 1997, (10 of 1997) s. 15, for section . 18 which was previously amended by various enactments. (e) “ward” means a distinct and compact locality the population of which does not exceed ten thousand persons approximately. (2) The Local Committee shall, subject to such guidelines as may be given by the Provincial Council and the District Committee, or the Tehsil, Taluqa or sub-divisional Committee. (a) determine istehqaq separately for — (i) subsistence allowance; (ii) rehabilitation, either directly or indirectly through deeni madaris, educational vocational and social welfare institutions ; (iii) treatment through public hospitals, charitable institutions and other institutions providing health care; and (iv) any other purpose as may be permitted by Shariah; (b) collect voluntarily Zakat, Ushr and attiyyat and deposit the moneys in the District Zakat Fund ; (c) prepare and maintain accounts of the Local Zakat Fund in such form and manner as may be prescribed ; and (d) tender to the Tehsil, District Committee advice on any matter connected with collection, disbursement and utilization of Zakat, Ushr and attiyyat. (3) The Local Committee shall consist of nine members, of whom two shall be Muslim women who are not less than forty five years of age selected by the residents of the locality in the manner specified in sub-section (4). (4) The District committee shall constitute a team of three or more persons including at least one gazetted officer, one aalim-e-deen and one member of the District Committee to organize a public gathering of the adult Muslims, teachers an ulema residents of a locality and call upon them to select, in the prescribed manner, seven adult Muslims residing in that locality who possess Secondary School Certificate and are known to be pious and who offer five times prayer daily, and have sound moral and financial integrity and not engaged in political activity : Provided that a person who is a member of a team constituted for the selection of members of a Local Committee shall not be eligible to be a member of such Local Committee, and except in the case of such Local Committees in the Islamabad Capital Territory as may be notified by the Administrator-General, a person who is a salaried employee of Government or of a local authority otherwise than as Pesh Imam of a local mosque or a teacher of a local school, or of a corporation set- up owned or controlled by Government shall not be eligible to be member of a Local Committee : Provided further that, where in a district the number of Local Committees is so large that the members of the District Committee cannot be put on all the teams constituted for the selection of members of Local Committees in the district, the District Committee, may, at its discretion, nominate any other non-official person of the district to represent it on the said team : Provided further that the team constituted by the District Committee shall organize a separate gathering of the adult Muslim female residents of the locality and call upon them to select, in the prescribed manner, two Muslim women residing in that locality who are known to be pious and who enjoy their trust to be members of the Local Committee. (5) The members of a Local Committee shall elect one of their members, being a person who possesses Secondary School Certificate and who offers prayer five times during a day regularly and observes the fast throughout Ramadhan-ul-Mubarak according to the injunctions of Islam, to be the Chairman of the Local Committee, and if two or more .persons secure an equal number of votes, the result of the election shall be determined by drawing lots. (6) The Local Committee so constitutes shall be duly notified by the District Committee concerned. (7) Any adult Muslim resident of a locality who is aggrieved by the conduct or the result of the proceedings for the selection of the members, or the election of the Chairman, of the Local Committee concerned may prefer an appeal to District Committee: Provided that the District Committee shall not grant any injunction or make any interim order, including a stay order, during the period an appeal is pending. (8) The District Committee to which an appeal under sub-section (9) is preferred shall decide the appeal with in such time as may be prescribed; and the decision of the District Committee shall be final and shall not be called in question before any court or other authority. (9) The Chairman and members of the Local Committee shall hold office for a term of three years and shall be eligible for re-election or re-selection as the case may be : Provided further that the District Committee may, in consultation with the Federal Government, remove a Chairman or a member or the Local Committee from his office and nominate another person as Chairman or, as the case may be, a member for the unexpired term of his predecessor : Provided also that a Chairman shall not be eligible to hold office for more than two consecutive term of three years each : Provided further that the District Committee may, in the event of delay in the constitution of the new Local Committee, ask a Local Committee to continue to function for a period not exceeding six months after the expiry of term of its office. (10) The Chairman or a member may by writing under his hand addressed to the District Committee, resign his office. (11)Subject to sub-section (1) the Chairman or, as the case may be, a member shall continue to hold office until his resignation is accepted by the District Committee. (12) Any vacancy in the office of Chairman or member shall be filled by election or selection of a person qualified to hold the office, in accordance with the provisions of sub-section (4) or, as the case may be, sub-section (7). (13) The Chairman, or the member elected or selected, as the case may be, under sub-section (12), shall hold office for the unexpired term of his predecessor. (14) All Local Committees existing before the 5th November, 1996, shall cease to function from that date.] 1[19. Vacancy etc., not to invalidate acts or proceedings.Notwithstanding anything contained in this Ordinance, no act or proceeding of a Council or committee established or con- stituted under this Ordinance shall be invalid by reason only of the existence of a vacancy in, or defect in the constitution of, such Council or Committee.] 2[19A Members of Council and other Committees to be Muslims.—(1) All the members of the Central Council, Provincial Council and other Committees shall be Muslim and where the holder of an office cannot become a member by reason of his not being a Muslim, the President in case of the Central Council, the Governor in case of Provincial Council and Provincial Council in the case of District Committees shall nominate a Muslim official member in his place. (2) Except in the case of Islamabad Capital Territory, a person who is a salaried employee of Government or of a local authority, otherwise than a Pesh Imam of a local mosque or a teacher of a local school or of a corporation set-up, owned or controlled by the Government shall not be eligible to be a member of a Committee constituted under section 18.] 20. Person to preside at meetings in the absence of Chairman. If the office of Chairman of a Council or Committee established or constituted under this Ordinance is for the time being vacant, or the Chairman is absent from a meeting of the Council or Committee, the meetings thereof or, as the case may be, the meeting from which the Chairman is absent, shall be presided at— (a) in the case of the Central Council, by the Administrator-General; 3[(b) in the case of the Provincial Council, by the Chief Administrator;] (c) in the case of a District Committee, by the 4[District Officer (Revenue)] 3[(d) in the case of a Tehsil, Taluqa or Sub-divisional Committee, by the ex-officio member, that is, 4[Deputy District Officer (Revenue)] or, if the ex-officio member is himself the Chairman of the Committee, by the member elected by the members present; and] (e) in the case of a Local Committee, by the member elected by the members present [:]5 6[Provided that in case of temporary disability of the Chairman, District Committee, the 4[District Officer (Revenue)] shall perform the functions of such Chairman.] 1Subs. by the Zakat and Ushr (Amdt.) Act 1997, (10 of 1997) s. 16, for section 19 which was previously amended by various enactments. 2Subs. ibid., s. 17, for section 19A which was previously amended by various enactments. , 3Added ibid., ss. 18 and 19. for clauses (b) and (d). 4Subs. by ord. 35 of 2002, S.7 (except ICT) 5Subs. by the Finance Act. 1994. (12 of 1994), s. 8, for “full-stop”. 6Proviso added by the Finance Act, 1994 (12 of 1994), s. 8. 21. Power of supersession and removal.— 1[(1) If the 2[Provincial] Council, in the case of a District Committee, and the District Committee in the case of a Local Committee, is of the opinion that a Committee constituted under this Ordinance— (a) is unable to discharge or persistently fails in discharging its duties; or (b) is unable to administer its affairs; or (c) acts in a manner contrary to public interest; or (d) otherwise exceeds or abuses its powers; (e) has a majority of members who are not pious Muslims or who are engaged in political activity, The 2[Provincial] Council or, as the case may be, the District Committee may, by a notification, declare the concerned Committee to be superseded for such period not exceeding one year as may be specified in the notification : Provided that the period of supersession may, if the 2[Provincial] Council or the District Committee considers its necessary to do so, be extended, beyond a period of one year.] (2) When a 3[declaration is made] under sub-section (1) in respect of a Committee,— (a) the persons holding office as Chairman and members of the Committee to which the resolution relates, shall cease to hold office ; 4[b) all functions of the District Committee shall, during the period of supersession, be performed by an Administrator appointed by the 2[Provincial] Council and in the case of a Local Committee such functions shall be performed by the Administrator appointed by the District Committee; and] (c) before the expiry of the period of supersession, elections shall be held and selection or nominations made in accordance with the provisions of this Ordinance to reconstitute the Committee. (3) 2[Provincial] Council, in the case of District Committee, and the District Committee in the case of Local Committee] is of the opinion that the Chairman or a member of a Committee constituted under this Ordinance,— (a) was at the time of his selection, election or nomination (i) not a 5[pious] Muslim; (ii) not an adult; (iii) not a resident of the area within the jurisdiction of the Committee; (iv) an undischarged insolvent; or 1Subs.by the Finance Act, 1994 (12 of 1994), s. 8, for sub-section (1). 2Subs. by the Zakat and Ushr (Amdt.) Act, 1997, (10 of 1997) s. 19 for “Central”. 3Subs. ibid., for “certain words.” 4Subs. by Act 12 of 1994, s. 8, for cl. (b). 5Added and subs. by the Zakat and Ushr (Amdt.) Ordinance, 1983 (7 of 1983), s. 5. (v) not of sound mind; [or]1 1[vi) engaged in political activity] ; (b) has been, during the period of three years preceding the date of his selection, election or nomination,— (i) ordered to execute a bond under section 108, 109 or 110 of the Code of Criminal Procedure, 1898 (Act V of 1898); or (ii) convicted for an offence involving moral turpitude; or (iii) declared goonda under the law relating to the control of goondas; (c) has, after his selection, election or nomination, incurred any of the disqualifications referred to in sub-clause (i), (iii), 1[(iv), (v) or (vi)] of clause (a), or sub-clauses (i), (ii) or (iii) of clause (b); (d) has, without reasonable excuse, absented himself from three consecutive meetings of the Committee ; (e) has been guilty of abuse of power or of misconduct in the discharge of his duties as Chairman or member, or been responsible for any loss 2[“mis- application, misappropriation or misuse] of any money or property of the Committee ; or (f) has become physically disabled from performing functions as Chairman or member, 2[the 3[Provincial] Council, in the case of a District Committee, and the District Committee, in the case of Local Committee, may, by a resolution, remove such Chairman or member from office]. 4* * * * * * * 5[(3A) If, after such inquiry as may be considered necessary, the 3[Provincial] Council, in the case of a District Committee, or the District Committee in the case of a Local Committee, is of the opinion that the Chairman or a member of Committee or an employee assigned to work with a Committee or an institution receiving Zakat Funds under this Ordinance, was guilty of misconduct in the discharge of his duties, or is responsible for the loss, misapplication or misuse of Zakat Funds, the 3[Provincial] Council or as the case may be, the District Committee shall initiate criminal proceedings against such Chairman, member, person or institution. 1Added and subs. by the Zakat and Ushr (Amdt.) Ordinance, 1983 (7 of 1983), s. 5. 2Subs. by the Finance Act 1994 (12 of 1994) s. 8, for certain words. 3Subs. by the Zakat and Ushr (Amdt.) Act, 1997, (10 of 1997) s. 19, for “Central”. 4Explanation omitted by Act, 12 of 1994, s. 8. 5New sub-section 3A ins. ibid. Explanation.- For the purpose of clause (e) of sub-section (3) and sub-section (3A), the expression “misconduct” means bribery, corruption, jobbery, favoritism, nepotism, wilful mal- administration or wilful diversion of funds, and shall include an attempt or abetment of such misconduct;] (4) When the Chairman or member of a Committee is removed from, or otherwise ceases to hold, office, the vacancy in the office of such Chairman or member shall be filled within such time as the 1[the 2[Provincial] Council, in the case of a District Committee, and the District Committee, in the case of a Local Committee may] determine, by the election, selection or nomination, as the case may be, in accordance with the provisions of this Ordinance, of a person qualified to hold the office. (5) The Chairman or member elected, selected or nominated under sub-section (4) shall hold office for the unexpired term of his predecessor. 3[(6) The 2[Provincial] Council may delegate to the Chief Administrator all or any of its powers and functions under the preceding provisions of this section in respect of a District Committee or a Local Committee.] (7) The Chairman or a member of a Committee superseded under subsection (1), or a Chairman or member removed from office under sub-section (3), may, within such time, and in such form and manner, as may be prescribed, apply to the 4[Central] Council for a review of its decision; and the decision of the 4[Central] Council in such review, given after giving to the applicant an opportunity of being heard, shall be final and shall not be called in question before any Court or other authority. 5* * * * * * * 6[21-A. 7[Vote of no confidence.]—(1) Where in case of a 8* * * Local Committee, the District Committee, after such enquiry as it may deem fit, is of the opinion that the members of that Committee no longer have confidence in the Chairman, the District Committee may, in the prescribed manner, remove the Chairman from his office. 9[(2) Where in the case of a member of a Local Committee, or of a Local Committee as a whole, the District Committee, after such enquiry as it may deem fit, is of the opinion that the adult Muslim residents of the locality no longer have confidence in the member, or in the Committee as a whole, the District Committee may, in the prescribed manner, remove the member from his office or dissolve the Committee as a whole]. (3) The vacancy in the office of Chairman or member 10[or members] so caused shall be notified by the District Committee and shall be filled in accordance with the provisions of this Ordinance.] 1Subs. by the Finance Act, 1994 (12 of 1994), s. 8, for certain words 2Subs. by the Zakat and Ushr (Amdt.) Act, 1997, (10 of 1997) s. 19, for “Central”. 3Subs. by the Finance Act, 1994 (12 of 1994), S.8 for sub-section 6. 4Subs. by Act 12 of 1994, s. 8, for “Provincial”. 5Explanation omitted ibid. 6New s. 21-A ins. by the Zakat and Ushr (Amdt.) Ordinance, 1980 (52 of 1980), s. 14 7Subs,by Act, 1994 (12 of 1994), s.8, for the “marginal heading.” 8The certain words omitted ibid, s. 8. 9Added and subs, by the Zakat and Ushr (Amdt.) Ordinance, 1983 (7 of 1983), s. 6. 10Ins. ibid., 1[22. Administrative organization. —The administrative organization under this Ordinance shall be through a Division to be known as the Religious Affairs, Zakat, Ushr and Minorities Affairs Division and may include such organizations as are performing social security and other com- plementary functions and that of a Chief Administrator, a Department or a part of a Department of the Provincial Government. (2) The Secretary of Religious Affairs, Zakat, Ushr and Minorities Affairs Division shall be the ex officio Administrator General Zakat]. 23. Certain persons to be public servants. — Every person engaged in, or employed for, the administration of this Ordinance shall be deemed t be a public servant within the meaning of section 21 of the Pakistan Penal Code (Act XLV of 1860). 2[Explanation.—For the purposes of this section, the Chairman and members of the District Committee and Local Committee shall be the persons engaged in the administration of this Ordinance.]; __________ CHAPTER-VI MISCELLANEOUS 24. Exemption. The Federal Government may, in consultation with the Council of Islamic Ideology exempt, by notification in the official Gazette, any specified class of cases or persons from payment of compulsory levy of Zakat or Ushr. 25. Certain tax concessions.—(1) Notwithstanding anything contained in any other law for the time being in force, — (a) in determining the tax liability of an assessee for an assessment year,— (i) under the Income-tax Ordinance, 1979 (XXXI of 1979), his taxable income shall be reduced by the amount paid by him to a Zakat Fund, during the previous year relevant to that assessment year; and (ii) under the Wealth-tax Act, 1963 (XV of 1963), his assets in respect of which Zakat or contribution in lieu thereof, has been deducted at source during the year relevant to that assessment year shall be excluded from his taxable wealth; and (b) land-revenue and development cess shall not be levied on land on the produce of which Ushr or contribution in lieu thereof, has been charged on compulsory basis. 1Subs. by the Zakat and Ushr (Amdt.) Act, 1997, (10 of 1997), s. 20, for section 22, which was previously amended by various enactments. 2Explanation added by the Finance Act, 1994, (12 of 1994) s.8. (2) Nothing in the preceding sub-section shall be deemed to affect the liability to pay income-tax, wealth tax, land revenue or development cess in respect of any period preceding the enforcement of the relevant provisions of this Ordinance. 1[26. Power to make rules.—The Central Council may, notification in the official Gazette, make rules for carrying out the purposes of this Ordinance. Provided that, if the Central Council so directs, the Provincial Council may, with the approval of the Central Council, make rules in respect of administrative matters.] 2[27. Power to call for information and issue directions.—The Central Council, the Administrator-General, a Provincial Council, a Chief Administrator, a District Committee, a Tehsil Committee, a Taluqa Committee, a Sub-divisional Committee, or a Local Committee, may, within its or his jurisdiction, call for such information or record from, and issue such directions to the concerned persons or agencies as may be necessary for the performance of its or his functions under this Ordinance.] 28. Indemnity and bar of jurisdiction.—(1) No suit, prosecution or other legal proceeding shall lie against any person for anything in good faith done or intended to be done under this Ordinance or any rule. (2) No Court shall call in question, or permit to be called in question, anything done or any action taken under this Ordinance or any rule. (3) No Court shall grant any injunction or make any order, nor shall any Court entertain any proceedings, in relation to anything done or intended to be done or any action taken or intended to be taken under this Ordinance or any rule. ________________________________________________________________________________ 1Subs.by the Zakat and Ushr (Amdt.) Act, 1997 (10 of 1997) s. 21, for section 26, which was previously amended by various enactment. (a) For the Zakat (Transfer and Disbursement) Rules, 1980, vide S.R.O. No. 758 (I)/80 dated the 12th July, 1980 see Gaz. of P., 1980 Ext., pp. 1387—1390. (b) For the Islamabad Capital Territory Local Committee (Constitution) Rules 1980 vide S.R.O. No. 1159(I)/80, dated the 23rd November, 1980, see Gaz. of P., 1980 Ext. Pt. II., PP. 2225—2228. (c) For the Islamabad Capital Territory Local Committee and the Islamabad Zakat and Ushr Committee (Procedure) Rules, 1980, vide S.R.O. No. ll60(l)/80, dated the 23rd November, 1980, see Gaz. of P., 1980, Ext.. Pt. II. pp. 2229—2230. (d) For the Zakat (Deduction and Refund) Rules, 1981, vide No. CA 1155/CD 2(5), dated the 23rd April, 1981, see Gaz. of P., Ext., Pt. III. pp. 197—222. (e) For the Islamabad Capital Territory Local Committee (Removal of Chairman and Members) Rules, 1982, vide S.R.O. III(I)/82, dated the 3rd February, 1982, see Gaz. of P., 1982, Ext., Pt. II pp. 151—155. (f) For the Ushr (Assessment and Collection) Rules, 1983, vide S.R.O. No. 2l9(I)/83, dated the 2nd March, I983 see Gaz. of P., 1983 Ext., Pt. II, pp. 287—298. (g) For the Punjab Ushr (Assessment and Collection) Rules, 1983 vide S.R.O. No. 305(I)/83, dated the 27th March, 1983, see Gaz. of P.; 1983, Ext., Pt. II pp. 433— 444. (h) For the Baluchistan Ushr (Assessment and Collection) Rules, 1983, vide S.R.O. No. 306 (l)/83, dated the 27th March, 1983, see Gaz. of P., 1983, Ext., Pt II pp. 445—456. (i) For the Sind Ushr (Assessment and Collection) Rules 1983, vide S.R.O. No. 334(I/83, dated the 30th March, I983f.see Gaz. of P., 1983. Ext., Pt. II. pp. 491—503. (j) For the North-West Frontier Province Ushr (Assessment and (Collection) Rules, 1983, vide S.R.O. No. 335 (I)/83, dated the 2nd April, 1983 see. Gaz of P., 1983 Ext., Pt.. II, pp. 505—517. (k) For the Superseded and Removed Chairman and Members of Zakat Committees (Application for Review) Rules, 1985, vide S.R.O. No. l47(I)/85, dated the 14th February, 1985, see Gaz., of P., 1985, Ext., Pt. II, pp. 197-198. 2Subs. by the Zakat and Ushr (Amdt.) Act, 1997 (10 of 1997) s. 22, for section 27, which was previously amended by Act 12 of 1994, s. 8. 29. Removal of difficulties. —The Federal Government may make such provisions1 as may be necessary to remove any difficulty in carrying out the purposes of this Ordinance. 2[29A. Dissolution and reconstitution of Committee. —All existing District Zakat and Ushr Committees, Tehsil Taluka and Sub-Divisional Zakat and Ushr Committees and Local Zakat and Ushr Committees shall stand dissolved and cease to function with immediate effect and new Committees shall be constituted under sections 16, 17 and 18 within a period of 3[six months] from commencement of the Zakat and Ushr (Amendment) Ordinance, 2000.] 30. Repeal.—The Zakat and Ushr (Organisation) Ordinance, 1979 (XXIX of 1979), is hereby repealed. 1The Zakat and Ushr Ordinance, 1980 has been modified as shown below: (1) S.R.O. 646(I)/80,dated the 22nd June, 1980. (2) S.R.O. 104(I)/81, dated 5th February, 1981. (3) S.R.O. 739(I)/81-A, dated 8th July, 1981. (4) S.R.O. 1207(I)/81, dated 15th November, 1981. (5) S.R.O. 523(K)/82, dated 6th June, 1982. 2Ins. by Ord. 59 of 2000, s.5. 3Subs. by Ord. XXI of 2001, s.2 and shall be deemed always to have been so subs. FIRST SCHEDULE (See section 2 and 3) ASSETS SUBJECT TO COMPULSORY LEVY OF ZAKAT THROUGH DEDUCTIN-AT- SOURCE FOR CREDIT TO THE CENTRAL ZAKAT FUND 1The heading “The valuation date”, figure “3” and entries relating thereto, have been omitted by the Zakat and Ushr (Amdt.) Ordinance, 1980 (52 of 1980), s. 15. 2Omitted by the Zakat and Ushr (Amdt.) Ordinance, 1984 (46 of 1984), s, 3. 3Subs, by Ord. 52 of 1980, s. 15 for certain original words. 4The words “and Fixed Deposit Receipts with terms of maturity of nine months or less” have been omitted, ibid, 5Ins. ibid. 6Subs. ibid, for the original entry. S.No. Assets 1* * * Rate and basis for computing the amount to be deducted as Zakat The Deduction Date The Deducting Agency 1 2 1* 4 5 6 1. Savings Bank Accounts and similar accounts by whatever name described 2* * * with the banks operating in Pakistan post offices. National Savings Centres and financial institutions keeping such Accounts. 1* * * 2.5% of the amount standing to the credit of an account at the commencement of the day on the Valuation Date. 3[No deduction shall be made in case the amount standing to the credit of an account does not exceed the amount notified by the Administrator-General]. As notified by the Administrator- General for the Zakat year. The bank, office, centre, or institution, as the case may be keeping the account. 2. Notice Deposit Receipt and Accounts 4 * * * and similar receipts and accounts by whatever name described 2 * * * with the banks operating in Pakistan, post offices, National Savings Centres and financial institutions issuing such receipts and keeping such accounts. 1* * * 2.5% of the face value of a receipt or the amount standing to the credit of an account 5[as the case may be] at the commencement of the day on the Valuation Date, in each Zakat year. 6[The date on which the first return is paid or the date of encashment with drawal, whichever be earlier in the Zakat year.] The bank, office centre or institution, as the case may be, issuing the receipt or keeping the account, and responsible for paying the return or the amount encashed/withd -rawn. 1The words, bracket and figure “(other than those mentioned in serial number 2)” have been omitted by the Zakat and Ushr (Amdt.) Ordinance, 1980 (52 of 1980) s. 15. 2Omitted by the Zakat and Ushr (Amdt.) Ordinance, 1984 (46 of 1984), s. 3. 3The heading “the valuation date”, figure “3” and entries relating thereto, have been omitted by Ordinance 52 of 1980, s. 15. 4Subs. ibid., for “receivable or”. 5Subs, ibid., for certain original words. 6The word “applicable” omitted , ibid., 7Subs. ibid., for “surrender”. 1 2 3* 4 5 6 3. 4. 5. Fixed Deposit Receipts 1* * * and Accounts and similar receipts and accounts 2* * * and certificates (e.g., Khas Deposit Certificates), by whatever name described, issued by the banks operating in Pakistan, post offices, National Savings Centres and financial institution,.—on which return is receivable by the holder periodically or is received earlier than maturity. Savings (deposit certificates e.g. Defence Savings Certificates, National Deposit Certificates), receipts and accounts by whatever name described, issued or kept by the banks operating in Pakistan, post offices. National Savings Centres, financial institution, statutory corporations and companies,— on which return is 4[receivable and] is received by the holder, only on maturity or encashment. Units of the National Investment (Unit) Trust. 3*** 33*** 3 3*** 2.5% of the face value of a receipt or a certificate, or the amount standing to the credit of an account,as the case may be, as at the commencement of the day on the Valuation Date, in each Zakat year. 2.5% of the payable value of certificates or receipts or the amount standing to the credit of an account, 5[as the case may be, as on the valuation Date]. 2.5% of the 6* repurchase value of the Units as on the The date on which the first return is paid, or the date of encashment redemption withdrawal, whichever be earlier in the Zakat year. The date on which the value on maturity is paid, or of encashment/withdrawal whichever be earlier in the Zakat year. The date on which the first return or the 7[repurchase] value is The bank, office, Centre or institution, as the case may be, issuing the receipt or certificate or keeping the account, and responsible for paying the return, or encashment redemp- tion/withdrawal . The bank office, Centre, institution, corporation or company, as the case may be responsible for paying the return or the amount, withdrawn, or redeeming/ encashing the certificates or receipts. The Trustee of the National Investment (Unit) Trust or its 1 2 *2 4 5 6 6. 7. 8. I.C.P. Mutual Fund Certificates. Government securities (other than prize bonds and certificates men- tioned at serial number 3 and 4) on which return is receivable by the holder periodically. Securities including shares and debentures of 3[companies or statutory Corporations] (excluding those held in the name of a 4[company or a statutory corporation] and those mentioned at serial number 5, 6 and 7), on which return is payable peri- odically or otherwise, and is paid. 2*** 2*** 2*** Valuation Date in each Zakat year. 2.5% of the face value, or the market value based on the closing rate at the Karachi Stock Exchange, whichever be lower as on the Valuation Date in each Zakat year. 2.5% of the face value of the Government securities as on the Valuation Date in each Zakat year. If listed on the stock exchange, 2.5% of the paidup value, or the market value based on the closing rate at the Karachi Stock Exchange, whichever be lower as on the he Valuation Date, in each Zakat year. If not listed on the stock exchange 2.5% of the paid up value on the Valuation Date, in each Zakat year. paid whichever be earlier in the Zakat year. The date on which the first return is paid in the Zakat year. The date on which the first return is paid or the date of encashment/redemption, whichever be earlier in the Zakat year. The date on which the first return is paid, or the date of encashment/redemption, whichever the earlier in the Zakat year. authorised agent paying the return on, or the 1[repurchase] value of, the Units. Investment Corporation of Pakistan. The bank, office or institution as the case may be, responsible for paying the return on encashing redeeming the securi- ty. The corporation, company or institution, as the case may be, responsible for paying the return or encashing/redeeming the security. 1Subs. by the Zakat and Ushr (Amdt.) Ordinance, 1980 (52 of 1980), s. 15, for “surrender/repurchase 2The heading “The valuation date”, figure “3” and entries relating thereto, have been omitted ibid., 3Subs. ibid., for “statutory corporations or companies”. 4Subs. ibid., for “statutory corporation or company”. 1The heading “The valuation date”, figure “3” and entries relating thereto, have been omitted by the Zakat and Ushr (Amdt.) Ordinance, 1980 (52 of 1980), s.15. 2Subs. ibid., for the original entry. 3Ins. ibid., 4Subs. by S.R.O. No. 739(1)/81—A32, dated 8th July, 1981, see Gazette of Pakistan, 1981, Part II, page 1729. 5Subs. by Ord. 52 of 1980, s 15 for the original entries. 1 2 3 4 5 6 9. Annuities 1* * * 2[2.5% of the aggregate amount of annuity benefit in each Zakat year or 2.5% of the surrender value on the Valuation Date, as the case may be.] The date of 3[first] payment of the annuity benefit, or of the surrender value, whichever be earlier in the Zakat year. 4[The insurer or the bank keeping the amount in the form of an annuity.] 10. Life insurance policies. 1* * * 2[2.5% of the payable value on maturity or of sur- render value,as on the Valuation Date in the Zakat year in which the policy matures or its survival benefit or surrender value is paid, as the case may be.] The date of payment of value on maturity or of survival benefit or of surrender value. The insurer. 11. Provident Funds. 1* * * 5[In case of non- refundable advance, 2.5% of the amount drawn or, in case of final settlement 2.5% of the balance standing to the credit of the subscriber as on the Valuation Date, excluding in both cases the employer”s contribution and the return accrued thereon. The date of payment of the advance or of the balance. The authority, officer or institution making payment of the advance or of the balance.] Note.—1. Deduction at source exceeding two and one half per cent of the value of an asset specified in this Schedule, shall not be made in respect of that asset within the same Zakat year. 1[1 A. No Zakat shall be charged on the amount paid as premium of a life insurance policy of a person from his Provident Fund and, where the proceeds of a life insurance policy of a person are credited to his Provident Fund during a Zakat year, no Zakat shall be charged on the amount received or drawn during that year as final settlement of his accountin the Provident Fund or as non-refundable advance, to the extent of the precedes so credited.] 2. If the amount to be deducted at source as Zakat, in a particular case, is less than a rupee, it shall not be charged, and, if it is more than a rupee but has a fraction of a rupee, fifty paisas and more shall be treated as the next higher rupee and less than fifty paisas shall not be charged. 2[Where the entire amount of the return balance instalment of annuity benefit is to be appropriated towards Zakat, and the amount contains a fraction of a rupee, this fraction shall not be so appropriated]. 3. The 3* * * Deduction Date 4[for serial number 1] shall be deemed to be a public holiday, for banks only, within the meaning of the Negotiable Instruments Act, 1881 (XXVI of 1881). Banks shall, however, remain open for their employees. 5[4. In case the amount of the first return on any of the assets specified as S. Nos. 2, 3 and 5 to 8, or the first instalment of the annuity benefit, is less than the Zakat due, the entire amount of such return or instalment shall be appropriated towards Zakat and the unrealized balance shall be deducted from the subsequent returns or instalments paid during the same Zakat year or, as the case may be, from the encashment or surrender value.]. 1New Note 1-A ins. by the Zakat and Ushr (Amdt.) Ordinance, 1980 (52 of 1980), s. 15, for the original entries. 2Added ibid.. 3Certain original words have been omitted, ibid., 4Ins. ibid., 5New note 4 added ibid.. SECOND SCHEDULE [See sections 2, 3(5) and 5] ITEMS NOT SUBJECT TO COMPULSORY LEVY OF ZAKAT BUT ON WHICH ZAKAT IS PAYABLE BY EVERY SAHIB-I-NISAB ACCORDING TO THE RELEVANT NISAB, ON SELF-ASSESSMENT BASIS, EITHER TO A ZAKAT FUND OR TO ANY INDIVIDUAL OR INSTITUTION, ELIGIBLE, UNDER THE SHARIAH, TO RECEIVE ZAKAT 1The heading “The Valuation Date”, figure “4” and entries relating thereto, have been omitted by the Zakat and Ushr (Amdt.) Ordinance, 1980 (52 of 1980), s. 16. 2Subs. ibid., for the original entry. S.No. Items Rate and Basis for Self-Assessment 1* * * 1 2 3 1* 1. 2[Gold and silver and manufactures thereof.]; ……………... 2.5% of the market value, as on the Valuation Date. 2. Cash ....................................................................................... 2.5% of the amount, as on the Valuation Date. 3. Prize bonds............................................................................. 2.5% of the face value, as on the Valuation Date. 4. 2[Current Accounts and foreign currency accounts and, to the extent not subject to compulsory levy of Zakat under the First Schedule, other accounts, certificates, receipts, Units of National Investment (Unit) Trust, ICP-Mutual Fund Certificates, Government securities, annuities, life insurance policies and Provident Funds.] 2.5% of the value of the asset, as on the Valuation Date. 5. Loans receivable, excepting loans receivable by banks, other financial institutions statutory corporations and Companies. 2.5% of the amount of loan receivable, as on the Valuation Date 1* * * 6. Securities including shares and debentures, to the extent not subject to compulsory levy of Zakat under the First Schedule. If listed on the stock exchange, 2.5% of the market value (i.e. the closing rate at the Karachi Stock Exchange), as on the Valuation Date. If not listed on the stock exchange, 2.5% of the paid-up value, as on the Valuation Date. 7. Stock-in-trade of:— (a) Commercial undertakings (including dealers in real estate). (b) Industrial undertakings (a) 2.5% of the book value, or, at the option of the sahib-e-nisab, the market value, as on the Valuation Date. (b) 2.5% of the book value, or, at the option of the sahib-e-nisab, the market value of raw materials and finished goods, as on the Valuation Date. 1* * * 1 2 3 1* 1* 2(c) Precious metals and stones and manufactures thereof (d) Fish and other catch produce of the sea, except catches by indigenous techniques. 2.5% of the market value, as in the Valuation Date. 2.5% of the value, as on the Valuation Date.] 3* * * * * * * 1* * * 9. Agricultural (including horticultural and forest) produce :— (a) Tenant”s share (a) (i) 10% of the produce as on the Valuation Date, in the barani area; and (ii) 5% of the produce, as on the Valuation Date, in the non-barani area. 1* * * (b) Other than the tenant”s share. 4[(b) (i) 5% over and above the compulsory 5%, in the barani areas, as on the Valuation Date ; and (ii) One-fourth of the value of produce allowed as an allowance for expenses on production.] 10. Animals (fed free in pastures) :_____ (a) Sheep or goats (a) (i) For owners of one to 39 heads : nil; (ii) For owners of 40 to 120 heads : one sheep/goat; (iii) For owners of 121 to 200 heads : two sheep/goats ; (iv) For owners of 201 to 400 heads : three sheep/goats ; and (v) For owners of every complete additional hundred heads: one sheep/goat, as on the Valuation Date. (b) Bovine animals (b) (i) For owners of one to 29 heads: nil; (ii) For owners of 30 to 39 heads : one-year old calf; (iii) For owners of 40 to 59 heads : two-years old calf; (iv) For owners of 60 head and every additional 10 heads : one year old calf for each 30 heads and two- years old calf for each 40 heads,—as on the Valuation Date. 1* * * (c) Camels (c) (i) For owners of one to 4 heads : nil; (ii) 5[For owners of 5 to 24 heads : one sheep goat for every five heads:] 1The heading “The Valuation Date”, figure “4” and entries relating thereto, have been omitted by the Zakat and Ushr (Amdt.) Ordinance, 1980 (52 of 1980), s. 16. 2Added by the Zakat and Ushr (Amdt:) Ordinance, 1980 (52 of 1980), s. 16. 3Serial No. 8 and entries relating thereto have been omitted ibid. 4Subs. ibid., for entry (b). 5Subs. ibid., for entry c (ii). ___________ 1Subs. by the Zakat and Ushr (Amdt.) Ordinance, 1980 (52 of 1980), s. 16, for figure “26”. 2The heading “The Valuation Date”, figure “4” and entries relating thereto, have been omitted by the Zakat and Ushr (Amdt.) Ordinance, 1980 (52 of 1980), s.16. 3Serial No. 11 and entries relating thereto have been omitted ibid,. (iii) For owners of 1[25] to 35 heads : one she-camel between one year and two-years old : and (iv) For owners of 36 to 45 heads : one she-camel between two and three-years old ; and so on, as on the Valuation Date. 2* * * 3* * * * * * * * 2* * * 12. Wealth and financial assets other than those listed in schedule, on which Zakat is payable according to Shariah. As per Shariah. 2* * *"
}