{
  "file": "administrator398ab6a39b232bd13fbc7ccc0becdef0.pdf",
  "law_name": "The Pakistan Junior Cadet Corps Act, 1953",
  "text": "THE PAKISTAN JUNIOR CADET CORPS ACT, 1953 CONTENTS 1. Short title, extent and commencement 2. Definitions 3. Constitution of Junior Cadet Corps 4. Constitution and organization of units 5. Certain students to be deemed to be enrolled 6. Officers of the Junior Cadet Corps 7. Officers to be attached to regular units for training 8. Officers to be subject to military law 9. Allowance of officers 10. Termination of officer’s commissions 11. Military training of cadets 12. Discipline of Cadets 13. Members of Junior Cadet Corps not to be liable to perform service 14. Power to make rules THE PAKISTAN JUNIOR CADET CORPS ACT, 1953 ACT No. XXXVI of 1953 [5th November, 1953] An Act to constitute a Junior Cadet Corps WHEREAS it is expedient to provide for the constitution and maintenance of a Junior Cadet Corps for Pakistan and for its administration ; It is hereby enacted as follows :___ 1. Short title, extent and commencement.___ (1) This Act may be called the Pakistan Junior Cadet Corps Act, 1953. (2) It applies to the whole of Pakistan. (3) It shall come into force at once. 2. Definitions. In this Act, unless there is anything repugnant in the subject or context,___ (a) “cadet” means a school boy who is deemed to be enrolled as a cadet under sub-section (1) of section 5 ; (b) 1[* * * * * * *] (c) “prescribed” means prescribed by rules made under this Act. 3. Constitution of Junior Cadet Corps. There shall be raised and maintained in the manner hereinafter provided a force, which shall be designated the Junior Cadet Corps, and shall consist of units constituted under section 4. 4. Constitution and organization of units.___(1) Subject to the control of the 2[Federal Government], the 1[Chief of the Army Staff] may, by order in writing, direct the constitution and maintenance for any boys’ school in Pakistan of two separate companies of the Junior Cadet Corps, each company to consist of the boys of one of each of the two final classes of the school, and may direct the disbandment of the companies so constituted. (2) The companies constituted under sub-section (1) from schools located in the same revenue district shall jointly constitute a battalion to be designated after the name of that district. 5. Certain students to be deemed to be enrolled.___(1) On the constitution of a company under sub-section (1) of section 4, every student of the class concerned who,___ 1Omitted and subs. by The Federal Adaptation of Laws Order 1975 (President’s Order No. 4 of 1975, Art. 2 and Sch. 3Subs., ibid. Art. 2 and Table. (i) is above thirteen years of age, at the commencement of the academic year, or by the first day of April of that year, and (ii) is certified on examination by an officer of the Pakistan Army Medical Corps to be physically fit to undergo the prescribed military training, shall be deemed to have been enrolled as a cadet in that company. (2) A student who is deemed to be enrolled as a cadet in a company under sub-section (1) shall not cease to belong to that company, until he passes out of or otherwise leaves, the class for which the company was constituted, or is duly certified by an officer of the Pakistan Army Medical Corps to have become physically unfit to undergo further military training. 6. Officers of the Junior Cadet Corps.___(1) The 1[Federal Government], on the recommendation of the Headmaster of the school for which units of the Junior Cadet Corps have been constituted under sub-section (1) of section 4, supported by the Director of Public Instruction of the Province concerned and the officer commanding the local military formation being not below the rank of brigadier, may appoint any member of the staff of that school, who is not less than twenty- three and not more than thirty-five years of age, as an officer of the corps. (2) A person appointed officer under sub-section (1) shall be granted a commission in the form prescribed in this behalf under sub-section (2) of section 232 of the Government of India Act, 1935 3[or under clause (2) of Article 40 of the Constitution] 4[of 1956 or under clause (2) of Article 17 of the Constitution of 1962] 2[or under clause (2) of Article 56 of the Interim Constitution of 1972 or under clause (2) of Article 243 of the Constitution of 1973]. 7. Officers to be attached to regular units for training. An officer of the Junior Cadet Corps shall be liable, under the orders of the officer commanding the local military formation being not below the rank of brigadier, to be attached to a unit of the regular army for undergoing the military training prescribed for his class. 8. Officers to be subject to military law. An officer of the Junior Cadet Corps shall, when undergoing military training under section 7, be subject to 5[* * *] the Pakistan Army Act, 1952 (XXXIX of 1952),] in such manner and to such extent as may be prescribed. 9. Allowance of officers.___An officer of the Junior Cadet Corps may be paid such allowance by the Provincial Government concerned as may have been agreed upon between the 1[Federal Government] and the Provincial Government: Provided that an officer, who is attached to a regular unit for training under section 7, shall receive such additional allowances as may be prescribed. 10. Termination of officer’s commissions.___ (1) The 1[Federal Government] may withdraw the commission of an officer at any time and for any cause whatever. 1Subs. by The Federal Adaptation of Laws Order, 1975 (P. O. No. 4 of 1975), Art. 2 and Table. 2Added ibid., Art. 2 and Sch. 3Added by The Central Adaptation of Laws Order, 1961 (P. O. No. 1 of 1961), Art. 2 and Sch. 4Ins. by The Central Adaptation Order of Laws 1964 (P. O. No. 1 of 1964), Art. 2 and Sch. 5Omitted by the Federal Laws (Revision and Declaration) Ordinance, 1981 (XXVII of 1981), s. 3 and II Sch. (2) An officer of the Junior Cadet Corps shall cease to hold his commission___ (i) on ceasing to be a member of the staff of the school from which he received his commission: Provided that an officer who is immediately re-employed in another school for which companies of the Junior Cadet Corps have been constituted under subsection (1) of section 4 may, on the recommendation of the Headmaster of that school, be allowed by the 1[Chief of the Army Staff] to retain his commission ; (ii) on attaining the age of forty-five years. 11. Military training of cadets.___A cadet shall be liable to undergo the prescribed military training. 12. Discipline of Cadets.___(1) The Headmaster of each school shall be Honorary commanding officer of the companies constituted for his school under sub-section (1) of section 4 and the primary responsibility for enforcing discipline in those companies shall rest on him. (2) With the approval of the 1[Chief of the Army staff] the Headmaster of each school may frame rules for the punishment of cadets who wilfully and without reasonable cause absent them- selves from parades held for imparting the prescribed military training or who are otherwise guilty of conduct to the prejudice of good order and discipline in the Junior Cadet Corps. (3) In addition to any other punishment, which the Headmaster may specify therein, the rules made under sub-section (2) shall provide for the subjection of the offender to extra drill for twenty minutes. 13. Members of Junior Cadet Corps not to be liable to perform service.___Officers and cadets of the Junior Cadet Corps shall not be liable to perform military service of any kind whatever. 14. Power to make rules. The 1[Chief of the Army Staff] may, with the approval of the 2[Federal Government], make rules to provide for any matter which may be prescribed under this Act and to carry out the purposes of this Act. ___________ 41351 Date: 03-02-2025 1Subs. by the Federal Adaptation of Laws Order, 1975 (P. O. No. 4 of 1975), Art. 2 and Sch. Subs. ibid., Art. 2 and Table."
}