{
  "file": "administratorc94aeb8ee3e750bf2775495293a4972b.pdf",
  "law_name": "THE PUBLICATION OF THE HOLY QURAN (ELIMINATION OF",
  "text": "THE PUBLICATION OF THE HOLY QURAN (ELIMINATION OF PRINTING ERRORS) ACT, 1973 CONTENTS 1 Short title, extent and commencement 2 Definitions 3 Registration of publishers and recording companies 4 Quran Board 5 Publishing of the Holy Quran 5A. Literal distortion of the text of Ayah 5B. Translation or interpretation of the Holy Quran contrary to belief of Muslims 5C. Disposal of damaged or Shaheed copies 6 Penalty 7 Offences by corporations 8 Power to make rules THE SCHEDULE THE PUBLICATION OF THE HOLY QURAN (ELIMINATION OF PRINTING ERRORS) ACT, 1973 ACT NO. LIV OF 1973 [28th July, 1973] An Act to ensure publication of the text of the Holy Quran free from errors of printing WHEREAS it is expedient to ensure publication of the text of the Holy Quran free from errors of printing, and matters connected therewith; It is hereby enacted as follows:___ 1. Short title, extent and commencement.—(1) This Act may be called the Publication of the Holy Quran (Elimination of Printing 1[and Recording] Errors) Act, 1973. (2) It extends to the whole of 2[Islamabad Capital Territory.] (3) It shall come into force at once. 2. Definitions.—In this Act, unless there is anything repugnant in the subject or context,___ 3[(a) “Ayah” means a sentence, clause or verse of the Holy Quran at the end of which the sign “O” is given in the standard copy; 2[(b)] “Committee” means the Committee of Ulema appointed under section 4;] 2[(c) “damaged or Shaheed copy of the Holy Quran” includes: (i) a sub-standard copy of the Quran, damaged or worn-out pages of the Holy Quran; (ii) any other material in the form of book, magazine, card, bill, flex etc. that contains Arabic Text of the Holy Quran; (d) “disposal” means collection and storage of demaged or shaheed copy of the Holy Quran and includes its burial under the ground or its disposal in the sea or river or re-cycling it in such manner as conforms to its holiness and sanctity;] 2[(e)] “Holy Quran” means the Holy Quran in the Arabic text, published in complete form, or in the form of parts (Paras) or Chapters (Surahs), but does not include extracts published in text-books or prayer-books or religious treaties; 2[(f)] “prescribed” means prescribed by rules made under this Act; 2[(g) “Quran Board” means the Board constituted under section 4;] 1[2[(h)] “record of the Holy Qur’an” means the Holy Qur’an recited in human voice and recorded by any modern means of recording conforming to the text thereof contained in the standard copy; 2[(i)] “recording company” means a person, or an association of persons, registered under section 3 as a recording company;] 2[(j)] “standard copy” means a copy of the Holy Quran authenticated by the 2[Quran Board] as correct and free from errors of printing. 1Ins. by Act No. X of 1987, ss. 2-3. 2Subs., re-numbered and ins. by Act No. II of 2024, ss. 2-3. 3Subs. by Act No. XXXVIII of 1976, s. 2. 3. Registration of publishers 1[and recording companies].___Any publisher who intends to publish 1[, and any recording company which intends to record, the Holy Qur’an shall get himself or itself] registered with the Auqaf 2[Directorate, Islamabad Capital Territory,] 2[***], on payment of such fee and on such terms and conditions as may be prescribed. 4. 2[Quran Board].___(1) The Federal Government shall 2[constitute a Quran Board] comprising prominent Ulema, Huffaz and Qaris of all schools of thought amongst Muslims. 2[(2) The Federal Government shall in the prescribed manner cause a copy of the Holy Quran to be prepared and shall forward it to the Quran Board for authentication as a standard copy. (3) The Federal Government shall in the prescribed manner keep the standard copy in the Government archives for safe custody including to upload it on website of the Division to which business of religious affairs stands allocated.] 2[(4) The Quran Board shall recommend steps for error-free printing and publication or recording of the Holy Quran and shall, subject to the direction of the Government, supervise the work of error-free printing and publication and recording of the Holy Quran including uploading the copies on the Internet. (5) The Quran Board shall perform such other functions as may be prescribed.] 5. Publishing of the Holy Quran.___(1) A publisher may print the Holy Quran in off-set, photostate, photo-block or any other modern system of printing but he shall not print it in litho process. (2) In printing the Holy Quran, a publisher shall use paper the use of which is not prohibited by the Federal Government. (3) Every publisher shall get his specimen copy 1[, and every recording company shall get its specimen record,] of the Holy Quran compared with the text of the standard copy by a person holding a diploma from a religious institution or a certificate of Moulvi Fazil or a qualified Qari who is also a Hafiz or a person trained in the job of proof reading in Arabic and have a certificate recorded by such person at the end to the effect that the text and references do not contain any error. (4) The publisher shall ensure— (a) that the serial number of every Chapter (Surah) is printed on every page and the serial number of every 3[Ayah] is inserted within the sign of conclusion (o) of every 3[Ayah]; (b) that the cover page of every edition of the Holy Quran clearly bears the name of the publisher, the name of the printing press, and the year of publication; (c) that every page of the Holy Quran bears the indication given in the illustration in the Schedule; and (d) that on detection of any error or omission in the printed Holy Quran the leaf on which it occurs is replaced by a fresh leaf free from such error and omission in each copy: 1Ins. and subs. by Act No. X of 1987, ss. 4-5. 2Subs., omitted and added by Act No. II of 2024, ss. 4-5. 3Ins. and subs. by Act No. XXXVIII of 1976, s. 3. Provided that he shall not be penalized for non-compliance with the provisions of paragraphs (a) and (c) 1[unless he is found negligent in the performance of his duty]. (5) No translation of the Holy Quran shall be published 2[or recorded] without its Arabic text. 1[(5a) Arabic text of the Holy Quran shall not be printed on newspapers, flexes, cards, hand bills, brochures or on any other such disposable forms, and only its translation shall be printed in such forms where required.] 2[(6) No record of the Holy Qur’an which injuries its sanctity in any form shall be prepared]. 3[5A. Literal distortion of the text of Ayah.—Where, in a copy 2[or record] of the Holy Quran or in any extract thereof published in a text-book, prayerbook, religious treatise or otherwise, an Ayah has been so literally distorted, either by change of a word, or of sequence, or of Aarab, as to alter its meaning, the printer or publisher thereof 2[or, as the case may be, recording company], whether registered under this Act or not, shall, unless he 2[or it] can prove that such distortion occurred only due to a printing 2[or mechanical] error, be liable to the punishment provided for in section 6.] 2[5B. Translation or interpretation of the Holy Qur’an contrary to belief of Muslims.— Where, in a copy or record of the Holy Qur’an, or in any extract thereof published in a text book, prayer book, religious treatise or other book, an Ayah of the Holy Qur’an is translated, interpreted or commented upon by a non Muslim contrary to the belief of Muslims, the author, printer or publisher, or the person who prepared the record, whether registered under this Act or not, shall, unless he can prove that such translation, interpretation or commentary occurred only due to a printing or mechanical error, be liable to the punishment provided for in section 6.] 1[5C. Disposal of damaged or shaheed copies. ___A publisher or a recording company shall make suitable arrangements in the prescribed manner for disposal of damaged or shaheed copy of the Holy Quran.] 6. Penalty.___2[(1) A printer or publisher who, or a recording company which, contravenes any provision of this Act or the rules made thereunder, or a person in whose voice a record is prepared, or a person who has certified, under sub-section (3) of section 5, a specimen copy, or record, of the Holy Qur’an which is not in conformity with the provisions of this Act shall be liable to imprisonment for a term which may extend to three years, or with fine amounting to not less than 1[twenty] thousand rupees, or with both.] (2) The registration under section 3 of a publisher who 2[, or recording company which,] is convicted of an offence under sub-section (1) may be cancelled. 7. Offences by corporations.—If the person guilty of an offence under sub-section (1) of section 6 is a company or other body corporate, every director, manager, secretary or other officer thereof shall, unless he proves that the offence was committed without his knowledge or that he exercised all due diligence to prevent the commission thereof, be deemed to be guilty of such offence. 8. Power to make rules.___(1) The Federal Government may, by notification in the official Gazette, make rules for carrying out the purposes of this Act. (2) In particular and without prejudice to the generality of the foregoing power, such rules may provide for__ ________________________________________________________________________________________________________________________ 1Ins. added and subs. by Act No. II of 2024, sss. 6-8. 2Ins. and added by Act No. X of 1987, ss. 5-8. 3Ins. by Act No. XXXVIII of 1976, s. 4. 1[(a) the inspection of the copies and records of the Holy Qur’an printed or, as the case may be, prepared before the commencement of this Act;] (b) the prohibition of the sale of copies 1[and records] containing errors 2[;] 2[(c) the checking of all such copies 1[and records] of the Holy Quran as have not been certified under this Act as free from errors, at the expense of the publisher 1[or recording company]; 3[*] (d) the seizure of such copies 1[or records] of the Holy Quran in which there exist errors which cannot, in the opinion of the prescribed authority, easily be corrected in print 1[or record] 3[;]] 3[(e) the constitution and functions of the Quran Board; and (f) the disposal of damaged and shaheed copies of the Holy Quran.] ––––––––––– THE SCHEDULE [See section 5(4) (c)] Illustration Upper side of the page Serial number of Surah with caption as Page number Serial number of Para with opening words as Lower side of the page Serial number of Surah with serial number of the concluding Ayah on the page as Manzil Serial Number of Surah with opening Ayah on the page as _____________ RGN Date: 03-09-2024 1Subs., ins. and added by Act No. X of 1987, s. 9. 2Subs. by Act No. XXXVIII of 1976, s. 5. 3Omitted, subs. and added by Act No. II of 2024, s. 9."
}