{
  "file": "administratorbe81002044f65895757da5cc51a85222.pdf",
  "law_name": "THE EMPLOYERS’ LIABILITY ACT, 1938 CONTENTS 1. Short",
  "text": "THE EMPLOYERS’ LIABILITY ACT, 1938 CONTENTS 1. Short title and extent 2. Definitions 3. Defence of common employment barred in certain cases 4. Risk not to be deemed to have been assumed without full knowledge 5. Saving THE EMPLOYERS’ LIABILITY ACT, 1938 1ACT NO. XXIV OF 1938 [24th September, 1938] An Act to declare that certain defences shall not be raised in suits for damages in 2[Pakistan] in respect of injuries sustained by workmen. WHEREAS it is expedient to declare that certain defences shall not be raised in suits for damages in 2[Pakistan] in respect of injuries sustained by workmen ; It is hereby enacted as follows:___ 1. Short title and extent.___ (1) This Act may be called the Employers’ Liability Act, 1938. 2[(2) It extends to the whole of Pakistan.] 2. Definitions. In this Act, unless there is anything repugnant in the subject or context,___ (a) “workman” means any person who has entered into, or works under a contract of service or apprenticeship with an employer whether by way of manual labour, clerical work or otherwise, and whether the contract is expressed or implied, oral or in writing; and (b) “employer” includes any body of persons whether incorporated or not, any managing agent of an employer, and the legal representatives of a deceased employer, and, where the services of a workman are temporarily lent or let on hire to another person by the person with whom the workman has entered into a contract of service or apprenticeship, means such other person while the workman is working for him. 3. Defence of common employment barred in certain cases. Where personal injury is caused to a workman___ (a) by reason of the omission of the employer to maintain in good and safe condition any way, works, machinery or plant connected with or used in his trade or business, or by reason of any like omission on the part of any person in the service of the employer who has been entrusted by the employer with the duty of seeing that such way, works, machinery or plant are in good and safe condition ; or (b) by reason of the negligence of any person in the service of the employer who has any superintendence entrusted to him, whilst in the exercise of such super- intendence ; or _________________________________________________________________________________ 1The Act has been applied to Baluchistan, see the Leased Areas (Laws) Order, 1950 (G. G. O. 3 of 1950) ; and applied in the Federal Areas of Baluchistan, see Gazette of India, 1937, Pt. I, p. 1999 ; It has also been extended to ___ (i) the Leased Area of Baluchistan, see the Leased (Laws) Order, 1950 (G. G. O. 3 of 1950) ; and applied in the Federal Areas of Baluchistan, see Gazette of India, 1937, Pt. I, p. 1499 ; (ii) the Baluchistan States Union, see the Baluchistan States Union (Federal Laws) (Extension) Order, 1953 (G. G. O. 4 of 1953), as amended ; (iii) the Khairpur States, see Khairpur (Federal Laws) (Extension) Order, 1953 (G. G. O. 11 of 1953), as amended ; and (iv) the State of Bahawalpur, see the Bahawalpur (Extension of Federal Laws) Order, 1953 (G. G. O. 11 of 1953), as amended. The Act has been and shall be deemed to have been brought into force in Gwadur with effect from the 8th September, 1958, by the Gwadur (Application of Central Laws) Ordinance 1960 (XXXVII of 1960), s. 2. 2Subs. by the Central Laws (Statute Reform) Ordinance, 1960 (Ordinance No. XXI of 1960), s. 3 and 2nd Sch. (c) by reason of the negligence of any person in the service of the employer to whose orders or directions the workman at the time of the injury was bound to conform and did conform, where the injury resulted from his having so conformed ; or (d) by reason of any act or omission of any person in the service of the employer done or made in obedience to any rule or bye-law of the employer (not being a rule or bye-law which is required by or under any law for the time being in force to be approved by any authority and which has been so approved) or in obedience to particular instructions given by any person to whom the employer has delegated authority in that behalf or in the normal performance of his duties ; a suit for damages in respect of the injury instituted by the workman or by any person entitled in case of his death shall not fail by reason only of the fact that the workman was at the time of the injury a workman of, or in the service of, or engaged in the work of, the employer. 4. Risk not to be deemed to have been assumed without full knowledge. In any such suit for damages, the workman shall not be deemed to have undertaken any risk attaching to the employ- ment unless the employer proves that the risk was fully explained to and understood by the workman and that the workman voluntarily undertook the same. 5. Saving. Nothing in this Act shall affect the validity of any decree or order of a civil Court passed before the commencement of this Act in any such suit for damages. ____________ Date: 24-09-2024"
}