{
  "file": "administrator183bd5ab6b69cfd8ff0b4c2eb366597f.pdf",
  "law_name": "THE CIGARETTES (PRINTING OF WARNING) ORDINANCE, 1979 CONTENTS",
  "text": "THE CIGARETTES (PRINTING OF WARNING) ORDINANCE, 1979 CONTENTS __________ 1. Short title, extent application and commencement. 2. Definitions. 3. Printing of health warning. 4. Prohibition to sell, etc. 5. Penalties. 6. Offences by companies. 7. Cognizance of offences. 8. Power to make rules. Update on 06.05.2023 THE CIGARETTES (PRINTING OF WARNING) ORDINANCE 1979. ORDINANCE No. LXXIII OF 1979 [31st December, 1979] An Ordinance to provide for printing of a health warning on packets of cigarettes. WHEREAS it is expedient to provide for printing or health warning on packets of cigarettes and for matters connected therewith; AND WHEREAS the President is satisfied that circumstances exist which render it necessary to take immediate action; NOW, THEREFORE, in pursuance of the Proclamation of the fifth day of July, 1977, read with the Laws (Continuance in Force) Order, 1977 (C.M.L.A. Order No. 1 of 1977), and in exercise of all powers enabling him in that behalf, the President is pleased to make and promulgate the following Ordinance:― 1. Short title, extent 1[application] and commencement:―(1) This Ordinance may be called the Cigarettes (Printing of Warning) Ordinance, 1979. (2) It extends to the whole of Pakistan. 2[(2A) It shall apply to Cigarettes manufactured for consumption in Pakistan.] (3) It shall come into force on the first day of 3[September], 1980. 2. Definition.—In this Ordinance, unless there is anything repugnant in the subject or context,― (a) “cigarette” includes Biri; (b) “health warning” means the health warning specified in section 3; and (c) “packet” includes a wrapper or other container. 4[3. Printing of health warning.—There shall be printed legibly and prominently, both in English and Urdu, on every packet of tobacco and on all types of advertisements on any media, a health wraning as the Ministry of Health may, by notification in the official Gazette, prescribe.] 4. Prohibition to sell, etc.— No person shall— (a) manufacture packets of cigarettes; or (b) sell or offer for sale cigarettes from packets of cigarettes; or (c) possess or sell or offer for sale packets of cigarettes, on which the health warning is not printed as required by Section 3. 1Ins. by the Cigarettes (Printing of Warning) (Amendment) Ordinance, 1980 (40 of 1980.) ,s.2. 2Sub-section (2A) ins. ibid., s.2. 3Subs. by Cigarettes (Printing of Warning) (Amdt.) Ordinance, 1980 (40 of 1980), s.2. 4Subs. by Ord. LXXV of 2002,s.2. 5. Penalties.—(1) Whoever contravenes any provision of Section 4 shall be punishable with imprisonment for a term which may extend to two years, or with fine which may extend to ten thousand rupees, or with both. (2) Where a Court convicts a person of an offence punishable under sub-section (1), it shall direct that the packets of cigarettes and the cigarettes in respect of which the offence has been committed be forfeited to the Federal Government. 6. Offences by companies.— If the person contravening any provision of Section 4 be a company or other body corporate, every director, manager, secretary or other officer or agent thereof shall, unless he proves that the contravention took place without his knowledge or that he exercised all due diligence to prevent such contravention, be deemed to be guilty of such contravention. 7. Cognizance of offences.—(1) No Court inferior to that of a Magistrate of the First Class shall try any offence punishable under this Ordinance. (2) No Court shall take cognizance of an offence punishable under this Ordinance except on a complaint made in writing by a police officer not below the rank of an Assistant Sub-Inspector or an Excise Officer not below the rank of an Sub-Inspector or any other officer authorised in this behalf by the Federal Government. 8. Power to make rules.—The Federal Government may, by notification in the official Gazette, make rules1 for carrying out the purposes of this Ordinance. ___________________ 1For such rules, see S.R.O. 45(1)/82, dated 19.1.1982, Gaz. of P., 1982, Ext., Pt. IIp. 68."
}