{
  "file": "administrator3d7efadcb67ac48dd8fd78c78cd1c1fb.pdf",
  "law_name": "The Pakistan Atomic Energy Commission Ordinance, 1965",
  "text": "THE PAKISTAN ATOMIC ENERGY COMMISSION ORDINANCE, 1965 CONTENTS CHAPTER I PRELIMINARY 1. Short title, extent and commencement. 2. Definitions. 3. Establishment of the Commission. 3A. Employment under Commission to be employment under Federal Government. 3B. [ Act IV of 2008 not to apply to commission]. CHAPTER II COMPOSITION AND FUNCTION OF THE COMMISSION 4. Composition of the Commission. 5. Term of office of member, etc.. 6. Functions of the Commission. 7. Meetings of the Commission, etc. 7A. Standing bodies and committees. 8. [Omitted]. 9. [Omitted]. 10. Funds of the Commission. 11. Budget. 12. Delegation of powers. 13. Appointment of officers, etc. Updated till 3.8.2022 CHAPTER III. MICELLANEOUS 14. Cooperation with international organizations, etc. 15. Submission of periodical reports, etc. 16. Directives from the 1[Federal Government]. 17. Discoveries and inventions to vest in the Commission. 18. Declaration of fidelity and secrecy. 19. Power to make rules. 20. Power to make regulations. 21. Continuance of certain rules, etc. 22. Winding up. 23. Dissolution of Pakistan Atomic Energy Council, etc. THE PAKISTAN ATOMIC ENERGY COMMISSION ORDINANCE, 1965 1ORDINANCE No. XVII OF 1965. [29th May, 1965] An Ordinance to provide for the establishment of an Atomic Energy Commission. WHEREAS it is expedient to provide for the establishment of an Atomic Energy Commission for the promotion of the peaceful uses of atomic energy in Pakistan, the discharge of international obligations connected therewith, the execution of development projects involving nuclear power stations an matters incidental thereto; AND WHEREAS the National Assembly is not in session and the President is satisfied that circumstances exist which render immediate legislation necessary; NOW, THEREFORE, in exercise of the powers conferred by clause (1) of Article 29 of the Constitution and of all other powers enabling him in that behalf, the President is pleased to make and promulgate the following Ordinance :― CHAPTER I PRELIMINARY 1. Short title, extent and commencement. Atomic Energy Commission Ordinance, 1965. (2) It extends to the whole of Pakistan. (3) It shall come into force at once. (1) This Ordinance may be called the Pakistan 2. Definitions. In this Ordinance, unless there is anything repugnant in the subject or context,— (1) “Atomic energy” means the energy or ionizing radiations released in any process which involves transformation of, or reaction between atomic nuclear and includes energy liberated as a result of the fission of special nuclear material of fusion or atomic unclei : (2) “ Chairman “ means the Chairman of the Commission ; (3) “Commission “ means the Pakistan Atomic Energy Commission established or deemed to be established under section 3 ; (4) “ prescribed “ means prescribed by rules made under this Ordinance ; (5) “special nuclear material” means plutonium – 239. Uranium - 235, or uranium - 233 or any other material which the Commission determines to be capable of releasing energy through fission. 1Approved by the National Assembly on 21st July, 1965, see Gaz. of P., 1965, Ext., p. 596. 3. Establishment of the Commission. (1) As soon as may be after the commencement of this Ordinance, the 1[Federal Government] shall establish, in accordance with the provisions of this Ordinance, a Commission to be called the Pakistan Atomic Energy Commission. (2) The Commission shall be a body corporate by the name of the Pakistan Atomic Energy Commission, having perpetual succession and a common seal, with power, subject to the provisions of Ordinance, to acquire and hold property, both movable and immovable, and shall by the said name sue and be sued. (3) The headquarters of the Commission shall be at Islamabad. 2* * * * * * * 3[3A Employment under Commission to be employment under Federal Government. Every employment under the commission shall, for the purposes of the Pakistan Essential Services (Maintenance) Act, 1952 (LIII of 1952), be deemed to be employment under the Federal Government and the said Act shall have effect accordingly. 3B. 4[Act IV of 2008 not to apply to Commission]. Nothing contained in the Industrial Relations 4[Act 2008 (Act IV of 2008)] shall apply to or in relation to the Commission or any of the officers, advisers and employees appointed by it]. 1 Sub. by the Pakistan Atomic Energy commission (Amdt.) Act, 1974 (16 of 1974), s. 2. for “Central Government”. 2Sub-section (4) omitted by the Federal Laws (Revision and Declaration) ordinance, 1981 (27 of 1981) s. 3 and Sch. II. 3Added by Act 16 of 1974 s. 3, 4Sub. by the Pakistan Atomic Energy commission (Amdt.) Act. 2010 (21 of 2010), s. 2. CHAPTER II COMPOSITION AND FUNCTIONS OF THE COMMISSION 4. Composition of the Commission. (1) The Commission shall consist of the following members1 to be appointed by the 2[Federal Government], namely : Full-time members (a) a Chairman ; 3* * * (b) a Finance member, being representative of the Ministry of Finance, Government of Pakistan; and 4[(c) 5[Seven] technical members of whom one may be a Member for Administration ; and] 5* * * 4[(d) * * * * * * (e) * * * * * * * (f) * * * * * * * (2) The Chairman 3* * * and other members of the Commission 3* * * * shall be appointed by the 7[Federal Government]. (3) The Chairman shall be the chief executive officer of the Commission, and 3* * * the other members, except the Finance member, shall perform such functions as the Commission may assign to them from time to time. (4) The Finance member shall exercise such powers and discharge such duties as may be prescribed. 5[(5) Notwithstanding the composition of the Board prescribed in subsection (1), the Federal Government may increase or decrease the number of members of the Commission and prescribe the qualifications and mode of appointment in such manner as it may deem appropriate.] 5. Term of office of members etc. (1) Save as hereinafter provided, a member of the Commission 3* * * * * shall hold office for a period of three years from the date of his appointment and shall be eligible for re-appointment for such further period or periods, not exceeding three years at any one time, as the 6[Federal Government] may deem fit. (2) Where a person is appointed to be a member of the Commission by virtue of his holding an office or appointment he shall cease to be such member when he ceases to hold that office or appointment. 1 Members of the Commission have been appointed vide S.R.O. 661 (K)/65, see Gaz. of P., 1965, Pt. I, p. 569. 2 Subs. by the Pakistan Atomic Energy Commission (Amdt.) Act, 1974 (16 of 1974) s. 2. for “Central Government”. 3Omitted by Ord. 12 of 2001, ss 2&3. 4Subs. by Act. 16 of 1974 s. 4 for clause “c”. 5Subs.omitted and add by the Pakistan Atomic Energy Commission (Amdt.) Act, 2010 (21 of 2010) s.3. 7Subs. Ibid., s. 2 for “Central Government”. (3) A person appointed to be a member of the Commission may at any time resign his office by letter addressed to the Chairman: Provided that no resignation shall take effect until it has been accepted by the 1[Federal Government]. (4) A vacancy caused by resignation or any other reason shall be filled by the appointment of a person qualified to fill such vacancy. (5) The 1[Federal Government] may at any time terminate the appointment of the Chairman 2* * *or any other member of the Commission 2* * * without assigning any reason. (6) No act or proceeding of the Commission shall be invalid merely on the ground of the existence of a vacancy in, or defect in the constitution of, the Commission. 6. Functions of the Commission. (1) The functions of the Commission shall be to do all acts and things, including research work, necessary for the promotion of the peaceful uses of atomic energy in the fields of agriculture, medicine and industry and for the execution of development projects involving nuclear power stations and the generation of electric power thereat. (2) The Commission may, on behalf of the 3[Federal Government] or, with the approval of the 3[Federal Government], on behalf of a Provincial Government perform such other functions relating to the peaceful uses of atomic energy, and on such terms and conditions, as may be agreed upon between the Commission and such Government. 4[(2A) Notwithstanding anything contained in the regulation of Mines and Oil-fields and Mineral Development (Government Control) Act, the powers of the Federal Government under that Act (XXIV of 1948), shall, in relation to mines of nuclear substances and development of such substances be exercisable by the Commission. Explanation. In this sub-section, “nuclear substance” means any substance or material which the Commission determines as being a substance or material which is or may be used for the production of or use in, atomic energy or for research into matters connected therewith, and includes all substances obtained or obtainable from the soil by underground or surface working which are radioactive.] (3) In the performance of its functions, the Commission shall be guided on questions of policy by the instructions, if any, given to it by the 1[Federal Government] which shall be the sole judge as to whether a question is a question of policy. 1 Subs. by the Pakistan Atomic Energy Commission (Amdt.) Act, 1974 (16 of 1974), s. 2 for “Central Government,”. 2Omitted by Ord. 12 of 2001, s. 3. 3Subs. by Act (16 of 1974), s. 2, for Central Government. 4 Ins ibid., s. 5. (4) The Commission shall, in order to carry out any functions under sub-section (1) or sub- section (2), (a) prepare and submit for the approval of the 1[Federal Government] proposals, schemes or projects in such form as may be indicated by the 1[Federal Government] or, where the functions are to be performed on behalf of a Provincial Government, by that Government ; and (b) proceed to give effect to a proposal, scheme or project as approved by the 1[Federal Government]. 7. Meetings of the Commission, etc. shall regulate the procedure for its meetings. (1) Save as hereinafter provided, the Commission (2) Meetings of the Commission shall be called by the Chairman on such date and at such time and place as may be specified by him: Provided that (i) not less than four meetings shall be held every year, and (ii) at least eight days' notice shall be given to the members specifying the date, time and place of the meeting. (3) The annual report and the accounts of the Commission for every financial year shall be submitted at a meeting of the Commission to be held within six months of the close of that year for adoption and record subject to such reservations as the Commission may make. (4) To constitute a quorum at a meeting of the Commission, not less than four members, including the Chairman, shall be present. (5) All meetings of the Commission shall be presided over by the Chairman, and, in the absence of the Chairman, 2* * * * * * * by a member of the Commission authorised in writing by the Chairman ; and in the absence of such authorization or of the member so authorized, by a member elected for the purpose by the members present. (6) Subject to such rules as the 1[Federal Government] may make regarding matters having financial implications, all questions at a meeting of the Commission shall be decided by a majority of the members present and voting, and in case of equality of votes, the person presiding shall have and exercise a second or casting vote. (7) Any business which it may be necessary for the Commission to transact may be transacted by circulation among all its members, and any proposal so circulated and approved by a majority of the members shall be as effectual and binding as if such proposal had been passed at a regular meeting of the Commission. 1 Subs. by the Pakistan Atomic energy commission (Amdt.) Act, 1974 (16 of 1974), s. 2, for “Central Government”. 2 Omitted and Subs. by Ord. 12 of 2001, s. 5. 1[7A. Standing bodies and committees. The commission may from time to time appoint such standing bodies or committees from amongst its members as it may consider necessary to assist it in the performance of its functions and to discharge such of its functions as it may assign to them.] 2* * * * * * * 2* * * * * * * 10. Funds of the Commission. (1) The funds of the Commission shall comprise― (a) funds of the Pakistan Atomic Energy Council which stand transferred to the Commission under section 23 ; (b) grants from the 3[Federal] and Provincial Governments; (c) donations and endowments ; (d) income from investments and royalties ; and (e) receipts of the Commission from such other sources as may be approved by the Commission. (2) The Commission may open a deposit account with the State Bank of Pakistan or with any Agency of the State Bank other than a Government Treasury or, with the approval of the 4[Federal Government], with any other bank. (3) The accounts of the Commission shall be audited by the 5[Auditor-General] of Pakistan, and shall be maintained, and presented for audit, in such form and manner as may be prescribed. 11. Budget. The Commission shall, by such date in each year as may be prescribed, submit to the 4[Federal Government] for approval, a budget in the prescribed form for each financial year showing the estimated receipts and expenditure and the sums which are likely to be required from the 4[Federal Government] during that financial year. 12. Delegation of powers. The Commission may, by general or special order in writing, direct that such of its powers shall, in such circumstances and under such conditions, if any, as may be specified in the order be exercisable also by the Chairman 6[the Deputy Chairman], or by such member or officer of the Commission as may be so specified. 13. Appointment of officers, etc. (1) The Commission may, subject to the provisions of sub-section (2) and such general or special orders as the 4[Federal Government] may give it from time to time, appoint such officers, advisers and employees as it considers necessary for the efficient performance of its functions on such terms and conditions as it may deem fit. (2) The 4[Federal Government] may direct the Commission to dispense with the services of any officer, adviser or employee and when so directed the Commission shall dispense with his services. 1Ins. ibid., by the Pakistan Atomic Energy Commission (Amdt.) Act, 1974 (16 of 1974), s. 6 2Omitted by the Pakistan Atomic Energy Commission (Amdt.) Act, 2010 (21 of 2010) s.4. 3Subs. by F.A.O., 1975, Art. 2 and Table, for “Central”. 4Subs. by the Pakistan Atomic Energy Commission (Amdt.) Act, 1974 (16 of 1974), s. 2, for “Central Government”. 5Subs. by Act 16 of 1974, s. 2, for “Comptroller and Auditor General”. 6Ins. by the Pakistan Atomic Energy Commission (Amdt.) Ordinance, 1979 (65 of 1979), s. 5. CHAPTER III MISCELLANEOUS 14. Co-operation with international organizations, etc. The Commission may, subject to the prior approval of the 1[Federal Government], co-operate with any foreign national authority or international organization in respect of the peaceful uses of atomic energy pursuant to the express terms and conditions of any programme or agreement for co-operation to which such authority or organization is a party or pursuant to any other international arrangement made before or after the commencement of this Ordinance. 15. Submission of periodical reports, etc. The Commission shall submit to the 1[Federal Government] at such time and at such intervals as the 1[Federal Government] may specify— (a) such periodical reports and summaries as may be required by the 1[Federal Government]; (b) annual reports on the Head-office and the different research centres, power stations and projects ; (c) such periodical returns, accounts statements and statistics as may be required by the 1[Federal Government] ; (d) information and comments asked for by the 1[Federal Government] on any specific point; (e) copies of the documents required by the 1[Federal Government] ; and (f) original documents required by the 1[Federal Government] for examination or any other purpose. 16. Directives from the 1[Federal Government]. The 1[Federal Government] may, from time to time, issue to the Commission such directives and orders as it may consider necessary for carrying out the purposes of this Ordinance and the Commission shall follow and carry out such directives and orders. 17. Discoveries and inventions to vest in the Commission. All rights relating to discoveries and inventions and any improvement in materials, methods, processes, apparatus or equipment made by any officer or employee of the Commission in the course of his employment shall vest in the Commission. 18. Declaration of fidelity and secrecy. Every member, adviser, officer or other employee of the Commission shall make such declaration of fidelity and secrecy as may be prescribed. 19. Power to make rules. The 1[Federal Government] may, by notification in the official Gazette, make rule to carry out the purposes of this Ordinance. 1 Subs. by the Pakistan Atomic Energy Commission (Amdt.) Act, 1974 (16 of 1974), s. 2, for “Central Government”. 20. Power to make regulations. The Commission may, with the previous sanction of the 1[Federal Government], make such regulations, not inconsistent with this Ordinance or the rules made thereunder, as may, in its opinion, be necessary or expedient for the achievement of its aims and objects and for the performance of its functions. 21. Continuance of certain rules, etc. All rules, regulations, and bye-laws of the Pakistan Atomic Energy Council registered under the Societies Registration Act, 1860 (XXI of 1860), and in force immediately before the commencement of this Ordinance, shall, mutatis mutandis, and so far as they are not inconsistent with any of the provisions of this Ordinance continue in force until repealed or altered by rules or regulations, made under this Ordinance. 22. Winding up. No provision of law relating to the winding up of bodies corporate shall apply to the Commission, and the Commission shall not be wound up except by order of the 1[Federal Government], and in such manner as the 1[Federal Government] may direct. 23. Dissolution of Pakistan Atomic Energy Council, etc. (1) Upon the commencement of this Ordinance the Pakistan Atomic Energy Council registered under the Societies Registration Act, 1860(XXI of 1860), shall, notwithstanding anything contained in that Act, stand dissolved, and upon such dissolution― (a) all assets, rights, powers, authorities and privileges, and all property, movable and immovable cash and bank balances, reserve funds investments and all other interests and rights in, or arising out of, such property and all debts, liabilities and obligation of whatever kind of the Council subsisting immediately before its dissolution shall stand transferred to and vest in the Commission. (b) all officers, consultants, advisers, auditors and other employees of the Council shall, notwithstanding anything contained in any law or in any agreement, deed, document or other instrument, stand transferred to the Commission and shall be deemed to have been appointed or engaged by the Commission in accordance with the terms and conditions of service applicable to them and no officer, consultant, adviser, auditor or other employee whose services are so transferred shall be entitled to any compensation because of such transfer ; (c) all debts and obligations incurred or contracts entered inot or rights acquired and all matters and things engaged to be done by, with or for the Council before its dissolution shall be deemed to have been incurred, entered into, acquired or engaged to be done, by, with or for the Commission ; and (d) all suits and other legal proceedings instituted by or against the Council before its dissolution shall be deemed to be suits and proceedings by or against the Commission and shall be proceeded or otherwise dealt with accordingly. (2) The 1[Federal Government] may, for the purpose of removing any difficulty in relation to the transfer and other matters specified in sub-section (1) make such orders as it considers expedient and any such order shall be deemed to be, and given effect to, as part of the provisions of this Ordinance. 1 Subs. by the Pakistan Atomic Energy Commission (Amdt.) Act, 1974 (16 of 1974), s. 2, for “Central government”."
}