{
  "file": "administratore8a332cad1093952d0ecb86288b38c75.pdf",
  "law_name": "The General Clauses Act, 1897",
  "text": "THE GENERAL CLAUSES ACT, 1897 CONTENTS PRELIMINARY 1. Short title. 2. [Repealed.] GENERAL DEFINITIONS 3. Definitions. 4. Application of foregoing definitions to previous enactments. 4A. Application of certain definitions to all Pakistan laws. GENERAL RULES OF CONSTRUCTION 5. Coming into operation of enactments. 5A. [Omitted.] 6. Effect of repeal. 6A. Repeal of Act making textual amendment in Act or Regulation. 7. Revival of repealed enactments. 8. Construction of references to repealed enactments. 9. Commencement and termination of time. 10. Computation of time. 11. Measurement of distances. 12. Duty to be taken pro rata in enactments. 13. Gender and number. 13A. [Omitted.] POWERS AND FUNCTIONARIES 14. Powers conferred to be exercisable from time to time. 15. Power to appoint to include power to appoint ex Officio. 16. Power to appoint to include power to suspend or dismiss. 17. Substitution of functionaries. 18. Successors. 19. Official chiefs and subordinates. PROVISIONS AS TO ORDERS, RULES, ETC., MADE UNDER ENACTMENTS. 20. Construction of orders, etc., issued under enactments. 20A. Rules and order, etc., to be published. 21. Power to make, to include power to add to, amend, vary or rescind, orders, rules or bye laws. 22. Making of rules or bye laws and issuing of orders between passing and commencement of enactment. 23. Provisions applicable to making of rules or bye-laws after previous publication. 24. Continuation, of orders, etc., issued under enactments repealed and reenacted. 24A. Exercise of power under enactments. MISCELLANEOUS 25. Recovery of fines. 26. Provision as to offences punishable under two or more enactments. 27. Meaning of service by post. 28. Citation of enactments. 29. Saving for previous enactments, rules and bye-laws. 30. Application of Act to Ordinances. 31. Application of Act to Orders made by the President. THE SCHEDULE. [Repealed.] THE GENERAL CLAUSES ACT, 1897 1Act No. X OF 1897 [11th March, 1897] An Act to consolidate and extend the General Clauses Acts, 1868 and 1887. WHEREAS it is expedient to consolidate and extend the General Clauses Acts, 1868 (I of 1868) and 1887 (I of 1887); it is hereby enacted as follows: — PRELIMINARY 1. Short title.—(1) This Act may be called the General Clauses Act, 1897; 2[* * * * * * *] 2. [Repeal.].Rep. by the Repealing and Amending Act, 1903 (I of 1903), s. 4 and Schedule III. GENERAL DEFINITIONS 3. Definitions. In this Act, and in all 3[Central Acts] and Regulations made the commencement of this Act, unless there is anything repugnant in the subject or context, (1) “Abet.” “abet”, with its grammatical variations and cognate expressions, shall have the same meaning as in the Pakistan Penal Code (Act XLV of 1860). 4[* * * * * * *] (2) “Act.” “act”, used with reference to an offence or a civil wrong, shall include a series of acts, and words which refer to acts done extend also to illegal omissions: (3) “Affidavit.” “affidavit” shall include affirmation and declaration in the case of persons by law allowed to affirm or declare instead of swearing: 5[* * * * * * *] 1For Statement of Objects and Reasons, see Gazette of India, 1897, Pt. V, p. 38; for Report of the Select Committee, see ibid., p. 77 ; and for Proceedings in Council, see ibid. Pt. VI, pp. 35, 40, 56 and 76. This Act has been declared to be in force in Baluchistan by the British Baluchistan Laws Regulation, 1913 (2 of 1913). It has been applied to Phulera in the Excluded Area of Upper Tanawal to the extent the Act is applicable in the N.W.F.P., subject to certain modi- fications; and also extended to the Excluded Area of Upper Tanawal (N.W.F.P.) other than Phulera with effect from such date and subject to such modifications as may be notified, see N.W.F.P. (Upper Tanawal) (Excluded Area) Laws Regulation, 1950. . It has also been extended to the Leased Areas of Baluchistan, see the Leased Areas (Laws) Order, 1950 (G.G.O.3 of 1950); and applied in the Federated Areas of Baluchistan, see Gazette of India, 1937, Pt. I, p. 1499. The Act has been extended to the whole of Pakistan and shall be deemed to have been so extended on the 14th day of October, 1955, see the Central Laws (Statute Reform) Ordinance, 1960 (21 of 1960), s. 3 and Second Sch. The provisions of this Act have been extended to the Special Areas of West Pakistan by West Pakistan Regulation No.1 of 1961 (with effect .from the 13th September, 1961). 2The word “and” in sub-section (1) and the whole of sub-section (2) rep. by the Repealing & and Amending Act. 1914 (10 of 1914), s. 3 and Sch. II. 3Subs. by .A. 0. 1937. for “Acts of the G.G. in C.”. 4C1. (1a) as amended by A. 0., 1949, Sch., has been omitted by the Federal Laws (Revision and Declaration), Ordinance, 1981 (27 of 1981) s. 3 and 2nd Sch. 5Cls. (3a) and (3b) as amended by Act 10 of 1914, s. 2 and Sch. I, Act 24 of 1917, s. 2 and Sch. I, Act 18 of 1928, s. 2 and Sch. I, A.O., 1937, and Ord. 21 of 1960, s. 3 and 2nd Sch. (w.e.f. 14th October, 1955), has been omitted by Ord. 27 of 1981, s. 3 and 2nd Sch. (3c) “Baluchistan.” “Baluchistan” shall mean the territories comprised in the Chief Commissioner's Province of Baluchistan immediately before the fourteenth day of October, 1955 1[,] 1[and after the first day of July, 1970, the Province of Baluchistan, comprising the territories mentioned in the Schedule to the Province of West Pakistan (Dissolution) Order, 1970:] 2[* * * * * * *] (4) “Barrister.” “barrister” shall mean a barrister of England or Ireland, or a member of the Faculty of Advocates in Scotland: 3[* * * * * * *] 4[* * * * * * *] 5[* * * * * * *] 6[* * * * * * *] 7[* * * * * * *] 8[(7) “British India.” “British India” shall mean, as respects the period before the 9commencement of Part III of the Government of India Act, 1935 (26 Geo.5.2.), all territories and places within His Majesty's dominions which were for the time being governed by His Majesty through the Governor General of India or through any Governor or officer subordinate to the Governor General of India, and as respects any period after that date 10[and before the establishment of the Federation of Pakistan] means all territories for the time being comprised within the Governors' Provinces and the Chief Commissioners' Provinces, except that a reference to British India in an Indian law passed or made before the 9commencement of Part III of the Government of India Act, 1935 (26 Geo.5.2.), shall not include a reference to Berar:] (8) “British possession.” ”British possession” shall mean any part of Her Majesty's dominions, exclusive of the United Kingdom, and, where parts of those domin ions are under both a central and a local legislature, all parts under the Central Legislature shall, for the purposes of this definition, be deemed to be one British possession: 11[* * * * * * *] 1Subs.and added by F. A. 0., 1975, Art. 2 and Sch. 2El. (3d) omitted by Ord. 27 of 1981, s. 3 and Sch. II. 3C1. (5) as amended by Act 10 of1914, s. 2 and Sch. I and Act 24 of 1917, s. 2 and Sch. I, has been omitted by the Federal Laws (Revision and Declaration) Ordinance, 1981, (27 of 1981) s. 3 and 2nd Sch. 4C1. (5a) relating to “Berar”, which was ins. by A.O., 1937, rep. by the Federal Laws (Revision and Declaration) Act, 1951 (26 of 1951), s. 3 and 2nd Sch. 5Cl. (5b) relating to “Bihar and Orissa Act”, which was first ins. as c1. (5a) by the Repealing and Amending Act, 1914 (10 of 1914), s. 2 and Sch. I and then re-numbered as c1. (5b) by A. 0., 1937, rep. by the Federal Laws (Revision and Declaration) Act, 1951, (26 of 1951), s. 3 and 2nd Sch. 6CI. (5c) which was ins. by A. 0., 1937, rep. by Act. 26 of 1951, s. 3 and 2nd Sch. 7CI. (6) as amended by various enactments has been omitted by the Federal Laws (Revision and Declarations) Ordinance, 1981, (27 of 1981), s. 3 and 2nd Sch. 8Subs. by A.O., 1937, for the original clause (7). 9I.e., the 1st April, 1937. 10Ins. by the Pakistan (Adaptation of Existing Pakistan Laws) Order, 1947 (G. G. O. 20 of 1947). 11Cl. (8a) relating to “Burma Act” which was ins. by the Amending Act, 1903 (1 of 1903), s. 3 and Sch. II, rep. by the Federal Laws (Revision and Declaration) Act, 1951 (26 of1951), s. 3 and 2nd Sch. 1[(8aa) “Central Act.” “Central Act” shall mean an Act of the Central lagislature, and shall include, except in section 5, an Act made by the Governor General under section 67 B of the Government of India Act, 2[ * * *:] 3[(8ab) “Federal Government.” “ 4[Federal Government]” shall— (a) in relation to anything done before the 5commencement of Part III of the Government of India Act, 1935 (26 Geo.5.2.), mean the Governor General in Council or the authority competent at the relevant date to exercise the functions corresponding to those subsequently exercised by the Governor General; (b) in relation to anything done after the 5commencement of Part III of the said Act, but before the establishment of the Federation of Pakistan, mean, as respects matters with respect to which the Governor General was by or under the provisions of the said Act then in force required to act in his discretion, the Governor General and as respects other matters, the Governor General in Council; 6[*] (c) in relation to anything done 7[* * *] after the establishment of the Federation of Pakistan 8[but before the twenty-third day of March, 1956], mean the Governor General; and shall include (i) in relation to functions entrusted under sub-section (1) of section 124 of the said Act to the Government of a Province, the Provincial Government acting within the scope of the authority given to it under that sub-section; and (ii) in relation to the administration 9[before the fourteenth day of October, 1955,] of a Chief Commissioner's Province, the Chief Commissioner acting within the scope of the authority given to him under sub section (3) of section 94 of the said Act 10[;] 11 * 1Ins. by A. 0., 1937. 2The words and figures “or section 44 of the Government of India Act, 1935” omitted by the Pakistan (Adaptation of Existing PakistanLaws) Order, 1947 (G. G. O. 20 of 1947). 3Subs. ibid., for clause (8ab), which had been ins. by A. 0., 1937. 4Subs. by F.A.O. , 1975 for Art. 2 and Table for, “Central Government” 5i.e., the 1st April, 1937 6The word “and” omitted by A. 0., 1961, Art. 2 and Sch. (with effect from the 23rd March, 1956). 7The words “or to be done” omitted ibid. (with effect from the 23rd March, 1956). 8Ins. ibid. (with effect from the 23rd March, 1956). 9Ins. by the Central Laws (Statute Reform) Ordinance, 1960 (21 of 1960), s. 3 and Second Sch. (with effect from the 14th October, 1955). 10Sub,. by A. 0.,1961, Art. 2 and Sch., for the full stop (with effect from the 23rd March, 1956). 11Omitted, subs. and added by F.A.O., 1975, Art. 2 and Sch. 1[(d) in relation to anything done or to be done, after the twenty-third day of March, 1956, mean the President; and shall inc1ude in relation to functions entrusted to the Government of a Province, the Provincial Government acting within the scope of the authority given to it by the President 2[ ; and]] 2[(e) in relation to anything done or to be done, after the fourteenth day of August, 1973, mean the Prime Minister and the Federal Ministers; and shall include in relation to functions entrusted to the Government of a Province, the Provincial Government acting within the scope of the authority given to or power conferred on it by the Federal Government;] 3[(8ac) “Central Legislature.” “Central Legislature” shall mean the Governor General in Council acting in a legislative capacity under the Government of India Act, 1833 (3&4, will.4), the Government of India Act, 1853(c. 85 16&17 vict.), The Indian Councils Act, 1861 to 1909 (c. 95.&6.), or any of those Acts, or the Government of India Act, 1915(Geo.5,c.61,26), the Indian Legislature acting under the Government of India Act, or the Government of India Act, 1935 (Geo.5,c.2), or the Federal Legislature acting under the Government of India Act, 1935, 4[or the Parliament acting under the Constitution 5[of 1956 or the Central Legislature acting under the Constitution of 1962] 6[ or the Federal Legislature acting under the Interim Constitution of 1972, or Parliament acting under the Constitution of 1973] as the case may require :] 7[* * * * * *] 8[* * * * * *] (9) “Chapter.” “Chapter” shall mean a Chapter of the Act or Regulation in which the word occurs: 1Subs.-clause (d) ins. by A.O., 1961, Art. 2 and Sch. (with effect from the 23rd March, 1956). 2Subs and Added by F.A.O., 1975, Art.2 and Sch. 3CI. (8ac) ins. by A. 0., 1937. 4Certain words ins, by A. 0.,1961, Art. 2 and Sch. (with effect from the 23rd March, 1956). 5Ins. by A. 0., 1964, Art. 2 and Sch. 6Ins. by F. A. 0., 1975, Art. 2 and Sch. 7Cl. (8b) relating to “Central Provinces Act” which was ins. by the Second Repealing and Amending Act, 1914 (17 of 1914), s. 2 and Sch. I, rep. by the Federal Laws (Revision and Declaration) Act, 1951 (26 of 1951), s. 3 and 2nd Sch. 8CI. (8c) relating to “Central Provinces and Berar Act”, which was ins. by A. 0.,1937, rep. by Act 26 of 1951, s. 3, and II Sch. 1[(9a) “Chief Revenue Authority.” “Chief Revenue Authority” shall mean the Board of Revenue of a Province:] 2[(10) “District Officer (Revenue).” shall m eans the chi e f officer in c h a r g e of r e v e n u e administration of a District:] 3[* * * * * * *] (12) “Commencement.” “commencement”, used with reference to an Act or Regulation, shall 4mean the day on which the Act or Regulation comes into force: 5[* * * * * * *] 6[(13a) “Constitution.” “Constitution” means the Constitution of the Islamic Republic of Pakistan brought into force on the 3[fourteenth day of August, 1973] :] 8[(14) “Consular Officer.” “Consular officer” shall include consul-general, consul, vice- consul, consular agent pro-consul and any person for the time being authorized to perform the duties of consul-general, consul, vice-consul or consular agent:] 9[* * * * * * *] (15) “District Judge.” “District Judge” shall mean the Judge of a principal Civil Court of original jurisdiction, but shall not include a High Court in the exercise of its ordinary or extraordinary original civil jurisdiction: (16) “Document.” “document” shall include any matter written, expressed or described upon any substance by means of letters, figures or marks, or by more than one of those means which is intended to be used, or which may be used, for the purpose of recording that matter: 10[* * * * * * *] 1Subs. by A. 0., 1964, Art. 2 and Sch., for (9a), which was first ins. by A. 0., 1937 and subsequently amended by the Pakistan (Adaptation of Existing Pakistan Laws) Order, 1947 (G.G.O. 20 of 1947), Act 26 of 1951, s.3 and 2nd Sch., the Central Laws (Statute Reform) Ordinance,1960 (21 of 1960), s. 3 and 2nd Sch., A. 0.,1961, Art. 2 and sch; and the Repealing and Amending Ordinance, 1961 (1 of 1961), s. 3 and 2nd Sch. 2Subs. by The General Clauses (Amdt.) Ordinance, 2001(Ord. No. XXXVI of 2001), s. 2. Except in Islamabad Capital territory where it shall come into force on such date as the Federal Government may, by notification in the official Gazette, Specify. Ord. 36 of 2001, s. 2 (w.e.f. 14-08-2001). 3Clause (11) relating to “colony”, which was amended by various enactments have been omitted by Federal Laws (Revision and Declaration) Ordinance, 1981, (27 of 1981) s. 3 and 2nd Sch. 4See section 5 on page 458, infra. 5Omitted by The General Clauses (Amdt.) Ordinance, 2001(Ord. No. XXXVI of 2001), s.2 (w.e.f 14-08-01). 6Cl. (13a) ins. by A.0., 1961, Art. 2 and Sch. (with effect from the 23rd March, 1956). 7Subs. by F.A.0, 1975, Art. 2 and Sch., for “eighth day of June, 1962” which was previously subs. by A.0., 1964, Art. 2 and Sch.,for “twenty third day of March, 1956”, to read as above. 8Cf. the Consular Salaries and Fees Act, 1891 (54 & 55 Vict., c. 36), s.3. 9Cls. (l4a) (14b) (l4c), (14d), (14e), (14f) and (14g), which were first ins. by A.0., 1937, and then amended by the Pakistan (Adaptation of Existing Pakistan Laws) Order, 1947 (G. G. O. 20 of 1947), Sch., omitted by A.0., 1961 Art. 2 and Sch. (with effect from the 23rd March, 1956). 10Clauses (16a), (16b) and (16c) which were ins. by Act 10 of 1914, G.G.O. 20 of 1947 and A.0., 1961 respectively, have been omitted by the Federal Laws (Revision and Declaration) Ordinance, 1981 (27 of 981), s.3. and 2nd Sch. (17) “Enactment.” “enactment” shall include a Regulation (as hereinafter defined) and any Regulation of the Bengal, 1[*] or Bombay Code, and shall also include any provision contained in any Act or in any such Regulation as aforesaid: (18) “Father.” “father “, in the case of anyone whose- personal law permits adoption, shall include an adoptive father: 2[* * * * * * *] 3[(19) “Financial year.” “financial year” means— (a) as respects the period before the first day of April, 1959, the year commencing on the first day of April and ending on the thirty first day of March; (b) as respects the period from the first day of April, 1959, to the thirtieth day of June, 1959, both days inclusive, that period ; and (c) thereafter, the year commencing on the first day of July and ending on the thirtieth day of June :] 4(20) “Good faith.” a thing shall be deemed to be done in “good faith” where it is in fact done honestly, whether it is done negligently or not: 5[(21) “Government.” “Government” or “the Government” shall include both the 6[Federal Government] and any Provincial Government:] 7[* * * * * * *] (25) “Immoveable property.” “immoveable property” shall include land, benefits to arise out of land, and things attached to the earth, or permanently fastened to anything attached to the earth: (26) “Imprisonment.” “imprisonment” shall mean imprisonment of either description as defined in the Pakistan Penal Code (Act XLV of 1860): 8[(27) “India.” “India” shall mean— (a) as respects any period before the establishment of the Federation of Pakistan, British India together with all territories of any Indian ruler then under the suzerainty of His Majesty, all territories under the suzerainty of such an Indian ruler, and the tribal areas; and (b) as respects any period after the establishment of the Federation of Pakistan all territories for the time being included in the Dominion of India 9[or the Union of India] :] 1The word “Madras” omitted by G.G.O. 20 of 1947, Sch. 2Clauses (18a) and (18b) relating to “Federal Government,” and “Federal Railway Authority” respectively omitted ibid. 3Subs. by the General Clauses (Amdt.) Ordinance, 1959 (14 of 1959), [section 2, for the original clause 19. 4Cf. the Pakistan Penal Code (Act 45 of 1860), s. 52, the Bills of Exchange Act. 1882 (45 & 46 Vict., c. 61), s. 90, and the Sale of Goods Act,1893 (56 & 57 Viet., c. 71, s. 62). For discussion in Council regarding this clause, see Gazette of India, 1897, Part VI, pp. 56 to 62 and 76 to 79. 5Subs. by A.O., 1937, for the original definition. 6Subs. by F.A.0.,1975, Art. 2 and Table, for “Central Government”. 7Cl. (21a) to (24) previously amended by various enactments have been omitted by the Federal Laws (Revision and Declaration) Ordinance, 1981 (27 of 1981) s. 3 and 2nd Sch. 8Subs. by G.G.O. 20 of 1947, Sch., for clause (27) which had been subs. for the original clause by A. 0., 1937. 9Ins. by the Central Laws (Statute Reform) Ordinance, 1960 (21 of 1960), s. 3 and Second Sch. (with effect from the 14th October, 1955). 1[* * * * * * *] 2[* * * * * * *] (28) “Local authority.” “local authority” shall mean a municipal committee, district board, body of port commissioners or other authority legally entitled to, or entrusted by the Government with, the control or management of a municipal or local fund: 3[* * * * * * *] (31) “Magistrate.” “Magistrate” shall include every person exercising all or any of the powers of a Magistrate under the Code of Criminal Procedure for the time being in force: (32) “Master” (of a ship). “master”, used with reference to a ship, shall mean any person (except a pilot or harbour-master) having for the time being control or charge of the ship: (33) “Month.” “month” shall mean a month reckoned according to the British calendar: (34) “Moveable property.” “moveable property” shall mean property of every description, except immoveable property: 4[(34a1) “North-West Frontier.” “North-West Frontier” shall mean the territories comprised in the North-West Frontier Province immediately before the fourteenth day of October, 1955 5[ , ]] 5[and on or after the first-day of July, 1970, the North West Frontier Province comprising the territories mentioned in the Schedule to the Province of West-Pakistan (Dissolution) Order, 1970:] 6[(34a) “North-West Frontier Province Act.” “North-West Frontier Province Act” shall mean an Act made by the local Legislature or the Governor of the North-West Frontier Province under the Government of India Act, or by the Provincial Legislature or the Governor of the North-West Frontier Province under the Government of India Act, (26 Geo.5, c.2.), 1935:] 7[* * * * * * *] (36) “Oath.” “oath” shall include affirmation and declaration in the case of persons by law allowed to affirm or declare instead of swearing: (37) “Offence.” “offence” shall mean any act or omission made punishable by any law for the time being in force: 1CI. (27a) relating to “Indian Law”, which was ins. by A. 0., 1937, omitted by the Pakistan (Adaptation of Existing Pakistan Laws) Order, 1947 (G.G.O. 20 of 1947). 2Clauses (27b) and (27c) previously amended by various enactments have been omitted by the Federal Laws (Revision and Declaration) Ordinance, 1981 (27 of 1981), s. 3 and 2nd Sch. 3CI. (29) defining “L. G.”, rep. by A.O., 1937 and cl. (30) defining “Madras Act” rep. by the Federal Laws (Revision and Declaration) Act, 1951 (26 of 1951), s. 3 and 2nd Sch. 4CI, (34a1). ins. by the Central Laws (Statute Reform) Ordinance, 1960 (21 of 1960), s. 3 and 2nd Sch. (with effect from the 14th October, 1955). 5Subs. and added by F.A.O., 1975, Art. 2 and Sch. 6Ins. by A.0., 1937. 7Clause (35) defining “North-Western Provinces and Oudh Act” rep. by the Federal Laws (Revision and Declaration) Act, 1951 (26 of 1951), s. 3 and 2nd Sch. 1[(37a) “Official Gazette.” “official Gazette” or “Gazette” shall mean the Gazette of 2[Pakistan], or, as the case may be, the official gazette of a Province:] 3[(37b) “Pakistan Law.” “Pakistan law” shall mean any Act, Ordinance, Regulation, rule, order, bye-law or any other instrument which has or had the force of law in Pakistan or any part thereof; but does not include an Act of Parliament of the United Kingdom or any Order-in- Council, rule or other instrument made thereunder;] 4[* * * * * * *] (38) “Part.” “Part” shall mean a Part of the Act or Regulation in which the word occurs: (39) “Person.” “person” shall include any company or association or body of individuals, whether incorporated or not: 5[(40) “Political Agent.” “Political Agent” shall,— (a) as respects the period before the fourteenth day of October, 1955, mean the principal officer by what-ever name called representing the 6[Federal Government] in an Acceding State or group of Acceding States or in any territory or place in the Tribal Areas 7[and as respects the period after the twenty first day of April, 1972, mean the principal officer by whatever name called representing the Federal Government in the Federally Administered Tribal Areas]; and (b) as respects the period after the thirteenth-day of October, 1955, 8[and before the twenty- first day of April, 1972,] mean the principal officer by whatever name called (i) representing the 9[Federal Government] in an Acceding State or (ii) representing the Provincial Government in the 10[Tribal Areas] 8 [and as respects the period after the twenty- first day of April, 1972, mean the principal officer by whatever name called representing the Federal Government in the Federally Administered Tribal Areas and the Provincial Government in the Provincially Administered tribal Areas] :] 1Ins. by A. O., 1937. 2Subs. by the Pakistan (Adaptation of Existing Pakistan Laws) Order, 1947 (G.G.O. 20 of 1947), Sch., for “India”. 3Clause (37b) which was originally ins. by G.G.O. 20 of 1947 and subsequently Subs. by A. 0.,1961, Art. 2 and Sch. have been subs. by the Federal Laws (Revision and Declaration) Ordinance, 1981 (27 of 1981), s. 3 and 2nd Sch. 4Cl. (37b) relating to “Orrisa Act” omitted by the General Clauses (Arndt.) Act, 1951 (27 of 1951), s. 2 (with effect from the 14th August, 1947). 5Subs. by the Central Laws (Statute Reform) Ordinance, 1960 (21 of 1960), s. 3 and 2nd Sch. (with effect from the 14th October, 1955), for clause (40), which was ins. by A.O., 1949, Sch. [The original clause (40) as amended by A. 0., 1937, had been omitted by the Pakistan (Adaptation of Existing Pakistan Laws) Order, 1947 (G.G.O. 20 of 1947), Sch.] 6Subs. by F.A.O., 1975, Art. 2 and Table, for “Central Government”. 7Subs. ibid., Art. 2 and Sch., for “or 1eased areas”. 8Ins. by F.A.O., 1975, Art. 2 and Sch. 9Subs. ibid, Art. 2 and Table, for “Central Government”. 10Subs. by A. 0., 1964, Art. 2 and Sch., for “Special Areas”. 1[* * * * * * *] 2[* * * * * * *] 3[(43ai) “Provincial Act.” “Provincial Act” shall mean an Act made by the Governor in Council, or Chief Commissioner in Council, Lieutenant-Governor in Council, or Chief Commissioner in Council of a Province under any of the Indian Councils Acts or the Government of India Act, 1915 or an Act made by the local Legislature or the Governor of a Province under the Government of India Act, or an Act made by the Provincial Legislature or Governor of a Province under the Government of India Act, 1935 (26 Geo. 5,c.2), or an Act made by the Provincial Legislature established or continued under the Constitution 4[of 1956 or an Act made by the Provincial Legislature established under the Constitution of 1962] 7[or an Act passed by a Provincial Assembly established under the Interim Constitution of 1972, or the Constitution of 1973] :] *5[(43a) “Provincial Government”. “Provincial Government”— 6[(a) as respects anything done after the establishment of the Federation of Pakistan but before the fourteenth day of October, 1955, shall mean in a Governor's Province, the Governor, and in a Chief Commissioner's Province, the 8[Federal Government] ; (aa) as respects anything done or to be done after the thirteenth day of October, 1955, shall mean the Governor, and where the administration of any area 9[vested in the Governor General or vests in the President],the 10[Federal Government];] 11[(aaa) as respects any thing done or to be done after the fourteenth day of August, 1973, shall mean the Chief Ministers and the Provincial Ministers and shall include, in relation to functions entrusted to the Federal Government, the Federal Government acting within tile scope of authority given to it by the Provincial Government] ; 12[(aaaa) as respects anything done or to be done after the thirtieth day of June, 1970, in relation to the Islamabad Capital Territory under any law coming into force after that day, s hall mean the Federal Government;] _________________________________________________________________________________ 1CI. (41) defining “Presidency town” omitted by G.G.O. 20 of 1947 Sch. 2Clauses (42) and (43) which were amended by A. 0., 1937, Ord. 21 of 1960, A. 0., 1961, have been omitted by the Federal Laws (Revision and Declaration) Ordinance, 1981 (27 of 1981), S. 3 and 2nd Sch. 3Ins. by A. 0., 1961, Art. 2 and Sch. (with effect from the 23rd March,1956). 4Ins. by A. 0., 1964, Art. 2 and Sch. 5Subs. by the Pakistan (Adaptation of Existing Pakistan Laws) Order, 1947 (G.G.0. 20 of 1947), Sch., for the. clause (43a), which was ins. by A. 0., 1937. 6Subs. by the Central Laws (Statute Reform) Ordinance, 1960 (21 of 1960), s.3 and 2nd Sch., for sub-clause (a) (with effect from the 14th October. 1955) *The Chief Administrator to be Provincial Government in respect Islamabad Capital Territory, Please see S.R.O 1316 (I)/80, dated 31-12-1980, read with P.O. 18 of 1980. 7Ins.by F.A.O, 1975, Art.2 and Sch. 8Subs.ibid, Art.2 and Table, for “Central Government”. 9Subs. by A.O., 1961, Art. 2 and Sch., for “vests in the Governor General” (with effect from the 23rd March, 1956). 10Subs. by F.A.O., 1975, Art. 2 and Table, for “Central Government “. 11Ins. ibid., Art. 2 and Sch. 12Ins. by the General Clauses (Amdt.) Ord., 1979 (32 of 1979), s. 2. (b) as respects anything done before the establishment of the Federation of Pakistan, but after the 1[commencement of Part III of the Government of India Act, 1935 (26 Geo. 5,c.2), shall mean in a Governor's Province, the Governor acting or not acting in his discretion, and exercising or not exercising his individual judgment, according to the provision in that behalf made by and under the said Act, and in a Chief Commissioner's Province, the 4[Federal Government] ; and (c) as respects anything done before the commencement of Part III of the said Act, shall mean the authority or person authorized at the relevant date to administer executive government in the Province in question:] (44) “Public nuisance.” “public nuisance” shall mean a public nuisance as defined in the Pakistan Penal Code (Act XLV of 1860). 2[* * * * * * *] (45) “Registered.” “registered”, used with reference to a document, shall mean registered in 3[a Province] under the law for the time being in force for the registration of documents: (46) “Regulation.” “Regulation” shall mean a Regulation made 5[by the 6[Federal Government] under the Government of India Act, 1870, 7[or the Government of India Act, 1915,] 8[or the Government of India Act,] 5[or under section 95 or section 96 of the Government of India Act, 1935] 9[or by the Governor under Article 103 or Article 104 of the Constitution. of 1956, or by the President or by the Governor under Article 223 of the Constitution of 1962] 10[,]10[or by the President or by the Governor under Article 247 of the Constitution of 1973:] (47) “Rule.” “rule” shall mean a rule made in exercise of a power”] conferred by any enactment, and shall include a regulation made as a rule under any enactment: (48) “Schedule.” “schedule” shall mean a schedule to the Act or Regulation in which the word occurs: 1I.e., the 1st April, 1937. 2C1s. (44al) and (44a) which were amended by various enactments have been omitted by the Federal Laws (Revision and Declaration) Ordinance, 1981, (27 of 1981), s. 3 and 2nd Sch. 3Subs. by the Pakistan (Adaptation of Existing Pakistan Laws) Order, 1947 (G.G.O. 20 of 1947), Sch., for “British India”. 4Subs.by F.A.O,1975, Art 2 and Table for “Central Government” 5Ins. by A.0., 1937. 6Subs. by F.A.O., 1975 Art. 2 and Table, for “Central Government”. 7Added by the Repealing and Amending Act, 1917 (24 of 1917), s. 2 and Sch. I. 8Ins., by Act 18 of 1928, s. 2 and Sch. I. 9Ins. by A. 0., 1964, Art. 2 and Sch. 10Subs. and added by F.A.O., 1975 Art. 2 and Sch. 1[(49) “Scheduled District.” “Scheduled District” shall mean a “Scheduled District” as defined in the Scheduled Districts Act, 1874 (XV of 1874): (50) “Section.” “section” shall mean a section of the Act or Regulation in which the word occurs: (51) “Ship.” “ship” shall include every description of vessel sed in navigation not exclusively propelled by oars: (52) “Sign.” “sign”, with its grammatical variations and cognate expressions, shall, with reference to a person who is unable to write his name, include “mark”, with its grammatical variations and cognate expressions: 2[* * * * * * *] (53) “Son.” “son”, in the case of any one whose personal law permits adoption, shall include an adopted son: 3[* * * * * * *] (54) “Sub-section.” “sub-section” shall mean a sub-section of the section in which the word occurs: 4[* * * * * * *] (55) “Swear.” “swear”, with its grammatical variations and cognate expressions, shall include affirming and declaring in the case of persons by law allowed to affirm or declare instead of swearing: 5[(55a) “Tribal Areas.” “Tribal Areas” shall (i) as respects the period after the first day of July, 1970 mean the areas in Pakistan which immediately before that day were the Tribal Area and include— (a) the Tribal Areas of Baluchistan and the North-West Frontier Province; and (b) the former States of Amb, Chitral, Dir and Swat; 1This clause was first amended by the Central Laws (Statute Reform) Ordinance, 1960 (21 of 1960), s. 3 and 2nd Sch. (with effect from the 14th October, 1955) and then revived, retrospectively by the Repealing and Amending Ordinance, 1961 (l of 1961), s. 3 and 2nd Sch. 2Cls. (52al) and (52a) which were ins. by A. 0., 1937 and Ord. 21 of 1960 and amended by F.A.O., 1975, have been omitted by the Federal Laws (Revision and Declaration) Ordinance, 1981 (27 of 1981), s. 3 and 2nd Sch. 3Cl. (53a), relating to “Special Areas” which was ins., by Ord. 21 of 1960, s. 3 and 2nd Sch. (with effect from the 14th October, 1955), has been omitted by A. 0.,1964, Art. 2 and Sch. 4Clause (54a), which was ins. by A. 0.,1937 and subs. by A. 0., 1961, have been omitted by the Federal Laws (Revision and Declaration) Ordinance, 1981 (27 of 1981). s. 3 and 2nd Sch. 5Clause (55a) defining “United Provinces Act” which was originally ins. by the Amending Act, 1903 (I of 1903), s. 3, Sch. II, repealed by the Federal Laws (Revision and Declaration) Act, 1951 (26 of 1951), s. 3 and 2nd Sch., and again ins by A.O., 1964, Art. 2 and Sch., have been subs. by F.A.O., 1975, Art. 2 and Sch. (ii) as respects the period on or after the tenth day of January 1964, and before the first day of July, 1970 mean the areas in the Province of West Pakistan which, on the thirteenth day of October, 1955, were (a) the Tribal Areas of Baluchistan the Punjab and the North-West Frontier; and (b) the States of Amb, Chitral, Dir and Swat; (iii) as respects the period on or after the eight day of June, 1962, and before the tenth day of January, 1964, mean the areas in the Province of West Pakistan which, on the thirteenth day of October, 1955, were— (a) the Tribal Areas of Baluchistan, the Punjab and the North-West Frontier ; and (b) the States of Amb, Chitral, Dir and Swat and the area in the Province of East Pakistan known as Chittagong Hill Tract; (iv) as respects the period on or after the twenty-third day of March, 1956, and before the eight day of June, 1962, mean the areas of the Province of West Pakistan which immediately before the commencement of the Establishment of West Pakistan Act, 1955, were— (a) the Tribal Areas of Baluchistan, the Punjab and the North-West Frontier; and (b) the States of Amb, Chitral, Dir and Swat; and (v) as respects the period before the twenty-third day of March, 1956, mean the areas in Pakistan which immediately before that day were the Tribal Areas and include (a) the Tribal Areas of Baluchistan, the Punjab and the North-West Frontier Province; and (b) the States of Amb, Chitral, Dir and Swat.] 1(56) “Vessel”. “vessel” shall include any ship or boat or any other description of vessel used in navigation. 2[* * * * * * *] 3(57) “Will”. “will” shall include a codicil and every writing making a voluntary posthumous disposition of property: 1Cf. s. 742 of the Merchant Shipping Act, 1894 (57 & 58 Vict., c. 60). This definition supplements the definition of ship in clause (51), supra. See also definition of vessel in s. 48 of the Pakistan Penal Code (Act 45 of 1860), and in s. 3 (4) of the Canal and Drainage Act, 1873 (8 of 1873) and ins. 2 (g) of the Customs Act, 1969 (4 of 1969). 2CIs. (56a) and (56aa) which were ins. by G.G.O. 20 of 1947 and Ord. 21 of 1960 respectively, have been omitted by Ord. 27 of 1981, s. 3 and 2nd Sch. 3Cf. the definition of “will “ in section 2 of the Succession Act, 1925 (39 of 1925). 1(58) “Writing.” expressions referring to “writing” shall be construed as including references to printing, lithography, photography and other modes of representing or reproducing words in a visible form: and (59) “Year.” “year” shall mean a year reckoned according to the British calendar. 4. Application of foregoing definitions to previous enactments.—(1)The definitions in section 3 of the following words and expressions, that is to say, “affidavit”, “barrister”, 2[* *] “District Judge”, “father”, 2[* * *] 3 [* * *] 2 [* *] “immoveable property”, “imprisonment”, 2[* *] “Magistrate”, “month”, “moveable property”, “oath”, “person”, “section”, ,”son”, “swear”, “will” and “year” apply also, unless there is anything repugnant in the subject or context, to all 4[Central Acts] made after the third day of January, 1868, and to all Regulations made on or after the fourteenth day of January, 1887. (2) The definitions in the said section of the following words .and expressions, that is to say, “abet”, “Chapter”, “commencement”, “financial year”, “local authority”, “master”, “offence”, “part”, “public nuisance”, “registered”, “schedule”, “ship”, “sign”, “sub -section” and “writing” apply also, unless there is anything repugnant in the subject or context, to all 5[Central Acts] and Regulations made on or after the fourteenth day of January, 1887. 6[4A. Application of certain definitions to all Pakistan Laws. — 7[(1) The definitions in section 3 of the expressions “British India”, “Central Act”, “8[Federal Government”, Central Legislature”, “Chief Revenue Authority”, “Gazette”, “High Court”, “India”, “Official Gazette”, “Pakistan law”, and “Provincial Government” apply also, unless there is anything repugnant in the subject or context, to all Pakistan laws.]. 9[* * * * * * *] 1Cf. s. 20 of the Interpretation Act, 1889 (52 & 53 Vict., c. 63). 2The words “British India”, “G. of I.”, “High Court” and “L. G.” rep. by A.O.,1937. 3The words “Her Majesty” or the Queen' rep. by the Repealing and Amending Act, 1919 (18 pf 1919), s. 3 and Sch. II. 4Subs. by A.O., 1937, for “Acts of the G.G in C.”. 5 Subs. by A.O., 1937, for “Acts of the G. G. in C.”. 6Ins. ibid. 7Subs. by the Federal Laws (Revision and Declaration) Ordinance, 1981 (27 of 1981), s. 3 and 2nd Sch., for sub-section (1), which was pre-viously amended by various enactments. 8Subs. by F.A.O., 1975, Art. 2 and Sch., for “Central Government”. 9Sub-sections (2) and (3) which were amended by various enactments have been omitted by the Federal Laws (Revision and Declaration) Ordinance, 1981 (27 of 1981) s. 3 and 2nd Sch. GENERAL RULES OF CONSTRUCTION 5. Coming into operation of enactments. 1[(1) Where any Central Act is not expressed to come into operation on any particular day, then it shall come into operation on the day on which it receives the assent,— (a) in the case of a Central Act made before the twenty-third day of March, 1956, of the Governor-General, and (b) in the case of a Central Act made after that date, of the President.] 2[* * * * * * *] (3) Unless the contrary is expressed, a 3[Central Act] or Regulation shall be construed as coming into operation immediately on the expiration of the day preceding its commencement. 45A. [Coming into operation of Governor-General's Act.] Omitted by the Pakistan (Adaptation of Existing Pakistan Laws) Order, 1947 ( G. G. O. 20 of 1947), Schedule. 6. Effect of repeal. Where this Act, or any 2[Central Act] or Regulation made after the commencement of this Act, repeals any enactment hitherto made or hereafter to be made, then, unless a different intention appears, the repeal shall not– (a) revive anything not in force or existing at the time at which the repeal takes effect; or (b) affect the previous operation of any enactment so repealed or anything duly done or suffered thereunder; or (c) affect any right, privilege, obligation or liability acquired, accrued or incurred under any enactment so repealed; or (d) affect any penalty, forfeiture or punishment incurred in respect of any offence committed against any enactment so repealed; or (e) affect any investigation, legal proceeding or remedy in respect of any such right, privilege, obligation, liability, penalty, forfeiture or punishment as aforesaid; and any such investigation, legal proceeding or remedy may be instituted, continued or enforced, and any such penalty, forfeiture or punishment may be imposed as if the repealing Act or Regulation had not been passed. 1Subs. by A. O., 1961, Art. 2 and Sch. (with effect from the 23rd March,1956), for the original sub-section (1), as amended by A. O., 1937. 2Sub-section (2), which was first subs. by the Repealing and Amending Act, 1917 (24 of 1917), s. 2 and Sch. I, and then amended by A. O., 1937 and the Pakistan (Adaptation of Existing Pakistan Laws) Order, 1947 (G. G.O. 20 of 1947), Sch., omitted by A. O., 1961. Art. 2 and Sch. (with effect from the 23rd March,.1956). 3Subs. by A. O., 1937. for “Act of the G.G. in C.”. 4S. 5A was ins. by A. O., 1937. 1[6A. Repeal of Act making textual amendment in Act or Regulation. Where any 2[Central Act ] or Regulation made after the commencement of this Act repeals any enactment by which the text of any 2[Central Act] or Regulation was amended by the express omission, insertion or substitution of any matter, then, unless a different intention appears, the repeal shall not affect the continuance of any such amendment made by the enactment so repealed and in operation at the time of such repeal.] 37. Revival of repealed enactments. (1) In any 2[ Central Act] or Regulation made after the commencement of this Act, it shall be necessary, for the purpose of reviving, either wholly or partially, any enactment wholly or partially repealed, expressly to state that purpose. (2) This section applies also to all 4[Central Acts] made after the third day of January, 1868, and to all Regulations made on or after the fourteenth day of January, 1887. 5[8. Construction of references to repealed enactments. (1)] 6Where this Act, or any 2[ Central Act] or Regulation made after the commencement of this Act, repeals and re-enacts, with or without modification, any provision of a former enactment, then references in any other enactment or in any instrument to the provision so repealed shall, unless a different intention appears, be construed as references to the provision so re-enacted. 7[* * * * * * *] 9. Commencement and termination of time.—(1) In any 8[Central Act] or Regulation made after the commencement of this Act, it shall be sufficient, for the purpose of excluding the first in a series of days or any other period of time, to use the word “from”, and, for the purpose of including the last in a series of days or any other period of time, to use the word “to”. (2) This section applies also to all 9[Central Acts] made after the third day of January, 1868, and to all Regulations made on or after the fourteenth day of January, 1887. 1Ins. by the General Clauses (Amdt.) Act, 1936 (19 of 1936), s. 2. 2Subs. by A. O., 1937, for “Act of the G. G. in C.”. 3Cf, s. 11 of the Interpretation Act, 1889 (52 & 53 Vict., c. 63). 4Subs. by A. O.,1937, for “Acts of the G. G. in C.”. 5The original s. 8 was renumbered as sub-section (1) of that section by the Repealing and Amending Act, 1919(18 of 1919), s. 2 and Sch. I. 6Cf, s. 38 (1) of the Interpretation Act, 1889 (52 &53 Vict., c. 63). 7Sub-section (2) which was ins. by Act 18 of 1919 s. 2 and Sch. I, have been omitted by the Federal Laws (Revision and Declaration) Ordinance,1981 (27 of 1981), s. 3 and 2nd Sch. 8Subs. by A. O.,1937, for “Act of the G. G. in C.”. 9Subs. ibid., for “Acts of the G. G. in C.” 10. Computation of time. (1) Where, by any 3[Central Act] or Regulation made after the commencement of this Act, any act or proceeding is directed or allowed to be done or taken in any Court or office on a certain day or within a prescribed period, then, if the Court or office is closed on that day or the last day of the prescribed period, the act or proceeding shall be considered as done or taken in due time if it is done or taken on the next day afterwards on which the Court or office is open: Provided that nothing in this section shall apply to any act or proceeding to which the 1[ Limitation Act, 1908] (IX of 1908), applies. (2) This section applies also to all 4[Central Acts] and Regulations made on or alter the fourteenth day of January, 1887. 211. Measurement of distances. In the measurement of any distance, for the purposes of any 3[Central Act] or Regulation made after the commencement of this Act, that distance shall, unless a different intention appears, be measured in a straight line on a horizontal plane. 12. Duty to be taken prorate in enactments. Where, by any enactment now in force or hereafter to be in force, any duty of customs or excise, or in the nature thereof, is leviable on any given quantity, by weight, measure or value of any goods or merchandize, then a like duty is leviable according to the same rate on any greater or less quantity. 13. Gender and number. In all 4[Central Acts] and Regulations, unless there is anything repugnant in the subject or context,— (1) words importing the masculine gender shall be taken to include females; and (2) words in the singular shall include the plural, and vice versa. 513A. [References to the Sovereign.] Omitted by A. O., 1961, Art. 2 and Sch. ( with effect from the 23rd March, 1956). POWERS AND FUNCTIONARIES 14. Powers conferred to be exercisable from time to time. (1) Where, by any 6[Central Act] or Regulation made after the commencement of this Act, any power is conferred 7* * * , then, 8[ unless a different intention appears], that power may be exercised from time to time as occasion requires. (2) This section applies also to all 9 [Central Acts] and Regulations made on or after the fourteenth day of January, 1887. 1Subs. by the Federal Laws (Revision and Declaration) Ordinance, 1981 (27 of 1981), s. 3 and 2nd Sch., for “Indian Limitation Act, 1877”. 2Cf. s. 34 of the Interpretation Act, 1889(52 & 53 Vict., c. 63). 3Subs.by A.O.,1937 for “Act of the G.G. in C”. 4Subs.ibid., for “Acts of the G.G. in C”. 5S.13A was ins. by the Repealing and Amending Act, 1919 (18 of 1919), s. 2 and Sch. I, and then amended by A. O., 1937. 6Subs. by A. O., 1937, for “Act of the G.G. in C.”. 7The words “ on the Govt.” rep. by Act 18 of 1919, s. 2 and Sch. I. 8Ins. ibid. 9Subs. by A. O., 1937, for “Acts of the G. G. in C.”. 15. Power to appoint to include power to appoint ex officio. Where, by any 3[Central Act] or Regulation, a power to appoint any person to fill any office or execute any function is conferred, then, unless it is otherwise expressly provided, any such appointment, if it is made after the commencement of this Act, may be made either by name or by virtue of office. 16. Power to appoint to include power to suspend or dismiss. Where, by any 3[Central Act] or Regulation, a power to make any appointment is conferred, then, unless a different inten tion appears, the authority having 1[for the time being] power to make the appointment shall also have power to suspend or dismiss any person appointed 2[whether by itself or any other authority] in exercise of that power. 17. Substitution of functionaries. (1) In any 3[Central Act] or Regulation made after the commencement of this Act, it shall be sufficient, for the purpose of indicating the application of a law to every person or number of persons for the time being executing the functions of an office, to mention the official title of the officer at present executing the functions, or that of the officer by whom the functions are commonly executed. . (2) This section applies also to all 3[Central Acts] made after the third day of January, 1868, and to all Regulations made on or after the fourteenth day of January, 1887. 18. Successors. (1) In any 3[Central Act] or Regulation made after the commencement of this Act, it shall be sufficient, for the purpose of indicating the relation of a law to the successors of any functionaries or of corporations having perpetual succession, to express its relation to the functionaries or corporations. (2) This section applies also to all 3[Central Acts] made after the third day of January, 1868, and to all Regulations made on or after the fourteenth day of January, 1887. 19. Official chiefs and subordinates.—(1) In any 3[Central Act] or Regulation made after the commencement of this Act, it shall be sufficient, for the purpose of expressing that a law relative to the chief or superior of an office shall apply to the deputies or subordinates lawfully performing the duties of that office in the place of their superior, to prescribe the duty of the superior. (2) This section applies also to all 3[Central Acts] made after the third day of January, 1868, and to all Regulations made on or after the fourteenth day of January, 1887. 1Ins. by the Repealing and Amending Act, 1928 (18 of 1928), s. 2. and Sch. I. 2Subs. ibid., for “ by it”. 3Subs. by A.O., 1937, for “Acts of the G.G. in C”. PROVISIONS AS TO ORDERS, RULES, ETC., MADE UNDER ENACTMENTS. 120. Construction of orders, etc., issued under enactments. Where, by any 9[Central Act] or Regulation, a power to issue any 2[notification], order, scheme, rule, form or bye-law is conferred, then expressions used in the 2[notification], order, scheme, rule, form or bye-law, if it is made after the commencement of this Act, shall, unless there is anything repugnant in the subject or context, have the same respective meanings as in the Act or Regulation conferring the power. 3[20A. Rules and Order, etc., to be published. All rules, Orders, regulations and circulars having the effect of law made or issued under any enactment shall be published in the official Gazette.] 421. Power to make, to include power to add to, amend, vary or rescind, orders, rules or bye-laws. Where, by any 9[Central Act] or Regulation, a power to 5[issue notifications], orders, rules, or bye-laws is conferred, then that power includes a power, exercisable in the like manner and subject to the like sanction and conditions (if any), to add to, amend, vary or rescind any 6[notifications], orders, rules or bye-laws so 7[issued]. 822. Making of rules or bye-laws and issuing or orders between passing and commencement of enactment. Where, by any 9[Central Act] or Regulation which is not to come into force immediately on the passing thereof, a power is conferred to make rules or bye- laws, or to issue orders with respect to the application of the Act or Regulation, or with respect to the establishment of any Court or office or the appointment of any Judge or officer thereunder, or with respect to the person by whom, or the time when, or the place where, or the manner in which, or the fees for which, anything is to be done under the Act or Regulation, then that power may be exercised at any time after the passing of the Act or Regulation; but rules, bye -laws or orders so made or issued shall not take effect till the commencement of the Act or Regulation. 23. Provisions applicable to making of rules or bye-laws after previous publication. Where, by any 10[ Central Act] or Regulation, a power to make rules or bye-laws is expressed to be given subject to the condition of the rules or bye-laws being made after previous publication, then the following provisions shall apply, namely:— (1) the authority having power to make the rules or bye-laws shall, before making them, publish a draft of the proposed rules or bye-laws for the information of persons likely to be affected thereby; 1Cf. s. 31 of the Interpretation Act, 1889 (52 & 53 Vict.,.c. 63). 2Ins. by the Amending Act, 1903 (1 of 1903), s. 3 and Sch. II. 3Ins. by The General Clause (Amdt.) Ordinance, 2002 (Ord. XXXIII of 2002), s. 2. 4Cf. s. 32 (3) of the Interpretation Act, 1889 (52 & 53 Vict.,c. 63). 5Subs. by Act 1 of 1903, s. 3 and Sch. II, for “ make”. 6Ins. Ibid. 7Subs. ibid., for “ made”. 8Cf. s. 37 of the Interpretation Act, 1889 (52 & 53 Viet., c. 63). 9Subs.by A.O., 1937, for “Act of the G.G. in C”. 10Subs. by A. O., 1937, for “Act of the G. G. in C.”. (2) the publication shall be made in such manner as that authority deems to be sufficient, or, if the condition with respect to previous publication so requires, in such manner as the 1[Federal Government] or the 2[ Provincial Government ] prescribes; (3) there shall be published with the draft a notice specifying a date on or after which the draft will be taken into consideration; (4) the authority having power to make the rules or bye-laws, and, where the rules or bye- laws are to be made with the sanction, approval or concurrence of another authority, that authority also, shall consider any objection or suggestion which may be received by the authority having power to make the rules or bye -laws from any person with respect to the draft before the date so specified; (5) the publication in the 3[official Gazette] of a rule or bye-law purporting to have been made in exercise of a power to make rules or bye-laws after previous publi-cation shall be conclusive proof that the rule or bye-law has been duly made. 24. Continuation, of orders, etc., issued under enactments repealed and re-enacted. Where any 5 [Central Act] or Regulation is, after the commencement of this Act, repealed and re-enacted with or without modification, then, unless it is otherwise expressly provided, any 4[ appointment, notification], order, scheme, rule, form or bye-law 4[ made or] issued under the repealed Act or Regulation, shall, so far as it is not inconsistent with the provisions re -enacted, continue in force, and be deemed to have been 4[made or] issued under the provisions so re- enacted, unless and until it is superseded by any 4[appointment, notification], order, scheme, rule, form or bye-law 4[made or] issued under the provisions so re-enacted 6[and when any 7[Central Act) or Regulation, which, by a notification under 8[ any law], has been extended to any local area, has, by a subsequent notification, been withdrawn from and re-extended to such area or any part thereof, the provisions of such Act or Regulation shall be deemed to have been repealed and re- enacted in such area or part within the meaning of this section ]. 9[24A. Exercise of power under enactments.—(1) Where, by or under any enactment, a power to make any order or give any direction is conferred on any authority, office or person such power shall be exercised reasonably, fairly, justly and for the advancement of the purposes of the enactment. 1The words “ Central Government”, which were previously subs. by A.O., 1937, for “G. G. in C.” have been further subs. by F.A.O., 1975, Art. 2 and Table, to read as above. 2Subs. by A. O., 1931, for “ L. G.”. 3Subs. ibid., for “ Gazette”. 4Ins. by the Amending Act, 1903 (I of 1903), s. 3 and Sch.II. 5Subs. By A.O., 1937, for “Act of the G.G. in C”. 6Ins. by the Second Repealing and Amending Act, 1914 (17 of 1914), section 2 and Sch. I. 7Subs. by A. O.,1937, for “Act of the G. G. in C.”. 8Subs. by the Federal Laws (Revision and Declaration) Ordinance, 1981 (27 of 1981), s. 3 and 2nd Sch., for” section 5 or 5A of the Scheduled Districts Act, 1874, or any like law”. 9Ins. by the Act of The General Clauses (Amdt.) Act, 1997 ( Act No. XI of 1997), s.2. (2) The authority, office or person making any order or issuing any direction under the powers conferred by or under any enactment shall, so far as necessary or appropriate, give reasons for making the order or, as the case may be, for issuing the direction and shall provide a copy of the order or as the case may be, the direction to the person affected prejudicially.] MISCELLANEOUS 25. Recovery of fines. Sections 63 to 70 of the Pakistan Penal Code and the 1provisions of the Code of Criminal Procedure for the time being in force in relation to the issue and the execution of warrants for the levy of fines shall apply to all fines imposed under any Act Regulation, rule or bye-law unless the Act, Regulation, rule or bye-law contains an express provision to the contrary. 26. Provision as to offences punishable under two or more enactments.—Where an act or omission constitutes an offence under two or more enactments, then the offender shall be liable to be prosecuted and punished under either or any of those enactments, but shall not be liable to be punished twice for the same offence. 227. Meaning of service by post.—Where any 5[Central Act] or Regulation made after the commencement of this Act authorizes or requires any document to be served by post, whether the expression” “serve” or either of the expressions “give” or “send” or any other expression is used, then, unless a different intention appears, the service shall be deemed to be effected by properly addressing, pre-paying and posting by registered post, a letter containing the document, and, unless the contrary is proved, to have been effected at the time at which the letter would be delivered in the ordinary course of post. 328. Citation of enactments.— (1) In any 5[Central Act] or Regulation, and in any rule, bye- law, instrument or document, made under, or with reference to, any such Act or Regulation, any enactment may be cited by reference to the title or short title (if any) conferred thereon or by reference to the number and year thereof, and any provision in an enactment may be cited by reference to the section or sub-section of the enactment in which the prevision is contained. (2) In this Act and in any 5[Central Act] or Regulation made after the commencement of this Act, a description or citation of a portion of another enactment shall, unless a different intention appears, be construed as including the word, section or other part mentioned or referred to as forming the beginning and as forming the end of the portion comprised in the description or citation. 529. Saving for previous enactments, rules and bye-laws. The provisions of this Act respecting the construction of Acts, Regulations, rules or bye-laws made after the commence ment of this Act shall not affect the construction of any Act, Regulation, rule or bye -law made before the commencement of this Act, although the Act, Regulation, rule or bye-law is continued or amended by an Act, Regulation, tule or bye-law made after the commencement of this Act. 1See the Code of Criminal Procedure, 1898 (5 of 1898), s. 386 et, seq. 2Cf. the Interpretation Act, 1889 (52 & 53 Viet., c. 63), s. 26. 3Cf. ibid., s.35. 4Subs. by A.O., 1937. For “Act of the G.G. in C”. 5Cf. the Interpretation Act, 1889 (52 & 53 Vict., c.63), s. 40. 1[30. Application of Act to Ordinances. In this Act the expression “2[ Central Act]” wherever it occurs, except in section 5, and the word “Act” in clauses (9), (12), (38), (48) and (50) of section 3 and in section 25 shall be deemed to include an Ordinance made and promulgated by the 3[ Governor General] under section 23 of the Indian Councils Act, 1861 4[ or section 72 of the Government of India Act, 1915] 5[ or section 42 6[* * *] of the Government of India Act, 1935 7 [ or an Ordinance made and promulgated by the President on or after the twenty-third day of March, 1956 ]].] [24&25 Vict., c.67; 5&6 Geo.5, c.61; 26 Geo.5, c.21.] 7[31. Application of Act to orders made by the President. The provisions of this Act shall apply for the interpretation of any Order made by the President on or after the twenty third day of March, 1956, as they apply for the interpretation of a Central Act, as if every such Order were a Central Act.] 8[* * * * * * *] THE SCHEDULE. [ENACTMENTS REPEALED.] Rep. by the Amending Act, 1903 ( I of 1903), s. 4 and Schedule III. 1Ins. by the Second Repealing and Amending Act, 1914 (17 of 1914),s. 2 and Sch I. 2Sub. by A. O., 1937, for “Act of the G. G. in C.”. 3Subs. and shall be deemed to. have been so. subs. on the twenty-third day of March, 1956, by the Repealing and Amending Ordinance,1965 (10 of 1965), s. 3 and 2nd Sch. for “President” which had been subs. by A. O., 1961, Art. 2, for the words “Governor General” (with effect from the 23rd, March, 1956). 4Ins. by the Repealing and Amending Act, 1917 (24 of 1917), s. 2 and Sch. I. 5Ins. by A. O., 1937. 6The words and figures “or section 43 omitted by the Pakistan (Adaptation of Existing Pakistan Laws) Order, 1947 (G. G. O. 20 of 1947), Sch. 7Added by the General Clauses (Second Amdt.) Ordinance, 1959 (37 of 1959), ss. 2 and 3. 8Ss. 30A and 31 regarding “Application of Act to Acts made by the Governor General” and “Construction of references to Local Government of a Province “ which were ins. by the Repealing and Amending Act, 1923 (11 of 1923), s. 2 and Sch. I and the Repealing and Amending Act, 1920 (31 of 1920), s. 2 and Sch. I, respectively, were rep. by A. O., 1937."
}