{
  "file": "administratorc8a212332f8c70013ceb9dbdcc7d70ee.pdf",
  "law_name": "The Coconut Committee Act, 1944",
  "text": "THE COCONUT COMMITTEE ACT, 1944 CONTENTS 1. Short title and extent 2. Definitions 3. Imposition of coconut cess 4. [Omitted] 5. [Omitted] 6. [Omitted] 7. [Omitted] 8. [Omitted] 9. [Omitted] 10. Delivery of monthly returns 11. Collection of cess by Collector 12. Fianlity of assessment and recovery of unpaid duty 13. Power to inspect mills and take copies of records and accounts. 14. Information acquired to be confidential 15. [Omitted] 16. [Omitted] 17. [Omitted] 18. Power of the Federal Government to make rule 18A. Penalty for contravention of rules 19. [Omitted] 20. Publication of rules and regulations THE COCONUT COMMITTEE ACT, 1944 1ACT NO. X OF 1944 [31st March, 1944] 2[An Act to provide for the levy and collection of a cess on copra consumed in mills.] Preamble 3[Whereas it is expedient to provide for the levy and collection of a cess on copra consumed in mills.] It is hereby enacted as follows:__ 1. Short title and extent. –4[(1) This Act maybe called the Coconut cess Act, 1944.] 5[(2) It extends to the whole of Pakistan.] 2. Definitions.— In this Act, unless there is anything repugnant in the subject or context,___ 6[(a) “Collector” means the officer appointed by the 7[Federal Government] to perform in any specified area the duties of a Collector under the provisions of this Act and the rules made thereunder, and includes any officer sub-ordinate to that officer whom he may by order and in writing authorize to perform his duties under those provisions;] 8[* * * * * * *] 9[* * * * * * *] (c) “mill” means any place in which copra is crushed for the extraction of oil, which is a factory as defined in section 2 of the 10[Factories Act, 1934 (XXV of 1934)], (d) “prescribed” means prescribed by rules made under this Act. 1The Act has been extended to__ (a) the Leased Areas of Baluchistan, see the Leased Areas (Laws) Order, 1950 (G.G.O.3 of 1950); (b) the Baluchistan States union by the Baluchistan States Union (Federal Laws) (Extension) Order, 1953 (G.G.O.4 of 1953), as amended; (c) the Khairpur State, see the Khairpur (Federal Laws) (Extension) Order, 1953 (G.G.O.5 of 1953), as amended; and (d) the State of Bahawalpur, see the Bahawalpur (Extension of Federal Laws) Order, 1953 (G.G.O.11 of 1953), as amended. The Act has been and shall be deemed to have been brought into force in Gwadur (with effect from the 8th September, 1958), by the Gwadur (Application of Central Laws) Ordinance, 1960 (XXXVII of 1960), s.2. 2Subs. by the Act relating to Cesses on Agricultural Products (Amendment) Ordinance, 1982 (X of 1982), s.2 and Sch., for the long title which was previously subs. by Act XVIII of 1950, s.2 and 3. 3Subs. by Ordinance X of 1982, s.2 and Sch., for the Preamble which was previously subs. by Act XVIII of 1950, ss.2 and 3. 4Subs. by Ordinance X of 1982, s.2 and Sch., for sub-section(1), which was previously subs. by Act XVIII of 1950, s.4. 5Subs. by the Central Laws (Statute Reform) Ordinance, 1960 (XXI of 1960), s.3 and 2nd Sch., (with effect from the 14th October, 1955),for the original sub-section (2), as amended by A.O.,1949. 6Subs. by the Indian Coconut Committee (Amdt.) Act, 1946 (XV of 1946),s.2, for the original clause. 7Subs. by F.A.O., 1975, Art.2 and Table, for “Central Government”. 8Cl. (b) omitted by the Act relating to Cesses on Agricultural Products (Amdt.) Ordinance, 1982 (X of 1982),s.2 and Sch., which was previously amended by various enactments. 9Cl.(bb) which was ins. by Act XV of 1946, s.2, omitted by Act XVIII of 1950, s.5. 10Subs. by the Repealing and Amending Act, 1945 (VI of 1945), s.3 and 2nd Sch., for words, brackets and figures “Indian Factories Act, 1934 (XXV of 1934)”. 1[3. Imposition of coconut cess.— (1)] There shall be levied and collected, as a cess for the purposes of this Act, on all copra consumed in any mill in 2[Pakistan], whether produced in or imported from outside 2[Pakistan], a duty of excise at such rate not exceeding four annas per cwt., as the 5[Federal Government] may, 3[* * *] by notification in the official Gazette, fix in this behalf 4[;] 6[Provided that the 5[Federal Government] may by notification in the official Gazette vary the rate at which the duty of excise shall be levied and collected.] 7[* * * * * * *] 8[* * * * * * *] 4 to 8. 9[Omitted] 9. 10[Omitted] 10. Delivery of monthly returns.___(1) The owner of every mill shall furnish to the Collector on or before the 7th day of each month, a return stating the total amount of copra consumed in the mill during the preceding month, together with such further information in regard thereto as maybe prescribed: Provided that no return shall be required in regard to copra consumed before the commencement of this Act. (2) Every such return shall be made in such form and shall be verified in such manner as may be prescribed. 11. Collection of cess by Collector.___(1) On receiving any return made under section 10, the Collector shall assess the amount of the duty payable under section 3 in respect of the period to which the return relates, and if the amount has not already been paid shall cause a notice to be served upon the owner of the mill requiring him to make payment of the amount assessed within thirty days of the service of the notice. (2) If the owner of any mill fails to furnish in due time the return referred to in sub-section (1) of section 10 or furnishes a return which the Collector has reason to believe is incorrect or defective, the Collector shall assess the amount if any, payable by him in such manner as may be prescribed, and the provisions of sub-section (1) shall thereupon apply as if such assessment had been made on the basis of a return furnished by the owner: 1Section.3 was re-numbered as sub-section (1) of that section by Act XV of 1946, s.3. 2Subs. by the Central Laws (Statute Reform) Ordinance, 1960 (XXI of 1960), s.3 and 2nd Sch. (with effect from the 14th October, 1955), for “the Provinces and the Capital of the Federation” which had been subs.by A.O., 1949, for “British India”. 3The words “after consulting the Committee” omitted by Act XVIII of 1950, s.6. 4Subs. ibid., for full-stop. 5Subs. by F.A.O., 1975, Art.2 and Table, for “Central Government”. 6Proviso added by the Coconut Committee (Amdt.) Act, 1950 (XVIII of 1950),s.6 7Sub-section (2) omitted by the Act relating to Cesses on Agricultural Products (Amendment) Ordinance, 1982 (X of 1982),s.2 and Sch., which was previously amended by various enactments. 8Sub-section (3) omitted by the Federal laws (Revision and Declaration) Ordinance, 1981 (XXVII of 1981),s.3 and 2nd Sch. 9Omitted by the Coconut Committee (Amendment) Act, 1950 (XVIII of 1950), s. 7. 10Omitted by the Acts relating to Cesses on Agricultural Products (Amendment) Ordinance, 1980 (X of 1980), s.2 and Sch. Provided that in the case of a return which he has reason to believe is incorrect or defective, the Collector shall not assess the duty at an amount higher than that at which it is assessable on the basis of the return without giving to the owner a reasonable opportunity of proving the correctness and completeness of the return. (3) A notice under sub-section (1) may be served on the owner of a mill either by post or by delivering it or tendering it to the owner or his agent at the mill. 12.Fianlity of assessment and recovery of unpaid duty.— 1[(1) Any owner of a mill who is aggrieved by an assessment made under section 11 may, within three months of service of the notice referred to in sub-section (1) of that section, apply to the District Judge, 2[* * *] for the cancellation or modification of the assessment and on such application the said Judge may cancel or modify the assessment and order the refund to such owner of the whole part, as the case may be, or any amount paid thereunder. (2) The decision under sub-section (1) of the District Judge 3[* * *] shall be final. (3) Any sum recoverable under section 11 may be recovered as an arrear of land-revenue. 13. Power to inspect mills and take copies of records and accounts.___(1) The Collector or any officer empowered by general or special order of the 4[Federal Government] in this behalf shall have free access to all reasonable times during working hours to any mill or to any part of any mill. (2) The Collector or any such officer may at any time 5[during working hours], with or without notice to the owner, examine the 6[purchase, sale and stock] records and accounts of any mill and take copies of or extracts from all or any of the said records or accounts for the purpose of testing the accuracy of any return or of informing himself as to the particulars regarding which information is required for the purposes of this Act or any rules made thereunder: 7[Provided that nothing in this section shall be deemed to authorise the examination of any description or formulae of any trade process.] 8[* * * * * * *] 14.Information acquired to be confidential.___(1) All such copies and extracts and all information acquired by a Collector or any other officer from an inspection of any mill or warehouse or from any return submitted under this Act shall be treated as confidential. (2) If the Collector or any such officer discloses to any person other than a superior officer any such information as aforesaid without the previous sanction of the 4[Federal Government] he shall be punishable with imprisonment which may extend to six months and shall also be liable to fine: 1Subs. by the Indian Coconut Committee (Amdt.) Act, 1946 (XV of 1946),s.6, for sub-sections (1) and (2). 2The Words “or in a Presidency-town, to the Chief Judge of the Small Cause Court’”omitted by the Coconut Committee (Amdt.) Act, 1950 (XVIII of 1950), s.9. 3The words “or the Chief Judge of the Small Cause Court, as the case may be,” omitted, ibid. 4Subs. by F.A.O., 1975, Art.2 and Table for “Central Government”. 5Ins. by the Indian Coconut Committee (Amdt.) Act, 1946 (XV of 1946), section 7. 6Subs. ibid., for “working records, sale”. 7This proviso was added, ibid. 8Sub-section (3) omitted, ibid. Provided that nothing in this section shall apply to the disclosure of any such information for the purposes of a prosecution in respect of the making of a false return under this Act. 15. [Omitted.] 16 and 17. [Omitted.] 18. Power of the Federal Government to make rule.—(1) The 3[Federal Government] may make rules for the purpose of carrying into effect the provisions of this Act. 4[* * * * * * *] 5[18A.Penalty for contravention of rules. Rules made under section 18 may provide that a breach of any of them shall be punishable with fine not exceeding one thousand rupees.] 19. 6[Omitted.] 20. Publication of rules and regulations. All rules made under section 18 7[* * *] shall be published in the 8[official Gazette]. ______________ Date:-22.04.2024 1Omitted by the Indian Coconut Committee (Amdt.) Act, 1946 (XV of 1946), s.8. 2Omitted by the Coconut Committee (Amdt.) Act, 1950 (XVIII of 1950), s.10. 3Subs. by .F.A.O., 1975, Art. 2 and Table, for \"Central Government\". 4Sub-section (2) omitted by the Coconut Committee (Amdt.) Act, 1950 (18 of 1950),s.11. 5S. 18A ins. by the Coconut and Oilseeds Committees Acts (Amdt.) Ordinance, 1962 (25 of 1962), s. 2. 6Omitted by the Coconut Committee (Amdt.) Act, 1950 (XVIII of 1950) s.12. 7The words \"and all regulations mde under section 19\" omitted by the Coconut Committee (Amdt.) Act, 1950 (18 of 1950), s. 13. 8Subs. ibid., for \"Gazette of India\"."
}