{
  "file": "administratorc8837f7797bb62e0d29f9b64f19cc243.pdf",
  "law_name": "The Registered Designs Ordinance, 2000",
  "text": "THE REGISTERED DESIGNS ORDINANCE, 2000 CONTENTS CHAPTER I PRELIMINARY 1. Short title, extent and commencement 2. Definitions CHAPTER II REGISTERABLE DESIGNS AND PROCEEDINGS FOR REGISTRATION 3. Registerable designs 4. Establishment of Patent Office 5. Proceedings for registration 6. Registration of same design in respect of other articles, etc CHAPTER III EFFECT OF REGISTRATION, ETC 7. Registration of designs 8. Infringement 9. Exemption of innocent infringer from liability for damages 10. Cancellation of registration CHAPTER IV INTERNATIONAL ARRANGEMENTS 11. Notification as to convention countries 12. Registration of design where application for protection in convention country has been made CHAPTER V REGISTER OF DESIGNS, ETC 13. Register of designs 14. Certificate of registration 15. Registration of assignments, etc. 16. Rectification of register 17. Power to correct clerical errors 18. Inspection of registered design 19. Information as to existence of registration 20. Evidence of entries, documents, etc. CHAPTER VI SUPPLEMENTARY PROVISIONS ON THE LEGAL PROCEEDINGS 21. Certificate of contested validity of registration 22. Remedy for groundless threats of infringement proceedings CHAPTER VII POWERS AND DUTIES OF REGISTRAR 23. Exercise of discretionary powers of Register 24. Costs and security for costs 25. Evidence before Registrar 26. Power of Registrar to refuse to deal with certain agents CHAPTER VIII OFFENCES AND PENALTIES 27. Offence and penalties 28. Falsification of register, etc 29. Falsely representing a design as registered 30. Offences by companies CHAPTER IX MISCELLANEOUS 31. Power to make rules 32. Fees 33. Service of notices, etc, by post 34. Saving 35. Instructions from the Federal Government 36. Repeal THE REGISTERED DESIGNS ORDINANCE, 2000 Ordinance No. XLV of 2000 [7th September, 2000] An Ordinance to repeal and to re-enact the law relating to industrial designs WHEREAS it is expedient to repeal and re-enact the law relating to the protection of industrial designs, and for matters ancillary thereto or connected therewith; AND WHEREAS, the National Assembly and the Senate stand suspended in pursuance of the Proclamation of Emergency of the fourteenth day of October, 1999, and the Provisional Constitution Order No. 1 of 1999; AND WHEREAS, the President is satisfied that circumstances exist which render it necessary to take immediate action; NOW. THEREFORE, in pursuance of the Proclamation of Emergency of the fourteenth day of October, 1999, and Provisional Constitution Order No. 1 of 1999, as well as Order No. 9 of 1999, and in exercise of all powers enabling him in that behalf, the President of the Islamic Republic of Pakistan is pleased to make and promulgate the following Ordinance. CHAPTER I PRELIMINARY 1. Short title, extent and commencement.___ (l) This Ordinance may be called the Registered Designs Ordinance, 2000. (2) It extends to the whole of Pakistan. (3) It shall come into force at once. 2. Definitions.___ In this Ordinance, unless there is anything repugnant in the subject or context,— (a) “article” means any article of manufacture and includes any part of an article if made and sold separately; (b) “assignee” includes the legal representative of a deceased assignee, and any references to the assignee of any person include references to the assignee of the legal representative or assignee of that person; (c) “Convention country” means, a country declared as such under section 11; (d) “registration of design” means the right to prevent third parties from applying a design to an article and from making, importing, selling, hiring or offering for sale or hire any article in respect of which a design is registered, being an article to which the registered design or a design not substantially different from the registered design has been applied, and from making anything enabling such article to be made as aforesaid, except with the license or written consent of the registered proprietor; (e) “design” means features of shape, configuration, pattern or ornament applied to an article by any industrial process or means, being features which in the finished article appeal to and are judged solely by the eye, but does not include a method or principle of construction or features of shape or configuration which are dictated solely by technical and functional considerations; (f) “Patent Office” means the Patent Office established, or deemed to have been established under section 4; (g) “prescribed” means prescribed by rules; (h) “proprietor” or creator of a design means,— (i) where the author or creator of the design, for good consideration, executes the work for some other person, the person for whom the design is so executed; (ii) where a design or the right to apply a design to an article becomes vested, whether by assignment, transmission or operation of law, in any person other than the original proprietor, either alone or jointly with the original proprietor, in respect and to the extent in and to which the design or right has been so vested, that other person or, as the case may be, the original proprietor and that other person; (iii) if and to the extent to which two or more persons have created the same design independently of each other, the person whose application has the earliest filing date or, if priority is claimed, the earliest validity claimed priority date shall have the right to the registration of industrial design, as long as the said application is not withdrawn, abandoned or rejected; and (iv) in any other case, the author or creator of the design as may be assigned or as may be transferred by succession; (i) “register” means the register of designs kept in pursuance of section 13; (j) “registered proprietor or agent”, in respect of a design, means the person for the time being entered in the register of designs as proprietor of the design; (k) “registrar” means the Controller of Patents and Designs appointed under section 3 of the Patents Ordinance, 2000; (I) “rules” means rules made under this Ordinance; and (m) “set of articles” means a number of articles of the same general character ordinarily on sale or intended to be used together, to each of which the same design, or the same design with modifications or variations not sufficient to alter the character or substantially to affect the identity thereof, is applied; and (i) any reference in this Ordinance to an article in respect of which a design is registered shall, in the case of a design registered in respect of a set of articles, be construed as a reference to any article of that set; and (ii) any question arising under this Ordinance whether a number of articles constitute a set of articles shall be determined by the Registrar; and, notwithstanding anything contained in this Ordinance, any determination of the Registrar under this sub-section shall be final. ______________ CHAPTER II REGISTERABLE DESIGNS AND PROCEEDINGS FOR REGISTRATION 3. Registerable designs.___ (1) A design may, upon application made by the person claiming to be the proprietor, be registered under this Ordinance in respect of any article or the set of articles specified in the application. (2) Subject to the provisions of this Ordinance, a design shall not be registered unless it is new or original and, in particular, shall not be so registered in respect of any article if it is the same as a design which before the date of the application for registration has been registered in Pakistan, or published anywhere in the world in respect of the same or any other article or differs from such a design only in immaterial details or in feature which are variants commonly used in the trade. Explanation.—Designs are not new or original if they do not significantly differ from known designs or combination of design features. (3) For the purposes of novelty, any disclosure to the public of the industrial design shall not be taken into consideration if it occurred within twelve months preceding the filing date or, where applicable, the priority date, of the application and if it was by reason or in consequence of acts committed by the applicant or his predecessor in title or of an abuse committed by a third party with regard to the applicant or his predecessor in title. (4) The Federal Government may make rules to provide for excluding from registration under this Ordinance designs that are contrary to public order or morality. 4. Establishment of Patent Office.___ There shall be established an office to be called the Patent Office and, until a Patent Office is established under this section, the Patent Office functioning under the Patents and Designs Act, 1911 (II of 1911) shall continue to function and shall be deemed to have been established under this Ordinance. 5. Proceedings for registration.___ (1) An application for the registration of a design shall be in the prescribed form and shall be filed at the Patent Office in the prescribed manner. (2) For the purpose of deciding whether a design is new or original, the Registrar may make such inquiries, if any, as he thinks fit. (3) The Registrar may refuse any application for the registration of a design or may register the design, in pursuance of the application subject to such modifications, if any, as he thinks. (4) An application which, owing to any default or neglect on the part of the applicant, has not been completed so as to enable registration to be effected within the prescribed time shall be deemed to be abandoned. (5) Except as otherwise expressly provided in this Ordinance, a design when registered shall be registered as of the date on which the application for registration was made, or such other, date, whether earlier or later than that date, as the Registrar may in any particular case direct: Provided that no proceedings shall be taken in respect of any infringement committed before the date on which the certificate of registration of the design under this Ordinance is issued. (6) An appeal shall lie to the High Court from any decision of the Registrar under sub-section (3). 6. Registration of same design in respect of other articles, etc.___ (1) Where the registered proprietor of a design registered in respect of any article makes an application— (a) for registration in respect of one or more other articles of the registered design, or (b) for registration in respect of the same or one or more other articles of a design consisting of the registered design with modifications or variations not sufficient to alter the character or substantially to affect the identity thereof, the application shall not be refused and the registration made on that application shall not be invalidated by reason only of the previous registration or publication of the registered design: Provided that the period of registration of a design registered by virtue of this section shall not extend beyond the expiration of the original and any extended period of registration in the original registered design. (2) Where any person makes an application for the registration of a design in respect of any article and either— (a) that design has been previously registered by another person in respect of some other article; or (b) the design to which the application relates consists of a design previously registered by another person in respect of the same or some other article with modifications or variations not sufficient to alter the character or substantially to affect the identity thereof, then, if at any time while the application is pending the applicant becomes the registered proprietor of the design previously registered, the foregoing provisions of this section shall apply as if at the time of making the application the applicant had been the registered proprietor of that design. ______________ CHAPTER III EFFECT OF REGISTRATION, ETC. 7. Registration of designs.___ (1) The registration of a design under this Ordinance shall give to the registered proprietor the registration in the registered design for a period of ten years from the date of registration. (2) The owner of a registered design shall have the right to exclude third parties, not having his consent, from making, selling or working articles bearing or embodying a design which is a copy of the registered design when such acts are undertaken for commercial purposes. (3) The Registrar shall extend the period of registration for a second period of ten years from the expiration of the original period and for a third period of ten years from the expiration of the second period if an application for extension of the period oi' registration for the second or third period is made in the prescribed form before the expiration of the original period or the second period, as the case may be, and if the prescribed fee is paid before the expiration of the relevant period or if such application is made and the said fee is paid within such further period, not exceeding six months, as may be, specified in a request made to the Registrar and accompanied by the prescribed additional fee. (4) The owner of a registered industrial design may surrender it by written declaration to the Registrar who shall record the surrender in the Register and publish it. The surrender shall have effect on the date it is thus recorded. 8. Infringement.___ (1) If any person infringes a registered proprietor's right, the registered proprietor may bring a suit against him for the recovery of damages and for an injunction against the continuation of the infringement: Provided that, for the purposes of grant of a temporary injunction, the registered proprietor must show that he has a prima facie case and that his design is valid and that it has been infringed by the defendant. (2) When the Court makes a decree in a suit under this Ordinance, it shall send a copy of the decree to the Registrar who shall cause an entry thereof to be made in the register. 9. Exemption of innocent infringer from liability for damages.___ In proceedings for the infringement of right in a registered design, damages shall not be awarded against a defendant who proves that at the date of the infringement he was not aware, and had no reasonable ground for supposing, that the design was registered and a person shall not be deemed to have been aware or to have had reasonable grounds for supposing as aforesaid by, reason only of the marking of an article with word “registered” or any abbreviation thereof, or any word or words expressing or implying that the design applied to the article has been registered, unless the number of the design accompanied the word or words or the abbreviation in question: Provided that nothing in this section shall affect the power of the Court to grant an injunction in any proceedings for infringement of copyright in a registered design. 10. Cancellation of registration.___ (1) Any person interested may by a petition made at any time after the registration of a design to the High Court or within two years of the registration of a design to the Registrar, seek cancellation of the registration of a design on the following grounds, namely: (a) the industrial design should not have been registered because the specific substantive requirements prescribed in this Ordinance have not been fulfilled; (b) the industrial design is contrary to public order or morality; or (c) person is whose name the industrial design is registered has no right to it. (2) An appeal shall lie to the High Court from any order of the Registrar under sub-section (1), and the Registrar may at any time refer any such petition to the High Court, and the High Court shall decide any petition so referred. _____________ CHAPTER IV INTERNATIONAL ARRANGEMENTS 11. Notification as to convention countries.___ The Federal Government may, by notification in the official Gazette, declare any country specified in the notification to be a convention country for the purposes of this Ordinance, in addition to the members of World Trade Organization. 12. Registration of design where application for protection in convention country has been made.___ (1) An application for registration of a design in respect of which protection has been applied for in a convention country may be made in accordance with the provisions of this Ordinance by the person by whom the application for protection was made or by his legal representative or assignee: Provided that no application shall be made under this section after the expiration of six months from the date of the application for protection in a convention country or, where more than one such application for protection has been made, from the date of the first application. (2) A design registered on an application made under this section shall be registered as of the date of the application for protection in the convention country or, where more than one such application for protection has been made, the date of the first such application: Provided that no proceedings shall be taken in respect of any infringement committed before the date on which the certificate of registration of the design under this Ordinance is issued. (3) The applicant may withdraw the application at any time during its pendency. (4) An application for the registration of a design made under this section shall not be refused, and the registration of a design on such an application shall not be invalid, by reason only of the registration or publication of the design in Pakistan during the period specified in the proviso to sub- section (1) as that within which the application for registration may be made. CHAPTER V REGISTER OF DESIGNS, ETC. 13. Register of designs.___ (1) There shall be kept at the Patent Office under the control of the Registrar a register of designs in which there shall be entered the names and addresses of proprietors of registered designs, notices of assignments and of transmissions of registered designs, and such other matters as may be prescribed or as the Registrar may think fit. (2) Subject to the provisions of this Ordinance and the rules, the register shall, at all convenient times, be open to inspection by the public and certified copies sealed with the seal of the Patent Office of any entry in the register shall be given to any person requiring them on payment of the prescribed fee. (3) The register shall be prima facie evidence of any matters required or authorized under this Ordinance to be entered therein. (4) No notice of any trust, whether expressed, implied or constructive shall be entered in the register. (5) The Patent Office shall publish in the official Gazette all the publication provided for in this Ordinance. 14. Certificate or registration.___ (1) The Registrar shall grant a certificate of registration in the prescribed form to the registered proprietor of a design when the design is registered. (2) The Registrar may, in a case where he is satisfied that the certificate of registration has been lost or destroyed, or in any other case in which he thinks it expedient, furnish one or more copies of the certificate. 15. Registration of assignments, etc.___ (1) Where any person becomes entitled by assignment, transmission or by operation of law to a registered design or to a share in a registered design, or becomes entitled as mortgagee, licensee or otherwise to any other interest in a registered design, he shall apply to the Registrar in the manner prescribed for the registration of his title as proprietor or co-proprietor or, as the case may be, of notice of his interest in the register. (2) Without prejudice to the provisions of sub-section (I), an application for the registration of title of any person becoming entitled by assignment to a registered design or a share in a registered design, or becoming entitled by virtue of a mortgage, license or other instrument to any other interest in a registered design, may be made in the prescribed manner by the assignor, mortgagor, licensor or other party to that instrument, as the case may be. (3) Where an application is made under sub-section (1) or sub-section (2) for the registration of title of any person, the Registrar shall upon proof of title to his satisfaction— (a) where that person is entitled to a registered design or a share in registered design, register him in the register as proprietor or co-proprietor of the design and enter in the register particulars of the instrument or event by which he derives title; or (b) where that person is entitled to any other interest in the registered design, enter in the register notice of his interest, with particulars of the instrument, if any, creating it. (4) Subject to any rights vested in any other person of which notice is entered in the register, the person or persons registered as proprietor of a registered design shall have power to assign, grant licences in respect of, or otherwise deal with the design and to give effectual receipts for any consideration for any such assignment, licence or dealing: Provided that any equities in respect of the design may be enforced in like manner as in respect of any other movable property. (5) Except for the purposes of an application to rectify the register, a document in respect of which no entry has been made in the register under sub-section (3) shall not be admitted in any Court as evidence of the title of any person to a registered design or share of or interest in a registered design unless the court otherwise directs. 16. Rectification of register.___ (1) The High Court may, on the application of any aggrieved person, order the register to be rectified by the making of any entry therein or the variation, or deletion, of any entry therein. (2) In proceedings under this section, the High Court may determine any question which it may be necessary or expedient to decide in connection with the rectification of the register. (3) Notice of any application to the High Court under this section shall be given in the manner as may be prescribed to the Registrar who shall be entitled to appear and be heard on the application and shall appear if so directed by the Court. (4) Any order made by the High Court under this section shall direct that notice of the order shall be served on the Registrar in the manner as may be prescribed and the Registrar shall, on receipt of the notice, rectify the register accordingly. 17. Power to correct clerical errors.___ (1) The Registrar may, in accordance with the provisions of this section, correct any error in an application for the registration or in the representation of a design or any error in the register. (2) A correction may be made in pursuance of this section either upon a request in writing made by any interested person and accompanied by the prescribed fee. (3) Where the Registrar proposes to make any such correction under sub-section's (1) and (2), otherwise than in pursuance of a request made under sub-section (2), he shall give notice of the proposal to the registered proprietor or the applicant for registration of the design, as the case may be, and to any other person who appears to him to be concerned and shall give them an opportunity of being heard before making the correction. 18. Inspection of registered design.___ (1) Subject to the provisions of this Ordinance and the rules, the representation or specimen of a design registered under this Ordinance shall be open to inspection at the Patent Office on and after the day on which the certificate of registration is issued. (2) In the case of a design registered in respect of an article of any class prescribed for the purposes of this sub-section, no representation or specimen of the design filed in pursuance of the application shall, until the expiration of such period after the day on which the certificate of registration is issued as may be prescribed in relation to articles of that class, be open to inspection at the Patent Office except by the registered proprietor, a person authorised in writing by the registered proprietor, or a person authorised by the Registrar or by the Court: Provided that where the Registrar proposes to refuse an application for the registration of any other design on the ground that it is the same as the first mentioned design or differs from that design only in immaterial details or in features which are variants commonly used in the trade, the applicant shall be entitled to inspect the representation or specimen of the first-mentioned design filed in pursuance of the application for registration of that design. (3) In the case of a design registered in respect of any article of any class as may be prescribed for the purposes of subsection (2), the representation or specimen of the design shall not, during the period prescribed aforesaid, be inspected by any person under this section except in the presence of the Registrar or an officer acting under him; and, except in the case of an inspection authorized by the proviso to that sub-section, the person making the inspection shall not be entitled to take a copy of the representation or specimen of the design or any part thereof. (4) Where an application for the registration of a design has been abandoned, or refused neither the application for registration nor any representation or specimen of the design filed in pursuance thereof shall at any time be open to inspection at the Patent Office or be published by the Registrar. 19. Information as to existence of registration.___ On the request of any person furnishing such information as may enable the Registrar to identify the design, and on payment of the prescribed fee, the Registrar shall inform him whether the design is registered, and if so, in respect what articles and whether any extension of the period of registration has been granted and shall state the date of registration and the name and address of the registered proprietor. 20. Evidence of entries, documents, etc.___ (1) A certificate purporting to be signed by the Registrar and certifying that any entry which he authorised by or under this Ordinance, to make has or has not been made, or that any other thing which he is so authorized, to do has or has not been done shall be prima facie evidence of the matters so certified. (2) A copy of any entry in the register or of any representation, specimen or document kept in the Patent Office or an extract from the register or any such document, purporting to be certified by the Registrar and sealed with the seal of the Patent Office, shall be admitted in evidence without further proof and without production of the original. ______________ CHAPTER VI SUPPLEMENTARY PROVISIONS ON THE LEGAL PROCEEDINGS 21. Certificate of contested validity of registration.___ (1) If in any proceedings before a Court the validity of the registration of a design is contested, and it is found by the Court that the design is validly registered, the Court may certify that the validity of the registration of the design was contested in these proceedings. (2) Where any such certificate has been granted then if in any subsequent proceedings before the Court for infringement of the copyright in the registered design or for cancellation of the registration of the design in the High Court, a final order or judgment is made or given in favour of the registered proprietor, he shall, unless the Court otherwise directs, be entitled to full costs: Provided that this sub-section shall not apply to the costs of any appeal to the High Court in any proceedings referred to in sub-section (2). 22. Remedy for groundless threats of infringement proceedings.___ (1) Where any person whether entitled to or interested in a registered design or an application for registration of a design, by circulars, advertisements or otherwise threatens any other person with proceedings for infringement of the registration in a registered design, any person aggrieved thereby may institute a suit against him for any relief specified in sub-section (2). (2) Unless in any suit under sub-section (1), the defendant proves that the acts in respect of which proceedings were threatened constitute or, if done, would constitute, an infringement of the registration in a registered design the registration of which is not shown by the plaintiff to be invalid, the plaintiff shall be entitled to the following reliefs, namely:— (a) a declaration to the effect that the threats are. unjustifiable; (b) an injunction against the continuance of the threats; and (c) such damages, if any, as he has sustained thereby. (3) For the avoidance of doubt it is hereby declared that a mere notification that a design is registered does not constitute a threat of proceedings within the meaning of this section. ______________ CHAPTER VII POWERS AND DUTIES OF REGISTRAR 23. Exercise of discretionary powers of Register.___ Without prejudice to the provisions of this Ordinance requiring, the Registrar to hear any party to proceedings thereunder, or to give to any such party an opportunity of being heard, the Registrar shall give to any applicant for registration of a design an opportunity of being heard to the applicant before exercising adversely any discretion vested in the Registrar by or under this Ordinance. 24. Costs and security for costs.___ (I) The Registrar may, in any proceedings before him under this Ordinance, by order award to any party such costs as he may consider reasonable, and direct how and by which parties they are to be paid, and any such costs shall be recoverable as an arrears of land revenue. (2) If any party, by whom application is made to the Registrar for the cancellation of the registration of a design or for the grant of a licence in respect of a registered design, or by whom notice of appeal is given from any decision of the Registrar under this Ordinance, neither resides nor carries on business in Pakistan, the Registrar, or, in the case of appeal, the High Court, may require him to give security for the costs of the proceedings or, as the case may be, appeal, and if no security is given may treat the application or, as the case may be appeal as abandoned. 25. Evidence before Registrar.___ (1) The evidence to be given in any proceedings before the Registrar under this Ordinance may be given by affidavit or in such manner as may be prescribed, but the Registrar may if he thinks fit in any particular case take oral evidence in lieu of, or in addition to, such evidence as aforesaid and may allow any witness to be cross-examined on his affidavit. (2) The Registrar shall, in respect of the examination of witnesses on oath and the discovery and production of documents, have all the powers of a Civil Court and the provisions applicable to the attendance of witnesses in proceedings before such Court shall apply to the attendance of witnesses in proceedings before the Registrar. 26. Power of Registrar to refuse to deal with certain agents.___ The Registrar may refuse to recognize in respect of any business under this Ordinance any agent who is not entitled to practice as a patent agent before the Controller of Patents and Designs under the Patents Ordinance, 2000. _______________ CHAPTER VIII OFFENCES AND PENALTIES 27. Offence and penalties.___ If any person fails to comply with any direction given under section 7 or makes or causes to be made an application for the registration of a design in contravention of that section,' he shall be punishable with imprisonment for a term which may extend to two years, or with fine which may extend to twenty thousand rupees, or with both. 28. Falsification of register, etc.___ If any person makes or causes to be made a false entry in the register, or a writing falsely purporting to be a copy of any entry in the register, or produces or tenders or causes to be produced or tendered in evidence any such writing, knowing the .entry or writing to be false, he shall be punishable with imprisonment for a term which may extend to two years, or with fine which may extend to twenty thousand rupees, or with both. 29. Falsely representing design as registered.___ (1) If any person falsely represents that a design applied to any article sold by him is registered in respect of that article, he shall be punishable with fine which may extend to one thousand rupees. (2) For the purpose of sub-section (1), a person who sells an article having stamped, engraved or impressed thereon or otherwise applied thereto the word “registered”, or any other word expressing or implying that the design applied to the article is registered, shall be deemed to represent that the design applied to the article is registered in respect of that article. (3) If any person, after the registration of a registered design has expired, marks any article to which the design has been applied with the word “registered”, or any word or words implying that there is a subsisting registration of the design, or causes any such article to be so marked, he shall be punishable with fine which may extend to two hundred rupees. 30. Offences by companies.___ Where an offence under this Ordinance is committed by a body corporate, every person who at the time of the commission of the offence is a director, general manager, secretary or other similar officer of the body corporate, or is purporting to act in any such capacity, shall be deemed to be guilty of that offence unless he proves that the offence was committed without his consent or connivance and that he exercised, all such diligence to prevent the commission of the offence as he ought to have exercised having regard to the nature of his functions in that capacity and to all the circumstances. _____________ CHAPTER IX MISCELLANEOUS 31. Power to make rules.___ (1) The Federal Government may, by notification in the official Gazette, make rules for carrying out the purposes of this Ordinance. (2) In particular and without prejudice to the generality of the foregoing power such rules may provide for— (a) prescribing the form of application for registration of designs and of any representations or specimens of designs or other documents which may be filed at the Patent Office, and for requiring copies to be furnished of any such representations, specimens or documents; (b) regulating the procedure to be followed in connection with any application or request to the Registrar or in connection with any proceedings before the Registrar and for authorizing the rectification of irregularities of procedure; (c) regulating the keeping of the register, (d) authorizing the publication and sale of copies of representations of designs and other documents in the Patent Office; and (e) any other matter which has to be or may be prescribed. (3) The power to make rules under this section shall be subject to the condition that of the rules shall be made after previous publication. 32. Fees.___ (1) There shall be paid in respect of the registration of designs, and applications therefor, and in respect of other matters with relation to the designs under this Ordinance, such fees as may be prescribed. (2) A proceeding in respect of which a fee is payable under this Ordinance or the rules made thereunder shall be of no effect unless the fee has been paid. 33. Service of notices, etc, by post.___ Any notice required or authorized to be given by or under this Ordinance, and any application or other document so authorized or required to be made or filed, may be given, made or filed by post or by hand. 34. Saving.___ Nothing contained in this Ordinance— (a) shall be construed as authorizing or requiring the Registrar to register a design the use of which would, in his opinion, be contrary to the public policy or morality; and (b) shall affect the right of the Federal Government or of any person deriving the directly or indirectly from the Federal Government to sell or use articles forfeited under the laws relating to customs or excise. 35. Instructions from the Federal Government.___ In the exercise of his powers and the discharge of his functions, the Registrar shall be guided on questions of policy by the instructions, if any, given to him from time to time by the Federal Government which shall be the sole judge as to whether a question is a question of policy. 36. Repeal.___ Clause (5) of section 2 and sections 43,44,45,46,47, 48, 49, 50, 51, 51A, 51B, 52, 53, and 54 of the Patents and Designs Act, 1911, (II of 1911) are hereby repealed. ______________"
}