{
  "file": "administrator546f97580c4012deb22e096dd05242b4.pdf",
  "law_name": "THE ORGANIZATION OF THE ISLAMIC CONFERENCE (IMMUNITIES AND",
  "text": "THE ORGANIZATION OF THE ISLAMIC CONFERENCE (IMMUNITIES AND PRIVILEGES) ACT, 1977 CONTENTS 1. Short title, extent and commencement 2. Provisions of the Agreement 3. Certificate of the Federal Government 4. Power to amend the Schedule 5. Repeal THE SCHEDULE THE ORGANIZATION OF THE ISLAMIC CONFERENCE (IMMUNITIES AND PRIVILEGES) ACT, 1977 Act No. XV of 1977 [5th May 1977] An Act to give effect in Pakistan to the Agreement on Immunities and Privileges of the Organization of the Islamic Conference. WHEREAS Pakistan has ratified the Agreement on Immunities and Privileges of the Organization of the Islamic Conference; AND WHEREAS it is necessary to give effect in Pakistan to the said Agreement on Immunities and Privileges of the Organization of the Islamic Conference: It is hereby enacted as follows:— 1. Short title, extent and commencement.—(1) This Act may be called the Organization of the Islamic Conference (Immunities and Privileges) Act, 1977. (2) It extends to the whole of Pakistan. (3) It shall come into force at once. 2. Provisions of the Agreement. Notwithstanding anything contained in any other law for the time being in force, the provisions of the Agreement on Immunities and Privileges of the Organization of the Islamic Conference set out in the Schedule shall, subject to the other provisions of this Act, have the force of law in Pakistan. 3. Certificate of the Federal Government. If any question arises whether or not any person is entitled to any privileges or immunities under this Act, a certificate issued by or under the authority of the Federal Government stating any fact relating to that question shall be conclusive evidence of that fact. 4. Power to amend the Schedule. The Federal. Government may, by notification in the official Gazette, amend the Schedule in conformity with any amendment duly made in the provisions of the said Agreement set out therein. 5. [Repeal.] Omitted by the Federal Laws (Revision and Declaration) Ordinance, 1981 (XXVII of 1981), s. 3 and Sch., II. THE SCHEDULE (See section 2) Whereas Article VI (8) of the Charter of the Organization of the Islamic Conference provides: “In the light of the agreement on immunities and privileges to be approved by the conference, (a) The Conference shall enjoy, in the Member States, such legal capacity, immunities and privileges as may be necessary for the exercise of its functions and the fulfilment of its objectives. (b) Representatives of member states shall enjoy such immunities and privileges as may be necessary for the exercise of their functions related to the Conference. (c) The staff of the Conference shall enjoy the immunities and privileges necessary for the performance of their duties as decided upon by the conference”. So, it is required to clarify in detail the varieties of immunities and privileges indicated in the Chapter, and to specify its scope and cases in which it is applied, in order to facilitate the functions of the Organization of Islamic Conference. Consequently, the Seventh Islamic Conference of Foreign Ministers held in Istanbul, Republic of Turkey, on 12—15 May, 1976 (13—16 Jamad Al Awal 1396 H) has approved the Convention placed below. CHAPTER I JURIDICAL PERSONALITY Article 1.—The Organization of the Islamic Conference shall possess juridical personality. It shall have the capacity: (a) To acquire and dispose of immovable and movable property. (b) To contract. (c) To institute legal proceedings. CHAPTER II PROPERTY, FUNDS AND ASSETS Article 2.—The Organization of the Islamic Conference, its property and assets, wherever located shall enjoy immunity from every form of legal process unless the Secretary General decides to waive it expressly. It is, however, understood that no waiving of immunity shall extend in any measure of execution. Article 3 —The premises occupied by the Organization of the Islamic Conference shall be inviolable. Its property and assets wherever located shall be immune from search, requisition, confiscation, expropriation and any other form of interference, by executive action. Article 4.—The archieves of the organization of the Islamic Conference and in general, all documents belonging to it, or held by it, shall be inviolable. Article 5.— The organization may, (1) Hold funds, gold or currency of any kind and operate accounts in any currency according to laws and regulations in force in Member States. (2) Be free to transfer its funds, gold or currency from one country to another, or within the country itself and to convert it to any currency according to the laws in force. The Organization may not, in contravention of any regulations prevailing, transfer any amount of funds subjected to special restrictions, from one State, in excess of any amount it has brought into that State. Article 6.—In exercising its rights under Article 5 above, the Organization of the Islamic Conference shall pay due regard to any representations made by Member States, in so far as is considered that effect can be given to such representations, without detriment to the interest of the Organization and Member States. Article 7.—The Organization of the Islamic Conference, its movable or immovable property and its assets shall be: (a) Exempt from all direct taxes, except for those which are no more than charges for public utility services. (b) Exempt from custom duties, prohibitions and restrictions on imports and exports in respect of articles imported or exported by the Organization, for its official use. Such articles, imported under such exemption, will not be sold in the country in which they were imported, except with the consent of the Government concerned. (c) Exempt from custom imports and exports in respect of its publications. CHAPTER III FACILITIES IN RESPECT OF COMMUNICATIONS Article 8.—The Organization of the Islamic Conference shall enjoy, in the territory of each Member States, for its official communications, treatment not less favourable than that accorded by that State to the communications of any other Member State, including its diplomatic mission, in the matter of priorities and rates, taxes on mails, cables, telegrams, radiograms, telephone and other communications and press rates for information to the press and radio. No censorship shall be applied to such official correspondence and other official communications. Article 9.—The Organization of the Islamic Conference may use codes and despatch its correspondence by couriers or bags, which shall have the same immunities and privileges as diplomatic couriers and bags. CHAPTER IV THE REPRESENTATIVES OF MEMBER STATES Article 10.—Representatives of Member States to the Principal and subsidiary organs and conferences convened by the organization, shall while exercising their functions and during the journey to and from the place of the meeting, enjoy the following immunities and privileges: (a) Immunity from personal arrest or detention and from seizure of their personal baggage. (b) Immunity from legal process of any kind in respect of words spoken or written and acts done by them in their capacity as representatives. (c) Inviolability for all papers and documents. (d) The right to use codes and to receive papers or correspondence by courier or in sealed bags. (e) Exemption in respect of themselves and their spouses from immigration restrictions, aliens registration or national service obligations in the State they are visiting, or through which they are passing, in the exercise of their functions. (f) The facilities accorded to the representatives of Foreign States, delegated on temporary official missions in respect of laws relevant to currency and exchange. (g) The same immunities and facilities, in respect of their personal baggage, as accorded to diplomatic envoys. (h) Such other immunities and facilities, not inconsistent with the foregoing as diplomatic envoys, except that they shall have no right to claim exemptions from custom and excise duties on articles imported other than their personal baggage. Article 11.—Representatives of Member States in the Principal and subsidiary organs of the Organisation of the Islamic Conference and in conferences convened by the Organization, shall enjoy immunity from legal process in respect of words spoken or written, in discharging their duties as representatives of their States in the organs of the Organization of the Islamic Conference notwithstanding that the persons concerned are no longer the representatives of Member States. Article 12.—Periods spent by the representatives of Member States to the Principal and Subsidiary organs of the Organization of the Islamic Conference and to conferences convened by it, in one of the territories of a Member State shall not be considered as periods of residence for the assessment of a tax, if the imposition of such a tax is consequent upon such period of residence. Article 13.—Immunities and privileges are accorded to the representatives of Member States, not for their personal benefits, but in order to safeguard the independent exercise of their functions in connection with the Organization. Consequently, Member States are under a duty to waive the immunity of its representatives in any case where that immunity would impede the course of justice and if it can be waived without prejudice to the purpose for which the immunity is accorded. Article 14.—The provisions of Articles 10, 11 and 12 are not applicable as between a representative and the authorities of the State of which he is a national, or the approval of the State concerned. Article 15.—The expression “representative” in this chapter shall be deemed to include all delegates of Members States, their deputies, advisers and technical experts and secretaries of delegations. Article 16.—Permanent State representatives shall enjoy, during the period of their representing their State in the organs of the Organization of the Islamic Conference, such immunities and privileges as are enjoyed by diplomatic envoys. Article 17.—The Secretary General shall notify Member States of the Organization, as well as their permanent delegates and members of permanent committees. CHAPTER V OFFICIALS Article 18—The Conference of the Organization of the Islamic Conference shall specify the categories of officials to which the provisions of Article 19 and the provisions of Chapter VII shall be applied, as submitted to it by the Secretary General, who will communicate to Member States periodically a list containing the names of such officials and their respective functions. Article 19.—(I) Officials of the General Secretariat of the Organization of the Islamic Conference shall, regardless of their nationality, enjoy the following immunities and privileges :— (a) Immunity from legal process, in respect of words spoken or written and all acts performed by them in their official capacity. (b) Exemption from taxation on their salaries and emoluments paid or to be paid to them by the organization. (c) Furthermore, officials of the General Secretariat other than the nationals of the host country, shall enjoy: (1) Together with their spouses and relatives dependent on them, immunity from immigration restrictions and aliens registration. (2) Facilities as accorded to diplomatic envoys of their ranks, accredited with the Government concerned, in respect of the regulations-relevant to exchange. (3) Facilities as accorded to diplomatic envoys, in times of international crisis, as regards their repatriation. (4) The right to import, free of duty, their furniture and effects, within a year from the time of first taking up their posts in the country in question. Article 20.—Further to the immunities and privileges provided for by the two preceding articles, the Secretary General, Assistant Secretary General and senior officials, together with their spouses and their minor children, shall enjoy immunities and privileges, which are accorded, in accordance with international law, to diplomatic envoys, each according to his rank. Article 21.—Immunities and privileges are accorded to officials to safeguard the interests of the Organization and to enable it to accomplish its aims. The Secretary General has the right and is under the duty to waive the immunity of officials of the General Secretariat, not specified in the foregoing article, in any case where, in his opinion, the immunity would impede the administration of justice and can be waived without prejudice to the interests of the Organization. As to officials provided for in that article, the immunity is not to be waived except by approval of the Conference. Article 22.—The Organization shall cooperate, at all times, with the appropriate authorities of Member States, to ensure the proper administration of justice, secure the observance of police regulations and prevent the occurrence of any abuse, in connection with the immunities and privileges mentioned in this chapter. CHAPTER VI EXPERTS Article 23.― Experts (other than officials coming within the scope of Chapter V) performing missions for the Organization of the Islamic Conference shall be accorded, in execution of a resolution to be adopted by its Conference, such immunities and privileges, necessary for the fulfilment of that mission, more specifically: (a) Immunity from personal arrest or detention and from seizure of their personal baggage except in emergency cases as decided by the concerned state upon consultation with the Secretary General. (b) Immunity from legal process, even after termination of their mission, in respect of words spoken or written and acts done by them in the course of the performance of their mission. (c) Inviolability for all papers and documents of the Organization. (d) The same facilities in respect of currency of exchange restrictions, as are accorded to representatives of foreign States on temporary official missions according to the laws in force in the concerned country. (e) The same immunities and facilities in respect of their personal baggages as are accorded to diplomatic envoys. (f) Immunity, together with their spouses and minor children, from immigration restrictions and alien registration and the obligation concerning national service. Article 24.—Immunities and privileges are granted to experts: in the interest of the Organization. The Secretary General shall have the right and the duty to waive the immunity in any case where, in his opinion, the immunity would impede the course of justice and it can be waived without prejudice to the interests of the Organization. CHAPTER VII LAISSEZ-PASSER Article 25.—The General Secretariat of the Organization of Islamic Conference may issue laissez-passers to its officials. Those laissez-passers shall be recognised and accepted as valid travel documents by Members States, taking into account the provisions of the two succeeding articles. Article 26.—Visas are accorded to holders of laissez-passer at the request of the General Secretariat, in which it is stated that they are officials, travelling on official business of the General Secretariat. Article 27.—The grant of visas shall be dealt with as speedily as possible. In addition, such persons shall be granted facilities for speedy travel. . Article 28.—Similar facilities to those specified in Article 27 shall be accorded to experts and officials who, though not holders of Organization laissez-passer, have a certificate that they are travelling on business for the Organization. CHAPTER VIII SETTLEMENT OF DISPUTES Article 29.—The Organization of the Islamic Conference shall establish an organ for settling: (a) Disputes arising out of contracts, or other disputes of a private law character, to which the Organization is a party. (b) Disputes involving any official of the Organization, who, by reason of his official capacity, enjoys immunity, when immunity has not been waived in his case. FINAL PROVISIONS Article 30.—Nothing under the provisions of this Agreement shall affect the authority of a Member State to take such measures as are deemed appropriate for the safety of its territory or the establishment of security and maintenance of public order. Any State deeming necessary the taking of such steps, shall hasten to contact the General Secretariat, as circumstances will permit, in order to agree upon the measures warranting the safeguarding of the interests of the Organization. Article 31—The Immunity whenever provided in this Convention either clearly or inclusively-means official immunity and not personal. Article 32—The Secretary General shall submit this Convention to Member States of the Organization for accession thereto. Article 33—This Convention shall become binding on the respective State as from the date of the deposit of the instruments of accession by that State with the General Secretariat. The Secretary General shall inform all Member States of the Organization of the deposit of each accession. Article 34.—The accession of any Member State to this Convention means that it has accomplished the Constitutional processes to render this Agreement part of its internal legislation. Article 35.—This Convention shall remain binding on each acceding State, as long as it remains a Member State of the Organization. Article 36.—The Organization of the Islamic Conference may conclude supplementary agreements for proper application of the provisions of this Convention, within the territories of Member States. Last Uploaded on 22.9.2023"
}