{
  "file": "administratorc4adcc448feb6542f54a1507ff2b6809.pdf",
  "law_name": "The Vaccination Act, 1880",
  "text": "THE VACCINATION ACT, 1880 CONTENTS PREAMBLE 1. Short title. Application 2. Interpretation-clause 3. Extension of Act to municipalities 4. Extension to cantonments 5. Power to withdraw local area from operation of Act 6. Prohibition of inoculation Inoculated persons not to enter without certificate local area subject to Act 7. Vaccination-circles Vaccinators Superintendent of vaccination 8. Private vaccinators 9. Unprotected children to be vaccinated Vaccinator to vaccinate children, or deliver certificate of postponement 10. Inspection after vaccination 11. Procedure when vaccination is successful 12. Procedure when vaccination is unsuccessful 13. Procedure when child is unfit for vaccination Renewal of postponement certificates 14. Certificates of insusceptibility of successful vaccination 15. What lymph to be used. 16. No fee to be charged except by private vaccinator Proviso 17. Duties of Superintendent of vaccination Notice to parent or guardian neglecting to comply with Act 18. Order by Magistrate when notice not complied with Procedure when order not obeyed Magistrates to be non-official Natives 19. Power to make rules for municipalities 20. Power to make rules for cantonments 21. What rules under sections 19 and 20 may provide for 22. Punishment of offences 23. Municipal funds to receive fees and meet expenditure THE VACCINATION ACT, 1880 1ACT No. XIII OF 1880 [9th July, 1880] An Act to give power to prohibit inoculation and to make the vaccination of children compulsory in certain Municipalities and Cantonments2. Preamble. WHEREAS it is expedient to give power to prohibit inoculation, and make the vaccination of children compulsory in certain municipalities and cantonments2; It is hereby enacted as follows:___ 1. Short Title, Application. This Act may be called the Vaccination Act, 1880: and it shall apply only to such municipalities and cantonments3 situate in 4[the Punjab, the North-West Frontier 5[*] and the district of Sylhet 5[* * *] as it may be extended to in manner hereinafter provided. 2. Interpretation-clause. In this Act unless there is something repugnant in the subject or context,___ (1) “Municipal Commissioners.” the expression “Municipal Commissioners” means a body of Municipal Commissioners or a Municipal Committee constituted under the provisions of any enactment for the time being in force: (2) “parent.” “parent” means the father of a legitimate child and the mother of an illegitimate child: (3) “guardian”. “guardian” includes any person who has accepted or assumed the care or custody of any child: (4) “unprotected child.” “unprotected child” means a child who has not been protected from small-pox by having had that disease either naturally or by inoculation, or by having been successfully vaccinated, and who has not been certified under this Act to be insusceptible to vaccination: (5) “inoculation.” “inoculation” means any operation performed with the object of producing the disease of small-pox in any person by means of variolous matter: 1For Statement of Objects and Reasons, see Gazette of India, 1880, Pt. V p. 80 ; for Report of Select Committee, see ibid., p. 205, and for Proceedings in Council, see ibid., 1879, Supplement, p. 1225, and ibid., 1880, Supplement, pp. 566, 1204. This Act has been declared to be in force in Balochistan by the British Balochistan Laws Regulation, 1913 (2 of 1913), s. 3. It has been applied to Phulera in the Excluded Area of Upper Tanawal to the extent the Act is applicable in the N.W.F.P., subject to certain modifications ; see N.W.F.P. (Upper Tanawal) (Excluded Area) Laws Regulation, 1950. It has been extended to the Excluded Area of Upper Tanawal other than Phulera by N.W.F.P. (Upper Tanawal) (Excluded Area) Laws Regulation, 1950 and declared to be in force in that area with effect from 1st June, 1951, see N.W.F.P. Gazette, Ext., dated the 1st June, 1951. It has been diversely amended in the Punjab, by Punjab Acts 3 of 1915 and 2 of 1929, and in N.W.F.P. by N.W.F.P. Act 11 of 1947. It has been extended to the Leased Areas of Balochistan, see the Leased Areas (Laws) Order, 1950 (G.G.O. 3 of 1950); and also applied in the Federated Areas of Balochistan, see Gaz. of India, 1937, Pt. I, p. 1499. This Act has been repealed in its application to the Province of West Pakistan by West Pakistan Ordinance 27 of 1958, s. 16. 2The long title and preamble have been amended in the Punjab and N.W.F.P. so as to include other local areas. 3This provision has been amended in the Punjab and the N.W.F.P. so as to include other local areas. 4The original words “the territories administered respectively by the Lieutenant-Governor of the North-Western Provinces and the Punjab, and the Chief Commissioner of Oudh, the Central Provinces, British Burma, Assam, Ajmer and Coorg” has been successively amended by A.O., 1937, A.O., 1949, Sch. and the Federal Laws (Revision and Declaration) Act, 1926 (26 of 1951), s. 8, to read as above. 5The words” Province and in East Bengal” omitted by the Central Laws (Statute Reform) Ordinance, 1960 (21 of 1960), s. 3 and 2nd Sch.(with effect from the 14th October, 1955). (6) “vaccination circle.” “vaccination-circle” means one of the parts into which a municipality or cantonment has been divided under this Act for the performance of vaccination: (7) “vaccinator”. “vaccinator” means any vaccinator appointed under this Act to perform the operation of vaccination, or any private person authorized 1* * * in manner hereinafter provided to perform the same operation; and includes a “Superintendent of vaccination” : (8) “vaccination season.” “vaccination-season” means the period from time to time fixed by the 2[Provincial Government] for any local area under its administration by notification in the official Gazette, during which alone vaccination may be performed under this Act. 3. Extension of Act to municipalities. A majority in number of the persons present at a meeting of the Municipal Commissioners specially convened in this behalf may apply to the 2[Provincial Government] to extend this Act to the whole or any part of a municipality, and thereupon the 2[Provincial Government] may, if it thinks fit, by notification published in the official Gazette, declare its intention to extend this Act in the manner proposed. Any inhabitant of such municipality or part thereof who objects to such extension may within six weeks from the date of such publication, send his objection in writing to the Secretary to the 2[Provincial Government], and the 2[Provincial Government] shall take such objection into consideration. When six weeks from the said publication have expired, the 2[Provincial Government], If no such objections have been sent as aforesaid, or (when such objections have been so sent) if in its opinion they are insufficient, may by like notification effect the proposed extension3. 4. Extension. to cantonments. The 2[Provincial Government] may, 3[* * *] by notification in the 5[official Gazette], extend this Act to the whole or any part of a military cantonment. 5. Power to withdraw local area from operation of Act. The 2[Provincial Government] may, by notification in the official Gazette, withdraw any local area in a municipality or 5* * * any local area in a cantonment, from the operation of this Act. 6. Prohibition of inoculation. In any local area to which the provisions of this Act apply, inoculation shall be prohibited; and Inoculated persons not to enter, without certificate, local area subject to Act. No person who has undergone inoculation shall enter such area before the lapse of forty days from the date of the operation, without a certificate from a medical practitioner, of such class as the 2[Provincial Government] may from time to time by written order authorize to grant such certificates, stating that such person is no longer likely to produce small-pox by contact or near approach. 7. Vaccination circles. Every local area to which this Act applies shall be a vaccination circle, or shall in manner hereinafter provided be divided into a number of such circles; Vaccinators. one or more vaccinators shall be appointed in manner hereinafter provided for each such circle; and 1The words “by the L.G.” rep. by the Decentralization Act, 1914 (IV of 1914), s. 2 and Sch., Pt. I. 2Subs. by A.O., 1937, for “L.G.”. 3The words “subject to the control of the G.G. in C” rep. by the Devolution Act, 1920 (XXXVIII of 1920). 4Subs. by A.O., 1937, for “local official Gazette”. 5See foot-note 4 on preceding page. Superintendent of vaccination. one or more Superintendents of vaccination shall be appointed in manner hereinafter provided for each such local area. 8. Private vaccinators. The 1[Commissioner] may by written licence authorize private vaccinators to perform vaccination in any vaccination-circle, and may suspend or cancel any such licence. 9. Unprotected children to be vaccinated. When any unprotected child, having attained the age of 6 months, has resided for a period of one month during the vaccination-season in any local area to which the provisions of this Act apply, and has not at the expiration of such period attained the age, if a boy, of fourteen years, and if a girl, of eight years, the parent or guardian of such child shall take it, or cause it be taken, to a vaccinator to be vaccinated, or send for vaccinator to vaccinate it. Vaccinator to vaccinate children or deliver certificates of postponement. Such vaccinator shall vaccinate the child and deliver to its parent or guardian a memorandum stating the date on which the vaccination has been performed and the date on which the child is to be inspected in order to ascertain the result of the operation, or shall, if he finds such child in a state unfit for vaccination, deliver to its parent or guardian a certificate under his hand to the effect that the child is in a state unfit for vaccination for the whole or part of the current vaccination-season. 10. Inspection after vaccination. The parent or guardian of every child which has been vaccinated under section nine shall, on the date of inspection stated in the memorandum, take the child, or cause it to be taken, to a vaccinator for inspection, or get it inspected at his own house by a vaccinator; and such vaccinator shall then append to the memorandum a certificate stating that the child has been inspected and the result of such inspection. 11. Procedure when vaccination is successful. When it is ascertained at the time of inspecting a child under section ten that the vaccination has been successful, a certificate shall be delivered by the vaccinator to the parent or guardian of such child to that effect, and such child shall thereafter be deemed to be protected. 12. Procedure when vaccination is unsuccessful. When it is ascertained as aforesaid that the vaccination has been unsuccessful, the parent or guardian shall, if the vaccinator so direct, cause the child to be forthwith again vaccinated and subsequently inspected in manner hereinbefore provided. 13. Procedure when child is unfit for vaccination. A certificate granted under section nine showing the unfitness of a child for vaccination shall remain in force for the period stated therein, and on the termination of that period, or, if that period terminates after the vaccination-season is over, when the next vaccination-season begins, the parent or guardian of such child shall take the child, or cause it to be taken to a vaccinator to be vaccinated, or procure its vaccination at his own house by a vaccinator: Renewal of postponement certificates. Provided that, if the child is still found to be in a state unfit for vaccination, the certificate granted under section nine shall be renewed. 1Subs. by the Decentralization Act, 1914 (4 of 1914), s. 2 and Sch., Pt. I, for “L.G.” . In the N.W.F.P. the reference to the Commissioner should be construed as referring to the Revenue Commissioner; see the N.W.F.P. Law and Justice Regulation, 1901 (7 of 1901), s.6 (1) (f). 14. Certificates of insusceptibility of successful vaccination. If the Superintendent of vaccination is of opinion that a child which has been three times unsuccessfully vaccinated is insusceptible of successful vaccination, he shall deliver to the parent or guardian of such child a certificate under his hand to that effect; and the parent or guardian shall thenceforth not be required to cause the child to be vaccinated. 15. What lymph to be used. The vaccination of a child shall ordinarily be performed with such lymph as may be prescribed by the rules to be made under this Act: Provided that, 1st, if animal-lymph is so prescribed and the parent or guardian of any child desires that such child shall be vaccinated with human lymph, it shall be so vaccinated; and 2nd, if in any local area in which animal-lymph is procurable human lymph is so prescribed, and the parent or guardian of any child desires that such child should be vaccinated with animal-lymph, and tenders to the vaccinator the amount of such fee, not exceeding one rupee, as may be fixed by such rules in this behalf, such child shall be so vaccinated. 16. No fee to be charged except by private vaccinator. No fee shall be charged by any vaccinator except a private vaccinator to the parent or guardian of any child for any of the duties imposed on such vaccinator by or under the provisions of this Act: Proviso. Provided that it shall be lawful for a vaccinator to accept a fee for vaccinating a child by request of the parent or guardian elsewhere than in the circle for which such vaccinator is appointed. 17. Duties of Suprintendent of vaccination. Notice to parent or guardian neglecting to comply with Act. The Superintendent of vaccination in addition to the other duties imposed on him by or under the provisions of this Act, shall ascertain whether all unprotected children, under the age of fourteen years if boys, and under the age of eight years if girls, within the local area under his superintendence have been vaccinated; and, if he has reason to believe that the parent or guardian of any such child is bound by the provisions hereinbefore contained to procure the vaccination of such child or to present it for inspection, and has omitted so to do, he shall personally go to the house of such parent or guardian, and there make enquiry, and shall, if the fact is proved, forthwith deliver to such parent or guardian, or cause to be affixed to his house, a notice requiring that the child be vaccinated, or (as the case may be) that it be presented for inspection, at a time and place to be specified in such notice. 18. Order by Magistrate when notice not complied with. If such notice is not complied with, the Superintendent of vaccination shall report the matter to the 1Magistrate of the District, or such Magistrate as the 2[Provincial Government] or the 1Magistrate of the District may from time to time appoint in this behalf; and the Magistrate receiving such report shall summon the parent or guardian of the child and demand his explanation, and shall, if such explanation is not satisfactory, make an order in writing directing such parent or guardian to comply with the notice before a date specified in the order. 1Read District Magistrate, see the Code of Criminal Procedure, 1898 (Act 5 of 1898), s. 3(2). 2Subs. by A.O., 1937, for “ L.G.” Procedure when order not obeyed. If on such date the order has not been obeyed, the Magistrate shall summon the parent or guardian before him, and unless just cause or excuse is shown, shall deal with the disobedience as an offence punishable under section twenty-two. Magistrates to be non-official Natives. The Magistrates appointed under this section shall, as far as is conveniently practicable, be 1[citizens of Pakistan], and not paid servants of the 2[State]. 19. Power to make rules for municipalities. When this Act has been applied to any municipality or any part thereof, the Municipal Commissioners may, from time to time, make 3rules consistent with this Act for the proper enforcement of this Act within the limits to which it applies. Such rules shall be made in the manner in which, under the law for the time being in force, the 4[Municipal] Commissioners make rules or byelaws for the regulation of other matters within the limits of the municipality, and shall, when confirmed by the 5[Commissioner] and published in the official Gazette, have the force of law: Provided that the 5[Commissioner] may at any time rescind or modify any such rule6. 20. Power to make rules for cantonments. When this Act has been applied to any cantonment or any part thereof, the 7[Provincial Government] may, from time to time, 8* * * make such 9rules. 21. What rules under sections 19 and 20 may provide for. The rules to be made for any local area under section nineteen10 or twenty may, among other matters, provide for__ (a) the division of such local area into circles for the performance of vaccination; (b) the appointment of a place in each vaccination-circle as a public vaccine-station, and the posting of some distinguishing mark in a conspicuous place near such station; (c) the qualifications to be required of public vaccinators and Superintendents of vaccination; (d) the authority with which their appointment, suspension and dismissal shall rest; (e) the time of attendance of public vaccinators at the vaccine-stations, and their residence within the limit of the vaccination-circles; (f) the distinguishing mark or badge to be worn by them; 1Subs. by A.O., 1961, Art. 2 and Sch. (with effect from the 23rd March, 1956), for “British subjects domiciled in Pakistan” which had been subs. by A. O., 1949, Sch., for “Natives of India”. 2Subs. by A.O., 1961, Art. 2 and Sch. (with effect from the 23rd March, 1956), for “ Crown” which had been subs. by A.O., 1937 for “Govt.”. 3For such rules, see the local rules and orders. 4Ins. by the Decentralization Act, 1914 (4 of 1914), s. 2 and Sch., Pt. I. 5Subs. ibid., for “ LG.”. See also foot-note 4 below s. 8, supra. 6S. 19 has been replaced by another section in the Punjab by Punjab Act 9 of 1925. After this section a new section 19A has been ins. in the Punjab and the N.W.F.P. by Punjab Act 2 of 1929 and N.W.F.P. Act 11 of 1947, respectively. 7Subs. by A.O., 1937, for “L.G.”. 8The words “subject to the control of the G.G. in C.” rep. by the Devolution Act, 1920 (38 of 1920). 9For such rules ,see the different local rules and orders. 10The word and letter “nineteen A” have been ins. at this place in the Punjab and the N.W.F.P. by Punjab Act 2 of 1929 and N.W.F.P. Act 1 of 1947, respectively. (g) the amount of fee chargeable by private vaccinators, and their guidance generally in the performance of their duties; (h) the facilities to be afforded to people for procuring the vaccination of their children at their own houses; (i) the grant and form of certificates of successful vaccination, of unfitness for vaccination or of insusceptibility of vaccination; (j) the nature of the lymph to be used and the supply of a sufficient quantity of such lymph; (k) the fee to be paid for vaccination with animal-lymph under section fifteen; (1) the fee to be paid to a public vaccinator for vaccinating a child beyond the vaccination-circle at the request of the parent or guardian of the said child; (m) the preparation and keeping of registers showing— the names of children born in such local area on or after the date of the application of this Act; the names of unprotected children born in such local area previous to the application of this Act, and who are, at the time this Act is applied, under the age of fourteen years if boys, and of eight years if girls; the names of unprotected boys and girls respectively under those ages brought within such local area at any time after the application of this Act and who have resided there for a month; the result of each vaccination or its postponement, and the delivery of certificates, if any; 1(n) the assistance to be given by the Municipal Commissioners and municipal servants in the preparation of these registers, and in other matters; and (o) the preparation of vaccination-reports and returns. 22. Punishment of offences. Whoever commits any of the undermentioned offences (that is to say):__ (a) violates the provisions of section six, (b) neglects without just excuse to obey an order made under section eighteen, (c) breaks any of the rules made under section nineteen2 or twenty, or (d) neglects without just cause to obey an order made under section eighteen after having been previously convicted of so neglecting to obey a similar order made in respect of the same child, shall be punished as follows (that is to say):- in the case of the offence mentioned in clause (a), with simple imprisonment for a term which may extend to three months, or with fine which may extend to two hundred rupees, or with both; 1This clause has been amended in the Punjab and the N.W.F.P. by Punjab Act 2 of 1929 and N.W.F.P. Act 11 of 1947, respectively, so as to include members of District Boards and the servants of those local bodies. 2The word and letter “nineteen A” have been ins. at this place in the Punjab and the N.W.F.P. by Punjab Act 2 of 1929 and N.W.F.P. Act 1 of 1947, respectively. in the case of the offences mentioned in clauses (b) and (c), with fine which may extend to fifty rupees; and in the case of the offence mentioned in clause (d), with simple imprisonment for a term which may extend to six months, or with fine which may extend to one thousand rupees, or with both. 23. Municipal funds to receive fees and meet expenditure. The amount of all fees 1* * realized, and the amount of all expenditure incurred, under this Act in any municipality shall respectively be credited to and paid from the Municipal Fund2. _________ Date: 16-09-2024 1The words “and fines” rep. by A.O., 1937. 2This section has been amended in the Punjab and the N.W.F.P. by Punjab Acts 9 of 1925, and 2 of 1929, and N.W.F.P. Act 11 of 1947, so as to include other local areas and funds."
}