{
  "file": "administratorc04599707559bad586492e3c473cf142.pdf",
  "law_name": "West Pakistan Shops And Establishments Ordinance, 1969",
  "text": "THE EMPOYEES COST OF LIVING (RELIEF) ACT, 1974 CONTENTS 1. Short title, extent and commencement 2. Definitions 3. Cost of living allowance 3A. Cost of living allowance in addition to that admissible under section 3 4. Responsibility for payment of cost of living allowance 5. Time for payment of cost of living allowance 6. Claims for recovery, or delay in payment, of cost of living allowance 7. Cost of living allowance to form part of Wages 8. Saving of certain right and privileges. 9. Penalty. 10. Cognizance of offences. 11. [Repeal] THE EMPLOYEES COST OF LIVING (RELIEF) ACT, 1974. 1ACT NO. I OF 1974 [31st December, 1973] An Act to provide for payment of a cost of living allowance to employees. WHEREAS it is expedient to provide for payment of a cost of living allowance to employees and for matters ancillary thereto; It is hereby enacted as follows:— 1. Short title, extent and commencement.—(1) This Act may be called the (Relief) Act, 1973. (2) It shall come into force at once. (3) It extends to the whole of Pakistan. 2. Definitions. In this Act, unless there is anything repugnant in the subject or context,— (a) “cost of living allowance” means 2[an amount] payable under the provisions of this Act; (b) “employee” means any person employed, whether directly or through any other person, for wages, lo do any skilled or unskilled, intellectual, technical, clerical, manual or other work in, or in connection with the affairs of, an undertaking, under any contract of service or apprenticeship, whether written or oral, express or implied, and includes such a person when laid off, but does not include 3* * * a person for whom a provision has been, or may be, made by the Federal Government or a Provincial Government for grant of an allowance intended to provide relief due to a rise in the cost of living; (c) “employer”, in relation to an undertaking, means any person who employs, either directly or through any other person, whether on behalf of himself or any other person, any employee, and includes— (i) a body or persons, whether incorporated or not; 1 For Statement of Objects and Reasons, see Gaz. of P., 1973, Pt. III, p. 1883. The Act has been applied to the Provincially Administered Tribunal Areas of the N.W.F.P., 1974, Ext., p. 199-a This Act has been applied to the Provincially Administered Tribunal Areas of Baluchistan by Notification No. SO (TA) 3/30/73, dated 25th September, 1974, see Gaz. of Baluchistan Extraordinary issue No. 71 of 1974. 2 Subs. by the Employees Cost of Living (Relief) (Amdt.) Act, 1974 (47 of 1974), s. 2, for “the amount” 3 The words “a person employed on wages equal to, or exceeding one thousand and one hundred rupees per month, or” omitted by the Employees’ Cost of Living (Relief) (Amdt.) Act, 1975 (61 of 1975), s. 2. The words in crocthets were subs. by Act, 47 of 1974, s. 2 for “seven hundred and thirty-five”. (ii) a person who has ultimate control over the affairs of an undertaking, including the owner of the undertaking, or where the affairs of any undertaking are entrusted to any other person (whether called a managing agent, director, manager, agent, superintendent, secretary, representative of the owner or by any other name), such other person, or in any other case, any person responsible to the owner for supervision and control of an employee or for payment of his wages; and (iii) an heir, successor, administrator or assign, as the case may be, of such person or association of persons; (d) “undertaking” means— (i) an establishment to which the West Pakistan Shops and Establishments Ordinance, 1969 (WP Ord. VIII of 1969.), for the time being applies, and, notwithstanding anything contained in section 5 thereof, includes clubs, hostels and messes not maintained for profit or gain and establishments for the treatment or care of the sick, infirm, and destitute or mentally unfit persons; (ii) a construction industry to which the West Pakistan Industrial and Commercial Employment (Standing Orders) Ordinance, 1968 (W.P. Ord. VI of 1968.), for the time being applies; (iii) a factory as defined in the Factories Act, 1934 (XXV of 1934). (iv) a mine as defined in the Mines Act, 1923 (IV of 1923.); (v) a road transport service as defined in the Road Transport Workers Ordinance, 1961 (XXVIII of 1961). (vi) a newspaper establishment as defined in the Newspaper Employees (Conditions of Service) Act, 1973 (LVIII of 1973); and includes any class of establishments which the Federal Government may, by notification in the official Gazette, declare to be undertakings for the purposes of this Act; (e) “wages” means remuneration for services 1 * * * payable in cash to an employee without taking account of deductions for any purpose, under a contract of service or apprenticeship, written, oral, express or implied, and includes any dearness allowance or other addition in respect of the cost of living payable or paid for the period preceding the first day of August, 1973, and any payment by the employer to an employee in respect of any period of authorised leave, but does not include— 1 The words “, other than cost of living allowance,” omitted by the Employees’ Cost of Living (Relief) (Amdt.) Act, 1977 (26 of 1977), s. 2, (w.e.f. 1-5- 77). (i) any payment for overtime, or (ii) any sum paid to an employee to defray special expenses entailed by the nature of his employment; or (iii) any gratuity payable on discharge; or (iv) any sum paid as bouns, house rent, conveyance allowance, travelling allowance or any other allowance. 1[3. Cost of living allowance.—(1)] Every employee 2[whose wages do not exceed seven hundred and thirty-five rupees] shall, in respect of his employment on or after the first day of August, 1973, whether on time-work or piece-work basis, be paid by his employer a cost of living allowance— (a) equal to thirty-five rupees per month, if his wages do not exceed seven hundred rupees; or (b) at such rate as, together with his wages, makes a total of seven hundred and thirty-five rupees per month, if his wages are more than seven hundred rupees. Explanation.—In this section, “month” means a normal working period of twenty-six days, calculated at the rate of forty-eight hours of work per week. 3[(2) In addition to the cost of living allowance admissible under sub-section (1), if any, every employee 4 [whose wages do not exceed one thousand and one hundred rupees] shall, in respect of his employment, on or after the eighth day of June, 1974, whether on time-work or piece-work basis, be paid by his employer a cost of living allowance,— (a) equal to fifty rupees per month or ten per cent of his monthly wages, whichever is more, if his wages do not exceed one thousand rupees; or (b) at such rate as, together with his wages, makes a total of one thousand and one hundred rupees per month, if his wages exceed one thousand rupees 5[but are less than one thousand and one hundred rupees]. 6[(3) In addition to the cost of living allowance admissible under sub-section (1) or, as the case may be, sub-section (2), if any, every employee shall in respect of his employment, on or after the seventh day of April, 1975, whether on time-work or piecework basis, be paid by his employer a cost of living allowance equal to twenty-five rupees per month.]. 1 Re-numbered as sub-section (1) of that section by the Employees’ Cost of Living (Relief) (Amdt.) Act, 1974 (47 of 1974), s. 3. 2 Ins. ibid., 3 New Sub-section (2) ins. ibid., 4 Ins. by the Employee’s Cost of Living (Relief) (Amdt.) Act, 1975 (61 of 1975), s. 3. 5 Ins. by the Employees’ Cost of Living (Relief) (Amd.) Act, 1975 (61 of 1975), s. 3. 6 New sub-section (3) added ibid., 6 New sub-section (3) added ibid., 1[(4) In addition to the cost of living allowance admissible under sub-section (1) and (2) or, as the case may be sub-section (3), if any, every employee whose wages do not exceed one thousand and five hundred rupees shall, in respect of his employment on or after the first day of July, 1980, whether on time-work or piecework basis, be paid by his employer a cost of living allowance equal to forty rupees per month: Provided that the said cost of living allowance shall be set off— (a) against the amount payable under an agreement or settlement reached, or an award given, under the Industrial Relations Ordinance, 1969 (XXIII of 1969), which has been announced and become effective on or after the first day of January, 1980 or which is announced and becomes effective within a period of one year of the commencement of the Employees Cost of Living (Relief) (Amendment) Ordinance, 1980; and (b) against the amount payable under an award given under the Newspaper Employees (Conditions of Service) Act, 1973 (LVIII of 1973), which becomes effective from the fifteenth day of April, 1980.] 2[(5) In addition to the cost of living allowance admissible under sub-sections (1), (2) and (3) or, as the case may be, subsection (4), if any, every employee whose wages do not exceed one thousand five hundred rupees shall, in respect of his employment on or after the first day of July, 1981 whether on time-work or piece-work basis, be paid by his employer a “cost of living allowance equal to forty rupees per month: Provided that the said cost of living allowance shall be set off— (a) against the amount payable as a relief due to rise in the cost of living under an agreement or settlement reached, or an award given, under the Industrial Relations Ordinance, 1969(XXIII of 1969), which has been announced and become effective on or after the first day of January, 1981, or which is announced and becomes effective within a period of one year of the commencement of the Employees' Cost of Living (Relief) (Amendment) Ordinance, 1981; and (b) against the amount payable under an agreement or settlement reached and in force on the first day of July, 1981, under which employees get increases at regular intervals on the basis of a rise in the cost of living [.] 2 3 * * * * * * * Explanation.—For the purposes of this sub-section 1[subsection (6) and sub-section (7)] any increase in wages accruing by virtue of the usual annual increment or promotion to a higher grade, or an allowance not specifically given to provide relief due to a rise in the cost of living, shall not be deemed to be an, increase intended to provide relief due to a rise in the cost of living.] 1 New sub-section (4) added by the Employees’ Cost of Living (Relief) (Amdt.) Ordinance, 1980 (32 of 1980), s.2. 2New sub-section (5) added by the Employee’ Cost of Living (relief) (Amdt.) Ordinance, 1981 (25 of 1981), s. 2. 3 Subs. and omitted by the Finance Act, 1986 (1 of 1986), s. 9. 1[(6) In addition to the cost of living allowance admissible under sub-sections (1), (2), (3) and (4), or, as the case may be, subsection (5), if any, every employee whose wages do not exceed one thousand five hundred rupees shall, in respect of his employment on or after the first day of July, 1985, whether on time-work or piece-work basis, be paid by his employer an increase in wages at the rate of 13.5 per cent of his wages: Provided that the said increase in wages shall be set off— (a) against the amount payable as a relief due to rise in the cost of living under an agreement or settlement reached, or an award given, under the Industrial Relations Ordinance, 1969, which has been announced and become effective on or after the first day of January, 1984; and (b) against the amount payable under an agreement or settlement reached and in force on the first day of July, 1985, under which employees get increases at regular intervals on the basis of a rise in the cost of living [.]2 2[ * * * * * * *] 2[(7) In addition to the cost of living allowance admissible under sub-section (1), (2), (3), (4), (5), or, as the case may be, subsection (6), if any, every employee whose wages do not exceed one thousand five hundred rupees shall, in respect of his employment on or after the first day of July, 1986, whether on time-work or piece-work basis, be paid by his employer an increase in wages at the rate of 18 per cent of his wages: Provided that the said increase in wages shall be set off— (a) against the amount payable as a relief due to rise in the cost of living under an agreement or settlement reached, or an award given, under the Industrial Relations Ordinance, 1969 (XXIII of 1969), which has been amended and became effective on or after the first day of January, 1984; (b) against the amount payable under an agreement or settlement reached and in force on the first day of July, 1986, under which employees get increase at regular intervals on the basis of a rise in the cost of living; and (c) against the amount payable as an increase in wages under sub-section (6).] 3[3A. Cost of living allowance in addition to that admissible under section 3. In addition to the cost of living allowance admissible under section 3, if any, every employee shall, in respect of his employment on or after the first day of December, 1990, whether on time-work or piece-work basis, be paid by his employer a cost of living allowance at such rate and in such area or areas, as the Federal Government may, from time to time, by notification in the official Gazette, specify.] 1Added by the Employees’ Cost of Living (Relief) (Amdt.) Act, 1985 (14 of 1985), s. 2. 2 Subs. Omitted and added by the Finance Act, 1986 (1 of 1986), s. 9. 3 New section 3A ins. by the Employees’ Cost of Living (Relief) (Amdt.) Act, 1992 (27 of 1992), s. 2 (w.e.f. 1-12-90). 4. Responsibility for payment of cost of living allowance. Every employer shall be responsible for the payment of the cost of living allowance required to be paid under this Act. 5. Time for payment of cost of living allowance. The cost of living allowance shall be paid alongwith wages in accordance with any custom, usage; practice or law applicable to the undertaking: 1[Provided that where an employee employed in an undertaking has not been paid the cost of living allowance payable under sub-section (1) of section 3 for any period commencing on or after the first day of August, 1973, but preceding the commencement of the Employees' Cost of Living (Relief) Act, 1973„ or, as the case may be, under sub-section (2) of that section for any period commencing on or after the eighth day of June, 1974, but preceding the commencement of the Employees Cost of Living (Relief) (Amendment) Act, 1974 (I of 1974) 2[or under sub-section (3) of that section for any period commencing on or after the seventh day of April, 1975, but preceding the commencement of the Employees Cost of Living (Relief) (Amendment) Ordinance, 1975,] the employer shall pay it to him within thirty days of the commencement,— (a) in the case of the cost of living allowance payable under sub-section (1) of section 3, of the Employees Cost of Living Allowance (Relief) Act, 1973; 3* (b) in the case of the cost of living allowance payable under sub-section (2) of that section, of the Employees' Cost of Living (Relief) (Amendment) Act, 1974 4[; and]] 5[(c) in the case of the cost of living allowance payable under sub-section (3) of that section, of the Employees Cost of Living (Relief) (Amendment) Ordinance, 1975.] 6. Claims for recovery, or delay in payment, of cost of living allowance. Where contrary to the provisions of this Act, the cost of living allowance of any employee has been withheld or delayed, such worker himself or through any other person authorised by him in this behalf may apply— (a) in the case of an establishment to which the West Pakistan Shops and Establishments Ordinance, 1969 (W.P. Ord. VIII of 1969), for the time being Applies, to the authority appointed under sub-section (1) of section 12 thereof having jurisdiction and the provisions of the said section and sections 11, 13, 21, 23, 30 and 32 of that Ordinance shall, so far as may be and with the necessary modifications, apply for the purposes of recovery of the cost of living allowance: and 1 Subs. by the Employee’s Cost of Living (Relief) (Amdt.) Act, 1974 (47 of 1974), s. 4., for the original proviso. 2 Ins. by the Employees’ Cost of Living (Relief) (Amendment) Act, 1975 (61 of 1975), s. 4. 3 The word “and” omitted ibid. 4 Subs. ibid., for the full-stop. 5 New cl. (c) added ibid., (b) in any other case, to the authority appointed under sub-section (1) of section 15 of the Payment of Wages Act, 1936 (IV of 1936), having jurisdiction and the provisions of the said section and sections 6,16,17,18, 19, 22, 23 and 26 of the said Act shall, so far as may be and with the necessary modifications, apply for the purposes of recovery of the cost of living allowance. 7. Cost of living allowance to form part of Wages. Notwithstanding anything contained in this Act or any other law for the time being in force, the cost of living allowance shall 1* form part of wages of a worker for the purposes of any other law, including the purposes of contribution to provident fund, gratuity, bonus, social security scheme 2 [, indexation of wages] and calculating wages for over-time work 3[:] 4[Provided that, for the purposes of the Workmen’s Compensation Act, 1923 (VIII of 1923), except section 4 thereof the Payment of Wages Act, 1936 (V of 1936.), the Companies Profits (Workers' Participation) Act, 1968 (XII of 1968), or the Industrial Relations Ordinance, 1969 (XXIII of 1969), the cost of living allowance shall not form part of the wages of a worker.] 5[8. Saving of certain right and privileges. Nothing in this Act shall affect any right or privilege to which an employee was entitled,— (a) in the case of the cost of living allowance payable under sub-section (1) of section 3, immediately before the commencement of the Employees' Cost of Living (Relief) Ordinance, 1973 (XXII of 1973), or (b) in the case of the cost of living allowance payable under sub-section (2) of section 3, immediately before the commencement of the Employees' Cost of Living (Relief) (Amendment) Act, 1974, 6[or] 7[(c) in the case of the cost of living allowance payable under sub-section (3) of section 3, immediately before the commencement of the Employees’ Cost of Living (Relief) (Amendment) Ordinance, 1975.], under any law for the time being in force or under any award, decision, agreement settlement contract, custom or usage in force immediately before such commencement: 1 The word “not” omitted by the Employees’ Cost of Living (Relief) (Amdt.) Act, 1977 (26 of 1977 (26 of 1977), s. 3 (w.e.f. 1-5- 1977). 2 ins. by the Employees’ Cost of Living (Relief) (Amdt.) Act, 1987 (6 of 1987), s. 9. 3 Subs. ibid., for the full-stop, (w.e.f. 1-5-1977). 4 Proviso added ibid., (w.e.f. 1-5-1977). 5 Subs. by the Employees’ Cost of Living (Relief) (Amdt.) Act, 1974 (47 of 1974), s.5 for the original section 8. 6 The word “or added by the employees’ Cost of Living (Relief) (Amdt.) Act, 1975 (61 of 1975), s. 5. 7 New cl. (c) ins. ibid., Provided that, if, at any time commencing on or after the first day of August, 1973, but preceding the commencement of the said Ordinance or, as the case may be, commencing at or after the commencement of the said Ordinance but preceding the commencement of the Employees' Cost of Living (Relief) (Amendment) Act, 1974, any employer has paid, or become liable to pay, whether by virtue of an award, decision, agreement, settlement, contract, custom or usage, to any employee, in respect of any period, any sum of money, which is intended to provide relief due to a rise in the cost of living, such employer shall not be required to pay to such employee in respect of such period any amount in excess of the difference if, any, between the amount so paid by him or the amount which he has so become liable to pay, and the cost of living allowance payable to such employee. Explanation.—For the purposes of this proviso, any increase in wages accruing by virtue of the usual annual increment for promotion to a higher grade, or an allowance not specifically given to provide relief due to a rise in the cost of living, shall not be deemed to be an increase intended to provide relief due to a rise in the cost of living.] 9. Penalty. Any employer who contravenes any provision of this Act shall be punishable with simple imprisonment for a term which may extend to six months, or with fine which may extend to two thousand rupees, or with both. 10. Cognizance of offences. No Court shall take cognizance of any offence under this Act save on a complaint made by an aggrieved employee or by an officer of a registered trade union of which such employee is a member, or by any person authorised in this behalf by the Provincial Government. 11. [Repeal] Omitted by the Federal Laws (Revision and Declaration) Ordinance, 1981 (XXVII of 1981), s. 3 and Sch., II."
}