{
  "file": "administrator115eb4cdf42e26de22d5b390f8e63d51.pdf",
  "law_name": "The Government Grants Act, 1895",
  "text": "THE GOVERNMENT GRANTS ACT, 1895 CONTENTS 1. Title and extent 2. Transfer of Property Act, 1882, not to apply to Government grants 3. Government grants to take effect according to their tenor THE GOVERNMENT GRANTS ACT, 1895 1ACT No. XV OF 1895 [10th October 1895] An. Act to explain the Transfer of Property Act, 1882, so far as relates to grants from the 2[Government], and to remove certain doubts as to the powers of the 2[Government] in relation to such grants. WHEREAS doubts have arisen as to the extent and operation of the Transfer of Property Act, 1882, and as to the power of the 1882 2[Government] to impose limitations and restrictions upon grants and other transfers of land made by it or under its authority, and it is expedient to remove such doubts; It is hereby enacted as follows : 1. Title and extent.___(1) This Act may be called the 2[Government] Grants Act, 1895. 3[(2) It extends to the whole of Pakistan] ; 4* 4[* * * * * * *] 2. Transfer of Property Act, 1882, not to apply to Government grants. Nothing in the Transfer of Property Act, 1882, contained shall apply or be deemed ever to have applied to any grant or other transfer of land or of any interest therein heretofore made or hereafter to be made 5[by or on behalf of the 2[Government]] to, or in favour of, any person whomsoever; but every such grant and transfer shall be construed and take effect as if the said Act had not been passed. 3. Government grants to take effect according to their tenor. All provisions, restrictions, conditions and limitations over contained in any such grant or transfer as aforesaid shall be valid and take effect according to their tenor, any rule of law, statute or enactment of the Legislature to the contrary notwithstanding. _________ Date: 05-09-2024 1For Statement of Objects and Reasons, see Gazette of India, 1895, Pt. V, p. 169, and for Proceedings in Council, see ibid.. Pt. VI, pp. 328 and 355. This Act has been declared to be in force in Baluchistan by the British Baluchistan Laws Regulation, 1913 (2 of 1913), s. 3 and Sch . I. It has also been extended to the Leased Areas of Baluchistan, see the Leased Areas (Laws) Order, 1950, (G. G. O. 3 of 1950); and applied in the Federated Areas of Baluchistan, see Gazette of India, 1937, Pt. I, p. 1499. 2Subs. by A. 0., 1961, Art. 2 and Sch., for “Crown” (with effect from the, 23rd March, 1956). 3Subs. by the Central Laws (Statute Reform) Ordinance, 1960 (21of 1960), s. 3 and, 2nd Sch. (with effect from the 14th October, 1955), for the original sub-section (2) as amended by A. 0., 1949, Arts. 3 (2) and 4. The word “and” at the end of sub-section (2), and sub-section (3), rep. by the Repealing and Amending Act, 1914 (1 0 of 1914), s. 3 and Sch. II. 5Subs. by A. O., 1937, for “by or on behalf of Her Majesty the Queen Empress, Her heirs or successors, or by or on behalf of the Secretary of Sta for India in Council”."
}