{
  "file": "administrator6e52f905186798fc3b84a947447d222e.pdf",
  "law_name": "Board Ordinance, 2001",
  "text": "THE PAKISTAN MADRASAH EDUCATION (ESTABLISHMENT AND AFFILIATION OF MODEL DINI MADARIS) BOARD ORDINANCE, 2001 CONTENTS 1. Short title, extent and commencement 2. Definitions 3. Establishment of the Board 4. Composition of the Board 5. Powers and functions of the Board 6. Visitation. 7. Meetings of the Board 8. Chairman 9. Secretary 10. Academic Council 11. Establishment and affiliation of dini madaris 12. Affiliation 13. Syllabii 14. Officers and servants of the Board to be public servants 15. Officer and other staff 16. Delegation of powers 17. Fund 18. Accounts and audit 19. Indemnity 20. Power to make rules 21. Power to make regulations 22. Removal of difficulties THE PAKISTAN MADRASAH EDUCATION (ESTABLISHMENT AND AFFILIATION OF MODEL DINI MADARIS) BOARD ORDINANCE, 2001 ORDINANCE NO. XL OF 2001 [18th August, 2001] An Ordinance to enable the establishment of Model Dini Madaris to improve and secure uniformity of standards of education and for the integration of the system of Islamic education imparted at dini madaris within the general education system; WHEREAS it is expedient to provide for securing the registration, regulation, standardization and uniformity or curricula and standard of education of the dini madaris imparting specialized Islamic education in Pakistan with the general education system in order to enable recognition of equivalence of the degrees, certificates and asnad awarded by such institutions and to regulate their examination system and the matters connected therewith or ancillary thereto; AND WHEREAS there is need that the Dini Madaris maintain their autonomous character and are better organized for the promotion of full-fledged, comprehensive and specialized Islamic Education along with subjects of general education system; AND WHEREAS the President is satisfied that circumstances exist which render it necessary to take immediate action; NOW, THEREFORE, in pursuance of the Proclamation of Emergency of the Fourteenth day of October, 1999, and the Provisional Constitution Order No. 1 of 1999, read with the Provisional Constitution (Amendment) Order No. 9 of 1999, and in exercise of all powers enabling him in that behalf, the President of the Islamic Republic of Pakistan is pleased to make and promulgate the following Ordinance:— 1. Short title, extent and commencement.—(1) This Ordinance, may be called the Pakistan Madrasah Education (Establishment and Affiliation of Model Dini Madaris) Board Ordinance, 2001. (2) It extends to the whole Pakistan. (3) It shall come into force on such date as the Federal Government may, by notification in the official Gazette, specify in this behalf and different dates may be so specified for different areas. 2. Definitions. In this Ordinance, unless there is anything repugnant in the subject or context,— (a) “Academic council” means the Academic Council established under section 10; (b) “affiliated dini madaris” means the dini madaris or darul ulooms which are affiliated with the Board; (c) “Board” means Pakistan Madrassah Education Board, constituted under section 3; (d) “Controlling Authority” means the Chairman of the Board; (e) “Dini Madaris” means religious educational institutions including Dini Madaris or Darul Ulooms established for the purpose of imparting Islamic Education with Islamic teachings and instructions as the principal competent of their curricula; (f) “Federal Government” means the Ministry of Religious Affairs; (g) “general education system” means the education system as recognized by the Ministry of Education, Government of Pakistan; (h) “member” means the member of the Board; (i) “Model Madrassah or Model Darul-Uloom” means a Madrassah or a Darul Uloom established by or affiliated to the Board under this Ordinance; (j) “Nazim or Sadr” means the Nazim or Sadr of a Wifaq or Tanzeem; (k) “prescribed” means prescribed by rules or regulations made under this Ordinance; (l) “qualifications” means any diploma, degree, sanad or other certificate in recognition of having fully completed the necessary course of study or training as recognized by the Board; (m) “regulations” means regulations made under this Ordinance; (n) “rules” means rules made under this Ordinance; (o) “students” means persons of any sex receiving education in a recognized or reputable religious institution of good standard; and (p) “syllabii” means the curricula which shall comprise of Islamic Education as the main component and shall also include subjects of the general education system as may be prescribed. 3. Establishment of the Board.—(1) As soon as may be after the commencement of this Ordinance, the Federal Government shall, by notification in the official Gazette, establish a Board to be known as the Pakistan Madrassah Education Board. (2) The Board shall be a body corporate having perpetual succession and a common seal with power, subject to the provisions of this Ordinance, to acquire, hold and dispose of property both moveable and immovable, and may, by the said name, sue and be sued. (3) The headquarters of the Board shall be at Islamabad. (4) The Board may establish its regional offices as and where it considers necessary. 4. Composition of the Board.—(1) The Board shall consist of the following members, to be appointed by the Federal Government, namely:— (i) An educationist of eminence Chairman (ii) Sadr or nazim of a wafaq or tanzim or rabitah to be appointed by the Federal Government in consultation with the Chairman. Vice/Chairman (iii) an educationist having experience in administrative matters. Secretary (iv) Secretary, Ministry of Education or his nominee not below the rank of a Joint Secretary. Member (v) Secretary, Ministry of Religious Affairs or his nominee not below the rank of a Joint Secretary. Member (vi) Secretary, Ministry of Science and Technology or his nominee not below the rank of a Joint Secretary. Member (vii) Chairman, University Grants Commission or a Member nominated by him. Member (viii) two Ulema who are or have been members of the Council of Islamic Ideology to be nominated by the Chairman. Members (ix) Director General, Dawa Academy, International Islamic University. Member (x) one Professor who is also a head of the Department of Islamic Studies in a University. Member (xi) Provincial Education Secretaries of all the four Provinces. Members (xii) one President or Nazim of Wifaqs Members (xiii) one President or Nazim of Tanzim Member (xiv) one President or Nazim of Rabita Member (xv) Chairman, Inter-Board Co-ordination Committee (IBCC) Member (xvi) two representatives of the Ministry of Science and Technology Members (2) A member, other than an ex officio member, unless earlier removed shall hold office during the pleasure of the Federal Government (3) No person shall be appointed or continue to be a member of the Board if he has been declared insolvent or is convicted of an offence involving moral turpitude or is declared disqualified from employment in, or dismissed from, Government service. (4) No person, who has committed misconduct, directly or indirectly, or he himself or his partner has any share or interest in a contract with, by or on behalf of the Board or is in any employment under, by or on behalf of the Board, shall be appointed or continue on the Board. On receipt of any such complaint against a member, the Board, after giving the member an opportunity of hearing, shall decide the matter, and send its recommendation to the Federal Government for its approval. The decision of the Federal Government shall be final. 5. Powers and functions of the Board.—(1) The Board shall have powers to perform such functions and exercise such powers as are necessary or conducive to implement and achieve the purposes of this Ordinance. (2) Subject to the provisions of this Ordinance and with due regard to the autonomy of a Wifaq or Tanzeem or Rabita, the Board shall have the following powers and functions to perform: (a) to establish such model madaris and model darul ulooms in which the Islamic Education is the main component and includes courses and curricula of the general education system as may be prescribed; (b) to regulate and approve conditions for affiliation of such existing madaris as have duly been recommended by the Academic Council; (c) to approve the curricula, courses of study and conditions for holding of examinations in the model dini madaris keeping in view the recommendations of the Academic Council; (d) to organize teachers training programmes for the teachers of the model dini madaris and dar-ul-ulooms in various social sciences and religious courses; (e) to grant affiliation and to lay down the regulations and to approve conditions for affiliation of existing madaris; (f) to suggest ways and means to bridge the existing gulf between the general education system and the madaris by revising and improving the curricula of Madaris and general education programs; (g) to approve the curricula, courses of study and the conditions for holding of examinations in the Dini Madaris on recommendations of the Academic Council; (h) to appoint such officers and staff as it may consider necessary for the performance of its functions and define their duties and lay down conditions of service; (i) to promote co-operation and co-ordination amongst existing Dini Madaris and their organizations; (j) to approve equivalence of degrees, diplomas, sanads or certificates where curricula includes subjects of the general education system; (k) to promote curricular and extra curricula activities in Model Dini Madaris and Model Darul Ulooms; (l) to inspect or arrange for inspection of a Model Dini Madrasah or Model Darul Uloom with a view to improve the performance of such Madrasah or the Darul Uloom; (m) to institute and award scholarships, medals and prizes subject to such conditions as may be prescribed; (n) to assist in the development of libraries of Dini Madaris; (o) to approve the Annual Budget; (p) to advise the Government in matters pertaining to model Dini Madaris; (q) to prescribe minimum conditions for admission of candidates to the examinations conducted by the Board and to print all educational material necessary for improving the standard of education; (r) to regulate and decide all administrative matters including creation and abolition of posts under the Board; (s) to enter into or carry out or cancel any contract to administer, invest buy or sell any moveable or immoveable property and assets; (t) to spend or incur expenditure as may be necessary for carrying out purposes of this Ordinance; (u) the Board may delegate any of its functions and powers to any member or officer of the Board or a committee or a sub-committee appointed by it (v) to hear complaints, conduct enquiries and inspections and direct or recommend measures for the improvement of any dini madaris established by or affiliated to the Board; and (w) to exercise inter alia all powers as given in this Ordinance and to perform all other acts necessary for carrying out the purposes of this Ordinance. 6. Visitation. The Board may cause an inspection or inquiry to be made in respect of any matter connected with the affairs of a Model Dini Madarsah or a Model Darul Uloom and shall from time to time appoint such persons as it may deem fit for the purposes of carrying out such inspection or inquiry and to submit its report to the Board. 7. Meetings of the Board.—(1) The meetings of the Board shall be called by the Chairman on such date, time and place as he may decide: Provided that not more than six months shall intervene between the two meetings of the Board and at least eight days written notice sent by registered post or courier shall be given to the members specifying the agenda, date, time and place of the meeting. (2) The Chairman or, in his absence the Vice-Chairman, shall preside over the meetings of the Board. (3) One half of the total members of the Board shall constitute a quorum for the meeting of the Board, a fraction being counted as one. (4) The decision of the Board shall be taken by the majority of its members present and voting, and in case of a tie, the Chairman shall have a casting vote. 8. Chairman.—(1) The Chairman of the Board shall be its principal executive officer and shall preside over the meetings of the Board. (2) The Chairman shall exercise such powers and perform such functions as may be assigned to him by the Board and shall be responsible for the proper running of the affairs of the Board. (3) In the absence of the Chairman, the Vice-Chairman shall exercise such powers and performs such functions as the Board may assign. 9. Secretary.__ (1) There shall be a Secretary of the Board who shall be a full time officer appointed by the Federal Government on such terms and conditions as it may determine. (2) The Secretary shall be the Administrative Officer of the Board and shall ensure subject to the approval of the Chairman that the orders of the Board and the Chairman are carried out and shall execute decisions for and on behalf of the Board. He shall also act as Secretary of the Academic Council. (3) The Secretary shall with the approval of the Chairman send notice of a meeting. The notice of the meeting and agenda shall be sent to every member of the Board by registered post or courier. (4) The Secretary shall ensure that all funds are spent for the purpose for which they are granted, allocated or authorized and shall prepare and submit annual statement of accounts and budget estimates for the approval of the Board. (5) The Secretary shall maintain in minutes of the meetings of the Board and its records and perform such other duties and functions as may be assigned to him by the Board. (6) The Secretary shall also act as the Registrar of the Board and shall perform such functions as may be assigned to him in this connection by the Board. 10. Academic Council.__ (1) There shall be an Academic Council of the Board to advise and assist it in the performance of its functions. (2) The Council shall consist of the following members, to be appointed by the Board, namely:__ (1) Chairman of the Board Chairman (2) a representative of the Ministry of Education Member (3) a representative of the Ministry of Science and Technology Member (4) Director General Research, Ministry of Religious Affairs, Zakat and Ushr Member (5) Chairman, Inter-Board Co-ordination Committee Member (6) two eminent scholars Members (7) one eminent scientist Member (8) one eminent educationist Member (3) The Academic Council shall be the Advisory Committee of the Board and shall, subject to the provisions of this Ordinance, have powers to determine and recommend proper standards of teaching and instructions, syllabi and examinations for the model Dini Madaris and Darul Ulooms, for consideration and approval by the Board. 11. Establishment and affiliation of dini madaris.__ (1) A Dini Madrassah or Darul Uloom may apply for affiliation under section 12. (2) The Board may establish Model Dini Madaris and Model Darul Uloom for the purposes of this Ordinance. 12. Affiliation.—(1) Any institution (Dini darul uloom or dini madrassah) may apply to the Board for affiliation in accordance with the procedure as the Board may prescribe. (2) The Board shall consider the application and may reject or grant affiliation on such terms and conditions as may be prescribed. The decision of the Board in any such matter shall be final. 13. Syllabii.—(1) Every dini madrassah and dar-ul-uloom affiliated with the Board shall teach Islamic education as the main component and shall also include such subjects of general education system as may be prescribed by the Board. (2) Where an affiliated dini madrassah or dar-ul-uloom contravenes the provisions of this Ordinance or any direction of the Board it may cancel the affiliation of such madrassah or dar-ul- uloom after giving the madrassah or Darul uloom as the case may be an opportunity of hearing. 14. Officers and servants of the Board to be public servants. The officers and servants of the Board shall be deemed to be public servants within the meaning of section 21 of the Pakistan Penal Code(Act XLV of 1860). 15. Officer and other staff. The Board may appoint such officers and staff as it may consider necessary for carrying out the purposes of this Ordinance. 16. Delegation of powers. The Board may, by order in writing and subject to such conditions as may be specified in the order, direct that any specific power or functions shall be exercisable by the Chairman or a member of the Board for a specified period which shall not extend for more than six months at a time. 17. Fund.—(1) There shall be established a fund to be known as Pakistan Madrasah Education Fund to which shall be credited all income of the Board including income from endowments and grants from the Federal Government, the Provincial Government or other organization: Provided that any grant from an international agency shall not be accepted without sanction of the Federal Government. (2) The funds of the Board may be used to finance the programme and activities of the model darul uloom and model dini madaris established by or affiliated to the Board. 18. Accounts and audit.__ (1) The Board shall maintain complete and accurate books of accounts of its actual expenses and receipts and annually submit its report to the Federal Government. (2) The Board shall cause to be carried out audit of its accounts by one or more auditors who are chartered accountants within the meaning of the Chartered Accountants Ordinance, 1961 (X of 1961), appointed by the Federal Government in consultation with the Auditor-General of Pakistan from a penal of chartered accountants proposed by the Board on such remuneration as the Federal Government may determine and annually submit its audited accounts to the Auditor General of Pakistan. 19. Indemnity. No suit, prosecution or other legal proceeding shall lie against the Chairman, any member of the Board or a committee thereof or an officer or employee of the Board, in respect of anything in good faith done or purported to have been done under this Ordinance or regulation made thereunder. 20. Power to make rules.__(1) The Board may, in consultation with the Federal Government, by notification in the official Gazette, make rules for carrying out the purposes of this Ordinance. (2) Without prejudice to the generally of the powers conferred by sub-section (1), such rules may provide for all or any of the following matters, namely:__ (a) finances; (b) general administration; (c) management of assets and matters ancillary thereto; and (d) such other matters as may be necessary for giving the effect to the provisions of this Ordinance, 21. Power to make regulations.__ (1) The Board may, by notification in the official Gazette, make regulations for carrying out the purposes of this Ordinance. (2) Without prejudice to the generally of the foregoing powers, such regulations may provide for all or any of the following matters, namely:__ (a) constitution of the committees, the appointment of the employees of the Board and their terms and conditions of service; (b) matters relating to pension and provident fund for the benefit of the employees of the Board; (c) admission, curricula, conduct of courses of study, quality institutions, regulation of examination and award of degrees and matters ancillary thereto; and (d) such other matters as may be necessary for giving effect to the provisions of this Ordinance. 22. Removal of difficulties. If any difficulty arises in giving effect to any of the provisions of this Ordinance, the Federal Government may, on the recommendations of the Board make such order, not inconsistent with the provisions of this Ordinance, as it may consider necessary for the removal of difficulty."
}