{
  "file": "administrator7958b24daa9f9348f35af1991d819398.pdf",
  "law_name": "The Delimitation Of Constituencies Act, 1974",
  "text": "THE DELIMITATION OF CONSTITUENCIES ACT, 1974 Last Amended on 2016­06­10 CONTENTS SECTIONS: 1. Short title, and commencement. 2. Definitions. 3. Commission to delimit constituencies. 4. Procedure of commission. 5. Delegation of powers, etc. 6. Assistance to the commission. 7. Allocation of seats in the National Assembly. 8. Delimitation of constituencies. 9. Principles of delimitation. 10. Reports of Commission and list of Constituencies. 10 A. Power of commission to make amendment, alteration or modification in the final list of constituencies. 10 B. Removal of difficulties. 11. Bar of jurisdiction. THE SCHEDULE.. 1THE DELIMITATION OF CONSTITUENCIES ACT, 1974 2ACT NO. XXXIV OF 1974 [8th May, 1974] An Act to provide for the delimitation of constituencies for elections to the National Assembly and the Provincial Assemblies. WHEREAS it is expedient to provide for the delimitation of constituencies for elections to the National Assembly and the Provincial Assemblies and for matters connected therewith or ancillary thereto; It is hereby enacted as follows:— 1. Short title and commencement. —(1) This Act, may be called the Delimitation of Constituencies Act, 1974. (2) It shall come into force at once. 2. Definitions. In this Act, unless there is anything repugnant in the subject or context— (a) \"Article\" means Article of the constitution of the Islamic Republic of Pakistan hereinafter referred to as the Constitution; (b) \"Commission\" means the Election Commission constituted under Article 218; 3[(ba) \"local government\" means a local government established under a Federal or a Provinicial law relating to local government; (bb) \"local government law\" means a Federal or a Provincial law relating to local government; (bc) \"council\" means a local council as defined in the respective Federal or Provincial local government laws;] (c) \"population\" means the population in accordance with the 4[last preceding] census officially published; and (d) all words and expressions used but not defined in this Act shall have the same meaning as in the Consti tution. 1 Amendment in delimitation of constituencies Act 1974. 2For Statement of Objects and Reasons, see Gaz. of Pakistan. 1974 Ext., Pt. 111. p. 560. The Act has been applied to the Federally Administered Tribal Areas, see Gaz. P. 1974 Ext., Pt. II, p. 1978 vide S.R.O. 1418(1)/74,dated the 14th November, 1974. The Act has been applied w.e.f. the 23rd Sept., 1974 to the Provincially Administered Tribal Areas of Chitral, Dir. Swat. Kalam, Malakand Protected Area the Tribal Area adjoining Hazara Distt. and former State of Amb : see Gaz. of N W.F.P. 1974 Ext.. p. 241­b. This Act has been amended by Ord. No. XXXVIII of 1978 and Ord. No. XXVII of 1979 for the purpose of Elections held in 1985. This Act has been applied to the Provincially Administered Tribal Areas of Baluchistan by Notification No. S.O. (TA) 3/32/73, dt. 25­9­1974 the Gaz. of Baluchistan. Ext.. Issue No. 71 of 1974. This Act has further been amended by Ordinance No. XXIX of 1988. The Delimitation of Constituencies (Amendment) Act, 1989 (III of 1989) shall apply to the Federally Administered Tribal Areas w.e.f the date Act III of 1989 received President's assent i.e. 9­2­1989 see S.R.O. No. 1093(I)/90, dated 3rd September. 1990. Gazette of Pakistan, Extraordinary Part­III, dated 22­10­1990 page 1848. 3Ins. by Act, XXVI 2016, s.2. 4Subs. by the Delimitation of Constituencies (Amdt.) Ordinance, 1988 (4 of 1988), s. 2, for “1972” which was previously amended for “last preceding” by Ord. 50 of 1984, s. 2, to read as above. 3. Commission to delimit constituencies. The Commission shall delimit territorial constituencies for elections to the National Assembly and to each Provincial Assembly in accordance with the provisions of the Constitution and this Act. 1[\"3A. Delimitaion of constituences for local government election. The Commission shall also delimit territoral constituencies for elections to the local governments in accordance with the provisions of the local government Law and the rules made thereunder of each Province.\"] 4. Procedure of Commission. —(1) Subject to the provisions of this section, the Commission shall regulate its own procedure. (2) If, upon any matter requiring the decision of the Com mission, there is difference of opinion amongst its members, the opinion of the majority shall prevail and the decision of the Commission shall be expressed in terms of the opinion of the majority. (3) The Commission may exercise its powers and performs its functions notwithstanding that there is a vacancy in the office of any one of its members or that any one of its members is, for any reason, unable to attend its proceedings and the decision of the 1[majority of the members of the Commission] shall have the effect of the decision of the Commission: 2[Provided that___ (a) where the members attending the proceedings of the Commission are four and they are equally divided in their opinion; or (b) where the members attending the proceedings of the Commission are three and there is difference of opinion amongst them; the matter shall be placed before the Commission for decision.] 2[“5. Delegation of powers, etc.___(1) The Commission may authorize three or more of its members, acting together, to exercise and perform all or any of its powers and functions under this Act. (2) Where four members are authorized under sub­section (1) the decision of majority shall prevail and where three members are authorized as aforesaid the decision shall be unanimous : Provided that___ (a) where four members have been authorized and they are equally divided in their opinion; or (b) where three members have been authorized and there is difference of opinion amongst them; the matter shall be placed before the Commission for decision.:] 1Ins. by Act No. XXVI of 2016, s.3. 2 Subs. by Act XII of 2012, s. 2 and 3. 6. Assistance to the Commission. —(1) The Commission may require any person or authority to perform such functions or render such assistance for the purposes of this Act as it may direct. (2) All executive authorities of the Federal Government and each Provincial Government shall assist the Commission in the performance of its functions and for this purpose the Commission may issue such directions as it may consider necessary. 1[7. Allocation of seats in the National Assembly. —(1) On the basis of population, the seats in the National Assembly for each Province, the Federally Administered Tribal Areas and the Federal Capital are allocated as set out in the table below:— S No. Province/Area General Seats Women Seats Total 1. Baluchistan 14 3 17 2. Khyber Pakhtunkhwa 35 08 43 3. Punjab 148 35 183 4. Sindh 61 14 75 5. Federally Administered Tribal Areas 12 ­ 12 6. Federal Capital 02 ­ 02 Total 272 60 332 Provided that in addition to the number of seats referred in the above table there shall be in the National Assembly ten seats reserved for non­Muslims as defined in Article 260 of the Constitution.”] 2* * * * * * * 3[(2) The seats allocated under sub­section (I) shall be reallocated after each succeeding census.] 1[8. Delimitation of Constituencies.___(1) For the purposes of election to the National Assembly, the Commission shall divide,___ (a) each Province into as many separate territorial constituencies as the number of general seats allocated to that Province under section 7; and (b) the Federally Administered Tribal Areas and the Federal Capital into as many separate territorial constituencies, as the number of general seats respectively allocated to said Areas and Federal Capital under section7. (2) The constituencies for the seats reserved for women in the National Assembly shall be such that each Province forms one constituency with as many such seats as are allocated to that Province under section 7. 1 Subs by Act XII of 2012, s. 4. 2 Omitted by the Delimitotion of Constituencies (Amdt.) Ordinance, 1984 (50 of 1984) s.3. 3 Added by the Delimitation of Constituencies (Amdt.) Act, 1989 (3 of 1989). s. 3. (3) The constituency for all seats reserved for non­Muslims in the National Assembly under clause (4) of Article 51 shall be the whole country. (4) For the purpose of election to Provincial Assemblies, the Commission shall divide each Province into as many separate territorial constituencies as the number of general seats given below: Province/ Area General Seats Women Seats Non­Muslims Total Baluchistan 51 11 3 65 Khyber Pakhtunkhwa 99 22 3 124 Punjab 297 66 8 371 Sindh 130 29 9 168 (5) The constituencies for the seats reserved for women and non­Muslims in the Provincial Assemblies shall be such that each Province forms one constituency with as many such seats as are allocated to that Province under sub­section (4)”. 1[\"(6) For the purpose of election to the local government, the Commission shall divide each local government into as many separate territorial constituencies and the number of councils and seats for direct election as provided in the respective Federal or Provincial local government laws.\"]. 2[9. Principles of delimitation.___(1) All constituencies for general seats shall, as far as practicable, be delimited having regard to the distribution of population in geographically compact areas, existing boundaries of administrative units, facilities of communication and public convenience and other cognate factors to ensure homogeneity in the creation of constituencies: Provided that for the purpose of delimiting constituencies for the general seats for the Federally Administered Tribal Areas two or more separate areas may be grouped into one constituency. (2) As far as may be the constituencies for election to the same Assembly shall be equal among themselves in population.] 10. Reports of Commission and list of constituencies.___(1) For the purpose of delimiting constituencies, the Commission may receive and consider representations, hold inquiries, summon witnesses and record evidence, and shall prepare and publish in the official Gazette a preliminary report and list of constituencies specifying the areas proposed to be included in each constituency. (2) Any person entitled to vote at an election to the National Assembly 1[or a local council] may, within 3[fifteen] days of the publication of the report under sub­section (1), make a representation to the Commission in respect of the delimitation of constituencies. 1Added and Ins. by Act XXVI. 2016, s. 4 and 5. 2 Subs. by Act XII of 2012 s. 5 and 6. 3 Subs, by the Delimitation of Constituencies (Amdt.) Act, 1989 (3 of 1989), s. 6, for \"thirty\". (3) The Commission shall, after hearing and considering the representations, if any, received by it, make such amendments, alterations or modifications, in the preliminary list published under sub­ section (1) as it thinks fit or necessary, and shall publish in the official Gazette the final report and list of constituencies showing the areas included in each constituency. 1[10A. Power of Commission to make amendment, alteration or modification in the final list of constituencies. Notwithstanding anything contained in this Act, the Commission may, at any time, of its own motion, make such amendments, alterations or modifications in the final list of constituencies published under sub­section (3), or in the areas included in a constituency, as it thinks, necessary. 10B. Removal of difficulties. If any difficulty arises in giving effect to any of the provisions of this 2[Act] the President may make such provision for the removal of the difficulty as he may deem fit.]. 11. Bar of Jurisdiction. The validity of the delimitation of any constituency, or of any proceedings taken or anything done by or under the authority of the Commission, under this Act shall not be called in question in any court. 3[\"12. Power to make rules.__The Commission may, with the approval of the President and by notification in the official Gazette, make rules for carrying out the purpose of this Act.\"]. 4THE SCHEDULE.—Omitted by the Delimitation of the Constituencies (Amdt.) Ordinance, 1988 (IV of 1988) s. 8. 5[****] _________ 1 Ins. by the Delimitation of Constituencies (Amdt) Ordinance, 1984 (50 of 1984). s.4 2Subs, by Act 3 of 1989, s. 7, for \"Order\". 3 Added by Act No. XXVI of 2016, s. 6. 4 The Schedule was added by the Delimitation of Constituencies (Amdt.) Ordinance, 1985(1 of 1985), s. 4, 5 Omitted by Act XII of 2012 s.7"
}