{
  "file": "administrator4b50fb9f2a0417cc9afd65b75e8c292e.pdf",
  "law_name": "THE WASTE LANDS (CLAIMS) ACT, 1863 CONTENTS PREAMBLE",
  "text": "THE WASTE LANDS (CLAIMS) ACT, 1863 CONTENTS PREAMBLE 1. Provision for enquiry in claims to land, or objections to sale of same. 2. Procedure in such cases. Notification of conditions. 3. Postponement of sale pending enquiry, to allow claimant to contest rejection of claim. 4. Sale to be stopped if claim appear to be established, but may afterwards be proceeded with. 5. Delivery to claimant of copy of order of rejection or of sale. Order when final. Report to Board. Decision of Board. Certification to Court. Notice to Claimant. Decision with final. 6. Power to order suit to try claim admitted by Collector. 7. Special Court for trying claims. Power of members. Exclusion of officer making original enquiry. 8. Notice of constitution of Special Courts. Claims not cognizable in other Courts. 9. Special Court where held. 10. Plaintiff and defendant in suit under section 5. Appearance. Proviso. Plaintiff and defendant in suits under section 6. 11. Regulation of proceedings. 12. Procedure before hearing. Procuring attendance of witnesses. Power to require attendance of claimant. 13. Procedure on hearing. 14. No appeal or revision. 15. Reference of question of law, etc., to High Court, etc. When reference obligatory. 16. Court may proceed notwithstanding reference. But not make final order. 17. Records of cases where to be deposited. 18. Limitation as to claims to land sold or dealt with. Provision for such claims if preferred within time. 19. If claim established, possession not to be given, but compensation. 20. When land sold not absolutely, or not sold, but otherwise dealt with. 21. Award under two last sections to be in full satisfaction. 22. Government not barred from awarding compensation for land absolutely sold, though claim be not preferred in time. 23. Compensation for land sold. subject to condition, if claim proved, though not preferred in time. 23A. Exercise of power of the Provincial Government by the Board of Revenue or the Financial Commissioner. 24. [Repleaded.] 1[THE WASTE LANDS (CLAIMS) ACT, 1863] 2ACT No. XXIII OF 1863 [10th March, 1863] An Act to provide for the adjudication of claims to waste lands Preamble. WHEREAS it is expedient to make special provision for the speedy adjudication of claims which may be preferred to waste lands proposed to be sold, or otherwise dealt with, on account of 3[the Provincial Government], and of objections taken to the sale or other disposition of such lands; It is enacted as follows:__ 1. Provision for enquiry in claims to land, or objections to sale of same. When any claim shall be preferred to any waste land proposed to be sold, or otherwise dealt with, on account of 3[the Provincial Government], or when any objection shall be taken to the sale or other disposition of such land, the Collector of the district in which such land is situate, or other officer performing the duties of a Collector of Land Revenue in such district by whatever name his office is designated, shall, if the claim or objection be preferred within the period mentioned in the advertisement to be issued for the sale or other disposition of such land, which period shall not be less than three months, proceed to make an enquiry into the claim or objections. 2. Procedure in such cases. The Collector or other officer as aforesaid shall call upon the claimant or objector to produce any evidence, or documents, upon which he may rely in proof of his claim or objection; and after considering the same, and making any further enquiry that may appear proper, shall dispose of the case by an order for the admission or rejection of the claim or objection; and if the land is proposed to be sold, for the sale of the same subject to any condition or reservation which, to such Collector or other officer as aforesaid, shall appear to be proper. Notification of conditions. If the land is ordered to be sold subject to any condition or reservation, such condition or reservation shall be notified to intending purchasers at the time of sale. 3. Postponement of sale pending enquiry, to allow claimant to contest rejection of claim. Pending an enquiry into any claim or objection under the last preceding section, the Collector or other officer as aforesaid shall postpone the sale or other disposition of the land; and, if he shall order that such claim or objection be rejected, he shall further postpone the sale or other disposition of the land, to allow the claimant or objector to contest the order of rejection in the manner hereinafter provided. 1Short title given by the Short Titles Act, 1897 (14 of 1897). This Act bas been repealed to the extent of Islamabad Capital Territory, see Ordinance No. 27 of. 1981, s. 4 and 3rd Sch. 2 For Proceedings relating to the Bill, see Calcutta Gazette, 1863, Supplement, p.109. This Act has been declared to be in force in all the Provinces and the Capital of the Federation, except the Scheduled Districts, by the Laws Local Extent Act, 1874 (15 of 1874), s. 3. It has been declared by notification under s. 3(a) of the Scheduled Districts Act. 1874 (14 of 1874), to be in force in the following Scheduled Districts, namely:— The Districts of Hazara, Peshawar, Kohat, Bannu, Dera Ismail Khan and Dera Ghazi Khan.[Portions of the District of Hazara, Bannu, Dera Ismail Khan and Dera Ghazi Khan and the Districts of Peshawar and Kohat now form the N.W.F.P. See Gazette of India, 1901, Pt. I, p. 857 and ibid., 1902, Pt. I. P. 575; but its application to that part of the Hazara District known as upper Tanawal has been barred by the Hazara (Upper Tanawal) Regulation, 1900 (2 of 1900)] see Gazette of India, 1886, Pt. I, p. 48. 3Subs. by A.O., 1937, for “Govt.” 4. Sale to be stopped if claim appear to be established, but may afterwards be proceeded with. If the Collector or other officer as aforesaid shall consider the claim or objection to be established, and that the sale or other disposition of the land should not take place, he shall stop the sale or other disposition of the land; but such sale or other disposition of the land may afterwards be proceeded with, if, on an order issued 1* * * to try the claim or objection, as provided in section 6 of this Act, the claimant or objector shall fail to establish the same. 5. Delivery to claimant of copy of order of rejection or of sale. If the Collector or other officer as aforesaid shall order that the claim or objection be rejected, or that the land be sold subject to any condition or reservation, or that it be otherwise dealt with, he shall cause a copy of such order to be delivered to the claimant or objector; Order when final. and if such claimant or objector shall not, within one week from the delivery of such copy, or within such further time as the Collector or other officer as aforesaid, for any special reason to be recorded, shall see fit to grant, give notice in writing to such Collector or other officer as aforesaid that he intends to contest such order, the order shall be final. Report to Board. If the claimant or objector shall, within the time allowed, give such notice, the Collector or other officer as aforesaid shall immediately make a report to the 2* * * superior revenue authority 3[to which he is immediately subordinate] and shall forward with such report a copy of his order, stating fully all the circumstances of the case, and the evidence adduced in support, or otherwise, of the claim or objection; Decision of Board. and such 4* * * authority, on the receipt of such report, and after calling for any further information which it may consider necessary, may confirm, modify or reverse the order of the Collector or other officer as aforesaid. Certification to Court. If the 4* * * authority as aforesaid confirm the order of the Collector or other officer as aforesaid, or modify such order in such manner as to leave any part of such order in force adverse to the claimant or objector, the Collector or other officer as aforesaid shall certify such order to the court constituted or hereinafter provided; Notice to Claimant. and such Court shall forthwith give notice to the claimant or objector; Decision with final. and if such claimant or objector shall not 5* * * institute a suit in such Court to establish his claim or objection, the order of the 6* * * authority aforesaid shall be final. 6. Power to order suit to try claim admitted by Collector. The 7[Provincial Government] may, within twelve months after the date on which the claim of any claimant of waste land, or the objection of any objector, as aforesaid, shall have been admitted under this Act by the Collector or other officer as aforesaid, direct a suit to be brought to try the claim or objection of the claimant or objector, in a Court constituted as hereinafter provided. 1The words “by the L.G.” were rep. by the Decentralization Act.1914 (4 of 1914), Sch., Pt. I. 2The words “Board of Revenue or other” were rep., ibid. 3Ins. ibid. 4The words “Board or other” were rep., ibid. 5The words \"within thirty days from the delivery of such notice from the Court\" were rep. by the Indian Limitation Act, 1871 (9 of 1871). For limitation, see now the Limitation Act, 1908 (9 of 1908). 6The words “Board or other” were rep. by the Decentralization Act, 1914 (4 of 1914), Sch., Pt. I. 7Subs. by A. O., 1937, for “L.G”. 7. Special Court for trying claims. For the investigation and trial of claims under this Act, the 1[Provincial Government] shall constitute, in every district in which there may be any waste lands capable of being sold, or otherwise dealt with, on account of 2[the Provincial Government], a Court consisting of an uneven number of persons, not less than three, of whom the Judge of the district, or the officer presiding in the principal Civil Court of original jurisdiction in the district, by whatever name his office may be designated, shall be one. Power of members. Any one or more of the members of which such Court shall consist shall have power to make all such orders in the case as may be necessary prior to the hearing of the suit: Exclusion of officer making original enquiry. Provided that, whenever the Collector, or other officer, by whom the original enquiry was held, is the officer presiding in the principal Civil Court of original jurisdiction in the district, such officer shall not be a member of such Court. 8. Notice of constitution of Special Courts. Whenever any Court is constituted under this Act, notice thereof shall be given by a written proclamation, copies of which shall be affixed in the several Courts, and in the offices of the several Collectors and Magistrates of the district: Claims not cognizable in other Courts. and from the date of the issue of such proclamation no other Court shall be competent to entertain any claim or objection belonging to the class of claims or objections for the trial and determination of which such Court is constituted. 9. Special Court where held. The Courts constituted under this Act shall be held at such place, or places, within the limits of their respective jurisdictions, as shall be considered most convenient. 10. Plaintiff and defendant in suit under section 5. In every suit instituted under section 5 of this Act, the claimant of the waste land, or objector to the sale or other disposition of such land, shall appear as plaintiff; and the Collector, or other officer aforesaid, shall appear as defendant on the part of 3[the Provincial Government]. Appearance. Either party may appear by pleader or by agent: Proviso. Provided that if such other officer as aforesaid be the presiding officer of the principal Civil Court of original jurisdiction in the district, the 4[Provincial Government] shall appoint some other officer to appear as defendant in the case on its behalf. Plaintiff and defendant in suits under section 6. In any suit ordered to be instituted 5* * * under section 6 of this Act, the 4[Provincial Government] by any officer, to be appointed for the purpose, shall appear as plaintiff; and the claimant or objector as aforesaid shall appear as defendant. 11. Regulation of proceedings. In suits instituted under this Act, except as hereinafter provided, the proceedings shall be regulated, so far as they can be, by the Code of Civil Procedure. 12. Procedure before hearing. The Court shall fix a day for the appearance of the parties, and for the hearing of the suit, of which due notice shall be given to the parties or their agents; and on the day so fixed, the parties or their agents shall bring their witnesses into Court, together with any documents on which they may intend to rely in support of their respective statements. 1Subs. by A. O., 1937, for “L.G”. 2Subs. ibid., for “Govt.”. 3Subs. by A. O., 1937, for “Govt.” 4Subs. ibid., for “L. G.”. 5The words “by the L.G.” were omitted by the Decentralization Act, 1914 (4 of 1914), Sch., Pt. I. Procuring attendance of witnesses. If either party require the assistance of the Court to procure the attendance of a witness on such day, he shall apply to the Court in sufficient time before the day fixed for the hearing of the suit; and the Court shall issue a subpoena requiring such witness to attend the Court on that day. Power to require attendance of claimant. It shall be competent to the Court to require the personal attendance of the claimant of the waste land, or objector, as aforesaid, on the day fixed for the hearing, or at any subsequent stage of the suit. 13. Procedure on hearing. On the day fixed for the hearing of the suit, or as soon after as may be practicable, the Court shall proceed to examine the claimant of the waste land, or the objector, or his agent (when his personal attendance is not required), and the witnesses of the parties; and upon such examination, and after inspecting the documents of the parties, and making any further enquiry that may appear necessary, shall proceed to pass such order in the case as it may consider just and proper. 14. No appeal or revision. No appeal shall lie from any decision or order passed under this Act, nor shall any such decision or order be open to revision. 15. Reference of question of law, etc., to High Court, etc. If, on the trial of any suit under this Act, any question of law or of usage having the force of law, or the construction of a document affecting the merits of the case, shall arise, on which the Court shall entertain reasonable doubts, the Court may, either of its own motion, or on the application of any of the parties to the suit, draw up a statement of the case and submit it, with its own opinion, for the opinion of the High Court of Judicature, or of the highest Civil Court of Appeal and Revision in the territory in which the land is situate: When reference obligatory. Provided that it shall be the duty of every Court held under this Act to make such reference to such High Court, or Court of Appeal, if, in any suit under this Act, any question shall arise involving any principle of general importance, or the rights of a class. 16. Court may proceed notwithstanding reference; The Court may proceed in the case notwithstanding a reference to the High Court, or other highest Civil Court of appeal as aforesaid; and may pass an order contingent upon the opinion of the High Court, or other Court as aforesaid, on the point referred; But not make final order. but no final order for the sale or other disposition of the land in question in the suit, or for the admission or rejection of any claim or objection which shall be before the Court in such suit, shall be passed, until the receipt of the order of the said High Court, or highest Civil Court of Appeal. 17. Records of cases where to be deposited. The record of cases disposed of by Courts constituted under this Act shall be deposited amongst the records of the principal Civil Court of original jurisdiction in the district in which the property in dispute is situate. 18. Limitation as to claims to land sold or dealt with. No claim to any land, or to compensation or damages in respect of any land, sold or otherwise dealt with on account of l[the Provincial Government] as waste land, shall be received after the expiration of three years from the date on which such land shall have been delivered by l[the Provincial Government] to the purchaser, or otherwise dealt with. 1Subs. by A. O., 1937, for “Govt.”. Provision for such claims if preferred within time. If within three years after any lands have been delivered by 1[the Provincial Government] to the purchaser, or otherwise dealt with, any claimant or objector shall prefer a claim to the land so delivered, or otherwise dealt with, or an objection to such sale, or to compensation or damages in respect thereof, in the Court constituted under this Act for the district in which the land is situate; and shall show good and sufficient reason for not having preferred his claim or objection to the Collector or other officer as aforesaid, within the period limited under section 1 of this Act; such Court shall file the claim or objection, making the claimant or objector plaintiff, and the Collector of the district or other officer as aforesaid (with the like provision as aforesaid if such other officer be the presiding officer of the principal Civil Court of original jurisdiction in the district), the defendant in the suit; and the foregoing provisions of this Act shall be applicable to the trial and determination of the suits. The report of the officer employed to give delivery, or to take possession, on the part of 1[the Provincial Government], of the land sold or otherwise dealt with, shall be conclusive evidence as to the date on which such delivery was made, or possession was taken. 19. If claim established, possession not to be given, but compensation. In any case in which the land has been sold, if the Court shall be of opinion that the claim of the claimant is established, the Court shall not award the claimant possession of the land in dispute; but shall order him to receive from 2[the Provincial Government] Treasury, by way of compensation, a sum equal to the price at which the land was sold, in addition to the costs of suit. 20. When land sold not absolutely, or not sold, but otherwise dealt with. If the land shall have been sold subject to any condition or reservation, or shall not have been sold, but shall have been otherwise dealt with on account of 2[the Provincial Government], and the Court shall be of opinion that the claim to such land, or the objection of an objector, is established, the Court shall award the claimant or objector to receive such sum, in respect of his interest in such land, as shall be awarded in that behalf under the provisions of 3Act, VI of 1857 (for the acquisition of land for public purposes), and thereupon the 4[Provincial Government] shall proceed under the said Act to obtain an award of the value of such interest. 21. Award under two last sections to be in full satisfaction. An award under any of the provisions of the two last preceding sections shall be in full satisfaction of the claim of the claimant or objector; and shall bar any future claim on his part, in respect to the land in suit resting on the same cause of action, or on a cause of action which existed prior to the date of the sale or other disposition of the land on account of 2[the Provincial Government]. 22. Government not barred from awarding compensation for land absolutely sold, though claim be not preferred in time. Nothing in this Act shall be held to prevent the 4[Provincial Government] from awarding, to any claimant of waste land sold on account of 2[the Provincial Government], on proof to the satisfaction of the 4[Provincial Government] of the claim of such claimant (notwithstanding that he may not have preferred his claim either to the Collector or other officer as aforesaid, or to the proper Court constituted under this Act, within the period prescribed by this Act), such amount as compensation for the said land, within the limits as to amount mentioned in section 19 of this Act, if the land have been sold not subject to any condition or reservation, as to such 4[Provincial Government] may seem proper. 1Subs. by A. O., 1937, for “Govt.”. 2Subs. ibid. for “the govt.”. 3See now s. 2 of the Land- Acquisition Act, 1894 (1 of 1894). 4Subs. by A. O., 1937, for “L. G.”. 23. Compensation for land sold. subject to condition, if claim proved, though not preferred in time. If the land have been sold subject to any condition or reservation, or have been otherwise disposed of, on account of 2[the Provincial Government], and any claim to such land, or objection to the sale or other disposition of the land, shall be proved to the satisfaction of the l[Provincial Government], although not preferred to the Collector or other officer as aforesaid, or to the Court constituted under this Act, within the period prescribed by this Act, the l[Provincial Government] may award to such claimant or objector such amount as to such l[Provincial Government] may appear to be the value of the interest of such claimant or objector in such land. 2[23A. Exercise of power of the Provincial Government by the Board of Revenue or the Financial Commissioner. In a Province for which there is a Board of Revenue or a Financial Commissioner, the powers and duties of the l[Provincial Government] under sections 6, 10, 22 and 23 may be exercised by such Board or Financia1 Commissioner, as the case may be.] 24. [Interpretation-clause. Number. Gender.] Rep. by the Repealing and Amending Act, 1914 (X of 1914) s. 3 and Sch. II. __________ Date: 13-09-2024 1Subs. by A. O., 1937, for “L. G.”. 2Ins. by the Decentralization Act, 1914 (4 of 1914), Sch., Pt. I."
}