{
  "file": "administrator7127b2a9f71004f4ce7165f41168465a.pdf",
  "law_name": "THE LEGAL PRACTITIONERS (FEES) ACT, 1926 CONTENTS 1.",
  "text": "THE LEGAL PRACTITIONERS (FEES) ACT, 1926 CONTENTS 1. Short title, extent and commencement 2. Interpretation 3. Agreement for engagement of legal practitioner 4. Right of legal practitioner to sue for fees 5. Liability of legal practitioner to be sued 6. [Repeals] THE LEGAL PRACTITIONERS (FEES) ACT, 1926 ACT No. XXI OF 1926 [25th March, 1926] An Act to define in certain cases the rights of legal practitioners to sue for their fees and their liabilities to be sued in respect of negligence in the discharge of their professional duties. WHEREAS it is expedient to define in certain cases the rights of legal practitioners to sue for their fees and their liabilities to be sued in respect of negligence in the discharge of their professional duties; It is hereby enacted as follows:___ 1. Short title, extent and commencement.___(1) This Act may be called the Legal Practitioners (Fees) Act, 1926. 1[(2) It extends to the whole of Pakistan.] (3) It shall come into force on such date2 as the 3[Federal Government] may, by notification in the 4[official Gazette], appoint. 2. Interpretation.___For the purposes of this Act, unless there is anything repugnant in the subject or context,___ 5[(a) “Legal practitioner” means a legal practitioner as defined in section 2 of the Legal Practitioners and Bar Councils Act, 1973 (XXXV of 1973).] (b) a legal practitioner shall not be deemed to “act” if he only pleads, or to “agree to act” if he agrees only to plead. 3. Agreement for engagement of legal practitioner.___Any legal practitioner who acts or agrees to act for any person may by private agreement settle with such person the terms of his engagement and the fee to be paid for his professional services. 4. Right of legal practitioner to sue for fees.___Any such legal practitioner shall be entitled to institute and maintain legal proceedings for the recovery of any fee due to him under the agreement, or, if no such fee has been settled, a fee computed in accordance with the law for the time being in force in regard to the computation of the costs to be awarded to a party in respect of the fee of his legal practitioner. 5. Liability of legal practitioner to be sued.___No legal practitioner who has acted or agreed to act shall, by reason only of being a legal practitioner, be exempt from liability to be sued in respect of any loss or injury due to any negligence in the conduct of his professional duties. 6. 6[Repeals.] Date: 15-08-2024 1Subs. by the Central Laws (Statute Reform) Ordinance, 1960 (XXI of 1960), s. 3 and 2nd Sch. (with effect from the 14th October, 1955). 2The 1st June, 1926 ; see Gazette of India, 1926, Pt. I, p. 514. 3Subs. by the Federal Adaptation of Laws Order (P.O. No.4 of 1975), 1975, Art. 2 and Table. 4Subs. by A.O. 1937. 5Subs. by the Federal Laws (Revision and Declaration) Ordinance, 1981 (XXVII of 1981), s. 3 and Sch., II. 6Rep. by the Repealing Act, 1927 (XII of 1927), s. 2 and Schedule."
}