{
  "file": "administratora6303c997da30442657bd566cbdc2ea3.pdf",
  "law_name": "Emigration Ordinance, 1979",
  "text": "THE FEE-CHARGING EMPLOYMENT AGENCIES (REGULATION) ACT, 1976 CONTENTS 1. Short title, extent and commencement 2. Definitions 3. Prohibition to act as fee-charging employment agency 4. Appointment and powers of competent authority 5. Issue, renewal, cancellation and suspension of licence 6. Prohibition of operation of fee-charging employment agency in certain cases 7. Offences and penalties 8. Cognizance of offences 9. Competent authority, etc., to be public servants 10. Indemnity 11. Power to make rules 12. Act not to apply to certain, persons THE FEE-CHARGING EMPLOYMENT AGENCIES (REGULATION) ACT, 1976 1ACT NO. LXXVII OF 1976 [1st December, 1976] An Act to regulate the working of fee-charging and other employment agencies conducted with a view to profit for placement of workers within Pakistan. WHEREAS it is expedient to regulate the working of fee-charging and other employment agencies conducted with a view to profit for placement of workers within Pakistan and for matters connected therewith or ancillary thereto; It is hereby enacted as follows:— 1. Short title, extent and commencement.—(1) This Act may be called the Fee-Charging Employment Agencies (Regulation) Act, 1976. (2) It extends to the whole of Pakistan. (3) It shall come into force in such areas and on such dates2 as the Federal Government may, by notification in the official Gazette, specify in this behalf: Provided that the Federal Government may, by notification in the official Gazette, exclude certain industries or establishments or classes of employment or employment agencies from the operation of all or any of the provisions of this Act. 2. Definitions. In this Act, unless there is anything repugnant in the subject or context,— (a) “competent authority” means an officer appointed to be the competent authority under section 4; (b) “employment agency” means a person, company, institution, agency, firm or other organization who or which acts as intermediary for the purpose of procuring employment for a worker, or supplying a worker for an employer, in Pakistan; (c) “establishment” means any office, firm, industrial unit, undertaking, shop or premises in which persons are employed; (d) “industry” means any business, trade, manufacture, calling, service employment or occupation; (e) “fee-charging employment agency” means— (i) an employment agency conducted with a view to deriving either directly or indirectly any pecuniary or other material advantage from an employer or worker; 1For Statement of Objects and Reasons, see Gaz. of P., 1976, Ext., Pt. 111. p. 1149. 2 i.e. 8.1.2003, whole of Pakistan, see SRO 5(1)/03 dated 1.1.2003. (ii) an employment agency though not conducted with a view to deriving any pecuniary or other material advantage, levies on the employer or worker for its services an entrance fee, a periodical contribution or any other charge; (f) “licence” means a licence issued under section 5; (g) “prescribed” means prescribed by rules; (h) “public employment service” means any office, agency or service set up and maintained by the Federal Government or a Provincial Government to find or procure employment for workers, or to supply, or assist in the supply of, workers to employers; (i) “rules” means rules made under this Act; and (j) “worker” means a person seeking employment. 3. Prohibition to act as fee-charging employment agency. After the enforcement of this Act, no employment agency shall, save as hereinafter provided, act as a fee-charging employment agency in any area: Provided that an employment agency acting immediately before the enforcement of this Act as a fee-charging employment agency may continue so to act for, and may apply for a licence within, a period of six months from such enforcement. 4. Appointment and powers of competent authority.—(1) The Federal Government may, by notification in the official Gazette, appoint an officer to be the competent authority for the purposes of this Act. (2) The competent authority or an officer uthorized by it in writing in this behalf may, with a view to securing compliance with the provisions of this Act or the rules, or any order or direction made or issued thereunder, or the terms or conditions of any licence,— (a) require any person to give such information or produce such documents in his possession with respect to any business or service of the nature of employment agency carried on or rendered by such person or any person employed by him as the competent authority or such officer may demand; (b) enter into and search any premises of an establishment or industry with such assistance as may be necessary and inspect any book or other document belonging to or under the control of any person acting or reasonably suspected to be acting as an employment agency; and (c) take on the spot or otherwise such evidence of any person as the competent authority or such officer may deem necessary: Provided that no one shall be required under this section to answer any question or give any evidence tending to incriminate himself. 5. Issue, renewal, cancellation and suspension of licence.—(1) The competent authority may issue a licence for operating a fee-charging employment agency to— (a) a person who is a citizen of Pakistan; (b) a firm, all the partners of which are citizens of Pakistan; or (c) a company, the majority of the shares of which is held by citizens of Pakistan. (2) A licence shall be issued in such manner and form, and on payment of such fee and deposits, as may be prescribed. (3) A licence shall, unless earlier cancelled or suspended, be valid for one year, and may, in the discretion of the competent authority and on payment of the prescribed fee, be renewed for a like period. (4) A licence shall be liable to be cancelled or suspended and the deposits forfeited in whole or in part by the competent authority for the contravention of any of the provisions of this Act or the rules, or any order or direction made or issued thereunder, or the breach of any of its terms and conditions. 1[(5) Any person aggrieved by an order under sub-section (4) may, within sixty days of the date of the order, appeal to the Federal Government, and the Federal Government may pass such order thereon as it may deem fit. (6) No order affecting any person under sub-section (4) or sub-section (5) shall be passed without giving such person a reasonable opportunity of being heard.] 6. Prohibition of operation of fee-charging employment agency in certain cases. Where a public employment service has been set up for any area, the competent authority may, by notification in the official Gazette, prohibit from such date as may be specified therein the operation of, or the rendering of any service by, all or any of the fee-charging employment agencies operating in such area, and on such prohibition the licences issued for such area shall stand cancelled from the date specified in the notification and no compensation shall be paid therefor: Provided that the competent authority may, in consultation with the organisations of employers, and workers in that area, exempt from the operation of the notification the placing or recruitment of specified categories of workers with respect to whom appropriate arrangements for placing or recruitment cannot conveniently be made by a public employment service. 7. Offences and penalties. —(1) Whoever wilfully contravenes any provision of this Act or the rules, or any order or direction made or issued thereunder, or the terms or conditions of any licence, shall be punishable with imprisonment for a term which may extend to one year, or with fine which may extend to five thousand rupees, or with both. 1Added by the Fee-Charging Employment Agencies (Regulation) (Amdt.) Ordinance, 1984, (12 of 1984), s. 2. (2) Where an offence punishable under sub-section (1) is committed by a corporation, firm, establishment, industry or undertaking, every director, manager, secretary, partner, agent or other officer or person concerned with the management thereof shall, unless he proves that the offence was committed without his knowledge or consent or that he exercised due diligence to prevent its commission, be deemed to be guilty or such offence. 8. Cognizance of offences. No court shall take cognizance of an offence under this Act except upon a complaint in writing made by the competent authority or an officer authorised by it in this behalf. 9. Competent authority, etc., to be public servants. The competent authority or the officer authorised by it under sub-section (2) of section 4 shall be deemed to be a public servant within the meaning of section 21 of the Pakistan Penal Code (Act. XLV of 1860). 10. Indemnity. No suit, prosecution or other legal proceedings shall lie against any person for anything which is in good faith done or intended to be done in pursuance of this Act or any rule. 11. Power to make rules.—(1) The Federal Government may, by notification in the official Gazette, make rules for carrying out the purposes of this Act. (2) In particular, and without prejudice to the generality of the foregoing power, such rules may provide for all or any of the following matters, namely:— (a) form of licence to be issued; (b) procedure for the issue and renewal of licences, the fees and deposits for their issue and renewal; (c) procedure for the cancellation or suspension of a licence, or prohibition of operation of fee-charging employment agencies; (d) fees and expenses to be charged by the fee-charging employment agencies; (e) manner of recruitment and placement of various type of workers; (f) returns and forms; and (g) procedure of consultation with organisation of workers and employers. 12. Act not to apply to certain, persons. Nothing in this Act shall apply to— (a) any person licensed under the Merchant Shipping Act, 1923 (XXI of 1923) to engage or supply seamen to merchant ships; (b) employment exchanges or any other public employment service managed by the Federal Government or a Provincial Government; and (c) any person permitted under the 1[Emigration Ordinance, 1979 (XVII of1979)] to engage persons for placement abroad. Last Uploaded on 13.11.2023 1Subs. by the Federal Laws (Revision and Declaration) Ordinance. 1981 (27 of 1981), s. 3 and Sch., II."
}