{
  "file": "administratorc8803548fbfe346d380935fb63ac2cd0.pdf",
  "law_name": "The Pakistan Fish Inspection And Quality Control Act, 1997",
  "text": "THE PAKISTAN FISH INSPECTION AND QUALITY CONTROL ACT, 1997 CONTENTS 1 Short title, extent and commencement. 2 Definitions. 3 Registration of fish processing plants, etc. 4 Registration of fish exporters. 5 Constitution and functions of Inspection Committee. 6 Inspection of fish processing plant. 7 Fish Export. 8 Handling of fish and fishery products. 9 Quality evaluation of fish and fishery products. 10 Powers, duties and functions of Fishery Officer. 11 Cognizance of offence. 12 Penalties. 13 Power to search. 14 Seizure and disposal. 15 Revision. 16 Indemnity. 17 Delegation of powers. 18 Power to make rules. THE PAKISTAN FISH INSPECTION AND QUALITY CONTROL ACT, 1997 ACT NO. XXXV OF 1997 An Act to regulate quality and promote export of fish and fishery products from Pakistan WHEREAS it is expedient to regulate quality and promote export of fish and fishery products and to prevent export of substandard quality of fish and fishery products and for matters connected therewith and ancillary thereto; It is hereby enacted as follows:— 1. Short title, extent and commencement.—(1) This Act may be called the Pakistan Fish Inspection and Quality Control Act, 1997. (2) It extends to the whole of Pakistan. (3) It shall come into force at once. 2. Definitions. In this Act, unless there is anything repugnant in the subject or context— (a) “certificate of quality and origin” means a certificate issued by the Director-General or an officer authorized by him certifying that the fish is wholesome and fit for human consumption or for any other purpose specified therein; (b) “Director-General” means Director-General, Marine Fisheries Department;, (c) “export” means export of fish and fishery products from Pakistan by any means to any place outside Pakistan; (d) “fish” means all aquatic animals of inland, marine and brackish water origin, alive or dead, and includes prawns, shrimps, lobsters, crabs, oysters, clams, scallops, turtles, in salted, unsalted, semi-dried, dried, frozen, preserved, cured, or canned form and any other aquatic animal or animal product which the Director General, Marine Fisheries Department, may by an order declare to be fish for the purposes of this Act ; (e) “fish exporter” means a person engaged in carrying on the business of export of fish and fishery products and registered with the registration authority; (f) “fish inspection” means inspection of fish and fishery products by a Fishery Officer for the purpose of assessing the quality of the fish by inspecting sanitary and hygienic conditions and the physical, chemical and bacteriological examination of fish and fishery products; (g) “fish processing” means cleaning, filleting, icing, packing, canning, freezing, pickling, cooking, drying, semi-drying, salting, chilling, smoking, extraction of oil, conversion into fish-meal or preparing fish in any other manner for marketing; (h) “Fishery Officer” means an Officer duly authorized by the Federal Government to exercise the powers and perform the functions for carrying out the provisions of this Act; (i) “Fishery product” means anything originating, produced or made, whether in whole or in part from a fish; (j) “Inspection Committee” means a committee constituted under section 5; (k) “prescribed” means prescribed by rules made under this Act; (l) “processing plant” means an establishment, place or premises where fishes are processed; (m) “quality” in respect of fish means a fish or fishery product conforming to the established standards prescribed under this Act; (n) “quality control” means quality assurance of fish and fishery products conforming to standards prescribed under this Act or the rules made thereunder; (o) “registration” means registration of a fish processing plant under this Act and “registered” shall be construed accordingly; (p) “registration authority” means a Fishery Officer authorised by the Director-General, by an order in writing, to register fish processing plants under this Act or the rules made thereunder; (q) “rules” means rules made under this Act; and (r) “unwholesome” means fish or fishery products that have an offensive or objectionable odour, flavour, colour, texture or substance associated with spoilage. 3. Registration of fish processing plants, etc.—(1) No fish processing plant shall process fish and fish products unless it is registered with the registration authority. (2) The registration authority may, on receipt of an application from a fish processing plant, on payment of such fees and conditions as may be prescribed, issue a certificate of registration. 4. Registration of fish exporters.—(1) No person shall export fish or fishery products unless he is registered with the registration authority. (2) The registration authority may, on receipt of an application from a fish processing plant, on payment of such fees and conditions as may be prescribed, issue a certificate of registration. 5. Constitution and functions of Inspection Committee.—(1) The Federal Government shall constitute an Inspection Committee consisting of one representative each of the Export Promotion Bureau, the Marine Fisheries Department and a broad based trade association of fish processing plants. (2) The functions of the Committee shall be— (a) to conduct a survey, or surveys, of fish processing plants with a view to determining their fitness for registration; (b) to hear appeals against orders, decisions, action or omissions of Fishery Officers; (c) to make recommendations to the Federal Government for the efficient functioning of the industry, the removal of malpractices therein and the enhancement of exports; and (d) to discharge such other functions as may be conferred on it under the rules. 6. Inspection of fish processing plant.—(1) A Fishery Officer may inspect any fish processing plant to ensure the observance of the provisions of this Act and the rules made thereunder. (2) A Fishery Officer may, without any order from a Magistrate and without a warrant, arrest any person operating a fish processing plant without a valid registration granted under section 3. 7. Fish Export.—No person shall process and export or market for export or have in his possession for export or deal in, any fish or fish products intended for human consumption which are decomposed, unwholesome or contaminated with pathogenic organisms. 8. Handling of fish and fishery products.—No Person who is suffering from leprosy, tuberculoses, polio or such other contagious diseases as the Government may, by notification in the official Gazette, specify, shall handle, carry or process fish or work in a fish processing and packing plant or establishment. 9. Quality evaluation of fish and fishery products.—All fish and fishery products found to be of sub-standard quality shall be detained by the Fishery Officer and shall be disposed of in such manner as may be prescribed. 10. Powers, duties and functions of Fishery Officer.—Subject to the provisions of this Act, the Fishery Officer shall exercise the following powers:- (a) to carry out inspections of plants where fish and fishery products are processed for export; (b) to carry out inspection of fish and fishery products for export; (c) to register fish processing plants and exporters carrying on fish export business and issue registration certificates on the recommendation of the Inspection Committee; (d) to issue certificates of quality and origin for fish and fishery products when the quality is found to be satisfactory upon inspection ; (e) to detain fish and fishery products when found to be unwholesome and unfit for human consumption upon inspection; and (f) to carry on any other functions assigned by the Director-General which may be necessary for the successful regulation of quality and promotion of export of fish and fishery products. 11. Cognizance of offence.—No Court shall take Cognizance of any offence under this Act, except upon a complaint in writing made by an Officer authorized by the Federal Government in this behalf. 12. Penalties.—(1) Whoever contravenes, or attempts to contravene, any provision of this Act or the rules shall, without prejudice to any other penalty to which he may be liable, be punished- (i) on a first conviction with fine which may extend to fifty thousand rupees; (ii) on a second conviction to a fine which may extend to one hundred thousand rupees; (iii) on a third conviction to a fine which may extend to two hundred thousand rupees; and (iv) for any subsequent conviction with imprisonment for a term which may extend to one year or with fine which may extend to three hundred thousand rupees. (2) No Court inferior to that of a Magistrate of the first class shall try an offence punishable under this Act and notwithstanding anything contained in the Code of Criminal Procedure, 1898 (Act V of 1898), it shall be lawful for the Magistrate trying an offence under this Act to pass any sentence authorized by this Act. (3) Any export of fish or fishery products which is not accompanied by a valid certificate of quality and origin, shall be detained, confiscated or disposed of by the Marine Fisheries Department, in such manner as may be prescribed. (4) Where the person contravening any provision of this Act or the rules is a company or other body corporate, every director, manager, or other officer or agent thereof involved in the contravention shall be deemed to be guilty of such contravention. (5) Whoever attempts to contravene, or abets the contravention of, any provision of this Act or the rules shall be deemed to have contravene the provisions of this Act or the rules. 13. Power to search.—Any Fishery Officer may search any fish processing plant or fish consignment intended for export which he has reason to believe to be not fresh, decomposed, unwholesome or contaminated. 14. Seizure and disposal.—(1) If any Fishery Officer has reason to believe that any fish or fishery product intended for human consumption is decomposed, unwholesome or contaminated with pathogenic organisms, he may seize or detain the same and shall, at the time of seizure or detention, inform, in writing, the person from whose possession the seizure or detention is made, of the grounds for the said action. (2) The seized or detained products shall be dealt with in accordance with the decision of the court before which the owner of the processing plant or fish exporter is prosecuted. 15. Revision.—(1) Any person aggrieved by an order passed by the Inspection Committee may apply for revision to the Federal Government within thirty days from the date of issue of such order and the decision of the Federal Government thereon shall be final. (2) The Federal Government may, on receipt of an application under sub-section (1) above, stay the operation of the order of the Committee till the disposal of the application. 16. Indemnity.—No suit, prosecution or legal proceedings shall lie against the Federal Government, Marine Fisheries Department, a Fishery Officer or any other person for anything in good faith done or intended to be done under this Act or the Rules. 17. Delegation of powers.—The Federal Government may, by notification in the official Gazette, delegate to the Inspection Committee or the Fishery Officer or any officer or authority, its powers under this Act. 18. Power to make rules.—(1) The Federal Government (Marine Fisheries Department) may, by notification in the official Gazette, after consultation with the Inspection Committee make rules for carrying out the purposes of this Act. (2) In particular and without prejudice to the generality of the foregoing power, such rules may provide for all or any of the following matters namely: — (a) the procedure of applying for registration; (b) the conditions of registration; (c) the fee to be charged for registration; (d) the fee to be charged for a certificate of quality and origin for export of fish and fishery products; (e) to hear appeals or revisions; (f) the procedure for inspection of fish and fishery products; (g) prescribing the samples procedure and the manner in which samples of fish and fishery products are selected for laboratory analysis; (h) prescribing quality standards for fish and fishery products; (i) regulation of handling, processing, packaging, storage and marketing of fish and fishery products; (j) determining disposal procedure for fish and fishery products which do not conform with the prescribed requirements or are otherwise considered unwholesome or unsuitable for human consumption; (k) the forms of registration and certificates of quality and origin; (l) validation period for registered fish processing plants, fish exporters and the certificates of quality and origin; and (m) any other matter which is to be or may be prescribed in furtherance of the provisions of this Act. _______________"
}