{
  "file": "administratorc6ac9c6df43581421462c0bbbbef30ef.pdf",
  "law_name": "The Sugar Export Subsidy Fund Ordinance, 1970",
  "text": "THE SUGAR EXPORT SUBSIDY FUND ORDINANCE, 1970 CONTENTS 1. Short title, extent and commencement 2. Definitions 3. Levy of sales tax and excise duty 4. Sugar export Subsidy Fund 5. Registration of contracts 6. Power to call for information, etc. 7. Penalty 8. Offences by companies, etc. 9. Cognizance of offences 10. Protection of action taken in good faith 11. Power to make rules THE SUGAR EXPORT SUBSIDY FUND ORDINANCE, 1970 *ORDINANCE NO. XX OF 1970 [26th October, 1970] An Ordinance to provide for the establishment of a Sugar Export Subsidy Fund for promoting export of sugar. WHEREAS it is expedient to provide for the establishment of a Sugar Export Subsidy Fund for promoting export of sugar; AND WHEREAS, during the absence of the President and Chief Martial Law Administrator abroad, the Minister for Health, Labour and Family Planning is performing the functions of President as Acting President in pursuance of clause (a) of paragraph 3 of the State Arrangements Regulation (Martial Law Regulation No. 55); NOW, THEREFORE, in pursuance of the Proclamation of the 25th day of March, 1969, read with the Provisional Constitution Order and the Regulation aforesaid, and in exercise of all powers enabling him in that behalf, the Acting President is pleased to make and promulgate the following Ordinance:___ 1. Short title, extent and commencement.___(1) This Ordinance may be called the Sugar Export Subsidy Fund Ordinance, 1970. (2) It extends to Baluchistan, the North-West Frontier Province, the Punjab and Sind. (3) It shall come into force at once. 2. Definitions. In this Ordinance, unless there is anything repugnant in the subject or context,___ (a) “export” means taking to any place outside Pakistan by any means; (b) “prescribed” means prescribed by rules made under this Ordinacne; (c) “sugar” does not include khandsari and Palmyra sugar; (d) “sugar-cane” means the plant saccharum officinarum which is commonly known as the sugar-cane and from which sugar is obtained. 3. Levy of sales tax and excise duty.___(1) There shall be levied and collected in such manner as may be prescribed___ (a) sales tax on sugar-cane sold to the sugar mills at the rate of twenty-five paisa per maund; and (b) excise duty___ (i) on sugar-cane grown by sugar mills at the rate of twenty-five paisa per maund, and (ii) on sugar produced by sugar mills at the rate of one rupee per maund. * The Ordinance has been declared to be validly made by the Competent authority, see the validation of Laws Act, 1975 (LXIII of 1975). (2) The sales tax and excise duty levied under sub-section (1) shall be in addition to any sales tax or excise duty imposed on sugar-cane or sugar by or under any other law for the time being in force. 4. Sugar Export Subsidy Fund.___(1) There shall be established a fund to be called the Sugar Export Subsidy Fund to which shall be credited the proceeds of the sales tax and excise duty levied and collected under section 3 after deducting the cost of collection. (2) The Sugar Export Subsidy Fund shall be applied for the purpose of subsidising export of sugar to such extent and in such manner as the 1[Federal Government] may, from time to time, decide. (3) The 1[Federal Government] may, by special order, authorise repayment from out of the Sugar Export Subsidy Fund of the excise duty paid on so much of the sugar produced by a sugar mill as is exported by such mill. 5. Registration of contracts. The 1[Federal Government] may, by general or special order, require any contract or class of contracts for export of sugar to be registered in such manner and with such authority as may be specified in the order. 6. Power to call for information, etc.___(1) The 1[Federal Government] may, at any time, by order, direct any sugar mill to maintain such accounts and to furnish to the 1[Federal] Board of Revenue or to any officer of the 1[Federal Government] such returns or other information relating to crushing of sugar-cane and production of sugar within such time and giving such particulars as may be specified in the order. (2) Any person authorised in this behalf by the 1[Federal Government] or by the 1[Federal] Board of Revenue may at all reasonable times enter any sugar factory or any place or premises where sugar is manufactured, stored or kept for sale and may require the production for his inspection of any book, register, record or other paper kept therein and ask for any information relating to the crushing of sugar-cane and production of sugar. 7. Penalty. A person shall be punishable with imprisonment for a term which may extend to three years, or with fine, or with both, if he ___ (a) contravenes or fails to comply with any order or direction issued under this Ordinance; or (b) when required by any order made under this Ordinance to make any statement or furnish any information, makes a statement or furnishes information which he knows or has reasonable cause to believe to be false or does not believe to be true; or (c) makes any such statement as aforesaid in any book, account, record, declaration, return or other document which he is required by any such order to maintain or furnish; or (d) maintains double sets of books, accounts or any other records, in which the entries are not identical. 1 Subs. by F.A.O., 1975, Art. 2 and Table. 8. Offences by Companies, etc. Where any person guilty of an offence under this Ordinance is a company or other body corporate, every director, manager, secretary or other officer, and every agent and servant thereof and, in the case of an unlimited company or a company limited by guarantee, also every member thereof shall be punishable as if he had committed such offence: Provided that no such director, manager, secretary or other officer and no such agent, servant, or member shall be prosecuted under this Ordinance except with the previous approval of the 1[Federal] Board of Revenue; and the 1[Federal] Board of Revenue shall not give such approval if it is satisfied after giving such director, manager, secretary, officer, agent, servant or member an opportunity of showing cause against prosecution that the offence was committed without his knowledge or that he used due diligence to prevent its commission. 9. Cognizance of offences. No court shall take cognizance of an offence punishable under this Ordinance except on a report in writing of the facts constituting such offence made by the 1[Federal] Board of Revenue or any person authorised by it in this behalf. 10. Protection of action taken in good faith. No suit, prosecution or other legal proceedings shall lie against the 1[Federal Government] or any authority or person exercising any power under this Ordinance for anything which is in good faith done or intended to be done under this Ordinance or any rules or orders made thereunder. 11. Power to make rules. The 1[Federal Government] may make rules for carrying out the purposes of this Ordinance. ____________ RGN Dated: - 04.01.2024 1 Subs. by F.A.O., 1975, Art. 2 and Table."
}