{
  "file": "administratora2befd40d215cadf121253d6efffa391.pdf",
  "law_name": "THE PRIVATE MILITARY ORGANISATIONS (ABOLITION AND PROHIBITION) ACT,",
  "text": "THE PRIVATE MILITARY ORGANISATIONS (ABOLITION AND PROHIBITION) ACT, 1974 CONTENTS 1. Short title, extent and commencement 2. Power to declare organisation illegal 3. Punishment for forming private military organisation, etc. 4. Power to make rules 5. [Omitted] THE PRIVATE MILITARY ORGANISATIONS (ABOLITION AND PROHIBITION) ACT, 1973 ACT NO. IV OF 1974 [24th December, 1973] An Act to abolish, and provide a penalty for the formation of, certain organisations prohibited by the Constitution WHEREAS Article 256 of the Constitution of the Islamic Republic of Pakistan prohibits the formation of a private organisation capable of functioning as a military organisation and declares such organisation illegal; AND WHEREAS it is necessary to abolish, and provide a penalty for the formation of, such organisation; It is hereby enacted as follows:— 1. Short title, extent and commencement.___(1) This Act may be called the Private Military Organisations (Abolition and Prohibition) Act, 1973. (2) It extends to the whole of Pakistan. (3) It shall come into force at once. 2. Power to declare organisation illegal.___(1) If the Federal Government is satisfied that any private organisation is capable of functioning as a military organisation in violation of the prohibition in Article 256 of the Constitution, the Federal Government may, by notification published in the official Gazette, direct that the organisation shall stand abolished forthwith. (2) Every such notification shall specify the grounds on which it is issued: Provided that nothing in this sub-section shall require the Federal Government to disclose any fact which it considers to be against the public interest to disclose. Explanation.— For the purposes of this section and section 3, an organisation shall be deemed to be capable of functioning as a military organisation if it is organised, trained or equipped so as to be capable of being employed for the use or display of physical force in promoting or attaining any object. 3. Punishment for forming private military organisation, etc. ___Whoever— (a) forms, organises, trains or equips a private organisation capable of functioning as a military organisation, or is a member or adherent, or takes part in the activities, of any such organisation; or (b) is a member or adherent, or takes part in the activities, of any organisation in respect of which a notification under section 2 has been issued; shall be punishable with imprisonment for a term which may extend to five years and with fine. 4. Power to make rules. ___The Federal Government may, by notification in the official Gazette, make rules to carry out the purposes of this Act. 5. 1[Omitted] ___________ RGN Date: 21-05-2024 1Omitted by Federal Laws (Revision and Declaration) Ordinance No. XXVII of 1981, sch.II."
}