{
  "file": "administrator416e6c94f52927a90e423f1ae3899e8c.pdf",
  "law_name": "The Literacy Ordinance, 1985",
  "text": "THE LITERACY ORDINANCE, 1985 CONTENTS 1. Short title, extent, application and commencement 2. Definitions 3. Issue of passports, etc., to and employment of, literate persons only 4. Savings THE LITERACY ORDINANCE, 1985 ORDINANCE No. XXVII OF 1985 [31st March, 1985] An Ordinance to encourage Literacy WHEREAS Islam assigns great importance to the acquisition of knowledge and makes its pursuit incumbent upon every Muslim ; AND WHEREAS the literacy ratio in Pakistan is very low which is a matter of great concern for the Government ; AND WHEREAS the President is satisfied that circumstances exist which render it necessary to take immediate action ; NOW, THEREFORE, in pursuance of the Proclamation of the fifth day of July, 1977, and in exercise of all powers enabling him in that behalf, the President is pleased to make and promulgate the following Ordinance:— 1. Short title, extent, application and commencement.—(1) This Ordinance may be called the Literacy Ordinance, 1985. (2) It extends to the Islamabad Capital territory and also applies to the establishments and institutions under the control of the Federal Government throughout Pakistan. 1[(3) It shall come into force on such 2date as the Federal Government may, by notification in the official Gazette, appoint.] 2. Definitions.—In this Ordinance, unless there is anything repugnant in the subject or context,— (a) “literate person” means a person who is certified by an authority to be able to read a newspaper and write a simple letter in any language; (b) “passport” has the same meaning as in the Passports Act, 1974 (XX of 1974) ; (c) “driving licence” means a licence issued under the Motor Vehicles Ordinance, 1965 (W. P. Ordinance XIX of 1965), which authorizes the holder thereof to drive a motor vehicle; (d) “arms licence” means a licence issued under the Pakistan Arms Ordinance, 1985 (W. P. Ordinance XX of 1965) ; 1 Subs. and shall be deemed always to have been so subs. by Act VII of 1987, s.2. 2 i.e. 1­1­93, vide Ministry of Education’s Notification No. F.5­4/91­NFE­II, dt. 15­8­1991,see Gaz. of Pak. Ext. Pt. III, K­1991, p. 419. (e) “authority” means the Headmaster of the Middle or High School of the District in which the applicant is residing; or an officer of the Literacy and Mass Education Commission or the Federal Ministry of Education or Federal Directorate of Education; or a person authorised to issue a passport or a driving license or an arms license; or the appointing authorities in the establishments or establishments under the control of the Federal Government. 3. Issue of passports, etc., to and employment of, literate persons only. Notwithstanding anything contained in any other law for the time being in force,__ (a) a passport other than a Hajj passport a driving licence or an arms licence shall be issued only to a literate person; and (b) only a literate person shall be eligible for employment under a local body or an establishment or institution under the control of the Federal Government: Provided that this section not be deemed to apply to the renewal of licences or passports issued, or to appointments made, before the date on which this Ordinance comes into force. 4. Savings. The provisions of section 3, so far as may be, shall not apply to a person who is physically or mentally handicapped."
}