{
  "file": "administratore30ef38868e5116d72022d5c3983d341.pdf",
  "law_name": "The Civil Defence Act, 1952",
  "text": "THE CIVIL DEFENCE ACT, 1952 CONTENTS 1. Short title, extent and commencement 1 A. Definitions 2. Power to make rules 3. Ordinary avocations of life to be interfered with as little as possible 4. Savings as to orders 5. Protection of action taken under the Act 6. Compensation to be paid in accordance with certain principles for compulsory acquisition of immovable property, etc 7. Power to acquire requisitioned property 8. Release from requisition 9. Delegation of powers under the Acts 10. Repeal of Ordinance, (VIII of 1951) THE CIVIL DEFENCE ACT, 1952 1ACT No. XXXI OF 1952 [29th April, 1952] An Act to provide for powers to secure the civil defence of 2[Pakistan]. WHEREAS it is necessary to provide for powers to secure the civil defence of 2[Pakistan] ; It is hereby enacted as follows 1. Short title, extent and commencement.__ (1) This Act may be called the Civil Defence Act, 1952. (2) It extends to the whole of Pakistan. (3) It shall come into force at once. 3[1A. Definitions.__ In this Act, unless there is anything repugnant in the subject or context 4[(1) civil defence includes any measures not amounting to actual combat, for affording defence against any form of hostile attack by a foreign power or for depriving any form of hostile attack by a foreign power of its effect, whether such measures are taken before, during or after the time of the attack and includes remedial measures during calamity or disaster in peace time.] (2) ‘Civil Defence Services’ means the services formed wholly or mainly to meet the needs of civil defence. 2. Power to make rules.__ The 1[Federal Government] may by notification in the official Gazette make such rules2 as appear to it to be necessary or expedient for securing the civil defence of 3[Pakistan]. (2) Without prejudice to the generality of the powers conferred by subsection (1) such rules may provide for, or may empower any authority to make orders providing for, all or any of the following matters, namely.__ _________________________________________________________________________________ 1For Statement of Objects and Reasons, see Gazette of Pakistan, Ext., 1952, page 287. The Act has been applied to­­‑ (i) Baluchistan, with certain modification, with effect on and from the thirtieth day of April, 1952, see Gazette of Pakistan, 1952, Pt. I, p 190 ; extended to the Leased Areas of Baluchistan, by the Leased Areas (Laws) Order, 1950 (G.G.O. 3 of 1950); and applied in the Federated Areas of Baluchistan, see Gazette of P. 1953, Pt. I, p. 152 ; and It has also been extended to__ (i) the Baluchistan States Union, by the Baluchistan States Union (Federal Laws) (Extension) Order, 1953 (G.G.O. 4 of 1953) ; and (ii) Khairpur State, by the Khairpur (Federal Laws) (Extension) Order, 1953 (G.G.O. 5 of 1953). The Act has been and shall be deemed to have been brought into force in Gwadur with effect from the 8th September, 1958, by the Gwadur (Application of Central Laws) Ordinance, 1960 (37 of 1960), S. 2. 2 Subs. by A.O., 1964, Art. 2 and Sch., for “the Federation”. 3 Section 1A, ins. by the Civil Defence (Amdt.) Act, 1966 (10 of 1966), s. 2. 4 Subs. by the Civil Defence (Amdt.) Act, 1994 (22 of 1994) , s. 2. for cl. (1). 5 Subs. by F.A.O., 1975 Art. 2 and Table, for “Central Government”. 6 For the Civil Denfence (Special Powers) Rules, 1951, see Gaz. of P., 1951, Ext., pp. 571582 ; for the Railway Air Raid Precautions Services Rules, 1951, see ibid., pp. 667672. 3 Subs. by A.O., 1964, Art. 2 and Sch., for “the Federation”. 1[(a) the constitution, enrolment, discipline, powers, duties, privileges and protection of Civil Defence Services ; (b) Preventing or prohibiting anything likely to assist the enemy or to prejudice the successful conduct of civil defence including acts, publication or communications prejudicial to civil defence ; (c) requiring any person or class of persons to comply with any scheme of civil defence ; (d) ensuring the safety of any place or thing used or intended to be used for the purposes of Government or a local authority, the protection of which is considered necessary or expedient for securing civil defence ; (e) the control of lights, sounds and vehicles ; (f) the control of trade or industry for the purposes of regulating or increasing the supply of, and the obtaining of information with regard to, articles or things of any description whatsoever which may be used in connection with the conduct of civil defence ; (g) the provision, storage and maintenance of commodities and material required for the conduct of civil defence ; (h) the provision, construction, maintenance or alteration of buildings, premises or other structures required for the conduct of civil defence ; (i) the measures for preventing and dealing with the outbreak of fire; (j)` preventing or controlling any use of uniforms, whether official or otherwise, flags, official decorations like medals, badges and other insignia and anything similar thereto, where such use is calculated or likely to deceive the public or to prejudice civil defence ; (k) the salvage of damaged buildings and property and disposal of the dead ; (l) the evacuation of areas and the removal of property or animals therefrom ; (m) the accommodation in any area of persons evacuated from another area and the regulation of the conduct of evacuated persons accommodated in such area ; (n) the billeting of evacuated persons ; (o) the instruction of members of the public in civil defence ; ________________________________________________________________________________________ 1 Subs. by the Civil Defence (Amdt.) Act, 1966 (10 of 1966), s. 3, for the original clauses (a), (b),(c), (d), (e), (f), (g) and (h). (p) the entry into, and search of, any place reasonably suspected of being used for any purpose prejudicial to civil defence and for the seizure and disposal of anything found there and reasonably suspected of being used for such purpose; (q) the requisition of property and acquisition thereof.] (3) The rules made under sub-section (1) may further___ (a) provide for the arrest and trial of persons contravening any of the rules or any order issued thereunder ; (b) provide that any contravention of, or any attempt to contravene, and any abetment of, or attempt to abet, the contravention of any of the provisions of the rules, or any order issued under any such provision, shall be punishable with imprisonment for a term which may extend to five years, or with fine which may extend to five thousand rupees or with both 1[;] 2[(c) provide for the seizure, detention and forfeiture of any property in respect of which such contravention, attempt or abetment as is referred to in clause (b) has been committed ; (d) prescribe the duties and powers of public servants and other persons as regards preventing the contravention of, or securing the observance of, the rules or any order issued thereunder ; (e) provide for preventing the obstruction and deception of, and disobedience to, any person acting, and interfering with any notice issued, in pursuance of the rules or of any order issued thereunder ; (f) make provision prohibiting attempts to screen from punishment any person contravening any of the rules or any order issued thereunder.] 3. Ordinary avocations of life to be interferred with as little as possible.__ An authority or a person acting in pursuance of this Act shall interfere with the ordinary avocations of life and the enjoyment of property as title as may be consonant with the purpose of ensuring the public safety and interest and the defence of Pakistan. 4. Savings as to orders.__ (1) No order made in exercise of any power conferred by or under this Act shall be called in question in any Court. (2) Where an order purports to have been made and signed by an authority in exercise of any power conferred by or under this Act, the Court shall, within the meaning of the Evidence Act (1 of 1872,) presume that such order was so made by that authority. _________________________________________________________________________________ 1 Subs. by the Civil Defence (Amdt.) Act, 1966 (10 of 1966), s.3. 2 New clauses (c) to (f) added ibid. 5. Protection of action taken under the Act.__ (1) No suit, prosecution or other legal proceeding shall tie against any person for anything which is in good faith done or intended to be done in pursuance of this Act or any rules made thereunder or any order issued under any such rule. (2) Save as otherwise expressly provided under this Act, no suit or other legal proceeding shall lie against the 1[Government[ for any damage caused or likely to be caused by anything in good faith done or intended to be done in pursuance of this Act or any rules made thereunder or any order issued under any such rule. 6. Compensation to be paid in accordance with certain principles for compulsory acquisition of immovable property, etc.__ (1) Where under Section 7 by or under any rule made under this Act any action is taken of the nature described in 2[Article 24] of the Constitution there shall be paid compensation, the amount of which shall be determined in the manner, and in accordance with the principles, hereinafter set out, that is to say :___ (a) Where the amount of compensation can be fixed by agreement, it shall be paid in accordance with such agreement. (b) Where no such agreement can be reached, the 3[Federal Government] shall appoint as arbitrator a person qualified 2* * * for appointment as a Judge of a High Court. (c) The 3[Federal Government] may, in any particular case, nominate a person having expert knowledge of the kind of property which has been acquired, to be an assessor to assist the arbitrator, and where such nomination is made, the person to be compensated may also nominate an assessor for the said purpose. (d) At the commencement of the proceedings before the arbitrator, the 3[Federal Government] and the person to be compensated shall state what in their respective opinions is a fair amount of compensation. (e) The arbitrator in making his award shall have regard to.__ (i) the provisions of sub-section (1) of Section 23 of the Land Acquisition Act, 1894 (I of 1894), so far as the same can be made applicable ; and (ii) whether the acquisition is of a permanent or temporary character : Provided that where any property requisitioned under any rule made under this Act, is subsequently acquired under Section 7 or any such rule, the arbitrator in any proceedings in connection with such acquisition shall, for the purposes of the provisions of the said Section 23, take into consideration the marketvalue of 4(2) The original words, brackets, figures and commas “under subsection (3) ofsection 220 of the Government of India Act, 1935,” omitted by A.O., 1961, Art. 2 and Sch. (with ef ect from the 23 rd March, 1956). _________________________________________________________________________________________________ 1Subs. by A.O., 1961, Art. 2., for “Crown” (with ef ect from the 23 rd March, 1956). 2The original words, bracket and figures “sub-section (2) of section 299 of the Government of India Act, 1935” were first subs. by A.O., 1961, Art. 2 and Sch., amended by A.O., 1964, Art. 2 and Sch. And Subs. by the Federal Laws (Revision and Declaration) Ordinance 1981 (27 of 1981), s. 3 and 2 and Sch., to read as above. 3Subs by F.A.O, 1975 Art.2 and Table, for “Central Government”. 4the original words bracket, figures and commas “under sub-section(3) of section 220 of the Government of India Act, 1935,”omitted by A.O., 1961, Art.2 and Sch. (with effect from the 23rd March, 1956) the property at the date of its requisition as aforesaid and not at the date of its subsequent acquisition. (f) An appeal shall lie to the High Court against any award of an arbitrator except in cases where the amount awarded does not exceed an amount prescribed in this behalf by rule made by the 1 [Federal Government]. (g) Save as provided in this section and in any rules made thereunder, nothing in any law for the time being in force shall apply to arbitrations under this section. (2) The 1[Federal Government] may make rules for the purpose of carrying into effect the provisions of this section. (3) In particular and without prejudice to the generality of the foregoing power, such rules may prescribe. (a) the procedure to be followed in arbitrations under this section ; (b) the principles to be followed in apportioning the costs of proceedings before the arbitrator and on appeal ; (c) the maximum amount of an award against which no appeal shall lie. 7. Power to acquire requisitioned property.__ (1) Without prejudice to any power to acquire property conferred by any rule made under this Act, any immovable property which has been requisitioned under any rule so made may in the manner provided by any such rules for the acquisition of property, be acquired in the circumstances and by the Government hereinafter specified, namely.__ (a) where any works have, during the period of requisition, been constructed on, in or over the property wholly or partly at the expense of any Government, by that Government if it decides that the value of, or the right to use, such works shall, by means of the acquisition of the property, be preserved or secured for the purposes of any Government ; or (b) where the cost to any Government of restoring the property to its condition at the time of its requisition as aforesaid would, in the determination of that Government, be excessive having regard to the value of the property at that time, by that Government ; and at the beginning of the day on which notice of such acquisition is served or published under the aforesaid rules, the immovable property shall vest in the acquiring Government free from any mortgage, pledge, lien or similar encumbrance, and the period of the requisition thereof shall end. (2) Any decision or determination of a Government under subsection (1) shall be final, and shall not be called in question in any Court. (3) For the purposes of this section, “works” includes buildings, constructions and improvements of the property, of every description. 1Subs. by F.A.O. 1975, Art. 2 and Table, for “Central Government 8. Release from requisition.__ (1) Where any property requisitioned under any rule made under this Act is to be released from such requisition, the Government by which or under whose authority the property was requisitioned or any person generally or specially authorised by it in this behalf may, after such enquiry, if any, as it or he may in any case consider it necessary to make or cause to be made, specify by order in writing the person to whom possession of the property shall be given. (2) The delivery of possession of the property to the person specified in an order under subsection (1) shall be a full discharge of the Government from all liabilities in respect of the property, but shall not prejudice any rights in respect of the property which any other person may be entitled by due process of law to enforce against the person to whom possession of the property is given. 9. Delegation of powers under the Acts.__ The 1[Federal Government] may, by 2notification in the official Gazette, direct that all or any of the powers or duties which under the provisions of this Act or rules made thereunder are conferred or imposed upon the 1 [Federal Government] shall be exercised or discharged by any officer or authority subordinate to it or by the Provincial Government ; and the Provincial Government may, by a like notification, direct that all or any of the powers or duties as aforesaid, to be exercised or discharged by it, shall be exercised and discharged by any officer or authority subordinate to it. 10. Repeal of Ordinance, VIII of 1951.__ (1) The Civil Defence Ordinance, 1951, is hereby repealed. (2) Every appointment, order or rule made under the Civil Defence (Special Powers) Ordinance, 1951 and maintained in force under the Civil Defence Ordinance, 1951 or made under the Civil Defence Ordinance, 1951, shall, if in force immediately before the commencement of this Act, and so far as it is not inconsistent with the provisions of this Act, be deemed to have been made under the provisions of this Act, and have effect accordingly subject to the provisions of this Act. _________________________________________________________________________________ 1 Subs. by F.A.O. 1975, Art. 2 and Table, for “Central Government”. 2 For such notification, see Gaz. of P., Ext., 1951, p. 582."
}