{
  "file": "administratorfc99040b8c95fa97c584d07cfbdccbdf.pdf",
  "law_name": "THE ISLAMABAD CAPITAL TERRITORY SHOPS, BUSINESS AND INDUSTRIAL",
  "text": "THE ISLAMABAD CAPITAL TERRITORY SHOPS, BUSINESS AND INDUSTRIAL ESTABLISHMENTS (SECURITY) ORDINANCE, 2000 CONTENTS 1. Short title, extent and commencement 2. Definitions 3. Security of Establishment 4. Penalties 5. Power to make rules THE ISLAMABAD CAPITAL TERRITORY SHOPS, BUSINESS AND INDUSTRIAL ESTABLISHMENTS (SECURITY) ORDINANCE, 2000 ORDINANCE No. XXX of 2000 [27th July, 2000] An Ordinance to provide for the security of shops, business and industrial establishments in the Islamabad Capital Territory WHEREAS, it is expedient to provide for security of shops, business and industrial establishments in the Islamabad Capital Territory and for matters ancillary thereto; AND WHEREAS the National Assembly and the Senate stand suspended in pursuance of the Proclamation of Emergency of the fourteenth day of October, 1999, and the Provisional Constitution Order No. 1 of 1999; AND WHEREAS the President is satisfied that circumstances exist which render it necessary to take immediate action; NOW, THEREFORE, in pursuance of the Proclamation of Emergency of the fourteenth day of October, 1999, and Provisional Constitution Order No. 1 of 1999, as well as Order No. 9 of 1999, and in exercise of all powers enabling him in that behalf, the President of the Islamic Republic of Pakistan is pleased to make and promulgate the following Ordinance:— 1. Short title, extent and commencement:___ (1) This Ordinance may be called the Islamabad Capital Territory Shops, Business and Industrial Establishments (Security) Ordinance, 2000. (2) It extends to the whole of Islamabad Capital Territory. (3) It shall come into force at once. 2. Definitions:___ In this Ordinance,— (a) “establishment” includes— (i) any bank, money changer or financial institution; and (ii) any office, firm, company, institution, industrial unit, undertaking, shop or premises used for undertaking any business, trade, manufacture, calling, service, employment or occupation; and (b) “Government” means the Federal Government. 3. Security of Establishment:___ The Government may by order, published in the official Gazette, provide for the regulation and enforcement of measures for the security of the property and persons connected with any establishment. 4. Penalties:___ If any person contravenes any order made under this Ordinance he shall be punished with imprisonment for a term which may extend to one month or with fine which may extend to fifteen thousand rupees, or with both. 5. Power to make rules:___ The Government may, by notification in the official Gazette, make rules for carrying out the purposes of this Ordinance. _____________"
}