{
  "file": "administrator2f7f6b8cfdf87e1119c78768ad083e0c.pdf",
  "law_name": "The Forest Act, 1927",
  "text": "THE FOREST ACT, 1927 CONTENTS CHAPTER I PRELIMINARY 1. Short title and extent 2. Interpretation clause CHAPTER II OF RESERVED FORESTS 3. Power to reserve forests 4. Notification by Provincial Government 5. Bar of accrual of forest-rights 6. Proclamation by Forest Settlement-officer 7. Inquiry by Forest Settlement-officer 8. Powers of Forest Settlement-Officers 9. Extinction of rights 10. Treatment of claims relating to practice of shifting cultivation 11. Power to acquire land over which right is claimed 12. Order on claims to rights of pasture or to forest-produce 13. Record to be made by Forest Settlement-Officer 14. Record where he admits claim 15. Exercise of rights admitted 16. Commutation of rights 17. Appeal from order passed under section 11, section 12, section 15 or section 16 18. Appeal under section 17 19. Pleaders 20. Notification declaring forest reserved 21. Publication of translation of such notification in neighbourhood of forest 22. Power to revise arrangement made under section 15 or section 18 23. No right acquired over reserved forest, except as here provided 24. Rights not to be alienated without sanction 25. Power to stop ways and water-courses in reserved forests 26. Acts prohibited in such forests 27. Power to declare forest no longer reserved CHAPTER III OF VILLAGE-FORESTS 28. Formation of village-forests CHAPTER IV OF PROTECTED FORESTS 29. Protected forests 30. Power to issue notification reserving trees, etc. 31. Publication of translation of such notification in neighbourhood 32. Power to make rules for protected forests 33. Penalties for acts in contravention of notification under section 30 or of rules under section 32 34. Nothing in this Chapter to prohibit acts done in certain cases CHAPTER V OF THE CONTROL OVER FORESTS AND LANDS NOT BEING THE PROPERTY OF GOVERNMENT 35. Protection of forests for special purposes 36. Power to assume management of forests 37. Expropriation of forests in certain cases 38. Protection of forests at request of owners CHAPTER VI OF THE DUTY ON TIMBER AND OTHER FOREST-PRODUCE 39. Power to impose duty on timber and other forest-produce 40. Limit not to apply to purchase money or royalty CHAPTER VII OF THE CONTROL OF TIMBER AND OTHER FOREST-PRODUCE IN TRANSIT 41. Power to make rules to regulate transit of forest produce 41A. Powers of Federal Government as to movements of timber across Customs frontiers 42. Penalty for breach of rules made under section 41 43. Government and Forest-officers not liable for damage to forest-produce at depot 44. All persons bound to aid in case of accidents at depot CHAPTER VIII OF THE COLLECTION OF DRIFT AND STRANDED TIMBER 45. Certain kinds of timber to be deemed property of Government until title thereto proved, and may be collected accordingly 46. Notice to claimants of drift timber 47. Procedure on claim preferred to such timber 48. Disposal of unclaimed timber 49. Government and its officers not liable for damage to such timber 50. Payments to be made by claimant before timber is delivered to him 51. Power to make rules and prescribe penalties CHAPTER IX PENALTIES AND PROCEDURE 52. Seizure of property liable to confiscation 53. Power to release property seized under section 52 54. Procedure thereupon 55. Forest-produce, tools, etc., when liable to confiscation 56. Disposal, on conclusion of trial for forest-offence, of produce in respect of which it was committed 57. Procedure when offender not known, or cannot be found 58. Procedure as to perishable property siezed under section 52 59. Appeal from orders under section 55, section 56 or section 57 60. Property when to vest in Government 61. Saving of power to release property seized 62. Punishment for wrongful seizure 63. Penalty for counterfeiting or defacing marks on trees and timber and for altering boundary marks 64. Power to arrest without warrant 65. Power to release on a bond a person arrested 66. Power to prevent commission of offence 67. Power to try offences summarily 68. Power to compound offences 69. Presumption that forest-produce belongs to Government CHAPTER X CATTLE-TRESPASS 70. Cattle-trespass Act, 1871, to apply 71. Power to alter fines fixed under that Act CHAPTER XI OF FOREST-OFFICERS 72. Provincial Government may invest Forest-officers with certain powers 73. Forest-officer deemed public servants 74. Indemnity for acts done in good faith 75. Forest-officers not to trade CHAPTER XII SUBSIDIARY RULES 76. Additional powers to make rules 77. Penalties for breach of rules 78. Rules when to have force of law CHAPTER XIII MISCELLANEOUS 79. Persons bound to assist Forest-officers and Police-officers 80. Management of forests the joint property of Government and other persons 81. Failure to perform service for which a share in produce of Government forest is employed 82. Recovery of money due to Government 83. Lien on forest-produce for such money 84. Land required under this Act to be deemed to be needed for a public purpose under the Land Acquisition Act, 1894 85. Recovery of penalties due under bond 85A. Saving for rights for Federal Government 86. [Omitted] THE FOREST ACT, 1927 1ACT NO. XVI OF 1927 [21st September, 1927] An Act to consolidate the law relating to forests, the transit of forest produce and the duty leviable on timber and other forest-produce WHEREAS it is expedient to consolidate the law relating to forests, the transit of Forests, the transit of forest-produce and the duty leviable on timber and other forest-produce ; It is hereby enacted as follows:___ CHAPTER I PRELIMINARY 1. Short title and extent,___(1) This Act may be called 2[*] Forest Act, 1927. 3[(2) It extends to Sind, the Punjab and the North-West Frontier Province (except the District of Hazara). (3) The Provincial Government of a Province may, by notification in the official Gazette, extend this Act to the whole or any specified part thereof.] 2. Interpretation clause. In this Act, unless there is anything repugnant in the subject or context,___ (1) “cattle” includes elephants, camels, buffaloes, horses, mares, geldings, ponies colts, fillies mules, asses, pigs, rams, ewes, sheep, lambs, goats and kids; (2) “Forest-officer” means, any person whom 4[* * *] the 5[Provincial Government] or any officer empowered by 4[* * *] the 5[Provincial Government] in this behalf, may appoint to carry out all or any of the purposes of this Act or to do anything required by this Act or any rule made thereunder to be done by a Forest-officer; (3) “forest-offence” means an offence punishable under this Act or under any rule made thereunder; 1It has also been applied to Phulera in the Excluded Area of Upper Tanawal to the extent the Act is applicable in the N.W.F.P and extended to the Excluded Area of Upper Tanawal (N.W.F.P) other than Phulera with effect from such date and subject to such modifications as may be notified, see N.W.F.P (Upper Tanawal) (Excluded Area) Laws Regulation, 1950. It has been amended in its application to the Province of ___ (i) Punjab, see Punjab Act No. IV of 1948, s. 2. (ii) Sind, see Sind Act No. VIII of 1953, s. 2 and (iii) West Pakistan, by West Pakistan Ordinance IV of 1962, s. 2 (with effect from the 22nd January, 1962) and by West Pakistan Act No.VII of 1964, s. 2 (with effect from he 17th March, 1964). The Act, as in force in the North-West Frontier Province immediately before the commencement of N.W.F.P Regulation No. II of 1974, has been applied to the Provincially Administered Tribal Areas of Chitral, Dir, Kalam, Swat and Malakand Protected Area, by N.W.F.P. Regulation, No. II of 1974, s. 3. 2The word “Indian” omitted by A.O., 1949. 3Subs. by the Federal Laws (Revision and Declaration) Ordinance, 1981 (XXVII of 1981), s. 5 and Sch., IV, for sub-sections (2) and (3). 4The words “the G.G. in C. or” omitted by A.O., 1937. 5Subs. ibid., for “L.G.” (4) “forest-produce” includes___ (a) the following whether found in, or brought from, a forest or not, that is to say:___ timber, charcoal, caoutchouc, catechu, wood-oil, resin, natural varnish, bark, lac, mahua flowers, mahua seeds 1[ kuth] and myrabolams, and (b) the following when found in, or brought from, a forest, that is to say:___ (i) trees and leaves, flowers and fruits, and all other parts or produce not herein before mentioned, of trees, (ii) plants not being trees (including grass, creepers, reeds and moss), and all parts or produce of such plants, (iii) wild animals and skins, tusks, horns, bones, silk, cocoons, honey and wax, and all other parts or produce of animals, and (iv) peat, surface soil, rock, and minerals (including limestone, laterite, mineral oils, and all products of mines or quaries); 2[(4A) “owner” includes a Court of Wards in respect of property under the superintendence or charge of such Court;] (5) “river” includes any stream, canal, creek or other channels, natural or artificial; (6) “timber” includes trees, when they have fallen or have been felled, and all wood whether cut up or fashioned or hollowed out for any purpose or not; and (7) “tree” includes palms, bamboos, stumps, brunch-wood and canes. CHAPTER II OF RESERVED FORESTS 3. Power to reserve forests.—The 3[Provincial Government] may constitute any forest-land or waste-land which is the property of Government, or over which the Government has proprietary rights, or to the whole or any part of the forest produce of which the Government is entitled, a reserved forest in the manner hereinafter provided. 4. Notification by Provincial Government.___(1) Whenever it has been decided to constitute any land a reserved forest, the 3[Provincial Government] shall issue a notification4 in the 5[official Gazette]___ 1Ins. by the Indian Forest (Amdt.) Act, 1930 (XXVI of 1930), s. 2. 2Clause (4A) ins. by the Indian Forest (Amdt.) Act, 1933 (III of 1933), section. 2. 3Subs. by A.O., 1937, for “L.G.”. 4See Government of N.W.F.P., Development Department Notification No. 47207-DD, dated the 21st September, 1951, published in the N.W.F.P. Govt. Gazette dated the 18th September, 1951, Pt. I, p. 285. 5Subs. by A.O., 1937, for “local official Gazette”. (a) declaring that it has been decided to constitute such land a reserved forest; (b) specifying, as nearly as possible, the situation and limits of such land; and (c) appointing an officer (hereinafter called “the Forest Settlement-officer”) to inquire into and determine the existence, nature and extent of any rights alleged to exist in favour of any person in or over any land comprised within such limits or in or over any forest-produce, and to deal with the same as provided in this Chapter. Explanation.___ For the purpose of clause (b), it shall be sufficient to describe the limits of the forest by roads, rivers, ridges or other well-known or readily intelligible boundaries. (2) The officer appointed under clause (c) of sub-section (1) shall ordinarily be a person not holding any forest-office except that of Forest Settlement-officer. (3) Nothing in this section shall prevent the 1[Provincial Government] from appointing any number of officers not exceeding three, not more than one of whom shall be a person holding any forest-office except as aforesaid, to perform the duties of a Forest Settlement-officer under this Act. 5. Bar of accrual of forest-rights.— After the issue of a notification under section 4, no right shall be acquired in or over the land comprised in such notification, except by succession or under a grant or contract in writing made or entered into by or 2[on behalf of the Government] or some person in whom such right was vested when the notification was issued; and no fresh clearings for cultivation or for any other purpose shall be made in such land except in accordance with such rules as may be made by the 1[Provincial Government] in this behalf. 6. Proclamation by Forest Settlement-officer.—When a notification has been issued under section 4, the Forest Settlement-officer shall publish in the local vernacular in every town and village in the neighborhood of the land comprised therein, a proclamation___ (a) specifying, as nearly as possible, the situation and limits of the proposed forest; (b) explaining the consequences which, as hereinafter provided, will ensue on the reservation of such forest; and (c) fixing a period of not less than three months from the date of such proclamation, and requiring every person claiming any right mentioned in section 4 or section, 5 within such period either to present to the Forest Settlement officer a written notice specifying or to appear before him and state, the nature of such right and the amount and particulars of the compensation (if any) claimed in respect thereof. 7. Inquiry by Forest Settlement-officer.— The Forest Settlement-officer shall take down in writing all statements made under section 6, and shall at some convenient place inquire into all claims duly preferred under that section, and the existence of any rights mentioned in section 4 or section 5 and not claimed under section 6 so far as the same may be ascertainable from the records of Government and the evidence of any persons likely to be acquainted with the same. 1Subs. ibid., for “L.G.”. 2The original words “on behalf of Govt.” were first subs. by A. O., 1937 and then amended by A.O., 1961, Art. 2 (with effect from the 23rd March, 1956), to read as above. 8. Powers of Forest Settlement-Officers.— For the purpose of such inquiry, the Forest Settlement-officer may exercise the following powers, that is to say:___ (a) power to enter, by himself or any officer authorised by him for the purpose, upon any land, and to survey, demarcate and make a map of the same; and (b) the powers of a Civil Court in the trial of suits. 9. Extinction of rights.— Rights in respect of which no claim has been preferred under section 6, and of the existence of which no knowledge has been acquired by inquiry under section 7, shall be extinguished, unless before the notification under section 20 is published, the person claiming them satisfies the Forest Settlement-officer that he had sufficient cause for not preferring such claim within the period fixed under section 6. 10. Treatment of claims relating to practice of shifting cultivation.—(1) In the case of a claim relating to the practice of shifting cultivation, the Forest Settlement-officer shall record a statement setting forth the particulars of the claim and of any local rule or order under which the practice is allowed or regulated, and submit the statement to the 1[Provincial Government], together with his opinion as to whether the practice should be permitted or prohibited wholly or in part. (2) On receipt of the statement and opinion, the 1[Provincial Government] may make an order permitting or prohibiting the practice wholly or in part. (3) If such practice is permitted wholly or in part, the Forest Settlement-officer may arrange for its exercise___ (a) by altering the limits of the land under settlement so as to exclude land of sufficient extent, of a suitable kind, and in a locality reasonably convenient for the purposes of the claimants, or (b) by causing certain portions of the land under settlement to be separately demarcated, and giving permission to the claimants to practice shifting cultivation therein under such conditions as he may prescribe. (4) All arrangements made under sub-section (3) shall be subject to the previous sanction of the 1[Provincial Government]. (5) The practice of shifting cultivation shall in all cases be deemed a privilege subject to control, restriction and abolition by the 1[Provincial Government]. 11. Power to acquire land over which right is claimed.___(1) In the case of a claim to a right in or over any land, other than a right-of-way or right of pasture, or a right to forest produce or a water-course, the Forest Settlement-officer shall pass an order admitting or rejecting the same in whole or in part. (2) If such claim is admitted in whole or in part, the Forest Settlement-officer shall either___ (i) exclude such land from the limits of the proposed forest; or (ii) come to an agreement with the owner thereof for the surrender of his rights; or 1Subs. by A.O., 1937, for “L.G.”. (iii) proceed to acquire such land in the manner provided by the Land Acquisition Act, 1894 (I of 1894). (3) For the purpose of so acquiring such land___ (a) the Forest Settlement-officer shall be deemed to be a Collector proceeding under the Land Acquisition Act, 1894 (I of 1894); (b) the claimant shall be deemed to be a person interested and appearing before him in pursuance of a notice given under section 9 of that Act; (c) the provisions of the preceding sections of that Act shall be deemed to have been complied with; and (d) the Collector, with the consent of the claimant, or the Court, with the consent of both parties, may award compensation in land, or partly in land and partly in money. 12. Order on claims to rights of pasture or to forest-produce.—In the case of a claim to rights of pasture or to forest-produce, the Forest Settlement-Officer shall pass an order admitting or rejecting the same in whole or in part. 13. Record to be made by Forest Settlement-Officer.—The Forest Settlement-officer, when passing any order under section 12, shall record, so far as may be practicable,___ (a) the name, father’s name, caste, residence and occupation of the person claiming the right; and (b) the designation, position and area of all fields or groups fields (if any), and the designation and position of all buildings (if any) in respect of which the exercise of such rights is claimed. 14. Record where he admits claim.—If the Forest Settlement-officer admits in whole or in part any claim under section 12, he shall also record the extent to which the claim is so admitted, specifying the number and description of the cattle which the claimant is from time to time entitled to graze in the forest, the season during which such pasture is permitted, the quantity of timber and other forest produce which he is from time to time authorised to take or receive, and such other particulars as the case may require. He shall also record whether the timber or other forest-produce obtained by the exercise of the rights claimed may be sold or bartered. 15. Exercise of rights admitted.___(1) After making such record the Forest Settlement- officer shall, to the best of his ability, having due regard to the maintenance of the reserved forest in respect of which the claim is made, pass such orders as will ensure the continued exercise of the rights so admitted. (2) For this purpose the Forest Settlement-officer may___ (a) set out some other forest-tract of sufficient extent, and in a locality reasonably convenient, for the purposes of such claimants, and record an order conferring upon them a right of pasture or to forest-produce (as the case may be) to the extent so admitted; or (b) so alter the limits of the proposed forest as to exclude forest-land of sufficient extent, and in a locality reasonably convenient, for the purposes of the claimants; or (c) record an order, continuing to such claimants a right of pasture or to forest- produce, as the case may be, to the extent so admitted, at such seasons, within such portions of the proposed forest, and under such rules, as may be made in this behalf by the 1[Provincial Government]. 16. Commutation of rights.—In case the Forest Settlement-officer finds it impossible, having due regard to the maintenance of the reserved forest, to make such settlement under section 15 as shall ensure the continued exercise of the said rights to the extent so admitted, he shall, subject to such rules as the 1[Provincial Government] may make in this behalf, commute such rights, by the payment to such persons of a sum of money in lieu thereof, or by the grant of land, or in such other manner as he thinks fit. 17. Appeal from order passed under section 11, section 12, section 15 or section 16.— Any person who has made a claim under this Act, or any Forest-officer or other person generally or specially empowered by the 1[Provincial Government] in this behalf, may, within three months from the date of the order passed on such claim by the Forest Settlement-officer under section 11, section 12, section 15 or section 16, present an appeal from such order to such officer of the Revenue Department, of rank not lower than that of a Collector, as the 1[Provincial Government] may, by notification in the 2[official Gazette], appoint to hear appeals from such orders: Provided that the 1[Provincial Government] may establish a Court (hereinafter called the Forest Court) composed of three persons to be appointed by the 1[Provincial Government], and, when the Forest Court has been so established, all such appeals shall be presented to it. 18. Appeal under section 17.___(1) Every appeal under section 17 shall be made by petition in writing, and may be delivered to the Forest Settlement-officer, who shall forward it without delay to the authority competent to hear the same. (2) If the appeal be to an officer appointed under section 17, it shall be heard in the manner prescribed for the time being for the hearing of appeals in matters relating to land-revenue. (3) If the appeal be to the Forest Court, the Court shall fix a day and a convenient place in the neighborhood of the proposed forest for hearing the appeal, and shall give notice thereof to the parties, and shall near such appeal accordingly. (4) The order passed on the appeal by such officer or Court, or by the majority of the members of such Court, as the case may be, shall, subject only to revision by the 1[Provincial Government], be final. 19. Pleaders.—The 1[Provincial Government], or any person who has made a claim under this Act, may appoint any person to appear, plead and act on its or his behalf before the Forest Settlement-officer, or the appellate officer or Court, in the course of any inquiry or appeal under this Act. 1Subs. by A.O., 1937, for “L.G.”. 2Subs. ibid., for “local official Gazette”. 20. Notification declaring forest reserved.___(1) When the following events have occurred, namely:– (a) the period fixed under section 6 for preferring claims has elapsed and all claims, if any made under that section or section 9 have been disposed of by the Forest Settlement-officer ; (b) if any such claims have been made, the period limited by section 17 for appealing from the orders passed on such claims has elapsed, and all appeals (if any) presented within such period have been disposed of by the appellate officer or Court; and (c) all lands (if any) to be included in the proposed forest, which the Forest Settlement-officer has, under section 11, elected to acquire under the Land Acquisition Act, 1894 (I of 1894), have become vested in the Government under section 16 of that Act, 1[Provincial Government] shall publish a notification2 in the 3[official Gazette], specifying definitely, according to boundary-marks erected or otherwise, the limits of the forest which is to be reserved, and declaring the same to be reserved from a date fixed by the notification. (2) From the date so fixed such forest shall be deemed to be a reserved forest. 21. Publication of translation of such notification in neighborhood of forest.—The Forest-officer shall, before the date fixed by such notification, cause a translation thereof into the local vernacular to be published in every town and village in the neighborhood of the forest. 22. Power to revise arrangement made under section 15 or section 18.—The 1[Provincial Government] may, within five years from the publication of any notification under section 20, revise any arrangement made under section 15 or section 18, and may for this purpose rescind or modify any order made under section 15 or section 18, and direct that any one of the proceedings specified in section 15 be taken in lieu of any other of such proceedings, or that the rights admitted under section 12 be commuted under section 16. 23. No right acquired over reserved forest, except as here provided.—No right of any description shall be acquired in or over a reserved forest except by succession or under a grant or contract in writing made by or 4[on behalf of the Government] or some person in whom such right was vested when the notification under section 20 was issued. 24. Rights not to be alienated without sanction.___(1) Notwithstanding anything contained in section 23, no right continued under clause (c) of sub-section (2) of section 15 shall be alienated by way of grant, sale, lease, mortgage or otherwise, without the sanction of the 1[Provincial Government]: 1Subs. by A.O., 1937, for “L.G.”. 2For such Notifn., see Gazette of Sind, 1954, Pt. I, p. 897. 3Subs. by A.O., 1937, for “local official Gazette”. 4The original words “on behalf of the Govt.” were first subs. by A.O., 1937 and then amended by A.O., 1961, Art. 2 (with effect from the 23rd March, 1956), to read as above Provided that, when any such right is appendant to any land or house, it may be sold or otherwise alienated with such land or house. (2) No timber or other forest-produce obtained in exercise of any such right shall be sold or bartered except to such extent as may have been admitted in the order recorded under section 14. 25. Power to stop ways and water-courses in reserved forests.—The Forest-officer may, with the previous sanction of the 1[Provincial Government] or of any officer duly authorised by it in this behalf, stop any public or private way or water-course in a reserved forest, provided that a substitute for the way or water-course so stopped, which the 1[Provincial Government] deems to be reasonably convenient, already exists, or has been provided or constructed by the Forest-officer in lieu thereof. 26. Acts prohibited in such forests.___(1) Any person who___ (a) makes any fresh clearing prohibited by section 5, or (b) sets fire to a reserved forest, or, in contravention of any rules made by the 2[Provincial Government] in this behalf, kindles any fire, or leaves any fire burning, in such manner as to endanger such a forest; or who, in a reserved forest___ (c) kindles, keeps or carries any fire except at such seasons as the Forest-officer may notify in this behalf, (d) trespasses or pastures cattle, or permits cattle to trespass; (e) causes any damage by negligence in felling any tree or cutting or dragging any timber; (f) fells, girdles, lops, or burns any tree or strips off the bark or leaves from, or otherwise damages, the same; (g) quarries stone, burns lime or charcoal, or collects, subjects to any manufacturing process, or removes, any forest-produce; (h) clears or breaks up any land for cultivation or any other purpose; [or]2 (i) in contravention of any rules made in this behalf by the 1[Provincial Government] hunts, shoots, fishes, poisons water or sets trapes or snares; 3[* * * * * * *] 4[* * * * * * *] 1Subs. by A.O., 1937, for “L.G.”. 2The word “or” omitted ibid., 3Clause (j) omitted ibid. 4Subs. by A.O., 1937, for “L.G.”. shall be punishable with imprisonment for a term which may extend to six months, or with fine which may extend to five hundred rupees, or with both, in addition to such compensation for damage done to the forest as the convicting Court may direct to be paid. (2) Nothing in this section shall be deemed to prohibit____ (a) any act done by permission in writing of the Forest-officer, or under any rule made by the 1[Provincial Government] ; or (b) the exercise of any right continued under clause (c) of sub-section (2) of section 15, or created by grant or contract in writing made by or 2[on behalf of the Government] under section 23. (3) Whenever fire is caused wilfully or by gross negligence in a reserved forest, the 1[Provincial Government] may (notwithstanding that any penalty has been inflicted under this section) direct that in such forest or any portion there of the exercise of all rights of pasture or to forest produce shall be suspended for such period as it thinks fit. 27. Power to declare forest no longer reserved.___(1) The 1[Provincial Government] may, 3[* * *] by notification4 in the 5[official Gazette], direct that, from a date fixed by such notification, any forest or any portion thereof reserved under the Act shall cease to be a reserved forest. (2) From the date so fixed, such forest or portion shall cease to be reserved, but the rights (if any) which have been extinguished therein shall not revive in consequence of such cessation. CHAPTER III OF VILLAGE-FORESTS 28. Formation of village-forests.___(1) The 1[Provincial Government] may assign to any village-community the rights of Government to or over any land which has been constituted a reserved forest, and may cancel such assignment. All forests so assigned shall be called village- forests. (2) The 1[Provincial Government] may make rules for regulating the management of village- forests, prescribing the conditions under which the community to which any such assignment is made may be provided with timber or other forest-produce or pasture, and their duties for the protection and improvement of such forest. (3) All the provisions of this Act relating to reserved forests shall (so far as they are not inconsistent with the rules so made) apply to village-forests. 1Subs. by A.O., 1937, for “L.G.”. 2The original words “on behalf of Govt.” were first subs. by A.O., 1937 and then amended by A.O., 1961, Art. 2 (with effect from the 23rd March, 1956), to read as above. 3The words “subject to the control of the G.G. in C.” omitted, ibid., 4For such Notifn., see Gazette of West Pakistan, 1957, Pt. I, p. 426. 5Subs. by A.O., 1937, for “local official Gazette”. CHAPTER IV OF PROTECTED FORESTS 29. Protected forests.___(1) The 1[Provincial Government] may, by notification in the 2[official Gazette], declare the provisions of this Chapter applicable to any forest-land or waste-land which, is not included in a reserved forest, but which is the property of Government, or over which the Government has proprietary rights, or to the whole or any part of the forest produce of which the Government is entitled. (2) The forest-land and waste-lands comprised in any such notification shall be called a “protected forest”. (3) No such notification shall be made unless the nature and extent of the rights of Government and of private persons in or over the forest-land or waste-land comprised therein have been inquired into an recorded at a survey or settlement, or in such other manner as the 1[Provincial Government] thinks sufficient. Every such record shall be presumed to be correct until the contrary is proved: Provided that, if, in the case of any forest-land or waste land, the 1[Provincial Government] thinks that such inquiry and record are necessary, but that they will occupy such length of time as in the meantime endanger the rights of Government, the 1[Provincial Government] may, pending such inquiry and record, declare such land to be a protected forest, but so as not to abridge or affect any existing rights of individuals or communities. 30. Power to issue notification reserving trees, etc.—The 1[Provincial Government] may, by notification in the 2[official Gazette],___ (a) declare any trees or class of trees in a protected forest to be reserved from a date fixed by, the notification; (b) declare that any portion of such forest specified in the notification shall be closed for such term, not exceeding thirty years, as the 1[Provincial Government] thinks fit, and that the rights of private persons, if any, over such portion shall be suspended during such terms, provided that the remainder of such forest be sufficient, and in a locality reasonably convenient, for the due exercise of the rights suspended in the portion so closed; or (c) prohibit, from a date fixed as aforesaid, the quarrying of stone, or the burning of lime or charcoal, or the collection or subjection to any manufacturing process, or removal of, any forest-produce in any such forest, and the breaking up or clearing for cultivation, for building, for herding cattle or for any other purpose, of any land in any such forest. 31. Publication of translation of such notification in neighborhood.—The Collector shall cause a translation into the local vernacular of every notification issued under section 30 to be affixed in a conspicuous place in every town and village in the neighborhood of the forest comprised in the notification. 1Subs. by A.O., 1937, for “L.G.”. 2Subs. ibid., for “local official Gazette”. 32. Power to make rules for protected forests.—The 1[Provincial Government] may make rules to regulate the following matters, namely: (a) the cutting, sawing, conversion and removal of trees and timber, and the collection, manufacture and removal of forest-produce, from protected forests; (b) the granting of licences to the inhabitants of towns and villages in the vicinity of protected forests to take trees, timber or other forest-produce for their own use, and the production and return of such licences by such persons; (c) the granting of licences to persons felling or removing trees or timber or other forest-produce from such forests for the purposes of trade, and the production and return of such licences by such persons; (d) the payments, if any, to be made by the persons mentioned in clauses (b) and (c) for permission to cut such trees, or to collect and remove such timber or other forest-produce; (e) the other payments, if any, to be made by them in respect of such trees, timber and produce, and the places where such payment shall be made; (f) the examination of forest-produce passing out of such forests; (g) the clearing and breaking up of land for cultivation or other purposes in such forests; (h) the protection from fire of timber lying in such forests and of trees reserved under section 30; (i) the cutting of grass and pasturing of cattle in such forests; (j) hunting, shooting, fishing, poisoning water and setting traps or snares in such forests, and the killing or catching of elephants in such forests 2[* * *] ; (k) the protection and management of any portion of a forest closed under section 30; and (l) the exercise of rights referred to in section 29. 33. Penalties for acts in contravention of notification under section 30 or of rules under section 32.___(1) Any person who commits any of the following offences, namely:– (a) fells, girdles, lops, taps or burns any tree reserved under section 30, or strips off the bark or leaves from, or otherwise damages, any such tree; (b) contrary to any prohibition under section 30, quarries any stone, or burns any lime or charcoal or collects, subjects to any manufacturing process, or removes any forest-produce; 1Subs. by A.O., 1937, for “L.G.”. 2The words “in areas in which the Elephants Preservation Act, 1879, is not in force” omitted by the Federal Laws (Revision and Declaration) Ordinance, 1981 (XXVII of 1981), s. 5 and Sch., IV, only to the extent of Islamabad Capital Territory. (c) contrary to any prohibition under section 30, breaks up or clears for cultivation or any other purpose any land in any protected forest; (d) sets fire to such forest, or kindles a fire without taking all reasonable precautions to prevent its spreading to any tree reserved under section 30, whether standing fallen or felled, or to say closed portion of such forest; (e) leaves burning any fire kindled by him in the vicinity of any such tree or closed portion; (f) fells any tree or drags any timber so as to damage any tree reserved as aforesaid; (g) permits cattle to damage any such tree; (h) infringes any rule made under section 32; shall be punishable with imprisonment for a term which may extend to six months, or with fine which may extend to five hundred rupees, or with both. (2) Whenever fire is caused wilfully or by gross negligence in a protected forest, the 1[Provincial Government] may, notwithstanding that any penalty has been inflicted under this section, direct that in such forest or any portion thereof the exercise of any right of pasture or to forest-produce shall be suspended for such period as it thinks fit. 34. Nothing in this Chapter to prohibit acts done in certain cases.—Nothing in this Chapter shall be deemed to prohibit any act done with the permission in writing of the Forest-officer, or in accordance with rules made under section 32, or, except as regards any portion of a forest closed under section 30, or as regards any rights the exercise of which has been suspended under section 33, in the exercise of any right recorded under section 29. CHAPTER V OF THE CONTROL OVER FORESTS AND LANDS NOT BEING THE PROPERTY OF GOVERNMENT 35. Protection of forests for special purposes.___(1) The 1[Provincial Government] may, by notification the 2[official Gazette], regulate or prohibit in any forest or waste-land___ (a) the breaking up or clearing of land for cultivation; (b) the pasturing of cattle; or (c) the firing or clearing of the vegetation; when such regulation or prohibition appears necessary for any of the following purposes:___ (i) for protection against storms, winds, rolling stones, floods and avalanches; 1Subs. by A.O., 1937, for “L.G.”. 2Subs. ibid., for “local official Gazette”. (ii) for the preservation of the soil on the ridges and slopes and in the valleys of hilly tracts, the prevention of land-slips or of the formation of ravines and torrents, or the protection of land against erosion, or the deposit thereon of sand, stones or gravel; (iii) for the maintenance of a water-supply in springs, rivers and tanks; (iv) for the protection of roads, bridges, railways and other lines of communication; (v) for the preservation of the public health. (2) The 1[Provincial Government] may, for any such purpose, construct at its own expense, in or upon an forest or waste-land, such work as it thinks fit. (3) No notification shall be made under sub-section (1) nor shall any work be begun under sub-section (2), until after the issue of a notice to the owner of such forest or land calling on him to show cause, within a reasonable period to be specified in such notice, why such notification should not be made or work constructed, as the case may be, and until his objections, if any, and any evidence he may produce in support of the same, have been heard by an officer duly appointed in that behalf and have been considered by the 1[Provincial Government]. 36. Power to assume management of forests.___(1) In case of neglect of, or wilful disobedience to, any regulation or prohibition under section 35, or if the purposes of any work to be constructed under that section so require, the 1[Provincial Government] may, after notice in writing to the owner of such forest or land and after considering his objections, if any, place the same under the control of a Forest-officer, and may declare that all or any of the provisions of this Act relating to reserved forests shall apply to such forest or land. (2) The net profits, if any, arising from the management of such forest or land shall be paid to the said owner. 37. Expropriation of forests in certain cases.___(1) In any case under this Chapter in which the 1[Provincial Government] considers that, in lieu of placing the forest or land under the control of a Forest-officer, the same should be acquired for public purposes, the 1[Provincial Government] may proceed to acquire it in the manner provided by the Land Acquisition Act, 1894 (I of 1894). (2) The owner of any forest or land comprised in any notification under section 35 may, at any time not less than three or more than twelve years from the date thereof, require that such forest or land shall be acquired for public purposes, and the 1[Provincial Government] shall require such forest or land accordingly. 38. Protection of forests at request of owners.___(1) The owner of any land or, if there more than one owner thereof, the owners of shares therein amounting in the aggregate at least two-thirds thereof may, with a view to the formation or conservation of forests thereon, represent in writing to the Collector their desire:___ 1Subs. by A.O., 1937, for “L.G.”. (a) that such land be managed on their behalf by the Forest-officer as a reserved or a protected forest on such terms as may be mutually agreed upon; or (b) that all or any of the provisions of this Act be applied to such land. (2) In either case, the 1[Provincial Government] may, by notification in the 2[official Gazette], apply to such land such provisions of this Act as it thinks suitable to the circumstances thereof and as may be desired by the applicants. CHAPTER VI OF THE DUTY ON TIMBER AND OTHER FOREST-PRODUCE 39. Power to impose duty on timber and other forest-produce.—(1) The 1[Provincial Government] may levy a duty in such manner, at such places and at such rates as it may declare by notification in the 2[official Gazette] on all timber or other forest-produce___ (a) which is produced in 3[Pakistan], and in respect of which 4[the Government] has any right; (b) which is brought from any place outside 3[Pakistan] 5[or is transported from or to any place within Pakistan]: 6[* * * * * * *] (2) In every case in which such duty is directed to be levied ad valorem, the 1[Provincial Government] may fix by like notification the value on which such duty shall be assessed. 7[* * * * * * *] 40. Limit not to apply to purchase money or royalty.—Nothing in this Chapter shall be deemed to limit the amount, if any, chargeable as purchase-money or royalty on any timber or other forest-produce, although the same is levied on such timber or produce while in transit, in the same manner as duty is levied. CHAPTER VII OF THE CONTROL OF TIMBER AND OTHER FOREST-PRODUCE IN TRANSIT 41. Power to make rules to regulate transit of forest produce.___(1) The control of all rivers and their banks as regards the floating of timber, as well as the control of all timber and other forest-produce in transit by land or water, is vested in the 1[Provincial Government], and it may make rules to regulate the transit of all timber and other forest-produce. 1Subs. by A.O., 1937, for “L.G.”. 2Subs. by A.O., 1937, for “local official Gazette”. 3Subs. by the Central Laws (Statute Reform) Ordinance, 1960 (XXI of 1960), s. 3 and 2nd Sch. (with effect from the 14th October, 1955), for “the Provinces and the Capital of the Federation” which had been subs. by A.O., 1949, for “British India”. 4The original words “the Govt.” were first subs. by A.O., 1937, and then amended by A.O., 1961, Art. 2 (with effect from the 23rd March, 1956), to read as above. 5Added by Ordinance X of 1962, s. 2. 6Proviso omitted by A.O., 1937. 7Sub-sections (3) and (4), as amended by A.O., 1937, omitted by Ordinance X of 1962, s. 2. (2) In particular and without prejudice to the generality of the foregoing power such rules may___ (a) prescribe the routes by which alone timber or other forest-produce may be imported, exported or moved into, from or within 1[the Province]; (b) prohibit the import or export or moving of such timber or other produce without a pass from an officer duly authorised to issue the same, or otherwise than in accordance with the conditions of such pass; (c) provide for the issue, production and return of such passes and for the payment of fees therefor; (d) provide for the stoppage, reporting, examination and marking of timber or other forest-produce in transit, in respect of which there is reason to believe that any money is payable to 2[the Government] on account of the price thereof, or on account of any duty, fee, royalty or charge due thereon, or, to which it is desirable for the purposes of this Act to affix a mark; (e) provide for the establishment and regulation of depots to which such timber or other produce shall be taken by those in charge of it for examination, or for the payment of such money, or in order that such marks may be affixed to it; and the conditions under which such timber or other produce shall be brought to, stored at and removed from such depots; (f) prohibit the closing up or obstructing of the channel or banks of any river used for the transit of timber or other forest-produce, and the throwing of grass, brushwood, branches or leaves into any such river or any act which may cause such river to be closed or obstructed; (g) provide for the prevention or removal of any obstruction of the channel or banks of any such river, and for recovering the cost of such prevention or removal from the person whose acts or negligence necessitated the same; (h) prohibit absolutely or subject to conditions, within specified local limits, the establishment of saw-pits, the converting, cutting, burning, concealing or making of timber, the altering or effacing of any marks on the same, or the possession or carrying of marking hammers or other implements used for marking timber; (i) regulate the use of property marks for timber, and the registration of such marks; prescribe the time for which such registration shall hold good; limit the number of such marks that may be registered by any one person, and provide for the levy of fees for such registration. (3) The 3[Provincial Government] may direct that any rule made under this section shall not apply to any specified class of timber or other forest-produce or to any specified local area. 1Subs. by A.O., 1937, for “British India”. 2The original word “Govt.” was first subs. by A.O., 1937 and then amended by A.O., 1961, Art. 2 (with effect from the 23rd March, 1956), to read as above. 3Subs. by A.O., 1937, for “L.G.”. 2[41A. Powers of Federal Government as to movements of timber across Customs frontiers.—Notwithstanding anything in section 41 3[the Federal Government] may make rules to prescribe the route by which alone timber or other forest-produce may be imported, exported or moved into or from 4[Pakistan] across any customs frontier as defined by the 3[Federal Government] and any rules made under section 41 shall have effect subject to the rules made under this section]. 42. Penalty for breach of rules made under section 41.___(1) The 1[Provincial Government] may by such rules prescribe as penalties for the contravention thereof imprisonment for a term which may extend to six months, or fine which may extend to five hundred rupees, or both. (2) Such rules may provide that penalties which are double of those mentioned in sub-section (1) may be inflicted in cases where the offence is committed after sunset and before sunrise, or after preparation for resistance to lawful authority, or where the offender has been previously convicted of a like offence. 43. Government and Forest-officers not liable for damage to forest-produce at depot.— The 1[Government] shall not be responsible for any loss or damage which may occur in respect of any timber or other forest-produce while at a depot established under a rule made under section 41, or while detained elsewhere, for the purposes of this Act; and no Forest-officer shall be responsible for any such loss or damage, unless he causes such loss or damage negligently, maliciously or fraudulently. 44. All persons bound to aid in case of accidents at depot.—In case of any accident or emergency involving danger to any property at any such depot, every person employed at such depot, whether by the 5[Government] or by any private person, shall render assistance to any Forest- officer or Police-officer demanding his aid in averting such danger or securing such property from damage or loss. CHAPTER VIII OF THE COLLECTION OF DRIFT AND STRANDED TIMBER 45. Certain kinds of timber to be deemed property of Government until title thereto proved, and may be collected accordingly.___(1) All timber found adrift, beached, stranded or sunk; all wood or timber bearing marks which have not been registered in accordance with the rules made under section 41, or on which the marks have been obliterated, altered or defaced by fire or otherwise; and in such areas as the 1[Provincial Government] directs, all unmarked wood and timber; shall be deemed to be the property of Government, unless and until any person establishes his right and title thereto, as provided in this Chapter. (2) Such timber may be collected by any Forest-officer or other person entitled to collect the same by virtue of any rule made under section 51, and may be brought to any depot which the Forest-officer may notify as a depot for the reception of drift timber. 1Subs. by A.O., 1937, for “L.G.”. 2Section 41A ins., ibid. 3Subs. by F.A.O., 1975, Art. 2 and Table, for “Central Government”. 4Subs. by the Central Laws (Statute Reform) Ordinance, 1960 (XXI of 1960), s. 3 and 2nd Sch. (with effect from the 14th October, 1955), for “the Provinces and the Capital of the Federation” which had been subs. by A.O., 1949, for “British India”. 5Subs. by A.O., 1961, Art. 2 (with effect from the 23rd March, 1956), for “Crown” which had been subs. by A.O., 1937, for “Govt.” (3) The 1[Provincial Government] may, by notification in the 2[official Gazette] exempt any class of timber from the provisions of this section. 46. Notice to claimants of drift timber.—Public notice shall from time to time be given by the Forest-officer of timber collected under section 45. Such notice shall contain a description of the timber, and shall require any person claiming the same to present to such officer, within a period not less than two months from the date of such notice, a written statement of such claim. 47. Procedure on claim preferred to such timber.___(1) When any such statement is presented as aforesaid, the Forest-officer may, after making such inquiry as he thinks fit, either reject the claim after recording his reasons for so doing, or deliver the timber to the claimant. (2) If such timber is claimed by more than one person, the Forest-officer may either deliver the same to any of such persons whom he deems entitled thereto, or may refer the claimants to the Civil Courts, or retain the timber pending the receipt of an order from any such Court for its disposal. (3) Any person whose claim has been rejected under this section may, within three months from the date of such rejection, institute a suit to recover possession of the timber claimed by him; but no person shall recover any compensation or costs against the 3[Government], or against any Forest-officer, on account of such rejection, or the detention or removal of any timber, or the delivery thereof to any other person under this section. (4) No such timber shall be subject to process of any Civil, Criminal or Revenue Court until it has been delivered, or a suit has been brought, as provided in this section. 48. Disposal of unclaimed timber.—If no such statement is presented as aforesaid, or if the claimant omits to prefer his claim in the manner and within the period fixed by the notice issued under section 46, or on such claim having been so preferred by him and having been rejected, omits to institute a suit to recover possession of such timber within the further period fixed by section 47, the ownership of such timber shall vest in the Government, or, when such timber has been delivered to another person under section 47, in such other person free from all encumbrances not created by him. 49. Government and its officers not liable for damage to such timber.—The 3[Government] shall not be responsible for any loss or damage which may occur in respect any timber collected under section 45, and no Forest-officer shall be responsible for any such loss or damage, unless he causes such loss or damage negligently, maliciously or fraudulently. 50. Payments to be made by claimant before timber is delivered to him.—No person shall be entitled to recover possession of any timber collected or delivered as aforesaid until he has paid to the Forest-officer or other person entitled to receive it such sum on account thereof as may be due under any rule made under section 51. 51. Power to make rules and prescribe penalties.___(1) The 1[Provincial Government] may make rules to regulate the following matters, namely:___ 1Subs. by A.O., 1937, for “L.G.”. 2Subs. ibid., for “local official Gazette”. 3Subs. by A.O., 1961, Art. 2 (with effect from the 23rd March, 1956), for “Crown” which had been subs. by A.O., 1937, for “Govt.”. (a) the salving, collection and disposal of all timber mentioned in section 45; (b) the use and registration of boats used in salving and collecting timber; (c) the amounts to be paid for salving, collecting, moving, storing or disposing such timber; and (d) the use and registration of hammers and other instruments to be used marking such timber. (2) The 1[Provincial Government] may prescribe, as penalties for the contravention of any rules made under this section, imprisonment for a term which may extend to six months, or fine which may extend to five hundred rupees, or both. CHAPTER IX PENALTIES AND PROCEDURE 252. Seizure of property liable to confiscation.___(1) When there is reason to believe that a forest-offence has been committed in respect of any forest-produce, such produce, together with all tools, boats, carts or cattle used in committing any such offence, may be seized by any Forest-officer or Police-officer. (2) Every officer seizing any property under this section shall place on such property a mark indicating that the same has been so seized, and shall, as soon as may be, make a report of such seizure to the Magistrate having jurisdiction to try the offence on account to which the seizure has been made: Provided that, when the forest-produce with respect to which such offence is believed to have been committed is the property of Government, and the offender is unknown, it shall be sufficient if the officer makes, as soon as may be, a report of the circumstances to his official superior. 253. Power to release property seized under section 52.—Any Forest-officer of a rank not inferior to that of a Ranger who, or whose subordinate, has seized any tools, boats, carts or cattle under section 52, may release the same on the execution by the owner thereof a bond for the production of the property so, released, if and when so required, before the Magistrate having jurisdiction to try the offence on account of which the seizure has been made. 54. Procedure thereupon.—Upon the receipt of any such report, the Magistrate shall, with all convenient despatch, take such measures as may be necessary for the arrest and trial of the offender and the disposal of the property according to law. 255. Forest-produce, tools, etc., when liable to confiscation.___(1) All timber or forest- produce which is not the property of Government and in respect of which a forest-offence has been committed, and all tools, boats, carts and cattle used in committing any forest-offence, shall be liable to confiscation. 1Subs. by A.O., 1937, for “L.G.”. 2This section has been amended in the Punjab by the Indian Forest (West Punjab Amdt.) Act, 1948 (IV of 1948), s. 2. (2) Such confiscation may be in addition to any other punishment prescribed for such offence. 56. Disposal, on conclusion of trial for forest-offence, of produce in respect of which it was committed.—When the trial of any forest-offence is concluded, any forest-produce in respect of which such offence has been committed shall, if it is the property of Government or has been confiscated, be taken charge of by a Forest-officer, and, in any other case, may be disposed of in such manner as the Court may direct. 57. Procedure when offender not known, or cannot be found.—When the offender is not known or cannot be found, the Magistrate may, if he finds that an offence has been committed, order the property in respect of which the offence has been committed to be confiscated and taken charge of by the Forest-officer, or to be made over to the person whom the Magistrate deems to be entitled to the same: Provided that no such order shall be made until the expiration of one month from the date of seizing such property, or without hearing the person, if any, claiming any rig thereto, and the evidence, if any, which he may produce in support of his claim. 58. Procedure as to perishable property seized under section 52.—The Magistrate may, notwithstanding anything hereinbefore contained, direct the sale of any property seized under section 52 and subject to speedy and natural decay, and may deal with the proceeds as he would have dealt with such property if it had not been sold. 59. Appeal from orders under section 55, section 56 or section 57.—The officer made the seizure under section 52, or any of his official superiors, or any person, claiming to be interested in the property so seized, may, within one month from the date of any order passed under section 55, section 56 or section 57, appeal therefrom to the Court to which orders made by such Magistrate are ordinarily appealable, and the order passed on such appeal shall be final. 60. Property when to vest in Government.—When an order for the confiscation of any property has been passed under section 55 or section 57, as the case may be, and the period limited by section 59 for an appeal from such order has elapsed, and no such an appeal has been preferred, or when, on such an appeal being preferred, the Appellate Court confirms such order in respect of the whole or a portion of such property, such property or such portion thereof, as the case may be, shall vest in the Government free from all incumbrances. 61. Saving of power to release property seized.—Nothing hereinbefore contained shall be deemed to prevent any officer empowered in this behalf by the 1[Provincial Government] from directing at any time the immediate release of any property seized under section 52. 62. Punishment for wrongful seizure.—Any Forest-officer or Police-officer who vexatiously and unnecessarily seizes any property on pretence of seizing property liable to confiscation under this Act shall be punishable with imprisonment for a term which may extend to six months, or with fine which may extend to five hundred rupees, or with both. 1Subs. by A.O., 1937, for “L.G.”. 63. Penalty for counterfeiting or defacing marks on trees and timber and for altering boundary marks.—Whoever, with intent to cause damage or injury to the public or to any person or to cause wrongful gain as defined in the Pakistan Penal Code (XLV of 1860)___ (a) knowingly counterfeits upon any timber or standing tree a mark used by Forest-officers to indicate that such timber or tree is the property of the Government or of some person, or that it may lawfully be cut or removed by some person; or (b) alters, defaces or obliterates any such mark placed on a tree or on timber by under the authority of a Forest-officer; or (c) alters, moves, destroys or defaces any boundary-mark of any forest or waste- land the provisions of this Act are applied, shall be punishable with imprisonment for a term which may extend to two years, or fine, or with both. 64. Power to arrest without warrant.___(1) Any Forest-officer or Police-officer may without orders from a Magistrate and without a warrant, arrest any person against whom a reasonable suspicion exists of his having been concerned in any forest-offence punishable with imprisonment for one month or upwards. (2) Every officer making an arrest under this section shall, without unnecessary delay and subject to the provisions of this Act as to release on bond, take or send the person arrested before the Magistrate having jurisdiction in the case, or to the officer-in-charge of the nearest police-station. (3) Nothing in this section shall be deemed to authorise such arrest for any act which is an offence under Chapter IV unless such act has been prohibited under clause (c) of section 30. 65. Power to release on a bond a person arrested.—Any Forest-officer of a rank not inferior to that of a Ranger, who, or whose subordinate, has arrested any person under the provisions of section 64, may release such person on his executing a bond to appear, if and when so required, before the Magistrate having jurisdiction in the case, or before the officer-in-charge of the nearest police-station. 66. Power to prevent commission of offence.—Every Forest-officer and Police- officer shall prevent, and may interfere for the purpose of preventing, the commission of any forest-offence. 67. Power to try offences summarily.—The District Magistrate or any Magistrate of the first class specially empowered in this behalf by the 1[Provincial Government] may try summarily, under the Code of Criminal Procedure, 1898 (V of 1898), any forest-offence punishable with imprisonment for a term not exceeding six months, or fine not exceeding five hundred rupees, or both. 68. Power to compound offences.___(1) The 1[Provincial Government] may, by notification in the 2[official Gazette], empower a Forest officer____ (a) to accept from any person against whom a reasonable suspicion exists that he has committed any forest-offence, other than an offence specified in section 62 or section 63 a sum of money by way of compensation for the offence which such person is suspected to have committed, and 1Subs. by A.O., 1937, for “L.G.”. 2Subs. ibid., for “local official Gazette”. (b) when any property has been seized as liable to confiscation, to release the same on payment of the value thereof as estimated by such officer. (2) On the payment of such sum of money, or such value, or both, as the case may be, to such officer, the suspected person, if in custody, shall be discharged, the property, if any seized shall be released, and no further proceedings shall be taken against such person or property. (3) A Forest-officer shall not be empowered under this section unless he is a Forest-officer of a rank not inferior to that of a Ranger and is in receipt of a monthly salary amounting to at least one hundred rupees, and the sum of money accepted as compensation under clause (a) of sub-section (1) shall in no case exceed the sum of fifty rupees. 69. Presumption that forest-produce belongs to Government.—When in any proceedings taken under this Act, or in consequence of anything done under this Act, a question arises as to whether any forest-produce is the property of the Government, such produce shall be presumed to be the property of the Government until the contrary is proved. CHAPTER X CATTLE-TRESPASS 70. Cattle-trespass Act, 1871, to apply.—Cattle trespassing in a reserved forest any portion of a protected forest which has been lawfully closed to grazing shall be deem to be cattle doing damages to a public plantation within the meaning of section 11 of Cattle-trespass Act, 1871 (I of 1871), and may be seized and impounded as such by Forest-officer or Police-officer. 71. Power to alter fines fixed under that Act.—The 1[Provincial Government] may, notification in the 2[official Gazette], direct that, in lieu of the fines fixed under section 12 of the Cattle-trespass Act, 1871 (I of 1871),, there shall be levied for each head of cattle impounded under section 70 of this Act such fines as it thinks fit, but not exceeding following, that is to say:___ For each elephant .. .. .. ten rupees. For each buffalo or camel .. .. two rupees. For each horse, mare, gelding, pony, colt, filly, mule, bull, bullock, cow, or heifer .. .. one rupee. For each calf, ass, pig, ram, ewe, sheep, lamb, goat or kid .. .. .. eight annas. CHAPTER XI OF FOREST-OFFICERS 72. Provincial Government may invest Forest-officers with certain powers.___(1) The 1[Provincial Government] may invest any Forest-officer with all or of the following powers, that is to say:___ 1Subs. by A.O., 1937, for “L.G.”. 2Subs. ibid., for “local official Gazette”. (a) power to enter upon any land and to survey, demarcate and make a map of the same; (b) the powers of a Civil Court to compel the attendance of witnesses and production of documents and material objects; (c) power to issue a search-warrant under the Code of Criminal Procedure, 1898 (V of 1898); and (d) power to hold an inquiry into forest-offences, and, in the course of such inquiry, to receive and record evidence. (2) Any evidence recorded under clause (d) of sub-section (1) shall be admissible in subsequent trial before a Magistrate, provided that it has been taken in the presence of accused person. 73. Forest-officer deemed public servants.—All Forest-officers shall be deemed to be public servants within the meaning of the Pakistan Penal Code (XLV of 1860). 74. Indemnity for acts done in good faith.—No suit shall lie against any public servant for anything done by him in good faith under this Act. 75. Forest-officers not to trade.—Except with the permission in writing of the 1[Provincial Government], no Forest-officer shall, as principal or agent, trade in timber or other forest-produce, or be or become interested in any lease of any forest or in any contract for working any forest, whether in or outside 2[Pakistan]. CHAPTER XII SUBSIDIARY RULES 76. Additional powers to make rules.—The 1[Provincial Government] may make rules___ (a) to prescribe and limit the powers and duties of any Forest-officer under this Act; (b) to regulate the rewards to be paid to officers and informers out of the proceeds of fines and confiscation under this Act; (c) for the preservation, reproduction and disposal of trees and timber belonging to Government, but grown on lands belonging to or in the occupation of private persons; and (d) generally, to carry out the provisions of this Act. 77. Penalties for breach of rules. Any person contravening any rule under this Act, for the contravention of which no special penalty is provided, shall be punishable with imprisonment for a term which may extend to one month, or fine which may extend to five hundred rupees, or both. 1Subs. by A.O., 1937, for “L.G.”. 2Subs. by the Central Laws (Statute Reform) Ordinance, 1960 (XXI of 1960), s. 3 and 2nd Sch. (with effect from the 14th October, 1955), for “the Provinces and the Capital of the Federation” which had been subs. by A.O., 1949, for “British India”. 78. Rules when to have force of law.—All rules made by the 1[Provincial Government] under this Act shall be published in the 2[official Gazette], and shall thereupon, so far as they are consistent with this Act, have effect as if enacted therein. CHAPTER XIII MISCELLANEOUS 79. Persons bound to assist Forest-officers and Police-officers.___(1) Every person who exercises any right in a reserved or protected forest, or who is permitted to take any forest-produce from, or to cut and remove timber or to pasture cattle in, such forest, and every person who is employed by any such person in such forest, and every person in any village contiguous to such forest who is employed by the 3[Government], or who receives emoluments from the 3[Government] for services to be performed to the community, shall be bound to furnish without unnecessary delay to the nearest Forest-officer or Police- officer any information he may possess respecting the commission of, or intention to commit, any forest-offence, and shall forthwith take steps, whether so required by any Forest-officer or Police- officer or not,____ (a) to extinguish any forest fire in such forest of which he has knowledge or information; (b) to prevent by any lawful means in his power any fire in the vicinity of such forest of which he has knowledge or information from spreading to such forest, and shall assist any Forest-officer or Police-officer demanding his aid (c) in preventing the commission in such forest of any forest-offence; and (d) when there is reason to believe that any such offence has been committed in such forest, in discovering and arresting the offender. (2) Any person who, being bound so to do, without lawful excuse (the burden of proving which shall lie upon such person) fails___ (a) to furnish without unnecessary delay to the nearest Forest-officer or Police- (officer any information required by sub-section (1); (b) to take steps as required by sub-section (1) to extinguish any forest fire in a reserved or protected forest; (c) to prevent, as required by sub-section (1), any fire in the vicinity of such forest from spreading to such forest ; or (d) to assist any Forest-officer or Police-officer demanding his aid in preventing the commission in such forest of any forest-offence, or, when there is reason to believe that any such offence has been committed in such forest, in discovering and arresting the offender; 1Subs. by A.O., 1937, for “L.G.”. 2Subs. ibid., for “local official Gazette”. 3Subs. by A.O., 1961, Art. 2 (with effect from the 23rd March, 1956), for “Crown” which had been subs. by A.O., 1937, for “Govt.” shall be punishable with imprisonment for a term which may extend to one month, or with fine which may extend to two hundred rupees, or with both. 80. Management of forests the joint property of Government and other persons.____(1) If the Government and any person be jointly interested in any forest or waste-land, or in the whole or any part of the produce thereof, the 1[Provincial Government] may either___ (a) undertake the management of such forest, waste-land or produce, accounting to such person for his interest in the same; or (b) issue such regulations for the management of the forest, waste-land or produce by the person so jointly interested as it deems necessary for the management thereof and the interests of all parties therein. (2) When the 1[Provincial Government] undertakes under clause (a) of sub-section (1) the management of any forest, waste-land or produce, it may, by notification in the 2[official Gazette], declare that any of the provisions contained in Chapters II and IV shall apply to such forest, waste- land or produce, and thereupon such provisions shall apply accordingly. 81. Failure to perform service for which a share in produce of Government forest is employed.—If any person be entitled to a share in the produce of any forest which is the property of Government or over which the Government has proprietary rights or to any part of the forest-produce of which the Government is entitled, upon the condition of duly performing any service connected with such forest, such share shall be liable to confiscation in the event of the fact being established to the satisfaction of the 1[Provincial Government] that such service is no longer so performed: Provided that no such share be confiscated until the person entitled thereto, and the evidence, if any, which he may produce in proof of the due performance of such service, have been heard by an officer duly appointed in that behalf by the 1[Provincial Government]. 82. Recovery of money due to Government.—All money payable to the Government under this Act, or under any rule made under this Act, or on account of the price of any forest-produce, or of expenses incurred in the execution of this Act in respect of such produce, may, if not paid when due, be recovered under the law for the time being in force as if it were an arrear of land-revenue. 83. Lien on forest-produce for such money.___(1) When any such money is payable for or in respect of any forest-produce, the amount thereof shall be deemed to be a first charge on such produce, and such produce may be taken possession of by a Forest-officer until such amount has been paid. (2) If such amount is not paid when due, the Forest-officer may sell such produce by public auction, and the proceeds of the sale shall be applied first in discharging such amount. (3) The surplus, if any, if not claimed within two months from the date of the sale by the person entitled thereto, shall be forfeited to 3[Government]. 1Subs. by A.O., 1937, for “L.G.”. 3Subs. by A.O., 1961, Art. 2, for “His Majesty” (with effect from the 23rd March, 1956). 84. Land required under this Act to be deemed to be needed for a public purpose under the Land Acquisition Act, 1894.—Whenever it appears to the 2[Provincial Government] that any land is required for any of the purposes of this Act, such land shall be deemed to be needed for a public purpose within the meaning of section 4 of the Land Acquisition Act, 1894 (I of 1894). 85. Recovery of penalties due under bond.—When any person, in accordance with any provision of this Act, or in compliance with any rule made thereunder, binds himself by any bond or instrument to perform any duty or act, or convenants by any bond or instrument that he, or that he and his servants and agents will obtain from any act, the whole sum mentioned in such bond or instrument as the amount to be paid in case of a breach of the conditions thereof may, notwithstanding anything in section 74 of the Contract Act, 1872 (IX of 1872), be recovered from him in case of such breach as if it were an arrear of land-revenue. 3[85A. Saving for rights for Federal Government.—4[Nothing] in this Act shall authorize any Provincial Government to make any order or do any other thing in relation to any 1[Government] property not vested in 5[that Provincial Government] (26 Geo. 5, c. 2.) or otherwise to prejudice any 1[Government] rights, without the consent of the Government or authority concerned.] 86. 6[Omitted] THE SCHEDULE .—7[ Repealed.] Dated: 05.04.24 1Subs. by A.O., 1961, Art. 2, for “His Majesty” (with effect from the 23rd March, 1956). 2Subs. by A.O., 1937, for “L.G.”. 3S. 85A ins. by A.O., 1937. 4Subs. by the Federal Laws (Revision and Declaration) Ordinance, 1981 (XXVII of 1981), s. 5 and Sch., IV, only to the extent of Islamabad Capital Territory. 5Subs. by A.O., 1961, Art. 2, for “Crown” (with effect from the 23rd March, 1956.). 6Omitted by the Federal Laws (Revision and Declaration) Ordinance, 1981 (XXVII of 1981), s. 5 and Sch., IV, only to the extent of Islamabad Capital Territory. 7Rep. by A.O., 1961, Art. 2 and Sch."
}