{
  "file": "administratord516d60c34ec57d45ade11224bd15922.pdf",
  "law_name": "The Pakistan Engineering Council Act, 1975",
  "text": "THE PAKISTAN ENGINEERING COUNCIL ACT, 1975 CONTENTS SECTIONS: 1. Short title, extent and Commencement. 2. Definitions. 3. Constitution and incorporation of Engineering Council. 3A. Executive powers of the Council. 4. Chairman, Senior Vice Chairman and Vice Chairman. 5. Annual general meeting of the Council. 6. Extraordinary general meeting of the Council. 7. General provisions relating to meetings of Council. 8. Functions of the Council. 9. Governing Body. 9A. Management Committee. 10. Accreditation of engineering qualifications granted by institutions in Pakistan. 11. Accreditation of foreign engineering qualifications. 12. Grant of temporary licences. 13. Power to require information as to courses of study and examination. 14. Accreditation of engineering institutions. 15. Withdrawal of Accreditation. Updated till 10.10.2022 SECTIONS: 16. Maintenance of Register, etc. 17. Registration and removal of names from Register. 18 Appeal against removal of name from Register. 19. Revision of Register. 20. Complaint against professional engineers, etc. 21. Tribunal of inquiry. 22. Procedure in inquiries, etc. 23. Powers of the Tribunal. 24. Fund of the Council, accounts and audit. 25. Bye laws of the Council. 25 A. Power to make regulations. 26. Proof of membership, etc. 27. Penalties and procedure. 28. Saving. 29. Power to exempt. 29 A. Supersession of Council. 30. Commission of inquiry. 30 A. Indemnity. 30 B. Validation of actions. 31. Repeal. ____________________________ THE PAKISTAN ENGINEERING COUNCIL ACT, 1975 1(ACT No.V OF 1976) [10th January, 1976] An Act to make provision for the regulation of the engineering profession WHEREAS it is expedient to make provision for regulation of the engineering profession and for that purpose to constitute an Engineering Council; 2 [WHEREAS the Council shall regulate the engineering profession with the vision that the engineering profession shall function as a key driving force for achieving rapid and sustainable growth in all national, economic and social fields; WHEREAS the Council shall as its mission set and maintain realistic and internationally relevant standards of professional competence and ethics for engineers, and licence engineers and engineering institutions to competently and professionally promote and uphold the standards; AND WHEREAS, the Council, covering the entire spectrum of engineering disciplines, shall function as an apex body to encourage and promote the pursuit of excellence in engineering profession and to regulate the quality of engineering education and the practice of engineering and thereby promote rapid growth in economic and social fields in Pakistan.] It is hereby enacted as follows:- 1. Short title, extent and commencement.⎯ (1) This Act may be called the Pakistan Engineering Council Act, 1975. (2) It extends to the whole of Pakistan. (3) It shall come into force at once. 2[2. Definitions. ⎯ In this Act, unless there is anything repugnant in the subject or the context,- (i) “Accreditation Committee” means the Accreditation Committee constituted under sub-section (1) of section 14; (ii) “accredited engineering qualification” means any of the qualification included in the First Schedule or the Second Schedule; (iii) “bye-laws” means bye-laws made under this Act; (iv) “Chairman” means the Chairman of the Council; _ 1For statement of Objects and Reasons, see Gaz. of P., 1975, Ext., Pt. III. p, 1500. 2Added and subs. by the Pakistan Enginering Council (Amdt.) Act, 2011 (II of 2011), ss. 2-3 and shall be deemed to have taken effect of the 15th Janurary, 2008. (v) “Constructor” means any person, partnership, corporate body or any other legal entity which or who is engaged in the business of construction and is licenced and registered as such; (vi) “consulting engineer” means any person, partnership, corporate body or any other legal entity which independently performs study, prepared reports, makes design, supervises construction or undertakes any other similar advisory activities in engineering disciplines and is registered as such by the Council; (vii) “continued professional development”, means the systematic maintenance, improvement and broadening of knowledge, understanding and skill, and the development of personal qualities necessary for the execution of professional and technical duties throughout the individual’s working life; (viii) “Council” means the Pakistan Engineering Council constituted under section 3; (ix) “creativity” means innovation, invention, hypothesis, theories and such other actions in the realm of engineering profession contributory to development; (x) “engineering institution” means an institution within or without Pakistan which grants degree, diploma and certificate in engineering and related education and is accredited as such by the Council; (xi) “engineering products’’ means the products as a result of or the outcome of professional engineering works or engineering profession or both; (xii) “engineering profession” means engineering education and practices of engineering and technology; (xiii) “engineering public organization” means a department of the Federal Government or a Provincial Government, a Public Corporation, autonomous or semi-autonomous body, cantonment board, municipality, improvement trust or other local authority; (xiv) “engineering services” means services relating to study, preparation of reports, design, supervision, estimation, documentation, evaluation and advising in matters of engineering profession and engineering works; (xv) “engineering university” means a degree awarding university or institution as has more than fifty per cent of their undergraduate and postgraduate programmes as well as student population pertaining to engineering and are recognized as such; (xvi) “enrolment committee” means the enrolment committee referred to in sub-section (1) of section 17; (xvii) “Governing Body” means the Governing Body of the Council; (xviii) “learned societies” means institutions and associations for promotion of knowledge and excellence in engineering and technology; (xix) “Management Committee” means the Management Committee of the Council; (xx) “member” means a member of the Council and includes the Chairman, Senior Vice-Chairman, Vice-Chairman, professional engineers and registered engineers ; (xxi) “Operator” means any person, partnership, corporate body or any other legal entity which is engaged in the business of operating construction work and is licenced and registered as such; (xxii) “prescribed” means prescribed by bye-laws; (xxiii) “professional engineer” means a person who holds an accredited engineering qualification and after obtaining a professional experience of five years, whether working privately or in the employment of an engineering public organization, has passed the prescribed engineering practice examination and is registered as such by the Council; (xxiv) “professional engineering bodies’’ means professional engineering institutes, associations and such other bodies registered as such by the Council; (xxv) “professional engineering work” means the giving of professional advice and opinions, the making of measurements and layouts, the preparation of reports, computations, designs, drawings, plans and specifications and the construction, inspection and supervision of engineering works, in respect of – (a) railways, aerodromes, bridges, tunnels and metal led roads; (b) dams, canals, harbours, light houses; (c) works of an electrical, mechanical, hydraulic, communication, aeronautical power engineering, geological or mining character; (d) waterworks, sewers, filtration, purification and incinerator works; (e) residential and non-residential buildings, including foundations framework and electrical and mechanical systems thereof; (f) structures accessory to engineering works and intended to house them; (g) imparting or promotion of engineering education, training and planning, designing, development construction, commissioning, operation, maintenance and management of engineering works in respect of computer engineering, environmental engineering, chemical engineering, structural engineering, industrial marine engineering and naval architecture, petroleum and gas engineering, metallurgical engineering, agricultural engineering, telecommunication engineering, avionics and space engineering, transportation engineering, air-conditioning ventilation, cold storage works, system engineering, electronics, radio and television engineering, civil engineering, electrical engineering, mechanical engineering and biomedical engineering, etc; (h) organizing, managing and conducting the teaching and training in engineering universities, colleges, institutions, Government colleges of technology, polytechnic institutions and technical training institutions; (i) preparing standard bidding or contract documents, construction cost data, conciliation and arbitration procedures; guidelines for bid evaluation, prequalification and price adjustments for construction and consultancy contracts; and (j) any other work which the Council may, by notification in the official Gazette, declare to be an engineering work for the purposes of this Act; (xxvi) “Register” means the Register maintained under section 16; (xxvii) “registered engineer” means a person who holds an accredited engineering qualification, whether working privately or in the employment of an engineering public organization and is registered as such by the Council. Registered engineer shall perform all professional engineering works except independently signing design ; (xxviii) “registered” means registered under this Act; (xxix) “Registrar” means the Registrar of the Council; (xxx) “Senior Vice-Chairman” means the Senior Vice-Chairman of the Council; (xxxi) “Think Tank” means a creative and innovative body to advise on engineering and national development plans; (xxxii) “Think Tank Committees” means bodies of eminent engineers constituted by the Council to assist in formulation of relevant policies relating to national development; (xxxiii) “University” means a University established by law in Pakistan and having an engineering faculty; and (xxxiv) “Subsidiary” means a body formed by the Government body of the Council to operate under its control and to perform its delegated functions.\". 3. Constitution and incorporation of Engineering Council.⎯ (1) There shall be constituted in accordance with the provisions of this Act an Engineering Council to be known as the Pakistan Engineering Council. (2) The Council constituted under sub-section (1) shall be a body corporate having perpetual succession and a common seal, with power to acquire and hold property, both movable and immovable, and to contract, and shall by the name by which it is known sue and be sued. (3) The Council shall be composed of all persons whose names may hereafter be entered in the Register, so long as they continue to have their names borne on the Register. (4) Notwithstanding anything contained in sub-section (3), the Council shall, upon its first constitution, be composed of - (a) a Chairman, being an engineer with not less than twenty years’ standing to be nominated by the Federal Government; (b) ten members, being engineers, of whom two each shall be nominated by the Federal Government and a Provincial Government; and (c) one member, being an engineer, to be nominated by each University. (5) The headquarters of the Council shall be at Islamabad or at such other place as the Federal Government may appoint. 1[3A. Executive powers of the Council.⎯ (1) The general direction and administration of the Council and its affairs shall vest in the Governing Body which may exercise all powers and do all acts and things that may be exercised or done by the Council. (2) Subject to the provisions of this Act, the bye-laws and the general or special delegation of powers by the Governing Body and the Management Committee, the Chairman shall be the Chief Executive of the Council and shall also be empowered to– (a) take any action or step in emergency which in his opinion requires immediate action as he may consider necessary, subject to ratification by the Governing Body in its meeting immediately held thereafter; and (b) exercise the powers of the Council in the matters relating to its administration and the staff of the Council, who may delegate such powers to the Registrar subject to such conditions as he may specify in this regard. (3) The Council shall be funded through an initial grant by the Government and thereafter continuous financial support shall be provided besides that accrue from registrations for running the affairs of the Council]. 1[4. Chairman, Senior Vice Chairman and Vice-Chairmen.⎯ (1) There shall be a Chairman, Senior Vice-Chairman and four Vice-Chairmen of the Council who shall be eminent professional engineers of known integrity, competence, standing and stature with a minimum of twenty-five years of standing. 1Added and subs. by the Pakistan Engineering Council (Amdt.) Act, 2011 (II of 2011), ss. 4-5 and shall be deemed to have taken effect of the 15th January, 2008. (2) The Chairman and Senior Vice-Chairman shall be elected by menbers from amongst themseleves in such manner as may be prescribed. (3) Four Vice-Chairman shall be elected one from each Province by the votes registered in the respective Province. (4) The Chairman, Senior Voice-Chairman and Vice-Chairmen shall hold office for a term of three years but no person shall hold office for more than two consecutive terms. (5) When the Chairman by reason of absence from Pakistan or any other cause is unable to perform his functions, the Senior Vice-Chairman for the time being shall perform the functions of Chairman until the Chairman returns to Pakistan or, as the case may be, resumes his functions.] 5. Annual general meeting of the Council.⎯ (1) An annual general meeting of the Council shall be held at the headquarters of the Council 1[or at a provincial capital by rotation] at such time as may be appointed by the 2[Governing Body.] (2) The following business may be transacted at the annual general meeting, namely:⎯ (a) presentation of annual report; (b) presentation of audited accounts; (c) presentation of annual budget; (d) appointment of auditors; and (e) such other business as may be placed before the meeting by the 2[Governing Body] or as the meeting may decide. 6. Extraordinary general meeting of the Council.⎯ (1) An extraordinary general meeting of the Council shall be called by the Chairman at the headquarters of the Council – (a) within fourteen days of the receipt by him of a requisition signed by not less than one hundred members and stating the business proposed to be transacted at the meeting; or (b) at any time, if the holding of such meeting for the consideration of any urgent matter is in his opinion necessary. (2) At a meeting called in pursuance of clause (a) of sub-section (1), no business other than the business stated in the requisition referred to in that clause shall be transacted. 7. General provisions relating to meetings of Council.⎯ (1) An annual or extraordinary general meeting of the Council shall be held and conducted in accordance with the bye-laws. _________________________________________________________________________________ 1Ins by the Pakistan Engineering Council (Amdt.) Act, 1992 (26 of 1992), s. 4. 2Subs. by the Pakistan Enginering Council (Amdt.) Act, 2011 (II of 2011), s. 6 and shall be deemed to have taken effect of the 15th Janurary, 2008 (2) To constitute a quorum at an annual or extraordinary general meeting of the Council, the presence of not less than one hundred members shall be necessary: Provided that, in respect of the Council as constituted under sub-section (4) of section 3, this sub-section shall have effect as if, for the words “one hundred” therein the word “six” were substituted. (3) All decisions of the Council at an annual or extraordinary general meeting shall be taken by majority of the members present and voting. 8. Functions of the Council.⎯ The following shall be the functions of the Council, namely:- 1[(a) maintenance of a Register of persons qualified to work as registered engineers, professional engineers, consulting engineers, constructors and operators; (b) accreditation of engineering qualifications for the purpose of registration of registered engineers, professional engineers;] (c) removal of names from the Register and restoration to the Register of names which have been removed; (d) laying down of standards of conduct for the members; (e) safeguarding the interests of the members; (f) promotion of reforms in the engineering profession; (g) management of the funds and properties of the Council; (h) promotion of engineering education and review of courses of studies in consultation with the Universities; (i) levy and collection of fees from applicants for registration or temporary licences and members; (j) exercise of such disciplinary powers over the members and servants of the Council as may be prescribed; 1[(k) formation of such committees and subsidiaries as may be prescribed; (l) assistance to the Federal Government as a Think Tank; (m) promotion of engineering profession in totality; (n) encouragement, facilitation and regulation of working of professional engineering bodies for creativity and as custodian of engineering under the umbrella of the Council; _________________________________________________________________________________ 1Subs. by the Pakistan Engineering Council (Amdt.) Act, 2011 (II of 2011), s. 7 and shall be deemed to have taken effect of the 15th January, 2008 (o) ensuring and managing of continued professional development through engineering academies and professional bodies; (p) establishing standards for engineering contracts, cost and services; (q) facilitating engineering sector industries; (r) coordinating between various engineering forums and Federal Government; (s) providing forum for arbitrations, pertaining to disputes in construction and consultancy contracts; and. (t) performance of all other functions connected with, or ancillary or incidental to, the aforesaid functions.] 1[9. Governing Body.⎯ (1) There shall be a Governing Body which shall be the principal executive authority of the Council for supervising and governing the affairs and functions assigned to the Council by or under this Act and bye-laws. (2) The Governing Body, 2[***], shall be composed of the following 2[sixty-six] professional engineers registered with the Council with a minimum twenty years standing, namely:- (a) the Chairman, Senior Vice-Chairman and four Vice-Chairmen one from each Province who shall also be the Chairman, Senior Vice-Chairmen and Vice- Chairmen of the Governing Body; (b) the Registrar; (c) two distinguished professional engineers to be nominated by the Federal Government one member each from Azad Jammu and Kashmir and Gilgit- Baltistan; (d) one distinguished professional engineer to be nominated by each Provincial Government; (e) Five Vice-Chancellors of engineering universities (one nominated by each Provincial and one by the Federal Government); 2[(ea) Engineer-in-Chief, Pakistan Army;] (f) President or Chairman Association of Consulting Engineers (Pakistan); (g) President or Chairman All Pakistan Contractors or their nominee; (h) Elected President of the Institution of Engineering of Pakistan; 1Subs. by the Pakistan Engineering Council (Amdt.) Act, 2011 (II of 2011), s. 8 and shall be deemed to have taken effect of the 15th January, 2008. 2Omitted, Subs. & Ins by Pakistan Engineering Council (Amdt.) Act, 2016 (XLVI of 2016). s.2. (i) Forty members to be elected in the prescribed manner in proportion to the number of engineers registered in each province, by the valid professional and registered engineers whose names are borne on the Register on the thirtieth June of the year in which election to the Governing Body are to be held, physical balloting will be held and no proxy voting to be permitted; (j) Elected President of Pakistan Engineering Congress; and (k) One nominees each from the following Ministry or Organizations of the Federal Government, not below the BPS-20, namely:⎯ (i) Planning Commission; (ii) Ministry of Science and Technology; (iii) Higher Education Commission. (3) The members of the Governing Body, other than the Registrar, shall hold office for a term of three years and no person shall hold office for more than two consecutive terms. (4) The members of the Governing Body shall be nominated or, as the case may be, elected not less than fifteen days before the term of the outgoing members is due to expire. (5) The Governing Body shall hold at least three meetings per year, the quorum for which shall be thirty per cent of the total membership of the Governing Body. (6) The election of members of the Governing Body under clause (i) of sub-section (2) shall be held so as to conclude not less than fifteen days before the terms of the outgoing members is due to expire.] 1[9A. Management Committee.⎯ (1) There shall be a Management Committee, to oversee working of the Secretariat to run the affairs of the Council in accordance with the provisions of this Act and bye-laws. (2) The Management Committee shall be composed of the following, namely:- (a) Chairman; (b) Senior Vice-Chairman; and (c) Four Vice-Chairmen. (3) The tenure of the Management Committee shall be the same as that of the Governing Body. The Management Committee shall hold meetings at least once in a quarter, the quorum for which shall be three.] ___________________________________________________________________________________________ 1Ins. by the Pakistan Engineering Council (Amdt.) Act, 2011 (II of 2011), s. 9 and shall be deemed to have taken effect of the 15th January, 2008. 1[10. Accreditation of engineering qualifications granted by institutions in Pakistan.⎯ (1) The engineering qualifications granted by engineering institutions in Pakistan which are included in the First Schedule shall be the accredited engineering qualifications for the purposes of this Act. (2) Any engineering institution in Pakistan which grants an engineering qualification not included in the First Schedule may apply to the Council to have such qualification accredited and the Council may, by notification in the official Gazette, amend the First Schedule so as to include such qualification therein. 11. Accreditation of foreign engineering qualifications.⎯ (1) The engineering qualifications granted by engineering institutions outside Pakistan which are included in the Second Schedule shall be accredited engineering qualifications for the purposes of this Act. (2) Any engineering qualification granted by an engineering institution outside Pakistan not included in the Second Schedule may be accredited by the Council and council may, by notification in the official Gazette, amend the Second Schedule so as to include such qualification therein.] 1[12. Grant of temporary licences.⎯ (1) The Enrolment Committee may grant to any person, domiciled outside Pakistan who does not hold an accredited engineering qualification but who holds an engineering degree or who is a corporate member of an engineering body, society, institute or association accredited by the Council of respective country, a temporary license for a specific project to work as an associate of a professional engineer; the professional engineer shall sign and seal the plans and specifications for the project. (2) The Enrolment Committee may, if it feels that such action is warranted by special circumstances, grant to a person referred to in sub-section (1) a temporary licence to work as the engineer in charge of a specific project for so long as he is assisted by a professional engineer. (3) The Enrolment Committee may, for works to be carried out at the discretion of an engineering public organization, grant a temporary licence to any person on the recommendation of such organization. (4) Any person to whom a temporary licence has been granted shall, during the period for which the licence is valid, be subject to the provisions of this Act and the bye-laws.] 13. Power to require information as to courses of study and examination.⎯ Every engineering institution in Pakistan which grants a 1[accredited] engineering qualification shall furnish such information as the Council may, from time to time, require as to the courses of study and examination to be undergone in order to obtain such qualification. 1[14. Accreditation of engineering institutions.⎯ (1) The Council shall constitute an Accreditation Committee for organizing and carrying out a comprehensive program of accreditation of engineering universities, colleges and institutions etc. according to the criteria approved by the Governing Body in consultation with Higher Education Commission. __________________________________________________________________________ 1Subs. by the Pakistan Engineering Council (Amdt.) Act, 2011 (II of 2011), ss. 10-13 and shall be deemed to have taken effect of the 15th January, 2008. (2) The curricula of courses of studies in various disciplines of engineering and minimum level and standard of such courses including lectures, laboratory, design, drawing and field work shall be examined and scrutinized by the Accreditation Committee who shall submit its report to the Governing Body for approval.] 15. Withdrawal of 1[accreditation].⎯ 1[(1) When upon report by the Accreditation Committee, it appears to the Council that the courses of study and examination to be gone through in any engineering institution in Pakistan in order to obtain an accredited engineering qualification or the standards of proficiency required from candidates in any examination held for the purpose of granting such qualification are not such to secure to person holding such qualification the knowledge and skill requisite for the efficient practice of engineering, the Council shall forward the report to the engineering institution concerned with an intimation of the period within which it may submit its explaination to the Council.;] (2) On receipt of the explanation or, where no explanation is submitted within the specified period, on the expiry of that period, the Council, after making such further inquiry, if any, as it may think fit, may, by notification in the official Gazette, direct that an entry shall be made in the First Schedule against the engineering qualification to which the explanation relates declaring that it shall be a 1[accredited] engineering qualification only when granted before a specified date. 16. Maintenance of Register, etc.⎯ [(1) The Council shall maintain in the prescribed manner a Register in which shall be entered the names and other particulars of persons possessing accredited engineering qualifications whose application for registration as registered engineers, professional engineers, consulting engineers, constructors and operators are, from time to time, granted by the Council.] (2) Every application for registration under this Act shall be made to the Council in the prescribed form and be accompanied by the prescribed fee. 1[(3) Every registered engineer, professional engineer, consulting engineer registered under this Act shall be entitled to receive a certificate of registration under the hand of the Registrar.] (4) A certificate of registration issued under sub section (3), shall, subject to the provisions of this Act, remain in force until the thirty-first day of December of the year in which it is issued and shall thereafter be renewable 2[for any number of years not exceeding three at a time] upon payment of the prescribed fee. 1[(5) Every constructor and operator registered under this Act shall be entitled to receive a licence under the hand of the Registrar.]. 17. Registration and removal of names from Register.⎯1[(1) Every application for registration and every case of removal of a name from the Register shall be considered by an enrolment committee consisting of the Chairman; Senior Vice-Chairman and Vice-Chairmen and three other members, being engineers of not less than twenty years’ standing, nominated by the Governing Body. 1Subs. by the Pakistan Engineering Council (Amdt.) Act, 2011 (II of 2011), ss. 14-16 and shall be deemed to have taken effect of the 15th January, 2008. 2Subs. by the Pakistan Engineering Council (Amdt.) Act, 1992 (26 of 1992), s.6. (2) The enrolment committee in its discretion may refuse to permit the registration of any person or direct the removal altogether or for a specified period from the Register of the name of any registered engineer, professional engineer, consulting engineer, constructor or operator who has been convicted of any such offence as implies in the opinion of the committee a defect of character after providing such person an opportunity of being heard, and shall record reasons for action under this section.] (3) The enrolment committee may direct that any name removed from the Register under sub section (2) shall be restored. (4) 1[ * * * * * * * ] 18. Appeal against removal of name from Register.⎯ 2[(1) Any registered engineer, professional engineer, consulting engineer, constructor or operator aggrieved by an order under sub- section (1) of section 17 for the removal of his or its name from the Register may, within thirty days of the communication of the order, prefer an appeal to the Governing Body]; (2) Upon the receipt of an appeal under sub section (1), the 2[Governing Body] may, after holding such inquiry as it may consider necessary and giving the appellant an opportunity of being heard in person or through an advocate, pass such order as it may deem fit. 2[19. Revision of Register.⎯ (1) The Registrar shall remove from the Register the name of any registered engineer, professional engineer, consulting engineer, constructor or opetator. (a) who has died or, as the case may be, which has ceased to exist; (b) who or which has failed to have his or its certificate of registration renewed within one year of the date of its expiry; or (c) whose name has been directed under sub-section (2) of section 17 or sub section (7) of section 22 to be removed from the Register. (2) The Registrar shall restore to the Register the name of any registered engineer, professional engineer, consulting engineer, constructor or operator whose name has been removed from the Register under clause (b) of sub-section (1) if such registered engineer, professional engineer, Consulting engineer, constructor or operator applies for such restoration and pays the prescribed fee. (3) The Council may, in its discretion, after the expiry of not less than one year following the removal from the register of the name of any registered engineer, professional engineer, consulting engineer, constructor or operator grant registration to such registered engineer, professional engineer, consulting engineer, constructor or operator if he or it applies for registration.]. 1[20. Complaints against professional engineers, etc.⎯ (1) A complaint made against any 2[registered engineer, professional engineer, consulting engineer, constructors or operator] as to work or conduct shall be considered by the enrolment committee and, if that committee is of the opinion that there are sufficient reasons to proceed against the person to whom the complaint relates, it may either proceed to inquire into the complaint itself or refer the complaint to a Tribunal of Inquiry. 1Omited and Subs. by the Pakistan Engineering Council (Amdt.) Act, 1992 (26 of 1992), ss.7-8. 2Subs. by the Pakistan Engineering Council (Amdt.) Act, 2011 (II of 2011), ss. 17-19 and shall be deemed to have taken effect of the 15th January, 2008. (2) Where the enrolment committee decides to proceed with the complaint itself, it shall follow the same procedure as has been prescribed for the Tribunal of Inquiry and may pass such order as it is competent to pass under sub section (7) of section 22. (3) For the purpose of any inquiry, the enrolment committee shall be deemed to be a court within the meaning of the Qanun-e-Shahadat, 1984 (P.O. No. 10 of 1984), and shall exercise all the powers of a civil court for summoning witnesses, for compelling the production of documents and for issuing commissions.] 1[(4) The Enrolment Committee may also take suo moto notice of a professional misconduct by registered engineer, professional engineer, consulting engineer, constructor or operator or an engineering organizations whether in the public or in private sector; and shall follow the same procedure as provided in sub-sections (1) and (2).] 21. Tribunals of Inquiry.⎯ (1) For holding inquiries into the professional conduct of 1[registrered engineers, professional engineers, consulting engineers, constructors and operators] the 1[Governing Body] may constitute as many Tribunals of Inquiry as it may consider necessary. (2) A Tribunal shall consist of three members appointed by the 1[Governing Body] out of a panel of members of the Council maintained by the Committee who have professional standing of not less than ten years and who hold, or have held high engineering assignments. (3) The 1[Governing Body] shall appoint one of the members of a Tribunal to be the Chairman thereof. 22. Procedure in inquiries, etc.⎯ (1) In inquiries relating to the professional conduct of 1[registered engineer, professional engineer, consulting engineer, contractors or operator], the Tribunal shall, except as hereinafter provided, follow such procedure as may be prescribed. (2) The Tribunal shall fix a date for the hearing of the case and shall cause notice of the day so fixed to be given to the complaint and the 1[registered engineer, professional engineer, consulting engineer, contractors or operator] concerned, hereafter in this section referred to as the respondent, and shall afford to the complainant and the respondent an opportunity of leading evidence, if any, and of being heard before recommendations are made in the case. (3) The Chairman of the Tribunal may empower a member of the Tribunal to consider and decide preliminary issues and to record evidence. (4) On completion of the inquiry, the Tribunal may recommend to the 2[enrolment committee.]⎯ (a) dismissal of the complaint; (b) imposition of any of the following penalties on the respondent namely:- (i) reprimand; (ii) removal of name from the Register for a period not exceeding 2[five years]; __________________________________________________________________________ 1Added and Subs. by the Pakistan Engineering Council (Amdt.) Act, 2011 (II of 2011), ss. 19-21 and shall be deemed to have taken effect of the 15th January, 2008 2Subs. by the Pakistan Engineering Council (Amdt.) Act, 1992 (26 of 1992), s.9. (iii) removal of name from the Register altogether; or (c) prosecution of the respondent for the offence constituted by his or its conduct. (5) The Tribunal may make such recommendation to the 1[enrolment committee] as to the cost of the proceedings before it as it may deem fit; and, where the Tribunal is of the opinion that a complaint made against a respondent is false and vexatious, it may, in addition and without prejudice to any other remedy available to the respondent, recommend imposition upon the complainant of costs not exceeding a sum of ten thousand rupees and payment to the respondent of the whole or any part of the costs recovered from the complainant. (6) In any case in which it has recommended the imposition of any penalty on, or the prosecution of , the respondent, the Tribunal may also recommend that an amount not exceeding twice the amount of the fee received by the respondent from the complainant may be recovered from the respondent and paid to the complainant as compensation. (7) The 1 [enrolment committee] shall meet to consider the recommendations of the Tribunal within a period of six weeks from the date of receipt thereof and pass such orders as it may deem fit. 1[(7A) Any person aggrieved by an order under sub section (7) may, within thirty days of the communication of order to him, prefer an appeal to the 2[Governing Body]]. (8) Any order of the 1 [enrolment committee] as to the costs of the proceedings before the Tribunal or as to the recovery of any amount from a complainant or a respondent shall be executable as if it were an order of a District Judge. (9) When any professional engineer or consulting engineer is reprimanded under this Act a record of the punishment shall be entered against his or its name in the Register. 23. Powers of the Tribunal.⎯ (1) For the purpose of any such inquiry as aforesaid, a Tribunal shall have the same powers as are vested in a court under the Code of Civil Procedure, 1908 (Act V of 1908), in respect of the following matters, namely:⎯ (a) enforcing the attendance of any person, (b) compelling the production of documents, and (c) issuing commissions for the examination of witnesses. (2) Every such inquiry shall be deemed to be a judicial proceeding within the meaning of sections 193 and 228 of the Pakistan Penal Code (Act XLV of 1860), and a Tribunal shall be deemed to be a civil court for the purpose of sections 480 and 482 of the Code of Criminal Procedure 1898 (Act V of 1898). _________________________________________________________________________________ 1Subs. by the Pakistan Engineering Council (Amdt.) Act, 1992 (26 of 1992), s.9. 2Subs. by the Pakistan Engineering Council (Amdt.) Act, 2011 (II of 2011), s. 21 and shall be deemed to have taken effect of the 15th January, 2008 (3) For the purposes of enforcing the attendance of any person or of compelling the production of documents or issuing commissions⎯ (a) the jurisdiction of a Tribunal shall extend to the whole of Pakistan; and (b) a Tribunal may send to any civil court having jurisdiction in the place where the Tribunal is sitting any summons or other process for the attendance of a witness or the production of documents required by the Tribunal, or any commission which it desires to issue, and the civil court shall serve such process or issue such commission, as the case may be, and may enforce any such process as if it were a process for attendance or production before itself. (4) Proceedings before a Tribunal in any such inquiry shall be deemed to be civil proceedings for the purposes of 1[Articles 15 of the Qanun-e-Shahadat, 1984 (P.O. No. 10 of 1984)] and the provisions of that section shall apply accordingly. 24. Fund of the Council, accounts and audit.⎯ (1) All sums received by the Council as fees, grants donations or subscriptions shall form part of a fund which shall be managed, administered and utilised in such manner as may be prescribed. (2) The 2[Governing Body] shall cause to be maintained such books of account and other books in such form and manner as may be prescribed. (3) The accounts of the Council shall be audited, before the thirtieth day of November each year, by an auditor appointed by the Council who is a chartered accountant within the meaning of the Chartered Accountants Ordinance, 1961 (X of 1961). 25. Bye-laws of the Council.⎯ (1) The 2[Governing Body] may, with the previous sanction of the Federal Government, by notification in the official Gazette, make bye-laws for carrying out the purposes of this Act. (2) In particular, and without prejudice to the generality of the foregoing power, such bye-laws may provide for all or any of the following matters, namely:- (a) the summoning and holding of meetings of the Council and 2[Governing Body], the time and places where such meetings are to be held, the conduct of business and the number of members necessary to constitute a quorum at a meeting of the 2[Governing Body]; (b) the powers and duties of the Chairman, Vice-Chairman and Registrar; (c) the terms of office and powers and duties of the Registrar and other officers and servants of the Council; (d) the appointment, powers, duties and procedure of inspectors; (e) the procedure for maintenance and publication of the Register, the fees to be charged under this Act and establishment of sub offices or branches of the Council; _________________________________________________________________________________ 1Subs. by the Pakistan Engineering Council (Amdt.) Act, 1992 (26 of 1992), s.10. 2Subs. by the Pakistan Engineering Council (Amdt.) Act, 2011 (II of 2011), s. 21 and shall be deemed to have taken effect of the 15th January, 2008 (f) the management of the property of the Council and the maintenance and audit of its accounts; (g) the procedure at any inquiry held under sub section (2) of section 1[22]; and (h) any other matter which is to be or may be prescribed. 2[25A. Power to make regulations.⎯ The 1 [Governing Body] may, in consultation with the committee of Vice-Chancellors of the Universities of Engineering and Technology of Pakistan set up by the 1[Higher Education Commission], make regulations, not inconsistent with the provisions of the this Act and the bye-laws, to provide for- (a) minimum standard of courses of study and practical training for obtaining graduate and post-graduate engineering qualifications to be included in the First and Second Schedules; (b) minimum requirement for the content and duration of courses of study as aforesaid; (c) minimum qualifications for admission to engineering institutions offering course of study and laying down minimum standard for holding admission examinations; (d) qualifications and experience required of teachers for appointment in engineering universities, colleges and institutions; (e) minimum standards of examinations, and duration and standard of practical training, for securing 1[accreditation] of engineering qualifications under this Act; and (f) qualifications and experience required of examiners for professional examinations of 1[accredited] engineering qualifications. 26. Proof of membership, etc.⎯ For the purposes of any action or proceeding under this Act, a certificate of the Registrar certifying under the seal of the Council that, on a specified date, the name of a person was or was not borne on the Register shall be proof of its contents and of the authenticity of his signature, until the contrary is proved. 27. Penalties and procedure.⎯ (1) After such 3 date as the Federal Government may, after consultation with the Council, by notification in the official Gazette, appoint in this behalf, whoever undertakes any professional engineering work shall, if his name is not for the time being borne on the Register, be punishable with imprisonment for a term which may extend to six months, or with fine which may extend to ten thousand rupees, or with both, and, in the case of a continuing offence, with a further fine which may extend to two hundred rupees for every day after the first during which the offence continues. 1Subs. by the Pakistan Engineering Council (Amdt.) Act, 2011 (II of 2011), ss. 23-24 and shall be deemed to have taken effect of the 15th January, 2008. 2Ins. by the Pakistan Engineering Council (Amdt.) Act, 1983 (XVIII of 1983), s.4. 3For such date see Gaz. Of P. (Ext.,) (I), Pt. III, pp.3476-3699. (2) After the date appointed as aforesaid, whoever employs for any professional engineering work any person whose name is not for the time being borne on the Register shall be punishable, on first conviction, with imprisonment for a term which may extend to six months, or with fine which may extend to five thousand rupees, or with both, and on a second or subsequent conviction, with imprisonment for a term which may extend to one year, or with fine which may extend to ten thousand rupees, or with both. (3) Whoever willfully procures or attempts to procure himself or itself to be registered under this Act as a 1[registered engineer, professional engineer, consulting engineer, constructor or operator] by making or producing or causing to be made or produced any false or fraudulent representation or declaration, either orally or in writing, and any person who assists him therein shall be punishable with imprisonment for a term which may extend to three months, or with fine which may extend to five hundred rupees, or with both. (4) Whoever falsely pretends to be registered under this Act, or not being registered under this Act, uses with his name or title any words or letters representing that he is so registered, irrespective of whether any person is actually deceived by such pretence or representation or not, shall be punishable with imprisonment for a term which may extend to three months, or with fine which may extend to five hundred rupees, or with both. (5) No person undertaking any professional engineering work shall, unless he is registered under this Act, be entitled to recover before any court or other authority any sum of money for services rendered in such work. 1[(5A) No person shall, unless registered as a registered engineer or professional engineer, hold any post in an engineering organization where he has to perform professional engineering work.] (6) No court shall take cognizance of any offence punishable under this Act save on complaint made by, or under the authority of, the Council. (7) No court inferior to that of a Magistrate of the first class shall try any offence punishable under this Act. 28. Saving.⎯ Nothing in this Act shall be deemed to⎯ (a) affect the right of any person who was, immediately before the date specified in a notification issued under sub-section (1) of section 27, entitled to practise as an architect to continue such practice, provided a professional engineering work is executed under the supervision of a professional engineer, or to prevent him from associating with a professional engineer; (b) affect the right of any person to execute or undertake any work for which he has been trained in an institution specified by the Council, by notification in the official Gazette, for the purposes of this clause; (c) affect the right of any person who was, immediately before the date specified in a notification issued under sub-section (1) of section 27, entitled to work as a land surveyor to continue such work, or __________________________________________________________________________ 1Subs and ins. by the Pakistan Engineering Council (Amdt.) Act, 2011 (II of 2011), s. 25 and shall be deemed to have taken effect of the 15th January, 2008 (d) restrict the normal practice of his art or trade by an artisan or skilled workman 1[; or ] 1[(e) affect the rights of the members of the Governing Body constituted for the term commencing from the year 2008 and ending in 2010.] 29. Power to exempt.⎯ If the Council so recommends, the Federal Government may, by notification in the official Gazette, exempt any person or class of persons, or any professional engineering work or class of such works, from the operation of the provisions of section 27, subject to such conditions, if any, as may be specified in the notification. 2[29A. Supersession of Council.⎯ (1) If at any time it appears to the Federal Government that the Council has failed to exercise or has exceeded or abused any of the powers conferred upon it by or under this Act, the Federal Government may, if it is satisfied that such failure, excess or abuse has adversely affected the efficient conduct of the affairs of the Council or the achievenment of the objects of this Act, by notification in the official Gazette, supersede the Council for a period of two years and may, by a like notification extend the period of supersession for a further period of one year. (2) Upon the supersession of the Council under sub-section (1)- (a) the persons holding office as Chairman, Vice Chairman and members of the Council shall cease to hold office, and (b) all powers and functions of the Council shall, during the period of supersession, be exercised and performed by such person or authority as the Federal Government may appoint in this behalf, as if such person or authority were the Council. (3) The Council shall be reconstituted in accordance with the provisions of this Act for the exercise and performance of its pwers and functions on the expiry of the period specified in the notification under sub-section (1)]. 30.Commission of Inquiry.⎯(1) Whenever it is made to appear to the Federal Government that the Council is not complying with any of the provisions of this Act, the Federal Government may refer the particulars of the complaint to a Commission of Inquiry consisting of- (a) a person who is, or has been, or is qualified to be, a Judge of a High Court, to be appointed by the Federal Government; (b) a professional engineer, to be nominated by the Federal Government; and (c) a professional engineer, to be nominated by the Council. (2) The Commission shall proceed to inquire and report to the Federal Government as to the truth of the matters charged in the complaint and, in case of any charge of default or of improper action being found by the Commission to have been established, the Commission shall recommend remedies, if any, which are in its opinion necessary. 1Subs. and added by the Pakistan Engineering Council (Amdt.) Act, 2011 (II of 2011), s. 26 and shall be deemed to have taken effect of the 15th January, 2008 2Ins. by the Pakistan Engineering Council (Amdt.) Act, 2002 (CXXIX of 2002), s.2. (3) The Federal Government may require the Council to adopt the remedies so recommended within such time as, having regard to the report of the Commission, 1 [ it] may think fit; and, if the Council fails to comply with any such requirement, the Federal Government may amend the bye-laws or make such provision or order or take such other steps as may seem necessary to give effect to the recommendations of the Commission. (4) A Commission of Inquiry shall have power to administer oaths, to enforce the attendance of witnesses and the production of documents, and shall have all such other necessary powers for the purpose of any inquiry conducted by it as are exercised by a civil court under the Code of Civil Procedure, 1908 (Act V of 1908). 2[30A. Indemnity.⎯ No suit, prosecution, or other legal proceedings shall lie against the Council or any of its Committees, Officers or servants for anything which is in good faith done or intended to be done in pursuance of this Act or the bye-laws or regulations made thereunder.] 1[30B. Validation of actions.⎯ Anything done, actions taken, orders passed, instruments made, proceedings initiated, process or communications issued, powers conferred, assumed, exercised by the Council or its officer and servants on or after the 15th January, 2008, and before the commencements of the Pakistan Engineering Council (Amendment) Act, 2009 shall be deemed to have been validly done, made, issued , taken initiated, conferred, assumed and exercised and shall have, and shall be deemed always to have had, effect accordingly.] 31. [Repeal]. Omitted by the Federal Laws (Revision and Decloration) Ordinance, 1981 (XXVII of 1981), s. 3 and sch., II. 1Subs. by the Pakistan Engineering Council (Amdt.) Act, 2011 (II of 2011), s. 26 and shall be deemed to have taken effect of the 15th January, 2008 2Ins. by the Pakistan Engineering Council (Amdt.) Ordinance, 1983 (18 of 1983), s. 5."
}