{
  "file": "administratorb1eefa1b9a21e1fc65dce10436713550.pdf",
  "law_name": "The Pakistan Armed Forces Nursing Service Act, 1952",
  "text": "THE PAKISTAN ARMED FORCES NURSING SERVICE ACT, 1952 CONTENTS 1. Short title, application and commencement 2. Definitions 3. Constitution of Pakistan Armed Forces Nursing Service 4. Liability for service of members of the Pakistan Armed Forces Nursing Service 5. Members to be of commissioned rank 6. Eligibility for appointment 7. 8. 9. Application of the Pakistan Army Act, 1952, the Pakistan Air Force Act, 1953, and the Pakistan Navy Ordinance, 1961, to members of the Pakistan Armed Forces Nursing Service 10. Power to make rules 11. Power to make regulations THE PAKISTAN ARMED FORCES NURSING SERVICE ACT, 1952 1ACT No. XXXVI of 1952 [5th May, 1952] An Act to constitute a force to be called the 2[Pakistan Armed Forces Nursing Service] and to provide for its discipline. WHEREAS it is expedient to constitute a force to be called the 2[Pakistan Armed Forces Nursing Service], as a part of the Armed Forces of Pakistan, and to provide for its discipline; It is hereby enacted as follows:__ 1. Short title, application and commencement.__(1) This Act may be called the 2[Pakistan Armed Forces Nursing Service] Act, 1952. (2) It applies to the members of the 2[Pakistan Armed Forces Nursing Service] wherever they may be. (3) It shall come into force at once and shall be deemed to have taken effect on the tenth day of May, 1951. 2. Definitions. In this Act, unless there is anything repugnant in the subject or context,__ (a) “prescribed” means prescribed by rules made under this Act; (b) “regulations” means regulations made under this Act. 3. Constitution of 2[Pakistan Armed Forces Nursing Service]. There shall be raised and maintained, in the manner hereinafter provided, as part of the Armed Forces of Pakistan, 3[a force] which shall be designated the 2[Pakistan Armed Forces Nursing Service]. 3[4. Liability for service of members of the Pakistan Armed Forces Nursing Service. The members of the Pakistan Armed Forces Nursing Service shall be liable for service with the force or persons subject to the Pakistan Army Act, 1952 (XXXIX of 1952), the Pakistan Air Force Act, 1953 (VI of 1953) or the Pakistan Navy Ordinance, 1961 (XXXV of 1961).] 1The Act has been applied to Baluchistan with effect on and from the 6th May, 1952, see Gaz. of P., 1952, Pt. I, p. 110; and extended to the Leased Areas of Baluchistan, by the Leased Areas (Laws) Order, 1950 (G. G. O. 3 of 1950). It has been applied also in the Federated Areas of Baluchistan, see Gaz. of P., 1953, Pt. I, p. 152. It has been extended to the Baluchistan States Union by the Baluchistan States Union (Federal Laws) (Extension) Order, 1953 (G. G. O. 4 of 1953). This Act has been and shall be deemed to have been brought into force in Gwadur with effect from the 8th September, 1958 by the Gwadur (Application of Central Laws) Ordinance, 1960 (XXXVII of 1960), s. 2. This Act has been and shall be deemed to have been so extended to the whole of Pakistan on the 14th October, 1955 by the Central Laws (Statute Reform) Ordinance, 1960 (XXI of 1960), s. 3 and 2nd Sch. 2Subs. by Act No. XXXIX (w. e. f. 10th May, 1951), s. 2. 3Subs. by Act No. V of 1963, ss. 2-3. 5. Members to be of commissioned rank.__All members of the 1[Pakistan Armed Forces Nursing Service] shall be of commissioned rank and shall be appointed as officers of the 1[Pakistan Armed Forces Nursing Service] by the 2[Federal Government], by notification in the official Gazette. 6. Eligibility for appointment.__(1) Any female citizen 3[* * *] shall be eligible for appointment as an officer in the 1[Pakistan Armed Forces Nursing Service] and, if she satisfies the prescribed conditions, may be appointed thereto in the manner laid down in section 5 of this Act: Provided that a woman who is not a citizen of Pakistan but who otherwise fulfils the conditions laid down by, or under this section for a citizen of Pakistan, may, with the consent of the 2[Federal Government], signified in writing, be appointed as an officer in the 1[Pakistan Armed Forces Nursing Service]. (2) Every person so appointed shall be subject to this Act and to the rules and regulations made thereunder. 1[7. The 2[Federal Government], or any authority empowered by the 2[Federal Government] in this behalf, may 3[dismiss, remove, release, or cause of retirement of,] any officer from the Pakistan Armed Forces Nursing Service.] 1[8. Subject to the provisions of this Act, an officer of the Pakistan Armed Forces Nursing Service shall be bound to undergo such training and in such manner and to perform such duties in connection with the forces and persons subject to any of the enactments referred to in section 4 as may be laid down by regulations.] 3[9. Application of the Pakistan Army Act, 1952, the Pakistan Air Force Act, 1953, and the Pakistan Navy Ordinance, 1961, to members of the Pakistan Armed Forces Nursing Service.__ (1) The provisions of the Pakistan Army Act, 1952 (XXXIX of 1952), shall, to such extent and subject to such adaptations and modifications as may be prescribed, apply to officers of the Pakistan Armed Forces Nursing Service, who may be serving with forces and persons subject to that Act as those provisions apply to officers of the Pakistan Army. (2) The provisions of the Pakistan Air Force Act, 1953 (VI of 1953), shall, to such extent and subject to such adaptations and modifications as may be prescribed, apply to officers of the Pakistan Armed Forces Nursing Service, who may be serving with forces and persons subject to that Act as those provisions apply to officers of the Pakistan Air Force. (3) The provisions of the Pakistan Navy Ordinance, 1961 (XXXVI of 1961), shall, to such extent and subject to such adaptations and modifications as may be prescribed, apply to officers of the Pakistan Armed Forces Nursing Service, who may be serving with forces and persons subject to that Ordinance as those provisions apply to officers of the Pakistan Navy.] 10. Power to make rules.__ (1) The 2[Federal Government] may, by notification in the official Gazette, make rules to carry out the purposes of this Act. 1Subs. by Act No. (XXXIX of 1953, ss. 2, 4 and 5. 2Subs. by the Federal Adaptation of Laws Order, 1975 (P. O. No. 4 of 1975), Art. 2 and Table. 3Omitted and subs. by Act No. V of 1963, ss. 4-6. (2) In particular and without prejudice to the generality of the foregoing power, rules may be made under this section,__ (a) providing for the medical examination of persons offering themselves for appointment in the 1[Pakistan Armed Forces Nursing Service]; and (b) providing for any matter which under this Act is to be or may be prescribed. 11.Power to make regulations. 2[Any officer or authority empowered in this behalf by the 3[Federal Government]] may make regulations not inconsistent with this Act and rules made thereunder, providing for all matters to be laid down by regulations and generally for all details connected with the organization, pay, allowances, duties, discipline, training, clothing, equipment and leave of members of the 1[Pakistan Armed Forces Nursing Service]. 4p7200wsp RGN Date: 17-06-2025 1Subs. by Act No. XXXIX of 1953, s. 2. 2Subs. by Act No. VIII of 1965, s. 2. 3Subs. by the Federal Adaptation of Laws Order, 1975 (P. O. No. 4 of 1975), Art. 2 and Table."
}