{
  "file": "administratorec3ee90d7c8aef5ea43c2de8369e71a3.pdf",
  "law_name": "The Protection Of Communal Properties Of Minorities Ordinance, 2002",
  "text": "THE PROTECTION OF COMMUNAL PROPERTIES OF MINORITIES ORDINANCE, 2002. CONTENTS 1. Short title, extent, commencement and application 2. Definition 3. Ban on sale or transfer of minority communities properties 5. Punishment 6. Removal of difficulties 7. Power to make rules THE PROTECTION OF COMMUNAL PROPERTIES OF MINORITIES ORDINANCE, 2002. ORDINANCE NO. V OF 2002 [22 January, 2002] An Ordinance to protect the properties of minority communities meant for their communal use WHEREAS in view of prevailing circumstances, it is the demand of the minority communities to protect their properties meant for their communal use; AND WHEREAS the President is satisfied that circumstances exists which render it necessary to take immediate action; NOW, THEREFORE, in pursuance of the Proclamation of Emergency of the fourteenth day of October, 1999, and the Provisional Constitution Order No.1 of 1999, read with the Provisional Constitution (Amendment) Order No.9 of 1999, and in exercise of all other powers enabling him in that behalf, the President of the Islamic Republic of Pakistan is pleased to make and promulgate the following Ordinance:— 1. Short title, extent, commencement and application: ― (1) This Ordinance may be called the Protection of Communal Properties of Minorities Ordinance, 2001. (2) It extends to the whole of Pakistan. (3) It shall come into force at once. (4) It shall apply to properties belonging to the minority communities in Pakistan meant for their communal use. 2. Definition:__ In this Ordinance, unless there is anything repugnant in the subject or context,— (a) “Commission” means the National Commission for Minorities. (b) “Property” means places of worship, monasteries, seminaries, vicarages, dharamshalas, gaoshalas, burial places, community centers, social welfare, educational, health and recreational institutions meant for communal use of minority communities and includes side buildings, vacant places, lands, residential places or offices annexed to the said properties. 3. Ban on sale or transfer of minority communities properties:— (1) No property of a minority community meant for its communal use shall be bought, sold or transferred by any person without N.O.C from the Federal Government: Provided that nothing contained herein shall apply to a property bought, sold or transferred for a Housing Scheme, meant for a minority community, approved by a Provincial or Federal Government. (2) The N.O.C. referred to in sub-section (1) may be given by the Federal Government on the recommendation of the National Commission for Minorities 4. Ordinance not to apply to evacuee trust properties :___ Nothing in this Ordinance shall apply to the evacuee trust properties forming party of Trust Pool and vested in the Federal Government under the Evacuee Trust Properties (Management and Disposal) Act,1975 (XIII of 1975). 5. Punishment.—Whoever buys, sells or transfers any property belonging to a minority community meant for its communal use in violation of section 3, shall be punishable with imprisonment of either description which may extend to seven years and shall also be liable to fine which shall not be less than one hundred thousand rupees and the sale or transfer transaction shall be of no legal effect. 6. Removal of difficulties:___ If any difficulty arises in giving effect to any of the provision of this Ordinance, the Federal Government may make such order, not inconsistent with the provisions of this Ordinance, as may appear to be necessary for the purpose of removing the difficulty. 7. Power to make rules:___ The Federal Government may, by notification in the official Gazette, make rules for carrying out the purposes of this Ordinance. ___________"
}