{
  "file": "administrator66dfa07a1720a9d25939d82bc7cee5d6.pdf",
  "law_name": "The International Monetary Fund And Bank Act, 1950",
  "text": "THE INTERNATIONAL MONETARY FUND AND BANK ACT, 1950 CONTENTS 1. Short title, extent and commencement 2. Payment to International Fund and Bank 3. State Bank to be depository for International Fund and Bank 4. Power to call for information 5. Certain provisions of Agreements to have force of law 5A. Special drawing rights not to be taxed 6. [Omitted] 7. [Omitted] SCHEDULE THE INTERNATIONAL MONETARY FUND AND BANK ACT, 1950 ACT NO. XLIII or 1950 [19th April, 1950] An Act to implement the International Monetary Fund and Bank Agreements WHEREAS, at the United Nations Monetary and Financial Conference held at Bretton Woods, New Hamp Shire, in July 1944, Articles of the following agreements were drawn up, and set out in the Final Act of the said Conference that is to say, ___ (a) an agreement (hereinafter referred to as the Fund Agreement) for the establishment and operation of an international body to be called the International Monetary Fund (hereinafter referred to as the International Fund), and (b) an agreement (hereinafter referred to as the Bank Agreement) for the establishment and operation of an international body to be called the International Bank for Reconstruction and Development (hereinafter referred to as the International Bank); 1[AND WHEREAS a resolution relating to certain amendments to the Articles of the Fund Agreement for the purpose of enabling the establishment of a facility based on special drawing rights in the International Fund and improving the present rules and practices of the Fund based on developments in world economic conditions and the experience of the Fund since the adoption of the Articles of Agreement, was adopted by the Board of Governor of the Fund on May 31, 1968;] It is hereby enacted as follows :___ 1. Short title, extent and commencement.___(1) This Act may be called the International Monetary Fund and Bank Act, 1950. 2[(2) It extends to the whole of Pakistan.] (3) It shall come into force on such date as the 3[Federal Government] may, by notification in the Official Gazette, appoint. 1Added by Ordinance No. X of 1969, s. 2. 2Subs. by Ordinance No. XLII of 1959, s. 2. 3Subs. by The Federal Adaptation of Laws Order, 1975 (P. O. No. 4 of 1975), Art. 2 and Table. 2. Payment to International Fund and Bank.___(1) There shall be paid out of the revenues of the 1[Federal Government] all such sums as may from time to time be required for the purpose of paying___ (a) the subscriptions payable by the 1[Federal Government] to the International Fund 2[section 1, and section 3], of Article III of the Fund Agreement, and to the International Bank under 3[paragraphs (a) and (c) of section 3 of Article II of the Bank Agreement]; (b) any sums payable by the 1[Federal Government] to the International Fund under 2[section 11 of Article V] of the Fund Agreement, and to the International Bank under section 9 of Article II of the Bank Agreement; (c) any charges payable by the 1[Federal Government] to the International Fund under section 8 of Article V of the Fund Agreement; (d) any sums required for implementing the guarantee of the 1[Federal Government] referred to in section 3 of Article XIII of the Fund Agreement; (e) any compensation required to be paid by the 1[Federal Government] to the International Fund or to any member thereof under 2[Schedule J or Schedule K] to the Fund Agreement 4[;] 2[(f) any charges or assessment payable by the Federal Government to the International Fund under sections 2 and 4 of Article XX, section 3 of Article XXIV, Article XXV (c) and paragraph 5 of Schedule 1 of the Fund Agreement.] (2) The 1[Federal Government] may, if it thinks fit so to do, create and issue to the International Fund or International Bank, in such form as it thinks fit, any such non-interest bearing and non- negotiable notes or other obligations as are provided for by 2[section 4] of Article III of the Fund Agreement and section 12 of Article V of the Bank Agreement. 4[(3) Any funds required on account of the following shall be provided by the 1[Federal Government] from out of a special deposit account to be maintained by it with the State Bank of Pakistan, namely :___ (a) cancellation of drawing rights under section 2 of 2[Article XVIII] of the Fund Agreement; (b) elimination of negative balance under paragraph (f) of section 2 of 2[Article XVIII] of the Fund Agreement ; (c) payments against cumulative allocation on termination under paragraph (b) of section 2 of 2[Article XXIV] of the Fund Agreement ; and 1Subs. by The Federal Adaptation of Laws Order, 1975 (P. O. No. 4 of 1975), Art. 2 and Table. 2Subs. by Ordinance No. XXXVII of 1977, s. 2. 3Subs. by Ordinance No. XLII of 1959 s. 3. 4Added by Ordinance No. X of 1969, s. 3. (d) payments against cumulative allocations on liquidation under 1[Article XXV] (c) of the Fund Agreement.] 1[(4) The Federal Government may take all such steps as may be necessary to meet its obligation under paragraph (e) of section 3 of the amended Article V of the Fund Agreement.] 3. State Bank to be depository for International Fund and Bank. The State Bank of Pakistan (hereinafter referred to as the State Bank) shall be the depository of the Pakistan currency holdings of the International Fund and International Bank. 4. Power to call for information.___(1) Where under section 5 of Article VIII of the Fund Agreement, the International Fund required the 2[Federal Government] to furnish it with any information, the 2[Federal Government], or if generally or specially authorised by the 2[Federal Government] in this behalf, the State Bank may by order in writing require any person to furnish to such officer or other person as may be specified in the order such detailed information as the 2[Federal Government] or the State Bank, as the case may be, may determine to be essential for the purpose of complying with the request of the International Fund; and any person so required shall be bound to furnish such information. (2) Every officer or person to whom any information is required to be furnished under this section shall be deemed to be a public servant within the meaning of section 21 of the Pakistan Penal Code (XLV of 1860). (3) No information obtained under this section shall be furnished to the International Fund in such detail as to disclose the affairs of any person, and the provisions of 3[sections 122 and sub-sections (1), (2) and (3) of section 150 of the Income-Tax Ordinance, 1979 (XXXI of 1979)], shall apply in relation to information obtained under this section as they apply to the particulars referred to in that section. (4) A determination of the 2[Federal Government] or the State Bank under sub-section (1) as to the extent of detail in which information is to be furnished shall be final, and in any prosecution under section 176 or section 177 of the Pakistan Penal Code in respect of any information required to be furnished under this section, it shall not be a defence to assert that the information was required to be furnished in greater detail than was essential for the purpose of complying with the request of the International Fund. (5) No prosecution for an offence in respect of any information required to be furnished under this section shall be instituted except with the previous sanction of the 2[Federal Government]. 1Subs. by Ordinance No. XXXVII of 1977, s. 2. 2Subs. by The Federal Adaptation of Laws Order, 1975 (P. O. No. 4 of 1975), Art. 2 and Table. 3Subs. by the Federal Laws (Revision & Declaration) Ordinance, 1981 (XXVII of 1981), s. 3 and 2nd Sch. 5. Certain provisions of Agreements to have force of law. Notwithstanding anything to the contrary contained in any other law, the provisions of the Fund and Bank Agreements set out in the Schedule shall have the force of law in 1[Pakistan]: Provided that nothing in section 9 of Article IX of the Fund Agreement or in section 9 of Article VII of the Bank Agreement shall be construed as___ (a) entitling the International Fund or International Bank to import into 1[Pakistan] goods free of any duty of customs without any restriction on their subsequent sale therein, or (b) conferring on the International Fund or International Bank any exemption from duties or taxes which form part of the price of goods sold or which are in fact no more than charges for services rendered. 2[5A. Special drawing rights not to be taxed.—Without prejudice to the privileges and immunities specified in Part I of the Schedule, no tax of any kind shall be levied on special drawing rights or on operations or transactions in special drawing rights.] 6. 3[* * * * * * *] 7. 3[* * * * * * *] 1Subs. by Ordinance No. XLII of 1959, s. 4. 2Added by Ordinance No. X of 1969, s. 4. 3Omitted by the Federal Laws (Revision and Declaration) Ordinance, 1981 (XXVII of 1981), s. 3 and 2nd Schedule. THE SCHEDULE (See section 5) PROVISIONS OF AGREEMENTS WHICH SHALL HAVE FORCE OF LAW. Part I Fund Agreement Paragraph (b) of section 2 of Article VIII.___Exchange contracts which involve the currency of any member and which are contrary to the exchange control regulations of that member maintained or imposed consistently with this Agreement shall be unenforceable in the territories of any member. ARTICLE IX STATUS, IMMUNITIES AND PRIVILEGES. Section 1. Purpose of Article.___To enable the Fund to fulfil the functions with which it is entrusted, the status, immunities and privileges set forth in this Article shall be accorded to the Fund in the territories of each member. Section 2. Status of the Fund.___The Fund shall possess full juridical personality, and, in particular, the capacity___ (i) to contract; (ii) to acquire and dispose of immovable and movable property; (iii) to institute legal proceedings. Section 3. Immunity from judicial process.___The Fund, its property and its assets, wherever located and by whomsoever held, shall enjoy immunity from every form of judicial process except to the extent that it expressly waives its immunity for the purpose of any proceedings or by the terms of any contract. Section 4. Immunity from other action.___Property and assets of the Fund, wherever located and by whomsoever held, shall be immune from search requisition, confiscation, expropriation or any other form of seizure by executive or legislative action. Section 5. Immunity of archives.___The archives of the Fund shall be inviolable. Section 6. Freedom of assets from restrictions.___To the extent necessary to carry out the operations provided for in this Agreement, all property and assets of the Fund shall be free from restrictions, regulations, controls and moratoria of any nature. Section 7. Privilege for communications.___The official communications of the Fund shall be accorded by members the same treatment as the official communications of other members. Section 8. Immunities and privileges of officers and employees.___All governors, executive directors, alternates, officers and employees of the Fund___ (i) shall be immune from legal process with respect to acts performed by them in their official capacity except when the Fund waives this immunity; (ii) not being local nationals, shall be granted the same immunities from immigration restrictions, alien registration requirements and national service obligations and the same facilities as regards exchange restrictions as are accorded by members to the representatives, officials, and employees of comparable rank of other members; (iii) shall be granted the same treatment in respect of traveling facilities as is accorded by members to representatives, officials, and employees of comparable rank of other members. Section 9. Immunities from taxation.___(a) The Fund, its assets, property, income and its operations and transactions authorised by this Agreement, shall be immune from all taxation and from all customs duties. The Fund shall also be immune from liability for the collection or payment of any tax or duty. (b) No tax shall be levied on or in respect of salaries and emoluments paid by the Fund to executive directors, alternates, officers or employees of the Fund who are not local citizens, local subjects, or other local nationals. (c) No taxation of any kind shall be levied on any obligation or security issued by the Fund, including any dividend or interest thereon, by whomsoever held___ (i) which discriminates against such obligation or security solely because of its origin; or (ii) if the sole jurisdictional basis for such taxation is the place or currency in which it is issued, made payable or paid, or the location of any office or place of business maintained by the Fund. PART II BANK AGREEMENT ARTICLE VII STATUS, IMMUNITIES AND PRIVILEGES Section 1. Purpose of Article.___To enable the Bank to fulfil the functions with which it is entrusted, the status, immunities and privileges set forth in this Article shall be accorded to the Bank in the territories of each member. Section 2. Status of the Bank.____ The Bank shall possess full juridical personality, and, in particular, the capacity___ (i) to contract; (ii) to acquire and dispose of immovable and movable property; (iii) to institute legal proceedings. Section 3. Position of the Bank with regard to judicial process.____Actions may be brought against the Bank only in a court of competent jurisdiction in the territories of a member in which the Bank has an office, has appointed an agent for the purpose of accepting service or notice of process, or has issued or guaranteed securities. No actions shall, however, be brought by members or persons acting for or deriving claims from members. The property and assets of the Bank shall, wheresoever located and by whomsoever held, be immune from all forms of seizure, attachment or execution before the delivery of final judgment against the Bank. Section 4. Immunity of assets from seizure.___Property and assets of the Bank, wherever located and by whomsoever held, shall be immune from search, requisition, confiscation, expropriation or any other form of seizure by executive or legislative action. Section 5. Immunity of archives.___The archives of the Bank shall be inviolable. Section6. Freedom of assets from restrictions.___To the extent necessary to carry out the operations provided for in this Agreement and subject to the provisions of this Agreement, all property and assets of the Bank shall be free from any restrictions, regulations, controls and moratoria of any nature. Section 7. Privilege for communications.___The official communications of the Bank shall be accorded by each member the same treatment that it accords to the official communications of other members. Section 8. Immunities and privileges of officers and employees.___All governors, executive directors, alternates, officers and employees of the Bank___ (i) shall be immune from legal process with respect to acts performed by them in their official capacity except when the Bank waives this immunity; (ii) not being local nationals, shall be accorded the same immunities from immigration restrictions, alien registration requirements and national service obligations and the same facilities as regards exchange restrictions as are accorded by members to the representatives, officials, and employees of comparable rank of other members; (iii) shall be granted the same treatment in respect of traveling facilities as is accorded by members to representatives, officials and employees of comparable rank of other members. Section 9. Immunities from taxation.___(a) The Bank, its assets, property, income and its operations and transactions authorised by this Agreement, shall be immune from all taxation and from all customs duties. The Bank shall also be immune from liability for the collection or payment of any tax or duty. (b) No tax shall be levied on or in respect of salaries and emoluments paid by the Bank to executive directors, alternates, officials or employees of the Bank who are not local citizens, local subjects, or other local nationals. (c) No taxation of any kind shall be levied on any obligation or security issued by the Bank (including any dividend or interest thereon) by whomsoever held___ (i) which discriminates against such obligation or security solely because it is issued by the Bank; or (ii) if the sole jurisdictional basis for such taxation is the place or currency in which it is issued, made payable or paid, or the location of any office or place of business maintained by the Bank. (d) No taxation of any kind shall be levied on any obligation or security guaranteed by the Bank (including any dividend or interest thereon) by whomsoever held___ (i) which discriminates against such obligation or security solely because it is guaranteed by the Bank; or (ii) if the sole jurisdictional basis for such taxation is the location of any office of place of business maintained by the Bank. ____________ 92775 Date: 03-02-2025"
}