{
  "file": "administratorac84fec38cbdff67dd3898bd38c30673.pdf",
  "law_name": "The Pakistan Veterinary Medical Council Act 1996. CONTENTS",
  "text": "The Pakistan Veterinary Medical Council Act 1996. CONTENTS 1. Short title, extent and commencement 2. Definition 3. Composition and incorporation of the Council 4. Terms of office of member of Council 5. President and Vice President 6. Executive Committee 7. Officers and Servants of the Council 8. Terms and conditions of the officers, etc. of the Council 9. Recognition of Veterinary and Animal Husbandry qualifications granted by Veterinary Institutions in Pakistan 10. Non Pakistan veterinary qualifications in Second Schedule to be recognized 11. Arrangement for modifying the Second Schedule 12. Power of the Council to certify certain persons to be possessed to sufficient qualifications 13. Power to required information as to courses of study and examination 14. Inspection of examination 15. Withdrawal of recognition 16. Maintenance of register 17. Register to be public document 18. Penalty for fraudulent representation or registration 19. Privileges of registered members 20. Responsibility of a registered person 21. Prohibition against use of unregistered veterinary qualification 22. Removal of names from the register 23. Power to make regulations 24. Information to be furnished by the Council and publication thereof 25. Commission of inquiry The Pakistan Veterinary Medical Council Act 1996. ACT No. III OF 1996 An act to constitute the Veterinary Medical Council in Pakistan. Whereas it is expedient to regulate the registration, practice and conduct of the veterans to establish uniform standards of basic and higher qualifications in veterinary medicine and surgery and to constitute a Pakistan Veterinary Medical Council: It is hereby enacted as follow:— 1. Short title, extent and commencement:—(1) This Act may be called the Pakistan Veterinary Medical Council Act 1996. (2) It extends to the whole of Pakistan. (3) It shall come into force at once. 2. Definition:— In this Act unless there is anything repugnant in the subject or context.— (a) “Council” means the Pakistan Veterinary Medical Council constituted under this Act; (b) “Member” means a member of the Council; (c) “Register” means the register of veterinary practitioners maintained under section 16; (d) “Regulation” means regulations made under section 23; (e) “Prescribed” means prescribed by regulations; (f) “Veterinary Medicine” means modern scientific medicine and includes surgery and obstetrics, as applicable to animals but does not include human medicine and surgery; and (g) “Veterinary” means animal health and production. 3. Composition and incorporation of the Council:—(1) There shall be constituted in accordance with the provision of this Act a Council to be known as the Pakistan Veterinary Medical Council. (2) The Council shall be a body corporate having perpetual succession and a common seal with powers to acquire, hold and dispose of property and enter into contract and shall be its name sue or be used. (3) The Council shall consist of:— (a) one member from each Province to be nominated by the Provincial Government; (b) one member each to be nominated by the Vice Chancellor of each University from among the members of the Veterinary and the Animal Husbandry Faculty of the University; (c) four members to be elected from among themselves by the Central Executive Committee of Pakistan Veterinary Medical Association, a society registered under the Societies Registration Act, 1860 (XXI of 1860); (d) four members to be nominated by the Federal Government of whom at least one shall be member of the Remount Veterinary and Farms Corps; (e) one member each to be nominated by the Head of each Veterinary Institution in Pakistan which trains for a recognized veterinary qualification form among its teaching staff; and (f) Animal Husbandry commissioner, Livestock Division, Government of Pakistan. (4) No person shall be qualified to be elected or nominated as a member of the Council unless:— (i) he is registered with the council; and (ii) he possesses a recognized veterinary qualification obtained not less than five years before his election or nomination: Provided that qualification at (i) above shall not apply to a person to be elected or nominated for the first Council, but such person shall get himself registered with the Council within six months of its constitution. (5) The headquarters of the council shall be at such place as the Council may determine. 4. Terms of office of member of Council:—(1) A member shall hold office for a term of four years, but shall be eligible to be re-elected or re-nominated. (2) When the term of office of a member is about to expire, his successor shall be elected for nominated, as the case may be, any time within three months before the term expires, but he shall assume office only after expiry of the term of incumbent. (3) A member may, at any time, resign his office by tendering his registration in writing to the President of the council. (4) A casual vacancy in the office of member shall be filled in through election or nomination, as the case may be, within three months of the occurrence of the vacancy. (5) A member elected or nominated to fill a casual vacancy shall hold office the full term of four years. (6) A member shall cease to hold office, and his office shall be declared vacant, if he fails to attend three consecutive meetings of the Council. 5. President and Vice President:—(1) The Council shall have a President and a Vice President to be elected by the members from among themselves. (2) The President and Vice President shall hold office for a term of four years. 6. Executive Committee:—(1) There shall be an Executive Committee of the Council which shall consist of the President, the Vice-President and five members to be elected by the council from among its members. (2) In addition to the powers and duties conferred and imposed upon it by this Act, the Executive Committee shall exercise such powers and discharge such duties as may be prescribed. (3) In addition to the Executive Committee, the Council may constitute such other committees for general or special purposes as it may deem necessary to carry out the purposes of this Act. 7. Officers and Servants of the Council:—(1) The Council may appoint such officers and servants, as it may deem necessary to carry out the purposes of the Act. (2) All persons appointed or employed by the Council shall be deemed to be public servants within the meaning of section 21 of the Pakistan Penal Code (XLV of 1860). 8. Terms and conditions of the officers, etc. of the Council:—The Council may with the previous sanction of the Federal Government fix the remuneration and allowances to be paid to the President, the Vice President, members and officers and servants of the Council. 9. Recognition of Veterinary and Animal Husbandry qualifications granted by Veterinary Institutions in Pakistan:—(1) The qualifications granted by Veterinary Institutions in Pakistan which are included in the first Schedule shall be recognized Veterinary and Animal Husbandry qualifications for the purpose of this Act. (2) Any veterinary institution in Pakistan which grants a veterinary qualification not included in the First Schedule may apply to the Federal Government to have such qualification recognized, and the Federal Government after consulting the Council by notification in the official Gazette amend the First Schedule so as to include such qualification therein. (3) The notification referred to in sub-section (2) may also direct that an entry shall be made in the last column of the First Schedule against the veterinary qualification declaring that it shall be a recognized qualification only when granted after a specified date. 10. Non Pakistan veterinary qualifications in Second Schedule to be recognized:—The veterinary qualification granted by veterinary institutions outside Pakistan which are included in the Second Schedule shall be recognized veterinary qualifications for the proposes of this Act. 11. Arrangement for modifying the Second Schedule:—(1) At any time the Council may enter into negotiations with the appropriate authority in any State or Country outside Pakistan for the settling of a scheme of reciprocity for the recognition of veterinary qualifications and in pursuance of any such scheme, the Federal Government may by notification in official Gazette amend the Second Schedule so as to include therein any veterinary qualification which the Council has decided to recognize. (2) The notification referred to in sub-section (1) may also direct that an entry shall be made in the last column of the Second Schedule against the veterinary qualification declaring that it shall be recognized qualification only when granted after a specified date. (3) The Federal Government, after consultation with the Council, may, by notification in the official Gazette, amend the Second Schedule by directing that an entry be made therein in respect of any veterinary qualification, declaring that it shall be a recognized qualification only when granted before a specified date. (4) Where the Council has refused to recognize any veterinary qualification which has been proposed for recognition by any such authority that authority may apply to the Federal Government, and the Federal Government after considering such application and the Council’s reason for such refusal may, by notification in the official Gazette amend the Second Schedule so as to module such qualification therein and the provisions of sub-section (2) shall apply to such notification. (5) The Federal Government, after consulting the Council, may, if it thinks fit direct that a veterinary qualification granted by an institution in a State or Country outside Pakistan shall be a recognized qualification for such period and subject to such conditions as may be specified in the direction, as it were mentioned, in the Second Schedule notwithstanding that a reciprocal scheme of recognition has not been entered into between the Council and the appropriate authority in that State or Country as in referred to in sub-section (1). 12. Power of the Council to certify certain persons to be possessed to sufficient qualifications:—If the Council is satisfied that a person is, by reason of qualification granted by a veterinary institution outside Pakistan, not included in the Second Schedule, and of experience gained in any part of Pakistan, possessed of qualifications which entitle him to be recognized as possessed of sufficient veterinary qualification for the purposes of this Act, it may, with the approval of the Federal Government certify that the person is possessed of such qualification; and, on such certification by the Council, the person shall be deemed to be possessed of recognized qualification for such period and subject to such condition as may be specified by the Council in this behalf. 13. Power to require information as to courses of study and examination:—Every veterinary institution in Pakistan which train for, or grants, or both trains for and grants a recognized veterinary qualification shall furnished such information as the Council may, for time to time, require as to:— (a) the courses of the study and examination to be undergone in order to obtain such qualification; (b) the minimum age at which such courses of study can be undertaken on admission in the institution; (c) examination required to be undergone prior to such qualifications being conferred, and (d) generally as to the requisites for obtaining such qualification. 14. Inspection of examination:—(1) The Executive Committee shall appoint such number of inspectors as it may deem necessary:— (a) to attend at any or all of the examinations held by veterinary institutions in Pakistan for the purpose of granting recognized qualifications or in respect of which recognition has been sought; and (b) to look into research projects and technical facilities available at any veterinary institution of Pakistan for evaluating any short falls or deficiencies and assessing the requirements of such institutions in terms of expertise and equipments. (2) The inspector appointed under this section shall not interface with the conduct of any examination of research studies, but he shall report to the Executive Committee on the sufficiency of the examination of the research proper which he attends and on the courses of study and facilities of teaching and research provided by the institution at different stages in respect of such examination research and on and other matters in regard to which the Executive Committee may require them to report. (3) The Executive Committee shall forward a copy of any such report to the institution concerned and shall also forward a copy with the remarks of such institution thereon, to the Federal Government. 15. Withdrawal of recognition:—(1) When upon report of the Executive Committee it appears to the Council that the courses of study and examinations to be gone through in any veterinary institution in Pakistan in order to obtain a recognized veterinary qualification or that the standard of proficiency required from candidates at any examination held for the purpose of granting such qualification or standard of research studies and facilities is not such as to secure to persons holding such qualifications the knowledge and skill requisite for the efficient practice of veterinary medicine or to contribute to the advancement of veterinary medicine, the Council shall make a representation to that effect to the Federal Government. (2) After considering such representation, the Federal Government shall forward it, alongwith such remarks as it may choose to make to the concerned institution with an intimation of period within which the institution may submit its explanation to the Federal Government. (3) On the receipt of the explanation or where no explanation is submitted within the specified period the Federal Government may after making such further inquiry, if any, as it may think fit direct that the measures necessary to bring the teaching and research upto the required standard be taken or an entry shall be made in the appropriate Schedule against the concerned institution declaring that any qualification granted by such institution after the specified date shall not be recognized. 16. Maintenance of register:—(1) The Council shall maintain in the prescribe manner a register in which shall be entered the names and other particulars of persons possessing recognized veterinary qualifications whose applications for registration as veterinarian are from time to time granted by the Council. (2) Every application for registration under this Act shall be made to the Council in the prescribed from and be accompanied by the prescribed fee. (3) Every veterinarian registered under this Act shall be entitled to receive a certificate of registration from the Council. (4) A certificate of registration issued under sub-section (3) shall, subject to the provisions of this Act, remain in force until the thirty first day of December of the year in which it is issued and shall thereafter be renewable annually upon payment of the prescribed fee. 17. Register to be public document:—The register maintained under section 16 shall be deemed to be a public record within the meaning of the Qanoon-e- Shahadat, 1984 (P.O. No. 10 of 1984). 18. Penalty for fraudulent representation or registration:—(1) Whoever will fully procures or attempts to procure himself to be registered under this Act by making or producing or causing to be made or produced any false or fraudulent representation or declaration either orally on in writing, and any person who assists him therein, shall be guilty of an offence punishable with fine which may extend to five thousand rupees or with imprisonment for a term which may extend to six months, or with both. (2) Whoever falsely pretends to be registered under this Act as a veterinary practitioner, not being registered under this Act, uses with his name or title any words or letters representing that he is so registered, irrespective of whether any person is actually deceived by such pretence or representation or not shall be guilty of an offence punishable with fine which may extend to five thousand rupees or with imprisonment for a term with may extend to six months, or with both. 19. Privileges of registered members:—(1) Notwithstanding anything to the contrary contained in any other law for the time being in force no person other than a registered veterinary practitioner shall hold any veterinary position in private or public sector. (2) Note understanding anything to the contrary contained in any other law for the time being in force, not certificate required to be obtained from a veterinary practitioner shall be valid unless in issued by a person who is registered with the Council. (3) No person shall be entitled to recover any charge in any count of law for any vetro-legal advice or attendance, or for the performance of any oration, or for any medicine prescribed or supplied unless he is a registered veterinary practitioner. 20. Responsibility of a registered person:—Every person registered under this Act shall notify any transfer of the place of his residence, employment or practice to the Council with thirty day of such transfer. 21 Prohibition against use of unregistered veterinary qualification:— No person shall use or publish with his name any title, abbreviate description or symbol, indicating or calculated to lead people to infer that possess any veterinary qualification unless the same is recognized and conferred upon him under this Act. 22. Removal of names from the register:—(1) The Council in its discretion may refuse to permit the registration of any person or direct the removal altogether or for a specified period from the register the name of any registered person who has been convicted of any such offence as implies in the opinion of the Council a defer of character, or has been held by the Council as guilty of infamous conduct in any professional respect, or who has become incapable to practice veterinary medicine by reason of physical or mental incapacity. Provided that no action shall be taken under this sub section, unless such person has been provided an opportunity of being heard. (2) The Council may direct that the name of any person removed from the register under sub- section (1) shall be restored. (3) For the purpose of an inquiry under sub-section (1) the Council shall be deemed to be a Court within the meaning of the Qanoon-e-Shahdat, 1984 (P.O. No. 10 of 1984) and shall exercise al the powers of a Civil Court for summoning the witnesses, for compelling the production of documents and for issuing commissions. 23. Power to make regulation:— The Council may, with the previous sanction of the Federal Government, make regulation generally to carry out the purposes of this Act, and without prejudice to the generality of this power such regulations may provide for:— (a) the management of the property of the Council and the maintenance and audit of its accounts; (b) the summoning and holding of the meetings of the Council, the time and places where such meeting are to be held, the conduct of the business there at and the number of members necessary to constitute a quorum; (c) the powers and duties of the President and Vice-President; (d) the mode of the appointment of the Executive Committee and other committees, the summoning and holding of the meetings, and the conduct of the business of such committees; (e) the tenure of the office and duties of the officers and servants of the Council; (f) the appointment, powers, duties and procedures of inspector; (g) the procedure of maintenance, compilation and publication of the register and, if necessary, for opening of sub-offices or branches for this purpose; (h) the procedure of inquires under this Act; (i) prescribing a uniform minimum standard courses of training for obtaining graduate and post-graduate qualifications included in the First Schedule. (j) prescribing minimum requirements for the content and duration of the courses of study as aforesaid; (k) prescribing the conditions for admission to courses of training as aforesaid; (l) prescribing minimum qualifications and experience require of teachers, researchers for appointment in professional institutions; (m) prescribing the standards of examinations, methods of conducting the examinations and other requirements to be satisfied for securing recognition of qualification under this Act; (n) prescribing the qualifications and experiences required of examiners for the examinations antecedent to the granting of recognized qualifications; (o) registration of students at any professional institution, college or any university and the fee payable in respect of such registration, and (p) any matter for which under this Act provision may be made by registration. 24. Information to be furnished by the Council and publication thereof:—(1) The Council shall furnish such reports, copies of its minutes, abstract of its accounts, and other information to the Federal Government as it may require. (2) The Federal Government may publish in such manner as it may think if any, report, copy, abstract, or other information furnished to it under this Act. 25. Commission of inquiry:— (1) Whenever it is made to appear to the Federal Government that the Council is not complying with any of the provisions of this Act, the Federal Government may refer the particulars of the complaint to a Commission of inquiry consisting of three persons of whom appointed by the Federal Government, one being a Judge of Court and the Council; and sub commission shall proceed to inquire in manner report to the Federal Government as to the charge of default or proper acting found by the Commission to have been established, the commission shall recommend the remedies, if any, which are in opinion necessary. (2) The Federal Government may require the Council to adopt the remedies so recommended within such time as, having regard to the report of the Commission, it may think fit; and if Council fails to comply with any such requirements, the Federal Government may amend the Regulations of the Council, or, make such provision or take such other steps as may seem necessary to give effect to the recommendations of the Commission. (3) A Commission of inquiry shall have power to administer oaths, enforce the attendance of witnesses and the production of documents, and shall have all such other necessary powers for the purpose of any inquiry conducted by it as are exercised by a Civil Court under the Code of Civil Procedure, 1908 (Act V of 1908). _________________ FIRST SCHEDULE (See Section 9) RECOGNIZED VETERINARY QUALIFICATION GRANTED BY THE VETERINARY INSTITUTIONS IN PAKISTAN S.# Institutions Recognized Qualification Abbrevation For Registration 1 College of Veterinary Sciences, Lahore Bachelor of Veterinary Sciences. B. V. Sc. Bachelor of Science (Animal Husbandry.) B. Sc. (A.H.) Bachelor of Veterinary Science and Bachelor of Animal Husbandry. B. Sc., B. Sc. (A.H.) Doctor of Veterinary Medicine D. V. M. Master of Science. M. Sc. Master of Science (Hons). M. Sc. (Hons). Doctor of Philosophy. Ph. D. 2 University of Agriculture, Faisalabad. (i) Faculty of Veterinary Sciences Doctor of Veterinary Medicine. D.V.M Master of Science. M. Sc. Master of Science (Hons). M. Sc. (Hons). (ii) Faculty of Animal Husbandry Bachelor of Science (Hons). Animal Husbandry. B. Sc. (Hons). A. H. Master of Science. M. Sc. Master of Science (Hons). M. Sc. (Hons). Doctor of Philosophy. Ph. D. 3 Sindh Agriculture, University, Tandojam Faculty of Animal Husbandry and Veterinary Sciences Doctor of Veterinary Medicine. D. V. M. Master of Science. M. Sc. Master of Science (Hons). M. Sc. (Hons). Doctor of Philosophy. Ph. D. 4 Quaid-e-Azam University, Islamabad. Master of Science (Hons.) M. Sc. (Hons). Master of Philosophy. M. Phil. 5 NWFP Agricultural University, Peshawar Master of Science (Hons) Animal Husbandry. M. Sc. (Hons) A. H. 6 Jinnah Post-graduate Medical Centre, Karachi Master of Philosophy. M. Phil SECOND SCHEDULE (See Section 10) RECOGNIZED VETERINARY QUALIFICATION GRANTED BY THE VETERINARY INSTITUTIONS ABROAD S.# Institutions Recognized Qualification Abbreviation For Registration 1. All state Universities of America, Australia and Provincial University Canada Doctor of Veterinary Medicine D.V.M Master of Sciences in Animal Health. MS (A.H.) Master of Animal Sciences M.S. (A.S.) Doctor of Philosophy in Animal Health. Ph.D. (A.H.) Doctor of Philosophy in Animal Sciences. Ph.D. (A.S.) 2. The College of Veterinary surgeons, London Master of Science in Animal Health. M. Sc. (A.H) Member of Royal College of Surgeon. M.R.C.V.S Fellow Royal College of Veterinary Surgeon F.R.C.V.S 3. Edinburgh University Centre of Tropical Veterinary Medicine Master of Science in Tropical Animal Health. M. Sc. (T.A.H.) Diploma in Tropical Animal Health. D.T.A.H. 4. James Cook University, Department of Tropical Veterinary Science Townsvillce, Australia. Master of Science in Tropical Veterinary Science. M. Sc. (T.V.Sc) 5. Facility of Veterinary Science University of Agriculture, UPSSALA, Sweden. Fellow Royal College of Veterinary Surgeons. M. Sc. (T.A.H) F.R.C.V.S."
}