{
  "file": "administrator0fe839ca47be25af43e93b0624d381fa.pdf",
  "law_name": "Medical And Dental Council Ordinance, 1962",
  "text": "THE UNANI, AYURVEDIC AND HOMOEOPATHIC PRACTITIONERS ACT, 1965 CONTENTS PART I PRELIMINARY 1. Short title, extent and commencement. 2. Definitions. 3. Establishment and incorporation of Councils. PART II CONSTITUTION AND FUNCTIONS OF COUNCILS CHAPTER I COMPOSITION AND PROCEEDINGS OF COUNCILS 4. Composition of the National Council for Tib. 5. Composition of the National Council for Homoeopathy. 6. The President. 7. Elections. 8. Publication of names, etc. 9. Term of office of members. 10. Vacancies not to invalidate proceedings of Council. 11. Resignation by President etc. 12. Declaration of vacancies. 13. Disqualification of members. 14. Functions of the Council. 15. Meetings of the council. 16. Officers of the Council and their pay and allowances. Updated till 3.8.2022 CHAPTER II TEACHING INSTITUTIONS AND EXAMINATIONS 17. Recognition of Institutions. 18. Maintenance of Standard of efficiency. 19. Withdrawal of recognition. 20. Duration of courses. 21. Qualifications for admission to institutions. 22. Qualifying examination. CHAPTER III REGISTRATION OF PRACTIONERS 23. Registration how made. 24. Registration of Unani, Ayurvedic Homoeopathic practitioners. 25. Registration of Unani and Ayurvedic Practitioners in Category B. 26. Registration of Homoeopathic Practitioners. 27. Listing of certain Homoeopathic. 28. Removal from register, etc. 29. Cancellation or alteration of entries in Register, etc. CHAPTER IV POWERS AND DUTIES OF REGISTRAR 30. Maintenance of register, etc. 31. Publication of List. PART III GENERAL PROVISIONS CHAPTER I RIGHT, DUTIES AND LIABILITIES OF REGISTERED PRACTITIONERS 32. Intimation of change of address. 33. Privileges of registered practitioners. 34. Privileges of listed Homoeopaths. 35. Exemption from serving on inquest etc. CHAPTER II OFFENCES, PENALTY AND PROCEDURE 36. Offences and penalties. 37. Persons not registered under Act not to practise, etc. 37A. Prohibition against calling applications, etc., by un-recognized in situations. 38. Colourable imitation of degrees. 39. Prohibition against use of title, description, etc. 40. Savings. 41. Cognizance offences, etc. CHAPTER III SUPERSESSION OF COUNCIL 42. Supersession of Council. CHAPTER IV MISCELLANEOUS 43. Fees received by Council. 44. Death of registered practitioners. 45. Indemnity. 46. Power to make rules. 47. Power to make regulations. 48. Policy issues relating to the affairs of the Council. THE UNANI, AYURVEDIC AND HOMOEOPATHIC PRACTITIONERS ACT, 1965 1ACT No. II OF 1965 [28th January, 1965] An Act to regulate the qualifications and to provide for the registration of practitioners of Unani, Ayurvedic and Homoeopathic systems of medicine. 2[WHEREAS it is expedient to promote and popularise the Unani, Ayurvedic and Homoeopathic systems of medicine, to regulate education and research in, and to provide for the registration of practitioners of, those systems of medicine;] AND WHEREAS the national interest of Pakistan in relation to the achievement of uniformity within the meaning of clause (2) of Article 131 of the Constitution requires Central legislation in the matter; It is hereby enacted as follows:⸺ PART I PRELIMINARY 1. Short title, extent and commencement.⸺(1) This Act may be called the Unani, Ayurvedic Homoeopathic Practitioners Act, 1965. (2) It extends to the whole of Pakistan. 3[(3) It shall come into force on the twenty first day of July, 1965.] 2. Definitions.⸺In this Act, unless there is anything repugnant in the subject or context,⸺ (a) “approved” means approved by the 4[Federal Government] on the recommendation of the 5[Council]; 6[(b) “Committee” means the Committee appointed by the Council; (bb) “Council” means the National Council for Tibb or, as the case may be, the National Council for Homoeopathy, established under section 3;] (c) “Homoeopathy” means the Homoeopathic system of medicine 7[including the Bio-Chemic system of medicine,] and “Homeopath” means a practitioner of Homoeopathy 7[or the Bio­Chemic system of medicine]; ________________________________________________________________________________________________________________________ 1For Statement of Objects and Reasons, see Gaz. of P., 1965, Ext., p. 52 S. 2Subs. by the Unani, Ayurvedic and Homeopathic Practitioners (Amdt.) Ordinance, 1978 (XXII of 1978), s. 2. 3Subs. and shall be deemed always to have been so subs. by Unani, Ayurvedic and Homeopathic Practitioners (Amdt.) Ordinance, 1966 (II of 1966), s. 2, for the original sub-section (3). 4Subs. by F.A.O., 1975, Art. 2 and Table, for “Central Government”. 5Subs. by the Unani, Ayurvedic and Homoeopathic Practitioners (Amdt.) Ordinance, 1982 (XXVII of 1982), s. 5 for “Board” and “Boards”. 6Subs. by the Unani, Ayurvedic and Homoeopathic Practitioners (Amdt) Ordinance (XXVII of 1982), s. 2. 7Ins. and added by the Unani, Ayurvedic and Homoeopathic Practitioners (Amdt.) Ordinance, 1978 (XXII of 1978), s.3. 1[(cc) ‘list’ means the list of Homoeopaths prepared under section 27 as that list existed immediately before the commencement of the Unani, Ayurvedic and Homoeopathic Practitioners (Amendment) Ordinance, 1978, and ‘listed’ shall be construed accordingly ; (ccc) ‘meeting’ means meeting of the 2[Council] ; (cccc) ‘misconduct’ means conduct contrary to the provisions of this Act, the rules and regulations made under this Act and the Code of Ethics adopted by the 2[Council];] (d) “prescribed” means prescribed by rules or regulations made under this Act ; (e) “President” means the President of the 2[Council] ; 1[(ee) ‘qualified’ means qualified from any approved or recognized teaching institution imparting instruction in the Unani, Ayurvedic or Homoeopathic system of medicine;] (f) “recognized” means recognized by the 3[Federal Government] for the purposes of this Act ; (g) “register” means a register of practitioners of the Unani or Ayurvedic or Homoeopathic system of medicine maintained under this Act ; (h) “registered practitioner” means a practitioner whose name is for the time being entered in a register ; (i) “Registrar” means the Registrar of the 2[Council] ; (j) “Tabib” means a practitioner of the Unani system of medicine ; (k) “Unani and Ayurvedic systems of medicine” means the Unani Tib and Ayurvedic (including the Siddha) system of medicine, whether supplemented or not by such modern advances as the 2[Council] may, from time to time, determine ; (l) “Vaid” means a practitioner of the Ayurvedic system of medicine 1[;] 1[(m) ‘Vice-President’ means Vice-President of the 2[Council].] 3. Establishment and incorporation of 2[Councils].⸺(1) As soon as may be after the commencement of this Act, the 3[Federal Government] shall, by notification in the official Gazette, establish a 4[Council to be called the National Council for Tib] and, by a like notification, 5[another Council to be called the National Council for Homoeopathy] for the purposes of this Act. _________________________________________________________________________________ 1Ins., Subs. and added by the Unani, Ayurvedic and Homoeopathic Practitioners (Amdt.) Ordinance, 1978 (XXII of 1978), s.3. 2Subs. by the Unani, Ayurvedic and Homoeopathic Practitioners (Amdt.) Ordinance, 1982 (XXVII of 1982), s. 5 for “Board” and “Boards”. 3Subs. by F.A.O., 1975, Art. 2 and Table for “Central Government”. 4Subs. by the Unani, Ayurvedic and Homoeopathic Practitioners (Amdt.) Ordinance, 1979 (LXVI of 1979), s. 3, for certain words. 5Subs. by the Unani, Ayurvedic and Homoeopathic Practitioners (Amdt) Ordinance, 1982 (XXVII of 1982), s.3. (2) Each of the two 1[Councils] shall be a body corporate, having perpetual succession and a common seal, and shall, by its name as specified in sub-section (1), sue and be sued. PART II CONSTITUTION AND FUNCTIONS OF 1[COUNCILS] CHAPTER I COMPOSITION AND PROCEEDINGS OF 1[COUNCILS] 2[4. Composition of the National Council for Tib.—(1) The National Council for Tib shall consist of the following members, namely:⸺ (a) four members, being qualified and registered practitioners of the Unani system of medicine, to be nominated by the Federal Government after consulting the Provincial Government concerned of whom one shall be from each Province ; (b) eleven qualified members, to be elected from amongst themselves by the registered practitioners of the Unani system of medicine, of whom five shall be from the Punjab, three from Sind, two from the North-West Frontier Province and one from Baluchistan ; (c) two members, to be elected from amongst themselves by the teachers of all the recognized institutions of the Unani or Ayurvedic system of medicine ; (d) one member, to be elected from amongst themselves by the registered practitioners of the Ayurvedic system of medicine ; and (e) four members, to be nominated by the Federal Government, of whom one shall be a scientist 3[from the related field], 4[and one Deputy Secretary (Budget), Ministry of Health] 3[who shall also be the Chairman of the Finance Committee]. (2) Notwithstanding anything contained in sub-section (1), for the purpose of constituting the National Council for Tib for the first time,⸺ (a) the members required to be elected under clauses (b) and (c) shall be nominated by the Federal Government from amongst the registered practitioners of the Unani system of medicine ; (b) the member required to be elected under clause (d) shall be nominated by the Federal Government from amongst the registered practitioners of the Ayurvedic system of medicine ; and (c) for the members nominated under clauses (a) and (e) the Federal Government shall nominate fresh members in accordance with the provisions of those clauses.] _________________________________________________________________________________________________________________________ 1Subs., by the Unani, Ayurvedic and Homoeopathic Practitioners (Amdt.), Ordinance, 1982, (XXVII of 1982), s. 5, for “Board” and “Boards” respectively. 2Subs. by the Unani, Ayurvedic and Homoeopathic Practitioners (Amdt.), Ordinance, 1979. (LXVI of 1979), s. 4, for section 4 which were previously subs. by Ord. 22 of 1978, s. 4, for the original sections 4 and 5. 3Ins. and added by the Unani, Ayurvedic and Homoeopathic Practitioners (Amdt), Ordinance, 2002 (LXI of 2002), s.2. 4Added by the Unani, Ayurvedic and Homoeopathic Practitioners (Amdt), Ordinance, 2002 (IV of 2002), s.2. 4[5. Composition of the 1[National Council for Homoeopathy].⸺The 1[National Council for Homoeopathy] shall consist of the following members, namely:⸺ (a) four members, being registered Homoeopaths, to be nominated by the Federal Government after consulting the Provincial Government concerned, of whom one shall be from each Province ; (b) eleven members, to be elected from amongst themselves by registered and listed Homoeopaths, of whom five shall be from the Punjab, three from Sindh, two from the North-West Frontier Province and one from Baluchistan ; (c) two members, to be elected from amongst themselves by the teachers of recongnised institutions of Homoeopathy ; and (d) four members, to be nominated by the Federal Government, of whom one shall be a scientist 2[from the related field] 3[and one Deputy Secretary (Budget), Ministry of Health] 2[who shall also be the Chairman of the Finance Committee]]. 6. The President.⸺The President 4[and Vice-President] shall be elected by the members of the Board from amongst themselves : 5[* * * * * * *] 7. Elections.⸺Elections under this Act shall be held at such time and place and in such manner as may be prescribed by rules. 8. Publication of names, etc.⸺The 6[Federal Government] shall publish in the official Gazette the names of the President 4[, the Vice-President] and other members of the 7[Council] together with the dates on which such members are elected or nominated. 9. Term of office of members.—(1) The members of the 7[Council] shall be nominated or elected, as the case may be , in such manner and for such term as may be prescribed by rules. 3[(2) Every member of the Council shall, subject to the other provisions of this Act and as may be prescribed by rules, hold office for the prescribed term and cease to hold office at the expiry thereof.] (3) Members shall be eligible for re-nomination or re-election to the 7[Council] on the expiry of the prescribed term. 3[(4) If a vacancy in the office of President, Vice-President or a member occurs during the prescribed term, through death, resignation, disability or otherwise, the vacancy shall be filled in accordance with the provisions of this Chapter.] _________________________________________________________________________________ 1Subs. by the Unani, Ayurvedic and Homoeopathic Practitioners (Amdt.), Ordinance, 1982 (XXVII of 1982), s. 4, for certain words. 2Ins. and added by the Unani, Ayurvedic and Homoeopathic Practitioners (Amdt), Ordinance, 2002 (LXI of 2002), s.3. 3Added and Subs. by by the Unani, Ayurvedic and Homoeopathic Practitioners (Amdt), Ordinance, 2002 (IV of 2002), ss.3-4. 4Subs., Ins. and Omitted by the Unani, Ayurvedic and Homoeopathic Practitioners (Amdt.), Ordinance, 1978 (XXII of 1978), ss, 4-6. 5Subs. by F.A.O., 1975, Art. 2 and Table, for “Central Government”. 6Subs. by the Unani, Ayurvedic and Homoeopathic Practitioners (Amdt.), Ordinance, 1982 (XXVII of 1982), s. 5, for “Board”. 1[(5) The election or nomination of the members of the Council shall be held at least three months prior to the expiry of the prescribed tenure of the Council and expenditure on election shall be borne by the respective Council and if, at any time, the Council ceases to exist on expiry of its prescribed tenure, all powers and functions of the Council shall, till constitution of new Council or for a period of one year, be exercised and performed by such person or authority as may be appointed by the Federal Government in this behalf, as if such person or authority were the Council.] 10. Vacancies not to invalidate proceedings of 2[Council].⸺No act or proceedings of the 2[Council] shall be invalid merely on the ground of the existence of any vacancy in or any defect in the composition of the 2[Council]. 3[11. Resignation by President etc.⸺The President, Vice-President or any member may at any time resign his office by a letter addressed to the Registrar, and such resignation shall take effect from the date it is accepted by the 2[Council]. 12. Declaration of vacancies.⸺If any member, during the term of his office,⸺ (a) absents himself, without such reason as may in the opinion of the 2[Council] be sufficient, from three consecutive ordinary meetings of the 2[Council]. or (b) becomes subject to any of the disqualifications mentioned in section 13, the 2[Council] shall declare his office vacant. 13. Disqualification of members.⸺4[(1)] No person shall be a member of the 2[Council] if⸺ (a) he is an undischarged insolvent ; (b) he has been adjudicated by a competent court to be of unsound mind ; (c) he has at any time been convicted of an offence which in the opinion of the 5[Federal Government] involves moral turpitude ; or (d) his name has been removed from the register. 4[(2) If at any time it appears to the Federal Government that any member of the Council has failed to exercise or has exceeded or abused any power conferred upon him as a member of the Council, any committee or examining body appointed under sub-section (3) of section 22, may, if satisfied that such failure, excess or abuse has adversely affected the efficient conduct of such member in achieving the objectives of this Act and after giving him an opportunity of showing cause against the action proposed to be taken, by notification in the official Gazette, disqualify him from the membership of the Council or, as the case may be, Committee or examining body.] 14. Functions of the Council.⸺The following shall be the functions of the 2[Council], namely:⸺ _________________________________________________________________________________ 1Added by the Unani, Ayurvedic and Homoeopathic Practitioners (Amdt), Ordinance, 2002 (LXI of 2002), s.4. 2Subs. by the Unani, Ayurvedic and Homoeopathic Practitioners (Amdt.), Ordinance 1982 (XXVII of 1982) s. 5 for “Board”. 3Subs. by the Unani, Ayurvedic and Homoeopathic Practitioners (Amdt), Ordinance, 1978 (XXII of 1978), s.8. 4Renumber and Added by the Unani, Ayurvedic and Homoeopathic Practitioners (Amdt), Ordinance, 2002 (IV of 2002), s.5. 5Subs. by F.A.O. 1975, Art. 2 and Table, for “Central Government”. (a) to consider applications for recognition under this Act made by institutions imparting or desiring to impart instruction in the system of medicine with which the 1[Council] is concerned ; (b) to secure the maintenance of an adequate standard of 2[education] in recognized Institutions ; (c) to make arrangements for the registration of duly qualified persons in accordance with the provisions of this Act ; 2[(cc) to appoint committees or sub-committees, each having due representation of all the Provinces, for a specific period, to perform any specified function connected with the functions of the 1[Council];] (d) to provide for research in the system of medicine with which the 1[Council] is concerned ; and (e) to do such other acts and things as it may be empowered or required to do by this Act or the rules. 15. Meetings of the Council.— (1) The 1[Council] shall meet at such time and place, and every meeting of the 1[Council] shall be summoned in such manner, as may be prescribed by regulations: Provided that, until such regulations are made, the President may summon a meeting of the 1[Council] at such time and place as he may deem expedient by notice addressed to each member. 2[(2) The President and, in his absence, the Vice-president, shall preside at every meeting of the 1[Council] and if, at any time, the Vice-president is also absent and the President has given prior permission, a member elected by the members present from amongst themselves shall preside.] (3) Except as hereinafter provided, all questions at meeting of the 1[Council] shall be decided by a majority of the votes of the members present. (4) 2[Eight] members of the 1[Council] shall form a quorum. (5) At every meeting of the 1[Council] the 2[person presiding] shall, in addition to his vote as a member of the 1[council], have a second or casting vote in case of an equality of votes. 16. Officer of the Council and their pay and allowance.—3[(1) The Council shall, with the previous approval in writing of the Federal Government, appoint a Registrar and Controller of Examination on such terms and conditions as may be determined by the Federal Government and may appoint a person to act in his place during his absence on leave. _________________________________________________________________________________ 1Subs. by the Unani, Ayurvedic and Homoeopathic Practitioners (Amdt.), Ordinance, 1982 (XXVII of 1982), s.5, for “Board”. 2Subs. and Ins. by the Unani, Ayurvedic and Homoeopathic Practitioners (Amdt.), Ordinance, 1978 (XXII of 1978), ss. 9-10. 3Subs. by the Unani, Ayurvedic and Homoeopathic Practitioners (Amdt.), Ordinance, 2002 (LXI of 2002), s.5. (2) An order of the Council appointing, punishing or removing the Registrar and Controller of Examination from office shall not take effect unless confirmed by the Federal Government in writing.] (3) The Registrar shall be Secretary to the 1[Council] and shall exercise such powers and perform such duties as may be prescribed by regulations. (4) The 1[Council] may appoint such other officers and servants on such terms and conditions as the 1[Council] may, with the previous approval in writing of the 2[Federal Government] determine. (5) The Registrar and all other officers and servants of the 1[Council] shall be deemed to be public servants within the meaning of Section 21 of the Pakistan Penal Code. CHAPTR II TEACHING INSTITUTIONS AND EXAMINATIONS 17. Recognition of institutions.—(1) Any institution imparting or desiring to impart instruction in the Unani, Ayurvedic or Homoeopathic system of medicine 3[according to the courses prescribed by rules] may apply for recognition under this Act. (2) An application for recognition shall be addressed to the Registrar of the 1[Council] Concerned 4[,shall be accompanied by the fees prescribed by rules] and shall contain full information in respect of the following matters, namely:⸺ (a) the constitution and personnel of the managing body of the institution ; (b) the subject and courses in which it imparts or proposes to impart instructions ; (c) the equipment possessed by the institution and the number of students for whom accommodation and other provision has been or is proposed to be made ; (d) the strength and particulars of its, staff their salaries, qualifications and the research work to their credit ; (e) the fees levied or proposed to be levied and the financial provision made for capital expenditure on buildings and equipment and for the continued maintenance and efficient working of the institution. (3) The Registrar shall place the application before the 1[Council], and the 1[Council] may direct the Registrar to call for any further information which it may consider necessary, and may also direct a local inquiry to be made by competent person or persons authorized by it in this behalf. (4) After considering the report of such local inquiry, if any and making such further inquiry as may appear to it to be necessary, the 1[Council] shall forward the application together with its recommendation whether the recognition asked for should or should not be granted, to the 2[Federal Government] which may, 5[after making inspection, if necessary, at its own or through the Provincial _________________________________________________________________________________ 1Subs. by the Unani, Ayurvedic and Homoeopathic Practitioners (Amdt.), Ordinance 1982 (XXVII of 1982) s. 5 for “Board”. 2Subs. by F.A.O., 1975, Art. 2 and Table, for “Central Government”. 3Ins. by the Unani, Ayurvedic and Homoeopathic Practitioners (Amdt.), Ordinance 1978 (XXII of 1978, s.11. 4Ins. by the Unani, Ayurvedic and Homoeopathic Practitioners (Amdt.), Act, 1968 (X of 1968), s. 2. 5Ins. by the Unani, Ayurvedic and Homoeopathic Practitioners (Amdt.), Act, 2002 (IV of 2002), s. 6. Government concerned,] by order, grant or refuse to grant recognition and the grant of recognition may be subject to such terms and conditions, if any, as may be specified in the order. 18. Maintenance of standard of efficiency.—(1) It shall be the duty of the 1[Council] to secure the maintenance of an adequate standard of efficiency in recognized institutions. (2) For the purpose of securing such standard, the 1[Council] may— (a) from time to time call upon any recognized institution to furnish such particulars as the 1[Council] may require of any course of study provided or examination conducted by such institution, and (b) appoint inspectors from amongst the registered practitioners to attend and be present at all or any of the examinations conducted by such institution prior to the qualifying examination. (3) The inspectors shall not interfere with the conduct of any examination, and their duty shall be to report to the 1[Council] their opinion as to the sufficiency or otherwise of every examination which they attend, and any other matter in relation to such examination on which the 1[Council] may require them to report. (4) The 1[Council] shall arrange periodical inspection of recognized institutions and supervision of the examinations conducted by such institutions, through inspectors to be appointed by the 1[Council], and shall pay such salaries and allowances and traveling expenses to the inspectors as may be approved by the 2[Federal Government]. 19. Withdrawal of recognition.—(1) The 1[Council] when it thinks fit may, and when required to do so by the 2[Federal Government] shall, make an enquiry whether any recognized institution should cease to be a recognized institution. (2) If, on making such an enquiry, and after considering all such information and reports as are referred to in the preceding section and making such further inquiry as may appear to it to be necessary, the 1[Council] is satisfied that the 3[education] provided or the examinations conducted by a recognized institution are not such as to secure and adequate standard of efficiency for the practice of the system of medicine taught in the institution, it shall submit a report to the 2[Federal Government] with its recommendation stating the reasons therefor that the recognition of the institution should be withdrawn and the 2[Federal Government] may, on receipt of such report, make an order to be published in the official Gazette, withdrawing the recognition of the institution: Provided that no order under this sub-section shall be made unless the institution concerned has been given an opportunity to raise, within a specified time, the standard of the 3[education] and examination to the satisfaction of the 2[Federal Government] and the institution has, in the opinion of the 2[Federal Government], failed to do so. 20. Duration of courses.—(1) The duration of the course in recognized institutions of Unani _________________________________________________________________________________ 1Subs. by the Unani, Ayurvedic and Homoeopathic Practitioners (Amdt.), Ordinance, 1982 (XXVII of 1982), s. 5, for “Board”. 2Subs. by F.A.O., 1975, Art. 2 and Table, for “Central Government”. 3Subs. by the Unani, Ayurvedic and Homoeopathic Practitioners (Amdt.), Ordinance, 1978 (XXII of 1978), s. 12. or Ayurvedic System of Medicine shall be four years and the course shall include the subjects prescribed by regulations. (2) The duration of diploma course in recognized institutions of Homoeopathy shall be four years and the course shall include the subjects prescribed by regulations. 1[21. Qualifications for admission to institutions.⸺(1) The minimum qualifications required for admission to a recognized institutions of Unani or Ayurvedic System of medicine shall be matriculation with science or equivalent examination of any university or education board in Pakistan established by or under any law for the time being in force. (2) The minimum qualifications required for admission to a recognized institution of homoeopathy shall be intermediate with science (F.Sc. Pre-medical) or equivalent examination of any university or education board in Pakistan established by or under any law for the time being in force, but those with bachelor or higher qualification with science shall be entertained.] 22. Qualifying examination.—(1) A qualifying examination shall be held at least once in every year for the purpose of granting a diploma conferring the right of registration under this Act. (2) The examination shall be held on the subjects prescribed by regulations and the right of appearing at the examination shall be restricted to candidates who have undergone a course of study in such subjects in the prescribed manner at a recognized institution. 2[(3) The examination shall be held under the control of an examining body to be appointed by the Federal Government after consulting the Council. (4) The Chairperson of the examination body shall be appointed by the Federal Government.] ____________________ _________________________________________________________________________________ 1Subs. by the Unani, Ayurvedic and Homoeopathic Practitioners (Amendment) Act, 2021 (LI of 2021), s. 2. 2Subs. by the Unani, Ayurvedic and Homoeopathic Practitioners (Amendment) Act, 2002 (LXI of 2002), s. 7. CHAPTER III REGISTRATION OF PRACTITIONERS 23. Registration how made.⸺1[(1) * * * * * * * (2) * * * * * * *] (3) Applications for registration under this Act shall be made in such form and on payment of such fee as may be prescribed by rules. (4) The 1[Council] shall examine the applications received under this section and after making such enquiries as it thinks fit regarding the qualifications 1[* * * * * * *] of the applicants and their professional efficiency direct the entry of the names to be made in the register in accordance with the Provisions of this Act. 1[24. Registration of Unani, Ayurvedic and Homoeopathic Practitioners.—(1) Every person who passes the qualifying examination in the Unani, Ayurvedic or Homoeopathic System of medicine from a recognized institution may apply for registration in the respective register. (2) Every person who is a registered medical practitioner within the meaning of the 4[Medical and Dental Council Ordinance, 1962 (XXXII of 1962)], and has taken to the practice of Homoeopathy may apply for registration as Homoeopath.] 3[(3) Notwithstanding anything contained in sub-sections (1) and (2), the Federal Government may, if it deems fit after consulting the Council, direct that a degree or diploma in the Unani, Ayurvedic or Homoeopathic System of medicine, as the case may be, granted by any institution in or outside Pakistan shall be recognized on such conditions as it may, by notification in the official Gazette, specify.] 1[25. * * * * * * * 26. * * * * * * * 27. * * * * * * *] 28. Removal from register, etc.—The 2[Council] may direct that the name of any practitioner who has been convicted of a cognizable offence or who after due enquiry has been found guilty of misconduct shall be removed from the register or the list 1[* * * *] if the offence or misconduct in the _________________________________________________________________________________ 1Omitted and subs. by the Unani, Ayurvedic and Homoeopathic Practitioners (Amdt.), Ordinance, 1978 (XXII of 1978), ss.14-17. 2Subs. by the Unani, Ayurvedic and Homoeopathic Practitioners (Amdt.), Ordinance, 1982 (XXVII of 1982), s. 5, for “Board”. 3Added. by the Unani, Ayurvedic and Homoeopathic Practitioners (Amdt.), Ordinance, 2002 (IV of 2002), s. 7. opinion of the 1[Council] discloses moral turpitude such as to render him unfit to practice his profession: Provided, however, that no action shall be taken by the 1[Council] under this section unless the person convicted of the cognizable offence or found guilty of misconduct has been given a reasonable opportunity to show cause against the punishment proposed to be inflicted on him. 29. Cancellation or alteration of entries in register, etc.—The 1[Council] may on its own motion or on information received from any person and after due enquiry and giving an opportunity to the person concerned of being heard cancel or alter any entry in the register or the list 2[* * * *] if in the opinion of the 1[Council] the entry was made fraudulently or improperly. CHAPTER IV POWERS AND DUTIES OF REGISTRAR 30. Maintenance of register, etc.—(1) Subject to any general or special orders of the 1[Council] it shall be the duty of the Registrar to keep the register and the list 2[* * * *] and to attend the meetings of the 1[Council]. (2) The register and the list shall contain the name, residence and qualifications of every practitioner registered or listed under this Act, and the dates on which the qualifications were acquired. (3) The Registrar shall keep the register and the list correct and up-to-date and shall, from time to time, enter therein any alteration in the address and qualifications of the practitioners, and remove there from the names of the practitioners who die or whose names are directed to be removed in accordance with the provisions of this Act. (4) The 3[Federal Government] may by rules prescribe any additional fee for any alteration in the register due to additional qualifications. (5) If the Registrar has reason to believe that any registered practitioner or a person whose name is entered in the list 2[* * * *] has ceased to practice or has changed his permanent address without due intimation to him, he may write by registered post to such practitioner at the address as entered in the register to enquire whether he has ceased to practice or has changed his residence and, if within six months no reply is received, the Registrar may remove the name of such practitioner from the register: Provided that the 1[Council] may, at any time on the application of the practitioner whose name is removed under this sub-section, order that the name of such practitioner be re-entered in the register. 31. Publication of List.—(1) The Registrar shall, in every 2[fourth] year, on or before a date to be fixed by the 1[Council] cause to be published a correct list of the names and qualifications of all practitioners for the time being entered in the register 2[or the list] and the dates when such qualifications were acquired. _________________________________________________________________________________ 1Subs.by the Unani, Ayurvedic and Homoeopathic Practitioners (Amdt.), Ordinance, 1982 (XXVII of 1982) s. 5, for “Board” 2Omitted and Subs. by the Unani, Ayurvedic and Homoeopathic Practitioners (Amdt.), Ordinance, 1978 (XXII of 1978), ss 18-20. 3Subs. by F.A.O., 1975, Art. 2 and Table, for “Central Government”. (2) It shall be presumed that any person entered in such list is a registered practitioner and that any person not so entered is not a registered practitioner. PART III GENERAL PROVISIONS CHAPTER I RIGHT, DUTIES AND LIABILITIES OF REGISTERED PRACTITIONERS 32. Intimation of change of address.—Every registered practitioner shall inform the Registrar of any change in his permanent address. 33. Privileges of registered practitioners.—(1) Notwithstanding any thing, contained in any law for the time being in force, every 1[registered or listed practitioner] shall be entitled⸺ (a) to hold any appointment as physician or medical officer in any Unani, Ayurvedic or, as the case may be, Homoeopathic dispensary, hospital, infirmary or lying-in hospital if such dispensary, hospital, infirmary or laying-in hospital is supported by or receives a grant from Government or any local authority and treats patients according to the relevant system of medicine, or in any public establishment, body or institution practicing such system; (b) to vote for the election of members to the 2[Council]; (c) to recover fees through courts. (2) No 1[registered or listed practitioner] shall stock, use or sell any drugs or medicines except such as are included in the Unani, Ayurvedic or, as the case may be, Homoeopathic Pharmacopoeia approved by the 3[Federal Government]. (3) A practitioner registered under section 25 shall be entitled to the privileges specified in clauses (b) and (c) of sub-section (1) and be subject to the restriction mentioned in sub-section (2). 1[(4) A registered or listed practitioner shall abide by the Code of Ethics framed by the 2[Council] with the approval of the Federal Government.] 1[34. * * * * * * * 35. * * * * * * *] _________________________________________________________________________________ 1Subs., added and omitted by the Unani, Ayurvedic and Homoeopathic Practitioners (Amdt.), Ordinance, 1978 (XXII of 1978), ss 21-22. 2Subs. by the Unani, Ayurvedic and Homoeopathic Practitioners (Amdt.), Ordinance, 1982 (XXVII of 1982), s. 5, for “Board”. 3Subs. by F.A.O., 1975, Art. 2 and Table, for “Central Government”. CHAPTER-II OFFENCES, PENALITY AND PROCEDURE 1[36. Offences and penalties.— Whoever contravenes the provisions of sub-section (2) of section 33 shall be punishable with imprisonment for a term which may extend to seven years, or with fine which may extend to one lac rupees, or with both.] 37. Persons not registered under Act not to practice etc.—(1) No person other than a 1[registered or listed practitioner] shall practise or hold himself out, whether directly or by implication, as practicing the Unani, Ayurvedic or, as the case may be , Homoeopathic system of medicine. (2) No Tabib, Vaid or Homoeopath shall⸺ (a) sign or authenticate a birth certificate 1[or death certificate] required by any law or rule to be signed or authenticated by a duly qualified medical practitioner; or (b) sign or authenticate a medical or physical fitness certificate 1[or death certificate] required by any law or rule to be signed or authenticated by a duly qualified medical practitioner. 1[(2A) No Homoeopath shall practise surgery.] (3) Whoever contravenes the provisions of this section, shall be punishable with imprisonment for a term which may extend to one year, or with fine which may extend to one thousand rupees, or with both. 1[37A. Prohibition against calling applications, etc., by un-recognised institutions.—(1) No institution which is not recognized under section 17 shall call applications, advertise or arrange for admission to such institution for imparting education in the Unani, Ayurvedic or Homoeopathic system of medicine; nor shall such institution advertise or conduct any correspondence course in any such system of medicine. (2) Whoever contravenes the provisions of sub-section (1) shall be punishable with imprisonment for a term which may extend to seven years, or with fine which may extend to one lac rupees, or with both.] 38. Colourable imitation of degrees.—(1) No person other than a body or institution authorized under this Act shall confer, grant or issue or hold out as entitled to confer, grant or issue a degree, diploma or licence which purports to entitle the holder to practise the Unani, Ayurvedic or Homoeopathic system of medicine, or which is identical with or is a colourable imtimation of any degree, diploma or licence granted by a body or institution so authorized. (2) Whoever contravenes the provisions of this section shall be punishable with fine which may extend to one thousand rupees, and if the person so contravening is an association, every member of such association who knowingly or willfully authorises or permits the contravention shall be punishable with fine which may extend to one thousand rupees. _________________________________________________________________________________ 1Subs. and Ins. by the Unani, Ayurvedic and Homoeopathic Practitioners (Amdt.), Ordinance, 1978 (XXII of 1978), ss 23-25. 39. Prohibition against use of title, description, etc.—(1) No person shall add to his name, title or description any letters or abbreviations which imply or are calculated to the belief that he holds a degree, diploma, licence or certificate as his qualification to practise the Unani, Ayurvedic or Homoeopathic system of medicine, unless he holds such degree, diploma, licence or certificate and such degree, diploma, licence or certificate.⸺ (i) is recognized by any law for the time being in force in Pakistan or in any part thereof; or (ii) has been conferred, granted or issued by a body or institution authorized under this Act in this behalf; or (iii) has been conferred, granted or issued by an authority empowered or recognized as competent by the 2[Federal Government] or the Provincial Government to confer, grant or issue such degree, diploma, licence or certificate. (2) Notwithstanding anything contained in any other law for the time being in force, no Tabib or Vaid shall describe himself as a Doctor but a Homoeopath may use the expression “Homoeopathic Doctor” both the words “Homoeopathic” and “Doctor” having equal prominence. (3) Whoever contravenes the provisions of this section shall be punishable with imprisonment for a term which 1[shall not be less than one year nor more than five years and also with fine which may extend to twenty thousand rupees]. 40. Savings.—Nothing in this Chapter shall apply to any person⸺ (a) who limits his practice to dentistry ; or (b) who being a nurse, midwife or health visitor and registered as such under any law for the time being in force, or a dai, attends on a case of labour ; or (c) who being a technical assistant like Jarrah or Kuhal attends on a case under the direction and personal guidance of a registered practitioner of the Unani system of medicine. 41. Cognizance of offences, etc.—(1) No court shall take cognizance of any offence under this Act except on a complaint in writing by an officer empowered in this behalf by the 1[*] Government. (2) 1[Except as provided in section 36, no] court other than that of a Magistrate of the first class shall try an offence under this Act. CHAPTER III SUPERSESSION OF 3[COUNCIL] 42. Supersession of Council.—1[(1) If at any time it appears to the Federal Government that ______________________________________________________________________________ 1Subs. and omitted by the Unani, Ayurvedic and Homoeopathic Practitioners (Amdt.), Ordinance, 1978 (XXII of 1978). ss 26-28. 2Subs. by F.A.O. 1975, Art. 2 and Table for “Central Government”. 3Subs. by the Unani, Ayurvedic and Homoeopathic Practitioners (Amdt.), Ordinance, 1982 (XXVII of 1982). S. 5, for “Board”. the 1[Council] has failed to exercise or has exceeded or abused any of the powers conferred upon it by or under this Act, the Federal Government may, if it is satisfied that such failure, excess or abuse has adversely affected the efficient conduct of the affairs of the 1[Council] or the achievement of the objects of this Act, by notification in the official Gazette, supersede the 1[Council] for a period of one year and may, by a like notification, extend the period of supersession for a further period of one year : Provided that no 1[Council] shall be superseded unless a reasonable opportunity has been given to it to show cause against the supersession]. (2) Upon the supersession of the 1[Council] under sub-section (1)⸺ (a) the persons holding office as President 2[, Vice-President] and members of the 1[Council] shall cease to hold office ; and (b) all powers and functions of the 1[Council] shall, during the period of supersession, be exercised and performed by such person or authority as the 3[Federal Government] may appoint in this behalf, as if such person or authority were the 1[Council]. (3) The 1[Council] shall be reconstituted in accordance with the provisions of this Act for the exercise and performance of its powers and functions on the expiry of the period specified in the notification under sub-section (1). CHAPTER-IV MISCELLANEOUS 43. Fees received by Council.—4[(1)] All moneys received by the 1[Council] as fees shall be applied for the purpose of the 1[Council] in accordance with the rules made under this Act. 4[(2) The accounts of the Council shall be maintained in such form and manner as the Auditor-General of Pakistan may prescribe. (3) The accounts of the Council shall be audited by one or more auditors appointed by the Federal Government in consultation with Auditor-General of Pakistan.] 2[44. Death of registered practitioners.—For the purpose of securing information relating to the death of a registered or listed practitioner, the 1[Council] may appoint an honorary. Registrar of Deaths in each district and regulate his functions and terms of appointment.] 45. Indemnity.—No suit, prosecution or other legal proceeding shall be instituted against any person for anything which is in good faith done or intended to be done under this Act or the rules or regulations made thereunder. 46. Power to make rules.—(1) The 3[Federal Government] may, after consulting the 1[Council], by notification in the official Gazette, make rules5 to carry out the purposes of this Act. (2) In particular and without prejudice to the generality of the foregoing power, such rules may provide for all or any of the following matters, namely:⸺ (a) the time and place at which and the manner in which elections shall be held ; (b) the manner in which vacancies shall be filled ; _________________________________________________________________________________ 1Subs. by the Unani, Ayurvedic and Homoeopathic Practitioners (Amdt.), Ordinance, 1982 (XXVII of 1982), s. 5, for “Board”. 2Ins. and subs. by the Unani, Ayurvedic and Homoeopathic Practitioners (Amdt.), Ordinance, 1978 (XXII of 1978) ss 28-29. 3Subs. by F.A.O., 1975, Art. 2 nad Table, for “Central Government”. 4Numbered and added by the Unani, Ayurvedic and Homoeopathic Practitioners (Amdt.), Ordinance, 2002 (LXI of 2002), s. 8. 5For such rules, see Gaz. of p., 1965, EXT., pp. 1445-1450. (c) the form of the list and register and the particulars to be entered therein ; (d) fees chargeable for the registration, alteration in the register regarding additional qualifications and alteration of other entries in the register ; 1[(e) fees chargeable from institutions applying for recognition under this Act ; (f) the registration with the 2[Council] concerned of students admitted to recognised institutions and the fees chargeable for such registration ; (g) fees chargeable for admission to examinations or tests held under any provision of this Act ; (h) the purposes for which the fees received by the 2[Council] shall be applied5[; and]] 5[(i) fee chargeable for renewal of registration.] 47. Power to make regulations.—The 2[Council] may, with the previous approval in writing of the 3[Federal Government], make regulations not inconsistent with this Act or the rules made thereunder for the following matters, namely :― (a) courses of study for training and qualifying examinations ; (b) languages in which examinations shall be conducted and instruction given ; (c) admission of students to recognized institutions ; (d) the conditions under which candidates shall be admitted to different courses and the qualifying and other examinations ; (e) the conditions of appointment of examiners and the conduct of examinations ; (f) the conditions for the appointment of teachers in recognized institutions 4[and the qualifications of the principals and teachers thereof] ; (g) the requirements for the recognition of teaching institutions ; (h) the time and place at which the 2[Council] shall hold its meetings ; (i) such other matters as may be necessary for the exercise of powers and performance of functions to be exercised or performed by the 2[Council] under this Act and the rules made thereunder. 6[48. Policy issues relating to the affairs of the Council.⸺In the discharge of its function, the Council shall be guided on questions of policy by the instructions, if any, as may be given to it, from time to time, by the Federal Government which shall be the sole judge as to whether a question is a question of policy.] _________________________________________________________________________________ 1Subs. by the Unani, Ayurvedic and Homoeopathic Practitioners (Amdt.), Act, 1968 (X of 1968) s. 3. 2Subs. by the Unani, Ayurvedic and Homoeopathic Practitioners (Amdt.), Ordinance, 1982 (XXVII of 1982), s. 5. for “Board”. 3Subs. by F.A.O., 1975, Art. 2 and Table, for “Central Government”. 4Added by the Unani, Ayurvedic and Homoeopathic Practitioners (Amdt.), Ordinance, 1978 (XXII of 1978), s. 30. 5Subs. by the Unani, Ayurvedic and Homoeopathic Practitioners (Amdt.), Act, 2002 (IV of 2002) s. 8. 6Added by the Unani, Ayurvedic and Homoeopathic Practitioners (Amdt.), Act, 2002 (LXI of 2002) s. 9."
}