{
  "file": "administrator7feb7421871aba03b75c6173a638b2a7.pdf",
  "law_name": "Substituted By The Repealing And Amending Ordinance, 1961",
  "text": "THE MEDICAL QUALIFICATIONS (INFORMATION) ORDINANCE, 1960 CONTENTS 1. Short title, extent and commencement 2. Definition 3. Liability to furnish information 4. Period within which to furnish information 5. Penalty and procedure THE FIRST SCHEDULE THE SECOND SCHEDULE THE MEDICAL QUALIFICATIONS (INFORMATION) ORDINANCE, 1960. ORDINANCE NO. IV OF 1960 [23rd February, 1960] An Ordinance to provide for the furnishing of certain information by persons qualified in certain branches of medicine. WHEREAS it is expedient to provide for the furnishing of certain information by persons qualified in certain branches of medicine ; Now, THEREFORE, in pursuance of the Proclamation of the seventh day of October, 1958, and in exercise of all powers enabling him in that behalf, the President is pleased to make and promulgate the following Ordinance :___ 1. Short title, extent and commencement.___(1) This Ordinance may be called the Medical Qualifications (Information) Ordinance, 1960. (2) It extends to the whole of Pakistan. (3) It shall come into force at once. 1[2. Definition.___In this Ordinance, “Director-General” means the Director of Health Services of the Province.] 3. Liability to furnish information.___All persons residing in Pakistan, of whatever nationality, and falling within any of the Categories specified in the First Schedule, whether in the employment of Government or not, shall furnish information to the Director-General in the Form given in the Second Schedule. 4. Period within which to furnish information.___ (1) The information required by section 3 shall be furnished by the person concerned so as to reach the Director-General within one month from the date of the promulgation of this Ordinance, or within such further period as the Director- General may, in special circumstances, allow. (2) Persons who first qualify or add to their basic qualifications after the promulgation of this Ordinance shall furnish the information in respect thereof to the Director-General within one month of their first qualifying, or, as the case may be, adding to their basic qualifications, or within such further period as the Director-General may, in special circumstances, allow. 5. Penalty and procedure.___(1) Any person who, without sufficient cause, fails to furnish the information required under this Ordinance shall be punishable with imprisonment for a term which may extend to one month, or with fine which may extend to one thousand rupees, or with both. (2) No Court shall take cognizance of an offence punishable under this Ordinance save on a complaint in writing made by or under the authority of the Director-General. 1Subs. by Central Adaptation of Laws Order, 1964 (President’s Order No. 1 of 1964), Art. 2 and Sch. THE FIRST SCHEDULE (See section 3) CATEGORIES (1) Persons holding qualifications in allopathic medicine ; (2) Qualified Dentists ; (3) Nurses, Nursing Orderlies ; (4) Health Visitors, Midwives and Assistant Midwives ; (5) Sanitary Inspectors, Malaria Inspectors, Health Assistants ; (6) Dispensers, Compounders, Pharmacists ; (7) Physiotherapists, Masseurs, Physio-therapy technicians ; (8) X-ray and hospital laboratory technician, and medical instrument repair technicians. THE SECOND SCHEDULE (See section 3) FORM [Vide section 3. 1[Medical Qualifications (Information) Ordinance, 1960]] 1. Name in full (in block letters) : 2. Father’s Name : 3. Home Address : 4. Present Address : 5. Age with year of birth : 6. Religion : 7. Male or Female : 8. Marital status : 9. Nationality (If not Pakistani, please state length of residence) : 10. Educational Qualifications : 11. Professional Basic Qualifications : 1Subs. and shall be deemed always to have been so Substituted by the Repealing and Amending Ordinance, 1961 (I of 1961), s. 3 and 2nd Sch. (1) (2) (3) (4) (5) 12. Professional Post-Graduate Qualifications (with year and place of qualification) : (1) (2) (3) 13. Speciality, if any : Physician. Surgeon. Bacteriologist. Pathologist. Radiologist, etc., etc. 14. Occupational Record : (a) If in employment. Authority under Pay Date of Date of Whom employed. Joining. leaving. (b) If not in employment. The information recorded above is correct to the best of my knowledge. Date………………….19. Signature……………………… ___________ RGN Date: 11-09-2024"
}