{
  "file": "administrator89ec1aed8993dc7500a42674b8433a47.pdf",
  "law_name": "THE LAND CONTROL (KARACHI DIVISION) ACT, 1952 CONTENTS",
  "text": "THE LAND CONTROL (KARACHI DIVISION) ACT, 1952 CONTENTS 1. Short title, extent and commencement 2. Definitions 3. Declaration of controlled area 4. Plans of controlled area to be deposited at certain offices 5. Restriction on building etc., in a controlled area 6. Application for permission to build etc., and the grant or refusal of such permission 7. Power of removal of un authorized building 8. Power of removal of building under construction 9. Eviction of occupier 10. Removal of building 11. Eviction of persons in unauthorized or wrongful occupation or possession 12. Entry into premises 13. Penalty 14. Power to try summarily 15. Cognizance of offence 16. Bar to jurisdiction of Civil Courts 17. Appeal 18. Authorised Officer to be deemed a public servant 19. Indemnity 20. Power to make rules 21. Effect of other laws 22. Cost of removal to be recoverable as an arrear of land revenue 23. Penalty not to prejudice other action under this Act 24. Repeal THE LAND CONTROL (KARACHI DIVISION) ACT, 1952 ACT No. XI of 1952 [15th April, 1952] An Act to make provision for the prevention of unauthorised occupation of certain lands in the 1[Karachi Division] and unauthorised building thereon, and for eviction therefrom WHEREAS it is expedient to make provision for the prevention of the unauthorised occupation of lands in the 1[Karachi Division] and of unauthorised building on the same, and for eviction from such lands and buildings; It is hereby enacted as follows:___ 1. Short title, extent and commencement___(1) This Act may be called the Land Control 1[Karachi Division] Act, 1952. (2) It extends to the 1[Karachi Division]. (3) It shall come into force at once. 2. Definitions.___ In this Act, unless there is anything repugnant in the subject or context,___ 2[* * * * * * *] (ii) “Authorised Officer” means an officer in the service of the Government or a local authority appointed by the 2[Commissioner], by notification in the official Gazette, to exercise in any controlled area all or any of the functions of an Authorised Officer under this Act; (iii) “building” includes any structure of any kind temporary or permanent, whether used or intended to be used for the purpose of human habitation or otherwise; 3[(iiia) “Commissioner” means the Commissioner of the Karachi Division;] (iv) “controlled area” means an area declared to be a controlled area under section 3 of the Act; (v) “owner” in relation to a building includes the person at whose expense such building is constructed and who has the right to transfer the same, and includes his heirs, assigns and legal representatives; (vi) “prescribed” means prescribed by rules made under this Act; 1Subs. by A. O., 1964, Art. 2 and Sch. 2Omitted and subs. by A.O., 1964, Art. 2 and Sch. 3Ins. by A.O., 1964, Art. 2 and Sch. (vii) “unauthorised building” means a building declared by the Authorised Officer or the 1[Commissioner] to be unauthorised; (viii) the expression “erect or re-erect” in relation to any building includes___ (a) any material alteration or enlargement; (b) the conversion by a structural alteration of a building not originally constructed for human habitation into a place intended for human habitation; (c) the conversion of one or more places of human habitation into a greater number of such places; (d) an alteration of the drainage or the sanitary system, or any alteration materially affecting the building’s safety; (e) the addition of any rooms, buildings, outhouses or other structures; and (f) the construction, in a wall adjoining any street or land not belonging to the owner of the wall, of a door opening on to such street or land; (ix) the word “removal” shall be construed, where necessary, as including references to levelling or filling the ground in after removal; (x) the expression “to serve notice” shall be construed, where necessary, as including the serving of such a notice on a group of persons living in any locality by publishing it in local newspapers. 3. Declaration of controlled area.___(1) The 2[Provincial Government] may, by notification in the official Gazette, declare any area to be a controlled area for the purposes of this Act. (2) In every such notification the boundaries and brief description of the area and the name of the Authorised Officer appointed for the area shall be specified. (3) The Authorised Officer shall publish every such notification or the substance thereof (a) in at least two local newspapers and (b) in such manner as he thinks fit at his office and in every ward or revenue estate of which part is included within the controlled area. 4. Plans of controlled area to be deposited at certain offices.___(1) The Authorised Officer shall deposit at his office and at such other places as he considers necessary plans showing all lands declared to be controlled areas. (2) The plans so deposited shall be open to free public inspection at all reasonable times. 1Subs. ibid. 2Subs. by A.O., 1964, Art.2 and Sch. 5. Restriction on building etc., in a controlled area.___ Notwithstanding anything to the contrary in any other law for the time being in force, or in agreement, no person shall erect or re-erect any building, or make or extend any excavation, in a controlled area except with the previous permission of the Authorised Officer in writing. 6. Application for permission to build etc., and the grant or refusal of such permission.___ (1) Notwithstanding anything to the contrary in any other law for the time being in force, or in any agreement, every person requiring the permission referred to in section 5 shall make an application in writing to the Authorised Officer on payment of such fee in such manner and form and containing such information in respect of the building to which the application relates as may be prescribed. (2) On receipt of such application the Authorised Officer, after making such enquiry as he considers necessary, shall, by order in writing, either___ (a) grant the permission, subject to such conditions, if any, as may be specified in the order; or (b) refuse it. (3) Any permission granted under sub-section (2) shall be liable to cancellation by the Authorised Officer for breach of any of the terms or conditions under which such permission was granted. 7. Power of removal of un authorized building. ___ The Authorised Officer may, by a notice served in the prescribed manner, direct the owner of an unauthorised building erected prior to the date of coming into force of this Act to remove the same within the period mentioned in the notice or within such further period as may be granted by the Authorised Officer. 8. Power of removal of building under construction.___ The Authorised Officer may, by a notice served in the prescribed manner, direct the owner of a building the construction whereof is in progress on the date of the commencement of this Act not to proceed with the construction and to remove such building within the period mentioned in the notice or within such further period as may be granted by the Authorised Officer, and the owner thereof shall remove the same within the period aforesaid. 9. Eviction of occupier.___(1) Simultaneously with the issue of a notice to be served on the owner of a building under section 7 or under section 8, the Authorised Officer shall issue a notice to be served upon the occupier thereof, if the occupier himself is not the owner, to vacate such building within the period mentioned therein or within such further period as may be granted by the Authorised Officer. (2) If the occupier does not vacate the building within the aforesaid period in compliance with a notice issued under sub-section (1) he shall, notwithstanding anything contained in any other law for the time being in force, be liable to be summarily evicted therefrom by the Authorised Officer and the Authorised Officer may, in effecting such eviction, use such force as he deems necessary. 10. Removal of building. ___If any person fails to comply with any direction for the removal of any building given to him under section 7 or section 8 within the period fixed therefor, the Authorised Officer may cause the unauthorised building or the building under construction, as the case may be, to be removed at the owner’s expense. 11. Eviction of persons in unauthorized or wrongful occupation or possession.___(1) The Authorised Officer may, by a notice served in the prescribed manner, direct any person unauthorisedly occupying or wrongfully in possession of any land or building in the controlled area to vacate such land or building within the period mentioned therein or within such further period as may be granted by the Authorised Officer. (2) If the person does not, in pursuance of a notice issued under sub-section (1), vacate the land or building within the aforesaid period, he shall, notwithstanding any provision to the contrary in any law for the time being in force, be liable to be summarily evicted therefrom by the Authorised Officer, and the Authorised Officer may, in effecting such eviction, use such force as he deems necessary. 12. Entry into premises.___(1) For carrying out the purposes of this Act, Authorised Officer or any person empowered by him in writing in this behalf may, after giving reasonable notice to the occupier of any premises, enter upon such premises at any time. (2) The owner of any building shall, on being required to do so by an Authorised Officer or any person empowered by the Authorised Officer in writing in this behalf, produce any permission granted under section 5 and any documents of title relating to the land on which the building is in progress. 13. Penalty. ___Whoever commits any offence by___ (a) contravening the provision of section 5, or (b) failing to comply with any direction given to him by an Authorised Officer under section 7, section 8, or under sub-section (1) of section 11, shall be punishable with a fine which may extend to one thousand rupees or, in default, with simple imprisonment which may extend to six months. 14. Power to try summarily. ___Any magistrate for the time being empowered to try in a summary way the offences specified in sub-section (1) of section 260 of the Code of Criminal Procedure, 1898 (V of 1898), may if he thinks fit, on application in this behalf by the prosecution, try any offence referred to in 1[section 13] of this Act in accordance with the provision of sub-section (1) of sections 262 to 265 of that Code. 15. Cognizance of offence. ___ No court shall take cognizance of any offence punishable under this Act except with the previous sanction in writing of the Administrator. 16. Bar to jurisdiction of Civil Courts. ___Every order of an Authorised Officer under section 5, 6, 7, 8, 9 or 11, shall, subject to the provision of 1[section 17], be final, and shall not be called in question in any Civil Court. 17. Appeal. ___An appeal, if presented within fifteen days from the date of the order appealed against, shall lie to the 2[Commissioner] against every order made by an Authorised Officer, under section 5, 6, 7, 8, 9 or 11 and the decision of the 2[Commissioner] on such appeal shall be final and shall not be called in question in any Civil Court. When an appeal has been presented to the Administrator, he may make such orders pending the disposal of the appeal as he may think fit. 1Subs. by the Land Control (Capital of the Federation) (Amdt.) Act No. XXXIV of 1952, s. 2. 2Subs. by A.O., 1964, Art. 2 and Sch. 18. Authorised Officer to be deemed a public servant. ___An Authorised Officer or any person empowered to perform any function under this Act shall be deemed to be a public servant within the meaning of section 21 of the Pakistan Penal Code (XLV of 1860). 19. Indemnity.___No suit, prosecution or legal proceeding shall lie against the 1[Commissioner] or against any person in respect of anything which is, in good faith, done or intended to be done under this Act. 20. Power to make rules. ___The 2[Provincial Government] may make rules3 for carrying out the purposes of this Act. 21. Effect of other laws. ___The provisions of this Act shall have effect notwithstanding anything to the contrary in any other law for the time being in force. 22. Cost of removal to be recoverable as an arrear of land revenue. ___Where under this Act anything is to be done at the expense of any person the expense of doing the same shall be recoverable from him as an arrear of land revenue. 23. Penalty not to prejudice other action under this Act. ___The imposition of a penalty under 4[section 13] shall not prejudice or be prejudiced by the taking of any action under any other provision of this Act. 24. Repeal. ___The Land Control (Capital of the Federation) Ordinance, 1952, is hereby repealed, and every appointment, order and rule made or issued thereunder and in force immediately before the commencement of this Act shall, so far it is not inconsistent with the provisions of this Act, be deemed to have been respectively made or issued under the provisions of this Act and continue in force accordingly. ________________ RI - Date: 13-05-2024 1Subs. by A.O., 1964, Art. 2 and Sch. 2Subs. ibid. 3For the Land Control (Capital of the Federation ) Rules, 1952, see Gaz. of P. 1953, Pt. I. p. 14. 4Subs. by Act No. XXXIV of 1952 s. 2."
}