{
  "file": "administratore4c4cbbff677c804a406277d0f1bc239.pdf",
  "law_name": "The International Development Association Ordinance, 1960",
  "text": "THE INTERNATIONAL DEVELOPMENT ASSOCIATION ORDINANCE, 1960 CONTENTS 1. Short title, extent and commencement 2. Definitions. 3. Financial provisions 4. State Bank to be depository for this Association 5. Certain provisions of Agreement to have force of law THE SCHEDULE THE INTERNATIONAL DEVELOPMENT ASSOCIATION ORDINANCE, 1960 ORIDNANCE NO. XX OF 1960 [2nd June, 1960] An Ordinance to give effect to an international agreement for the establishment and operation of an International Development Association and for purposes connected therewith. WHEREAS Articles of Agreement of the International Development Association have, on the twenty sixth day of January, 1960, been approved by the Executive Directors of the International Bank for Reconstruction and Development, hereinafter referred to as the Bank, and deposited in the archives of the Bank for signature and acceptance on behalf of Governments; AND WHEREAS it is expedient to provide for the participation of Pakistan in the said Association in pursuance of the aforesaid Agreement; NOW, THEREFORE, in pursuance of the Proclamation of the seventh day of October, 1958, and in exercise of all powers enabling him in that behalf, the President is pleased to make and promulgate the following Ordinance :___ 1. Short title, extent and commencement.___ (1) This Ordinance may be called the International Development Association Ordinance, 1960. (2) It extends to the whole of Pakistan. (3) It shall come into force on such date1 as the 2[Federal Government] may, by notification in the official Gazette, appoint. 2. Definitions.— In this Ordinance, unless there is anything repugnant in the subject or context,___ (a) “Agreement” means any Agreement which may be signed and accepted on behalf of the Government of Pakistan in pursuance of the Articles of Agreement approved by the Executive Directors of the Bank on the twenty- sixth day of January, 1960, providing for the establishment and operation of an international body to be called the International Development Association; (b) “Association” means the International Development Association; and (c) “member” means a member of the Association. 3. Financial provisions.___ (1) There shall be paid out of the 3[Federal Consolidated Fund] all such sums as may be required for the purpose of making payments on behalf of the Government of Pakistan under section 2 (a) of Article II and section 1 (a) of Article III of the Agreement. (2) Any sums received by the Government of Pakistan from the Association in pursuance of the Agreement shall be paid into the Federal Consolidated Fund. 1I.e., the 7th October, 1960, see Gaz. of P., 1960, Ext., p. 1493a. 2Subs. by F.A.O., 1975, Art. 2 and Table, for “Central Government”. 3Subs. ibid., for “Central Consolidated Fund” which was previously subs. by A.o., 1964, Art. 2 and Sch., for “Federal Consolidated Fund”, to read as above. 2[(3) The 1[Federal Government] may, if it thinks fit so to do, create and issue to the International Development Association, in such form as it thinks fit, any such non-interest bearing and non-negotiable notes or other obligations as are provided for by paragraph (e) of section 2 of Article II of the Agreement.] 4. State Bank to be depository for this Association.— The State Bank of Pakistan shall be the depository of the Pakistan currency holdings or other assets of the Association. 5. Certain provisions of Agreement to have force of law.— Notwithstanding anything to the contrary contained in any other law, the provisions of Article VIII of the Agreement set out in the Schedule shall have the force of law in Pakistan : Provided that nothing in section 9 thereof shall be construed as___ (a) entitling the Association to import into Pakistan goods free of any duty of customs without any restriction on their subsequent sale therein, or (b) conferring on the Association any exemption from duties or taxes which form part of the price of goods sold or which are in fact no more than charges for services rendered. _______ THE SCHEDULE (See section 5) Provisions of Agreement which shall have force of law THE AGREEMENT ARTICLE VIII Status, Immunities and Privileges SECTION 1.___ Purposes of Article To enable the Association to fulfil the functions with which it is entrusted, the status, immunities and privileges provided in this Article shall be accorded to the Association in the territories of each member. SECTION 2.___ Status of the Association The Association shall possess full juridical personality and, in particular, the capacity: (i) to contract; (ii) to acquire and dispose of immovable and movable property; 1Subs. by F.A.O., 1975, Art. 2 and Table, for “Central Government”. 2Sub-section (3) added by the International Development Association (Amdt.) Ordinance, 1960 (XLIX of 1960), s. 2. (iii) to institute legal proceedings. SECTION 3.___ Position of the Association with regard to Judicial Process. Actions may be brought against the Association only in a court of competent jurisdiction in the territories of a member in which the Association has an office, has appointed an agent for the purpose of accepting service or notice of process, or has issued or guaranteed securities. No actions shall, however, be brought by members or persons acting for or deriving claims for members. The property and assets of the Association shall, wheresoever located and by whomsoever held, be immune from all forms of seizure, attachment or execution before the delivery of final judgment against the Association. SECTION 4.___ Immunity of Assets from Seizure Property and assets of the Association, wherever located and by whomsoever held, shall be immune from search, requisition, confiscation, expropriation or any other form of seizure by executive or legislative action. SECTION 5.___ Immunity of Archives The archives of the Association shall be inviolable. SECTION 6.___ Freedom of Assets from Restrictions To the extent necessary to carry out the operations provided for in this Agreement and subject to the provisions of this Agreement, all property and assets of the Association shall be free from restrictions, regulations, controls and moratoria of any nature. SECTION 7.___ Privileges for Communications The Official Communications of the Association shall be accorded by each member the same treatment that it accords to the official Communications of other members. SECTION 8.___ Immunities and Privileges of Officers and Employees. All Governors, Executive Directors, Alternates, Officers and employees of the Association: (i) shall be immune from legal process with respect to acts performed by them in their official capacity except when Association waives this immunity ; (ii) not being local national, shall be accorded the same immunities from immigration restrictions, alien registration requirements and national service obligations and the same facilities as regards exchange restriction as are accorded by members to the representatives, official, and employees of comparable rank of other members; (iii) shall be granted the same treatment in respect of travelling facilities as is accorded by members to representatives, officials and employees of comparable rank of other members. SECTION 9.___ Immunities from Taxation (a) The Association, its assets, property, income and its operations and transactions authorized by this Agreement, shall be immune from all taxation and from all customs duties. The Association shall also be immune from liability for the collection or payment of any tax or duty. (b) No tax shall be levied on or in respect of salaries and emoluments paid by the Association to Executive Directors, Alternates, officials or employees of the Association who are not local citizens, local subjects, or other local national. (c) No taxation of any kind shall be levied on any obligation or security issued by the Association (including any dividend or interest thereon) by whomsoever held: (i) which discriminates against such obligation or security solely because it is issued by the Association; or (ii) if the sole jurisdictional basis for such taxation is the place or currency in which it is issued, made payable or paid, or the location of any office or place of business maintained by the Association. (d) No taxation of any kind shall be levied on any obligation or security guaranteed by the Association (including any dividend or interest thereon by whomsoever held: (i) which discriminates against such obligation or security solely because it is guaranteed by the Association; or (ii) if the sole jurisdictional basis for such taxation is the location of any office or place of business maintained by the Association. SECTION 10.___ Application of Article Each member shall take such action as is necessary in its own territories for the purpose of making effective in terms of its own law the principles set forth in this Article and shall inform the Association of the detailed action which it has taken. ______ Date:- 22.04.2024"
}