{
  "file": "administrator27d951fd230e0234282d0133cb695b0e.pdf",
  "law_name": "The Price Control And Prevention Of Profiteering And Hoarding Act, 1977",
  "text": "THE PRICE CONTROL AND PREVENTION OF PROFITEERING AND HOARDING ACT, 1977 CONTENTS 1. Short title, extent and commencement 2. Definitions 3. Powers to make orders etc. 4. Delegation of powers 5. Effect of orders inconsistent with other enactments 6. Fixation of prices 6A. Appeal 7. Penalties 8. Attempts and abetments 9. Offences by corporations 10. False statements 11. Power to try offences summarily 12. Power to amend Schedule 13. Presumption as to order 14. Burden of proof in certain cases 15. Protection of action taken under the Act 16. Repeal THE PRICE CONTROL AND PREVENTION OF PROFITEERING AND HOARDING ACT, 1977 1ACT No. XXIX OF 1977 [21st May, 1977] An Act to provide for price control and prevention of profiteering and hoarding. WHEREAS it is expedient to provide for price control and prevention of profiteering and hoarding; It is hereby enacted as follows:— 1. Short title, extent and commencement.―(1) This Act may be called the Price Control and Prevention of Profiteering and Hoarding Act, 1977. (2) It extends to the whole of Pakistan. (3) It shall come into force at once 2. Definitions. In this Act, unless there is anything repugnant in the subject or context,— (a) “Controller-General” means the Controller-General of Prices and Supplies appointed by the Federal Government, and includes any Deputy or Assistant Controller-General of Prices and Supplies so appointed, and any other officer authorised by the Federal Government to exercise all or any of the powers of the Controller-General under this Act; (b) “dealer” means a person carrying on, whether in conjunction with any other business or not, the business of selling any essential commodity, whether wholesale or retail; (c) “essential commodity” means any of the commodities or classes of commodities mentioned in the Schedule; (d) “importer” means a person importing into Pakistan, whether under an import licence granted by the Federal Government or otherwise, any essential commodity from outside Pakistan, but does not include a person importing any essential commodity as part of his personal baggage; (e) “notified order” means an order notified in the official Gazette; (f) “producer” means a person engaged in the manufacture or production of any essential commodity. 1For Statement of Objects and Reasons, see Gaz. of P., 1977, Ext. Pt. III, p. 3539. 3. Powers to make orders etc.―(1) The Federal Government, so far as it appears to it to be necessary or expedient for securing equitable distribution of an essential commodity and its availability at fair prices, may, by notified order, provide for regulating the prices, production, movement, transport, supply, distribution, disposal and sale of the essential commodity and for the price to be charged or paid for it at any stage of transaction therein. (2) Without prejudice to the generality of the powers conferred by sub-section (1), an order made thereunder may provide— (a) for controlling the prices at which any essential commodity may be bought or sold in any area; (b) for regulating the production, treatment and keeping of any essential commodity; (c) for regulating, by licences, permits or otherwise, the transport, movement and distribution between the Provinces of an essential commodity; (d) for prohibiting the withholding of sale of an essential commodity ordinarily kept for sale; . (e) for requiring any person holding stock in a Province of an essential commodity to sell in another province the whole or a specified part of the stock at such price, to such persons or class of persons and under such conditions as may be specified in the order; (f) for fixing the maximum quantity of any essential commodity which may at any time be possessed by a producer or dealer; (g) for collecting any information or statistics with a view to regulating or prohibiting any of the matters aforesaid; (h) for requiring persons engaged in any of the matters aforesaid in respect of any essential commodity to maintain and produce for inspection such books, accounts and records relating to their business, and to furnish such information relating thereto, as may be specified in the order; (i) for requiring every importer, producer and dealer to mark the essential commodities with the sale prices and to exhibition his premises a price list of the essential commodities held by him for sale; and (j) for any incidental and supplementary matters, including in particular the entering and search of premises, vehicles, vessels and aircraft, the seizure by a person authorised to make such search of any articles in respect of which such person has reason to believe that a contravention of the order has been, is being or is about to be committed, or any records connected therewith, the grant or issue of licences, permits or other documents and the charging of fees therefor. 4. Delegation of powers. The Federal Government may, by notified order, direct that any power conferred on it by or under this Act shall, in relation to such matters and subject to such conditions, if any, as may be specified in the direction, be exercisable also by— (a) such officer or authority subordinate to the Federal Government; or (b) such Provincial Government or such officer or authority subordinate to a Provincial Government, as may be specified in the direction. 5. Effect of orders inconsistent with other enactments. Any order made under section 3 shall have effect notwithstanding anything inconsistent therewith contained in any enactment other than this Act or any instrument having effect by virtue of any enactment other than this Act. 6. Fixation of prices.—(1) Subject to such general or special orders as may be made by the Federal Government under section 3, the Controller- General may, by notification in the official Gazette, fix specific maximum prices of essential commodities and different prices may be fixed for different localities or for different classes or categories of any essential commodities. (2) No person shall sell or re-sell any essential commodity at a price higher than the maximum price so fixed. 1[(2A) Every dealer, importer or producer of an essential commodity the maximum price of which is not for the time being fixed by a notification issued under sub-section (1) shall, if so required by the Controller-General by an order in writing or by a notified order, inform the Controller-General by notice in writing forwarded to him by registered post acknowledgement due of his intention to raise the price of the essential commodity and shall not raise the price. (a) before the expiration of thirty days from the day on which the notice is received by the Controller-General ; or (b) at any time thereafter, if, within the said period, the Controller-General communicates to him an objection to the price being raised. (2B) A notice under sub-section (2A) shall specify the amount by which the price of the essential commodity is proposed to be raised and the reasons therefore and be accompanied by the latest annual audited accounts of the dealer, importer or producer.] (3) Every dealer, importer, or producer shall supply to the Controller-General such information regarding the production, importation, purchase, stock, sale or distribution of any of the essential commodities as the Controller-General may, by an order in writing or by a notified order, require. 2[6A.Appeal.—(1) Any producer, dealer or importer, if aggrieved by an order of a Controller General, may prefer an appeal within three working days of the order to an appellate committee comprising of federal secretary of the division to which business of industries stands allocated and two federal secretaries nominated by the Cabinet Division in case of the Federal Government and an appellate committee comprising of three provincial secretaries including secretary of the department to which business of industries stands allocated, constituted by chief secretary of the province concerned in case of a province or district thereof, as the case maybe. 1Subs. by the Price Control and Prevention of Profiteering and Hoarding (Amdt.) Ordinance, 1979 (64 of 1979), s. 2. 2 Ins by the Price Control and Prevention of Profiteering and Hoarding (Amendment) Act, 2023, (Act No. LXIV of 2023), s.2. (2) An appeal under sub-section (l) shall be decided by the concerned appellate committee within five working days after providing the appellant an opportunity of being heard.] 7. Penalties.—(1) Any person who contravenes any order made under section 3 or a notification issued, or order made, under section 6 shall be punishable with imprisonment for a term which may extend to three years and with fine which may extend to one lac rupees:, Provided that, if a person convicted for an offence punishable under this sub-section is again convicted for such offence, the term of imprisonment awarded to him shall not be less than one year. (2) If the order made under section 3 so provides, any Court trying any contravention of such order may direct that any property in respect of which the Court is satisfied that the order has been contravened shall be forfeited to the Federal Government. 8. Attempts and abetments. Any person who attempts to contravene, or abets a contravention of, any order made under section 3 shall be deemed to have contravened the order: Provided that a person who buys an essential commodity for his personal consumption or use and not for sale shall not be deemed to have abetted the contravention of an order controlling the price at which the essential commodity may be sold. 9. Offences by corporations. If the person contravening an order made under section 3 is a company or other body corporate or a partnership or other body of individuals, every director, manager, secretary, member or other officer or agent thereof shall, unless he proves that the contravention took place without his knowledge or that he exercised all due diligence to prevent such contravention, be deemed to be guilty of such contravention. 10. False statements. If any person— (i) when required by an order made under section 3 to make a statement or furnish any information makes any statement or furnishes any statement which is false in any material particular and which he knows or has reasonable cause to believe to be false, or does not believe to be true; or (ii) makes any statement as aforesaid in any book, account, record, declaration, return or other document which he is required by any such order to maintain or furnish, he shall be punishable with imprisonment for a term which may extend to three years, or with fine, or with both. 1[11. Power to try offences summarily.—(1) Offences punishable under this Act shall be tried by a Special Magistrate appointed under section 14A of the Code of Criminal Procedure, 1898, in a summary manner as provided in sections 262 to 265 of the said Code. Provided that sub-section (2) of section 262 shall not apply. 1Subs by Act III of 06, s. 14. (2) If a Special Magistrate has reason to believe that any offence punishable under this Act has been committed by any person, he may enter the place or premises where the offence has been committed and try the offence on the spot.] 12. Power to amend Schedule. The Federal Government may, by notification in official Gazette, amend the Schedule so as to add to, or omit from it any commodity or class of commodities. 13. Presumption as to order.—(1) No order made by any authority other than a Court in exercise of any power conferred by or under this Act shall be called in question in any Court. (2) Where an order purports to have been made and signed by an authority in exercise of any power conferred by or under this Act, a Court shall, within the meaning of the Evidence Act, 1872 (L of 1872) presume that such order was so made by that authority. 14. Burden of proof in certain cases. Where any person is prosecuted for contravening any order made under section 3 which prohibits him from doing an act or being in possession of a thing without lawful authority or without a permit, licence or other document, the burden of proving that he has such authority, permit, licence or other document shall be on him. 15. Protection of action taken under the Act.—(1) No suit, prosecution or other legal proceeding shall lie against any person for anything which is in good faith done or intended to be done in pursuance of any order made under section 3. (2) No suit or other legal proceeding shall lie against the Government for any damage caused or likely to be caused by anything which is in good faith done or intended to be done in pursuance of any order made under section 3. 16. [Repeal.] Omitted by the Federal laws (Revision and Declaration) Ordinance, 1981 (XXVII of 1981), s. 3 and Sch., II. 1[SCHEDULE (See Section 2 and section 12) PART- I 1. Edible oils, hydrogenated or otherwise; 2. Processed meat; 3. Tea; 4. Powdered milk; 5. Milk food for infants; 6. Aerated water; 7. Fruit juices and squashes; 8. Chemical fertilizers all sorts; 1Subs. by S.R.O No. 1065 (I)/2021, page No. 1263, dated 24th August, 2021 9. Cement; 10. Caustic soda; 11. Soda ash; 12. Bicycles, motor cycles, trucks, tractors, cars, light commercial vehicle (LCV), heavy commercial vehicle (HCV), sports utility vehicle (SUV), buses and trailors; 13. Face masks, oxygen cylinder, hand sanitizers; 14. Iron and steel; and 15. Tyres (all types). PART-II 1. White sugar; and 2. Wheat PART-III 1. Milk; 2. Salt; 3. Potatoes; 4. Onion; 5. Pulses all sorts; 6. Fish all sorts; 7. Beef; 8. Mutton; 9. Eggs; 10. Gur; 11. Spices and vegetables; 12. Red chilies; 13. Charcoal; 14. Firewood; 15. Matches 40 and 50 sticks; 16. Coal; 17. Poultry feed; 18. Bricks; 19. Phutti (seed cotton); 20. Cotton (lint); 21. Cotton seed all sorts; 22. Wool, shoddy or raw; 23. Paddy (rice); 24. Ice; 25. Pesticides; 26. Meat on hoof; 27. Roti and naan (tandoori); 28. Fruits and vegetables; 29. Meda and suji; 30. Gram flour; 31. Bread (double roti); 32. Curd; and 33. Live poultry and poultry meat.] ___________ Date: 13-09-2024"
}