{
  "file": "administratorde527088a6cc7f384f4beebfc32ab87e.pdf",
  "law_name": "The Agricultural Produce Cess Act, 1940",
  "text": "THE AGRICULTURAL PRODUCE CESS ACT, 1940 CONTENTS 1 Short title and extent 2 Definitions 3 Imposition of cess 4 Power to exclude articles from Schedule 5 Refund of, and exemption from, cess *5A *5B *5C *6 *6A *6B *6C *6D *7 *8 *9 10 Power to make rules *11 12 Rules and regulations to be published SCHEDULE *Omitted THE AGRICULTURAL PRODUCE CESS ACT, 1940 ACT NO. XXVII OF 1940 [15th April, 1940] 1[An Act to provide for the levy and collection of a cess on certain agricultural products exported from Pakistan] 1[WHEREAS it is expedient to provide for the levy of a cess on certain agricultural products exported from Pakistan;] It is hereby enacted as follows:— 1. Short title and extent.—(1) This Act may be called the Agricultural Produce Cess Act, 1940. 2[(2) It extends to the whole of Pakistan.] 2. 3[Omitted] 3. Imposition of cess.—(1) A customs duty at the rate of one-half of one per cent. ad valorem shall be levied on all articles included in the Schedule which are exported from 2[Pakistan]: Provided that the said duty shall not be levied on articles proved to the satisfaction of the Collector not to have been produced in 4[Pakistan]: 4[Provided further that the 5[Federal Government] may, by notification in the Official Gazette, vary the rate at which customs duty shall be levied.] (2) The 5[Federal Government] may, by notification in the official Gazette, fix for the purposes of levying the said duty tariff values of any articles included in the Schedule, and may alter any tariff values for the time being in force. 1Subs. by the Acts relating to Cesses on Agricultural Products (Amdt) Ordinance, 1982 (X of 1982), s. 2 and Sch. 2Subs. by the Central Laws (Statue Reform) Ordinance, 1960 (XXI of 1960), s. 3 and 2nd Sch. (with effect from the 14th October, 1955). 3Omitted by the Acts relating to the Cesses on Agricultural Products (Amendment) Ordinance, 1982 (X of 1982), s. 2 and Sch. 4Subs. and added by Act No. XII of 1950, s.5. 5Subs. by F. A. O., 1975 (P.O. No. 4), Art. 2 and Table. 4. Power to exclude articles from Schedule.—The 1[Federal Government] may, 2* * *, by notification in the official Gazette, direct that any article specified in the Schedule shall cease to be subject to the duty imposed by section 3, and thereupon, so long as the notification remains in force, that article shall be deemed not to be included in the Schedule. 5. Refund of, and exemption from, cess.—The 1[Federal] Board of Revenue may make rules providing, on such conditions as may be specified in the rules, for— (a) the refund of duty levied where articles are exported by land and subsequently imported into 2[Pakistan], and (b) the export by land, without payment of the duty of articles, which are subsequently to be imported into 2[Pakistan]. 5A. 3[Omitted] 5B. 3[Omitted] 5C. 3[Omitted] 6. 3[Omitted] 6A. 3[Omitted] 6B. 3[Omitted] 6C. 3[Omitted] 6D. 3[Omitted] 7. 4[Omitted] 8. 4[Omitted] 9. 4[Omitted] 4[10. Power to make rules.__ (1) The 1[Federal Government] may, after previous publication, make rules for the purpose of carrying into effect the provisions of this Act. (2) In particular and without prejudice to the generality of the foregoing power, such rules may provide for all or any of the following matters, namely :__ 5* * * * * * * 11. 3[Omitted] 12. Rules and regulations to be published.—All rules made under section 10 3* * * shall be published in the official Gazette.] 1Subs by F. A. O., 1975 (P.O. No. 4 of 1975), Art. 2 and Table. 2Omitted by Act No. XII of 1950, s. 6. 3Omitted by the Acts relating to Cesses on Agricultural Products (Amendment) Ordinance, 1982 (X of 1982), s. 2 and Sch. 4Omitted and added by Act No. XII of 1950, ss. 11-12. 5Cls. (a) to (s) omitted by the Acts relating to Cesses on Agricultural Products (Amendment) Ordinance, 1982 (X of 1982), s. 2 and Sch. THE SCHEDULE (See section 3) 1. BONES. 2. BRISTLES. 3. BUTTER. 4. CEREALS, other than Rice and Wheat. 5. DRUGS. 6. FIBRE for brushes. 7. FISH. 8. FRUITS. 9. GHEE. 10. HIDES, raw. 11. MANURES. 12. OILCAKES. 13. PULSES. 14. SEEDS. 15. SKINS, raw. 16. SPICES. 17. TOBACCO, unmanufactured. 18. VEGETABLES. 19. WHEAT. 20. WHEAT FLOUR. 21. WOOL, raw. ______ Date: 21.03.2024"
}