{
  "file": "administrator00607dfddff08b6d0a71b341f1667f23.pdf",
  "law_name": "THE PAKISTAN STUDY CENTRES, ACT 1976 CONTENTS __________",
  "text": "THE PAKISTAN STUDY CENTRES, ACT 1976 CONTENTS __________ SECTIONS: 1 Short title, extent and commencement. 2 Definitions. 3 Establishment of Centre and the Institute. 4 Functions of Centre. 5 Functions of Institute. 6 Board of Governors. 7 Director. 8 Academic Committee. 9 Fund. 10 Audit and accounts, etc. 10A Power to transfer Centres. 11 Power to make rules. 12 Power to make regulations. Updated till 14.04.2023 THE PAKISTAN STUDY CENTRES, ACT 1976. 1ACT No. XXVII OF 1976 [11th May, 1976] An Act to provide for the establishment of Pakistan Study Centres in the Universities for the study of languages, literature, social structure, customs, attitudes and motivation, of the people of various regions of Pakistan. WHEREAS it is expedient for national cohesion, to provide for the establishment of Pakistan Study Centres in the Universities for the study of languages, literature, social structure, customs, attitudes and motivation, of the people of various regions of Pakistan; It is hereby enacted as follows: 1. Short title, extent and commencement.—(1) This Act may be called the Pakistan Study Centres Act, 1976. (2) It extends to the whole of Pakistan. (3) It shall come into force at once. 2. Definitions. In this Act unless there is anything repugnant in the subject or context,— (a) “Board” means a Board of Governors referred to in sub-section (1) of section 6; (b) “Centre” means a Pakistan Study Centre established under section 3 and, except in that section and section 4, includes the Institute; (c) “Commission” means the University Grants Commission; (d) “Director” means the Director of a Centre or Institute; (e) “Institute” means the National Institute of Pakistan Studies, University of Islamabad; (f) “regulations” means regulations made under section 12; and (g) “rules” means rules made under section 11. 3. Establishment of Centre and the Institute. As soon as may be after the commencement of this Act, the Federal Government may by notification in the official Gazette, establish a Pakistan Study Centre in a University specified in the notification and the National Institute of Pakistan Studies in the University of Islamabad. 1For Statement of Objects and Reasons, see Gaz. of P., 1976, Ext., Pt. Ill, p. 334. 4. Functions of Centre. A Centre shall— (a) engage in the study of languages, literature, social structure, customs, attitudes and motivation, of the people of various regions of Pakistan; (b) establish under-graduate, graduate, post-graduate degree and other programmes in the relevant discipline in accordance with the standard and requirements of the University in which the Centre is established; (c) promote co-operation in inter-disciplinary relationship with other centres, teaching and research establishments; (d) arrange conferences, seminars and refresher courses for the development of teaching and research; (e) promote teaching and research in particular subjects as assigned to it by the Federal Government in consultation with the University in which the Centre is established. 5. Functions of Institute. The Institute shall— (a) engage in high-level teaching and research; (b) train research workers; (c) establish M.A., M.Phil, Ph.D. and other programmes in the relevant discipline in accordance with the standard requirements of the University of Islamabad; (d) promote co-operation in inter-disciplinary relationship with other centres, teaching and research establishments; (e) arrange conferences, seminars and refresher courses for the development of teaching and research; and (f) conduct teaching and research in such particular field as is assigned to it by the Federal Government in consultation with the University of Islamabad. 6. Board of Governors.—(1) The management, overall control and supervision of the affairs of a Centre established in a University shall vest in a Board of Governors consisting of the following members, namely:— (a) Vice-Chancellor of the University, who shall also be its Chairman; (b) a representative of the Commission; (c) a representative of the Pakistan History Commission; (d) a representative of the Ministry of Education; (e) a representative of the National Educational Council; (f) Dean of the Faculty of the University; (g) two experts in the relevant discipline to be nominated by the Federal Government on the recommendation of the Commission; (h) one expert in the relevant discipline to be nominated by the Syndicate of the University; (i) one expert in the relevant discipline to be nominated by the Academic Council of the University; (j) Director of the Centre. (2) In particular and without prejudice to the generality of the foregoing provision, a Board shall have the power to— (a) approve the academic and research programmes of the Centre with the concurrence of the Academic council of the Univeristy in which the centre is established; (b) lay down rules of admission to the Centre; (c) institute fellowships for promotion of research in the discipline concerned; (d) create, suspend or abolish such posts as may be necessary; (e) appoint teachers and other officers; and (f) hold, control and administer the funds of the Centre. (3) A member of a Board referred to in clause (g) of sub-section (1) shall hold office for such term as may be determined by the Federal Government. (4) The meetings of a Board shall be held as and when called by the Chairman: Provided that not less than two meetings shall be held in each year and the period between such meetings shall not be more than twelve months. . (5) In the exercise of its powers and the performance of its functions, a Board shall be subject to such special or general instructions as may be issued by the Commission from time to time. (6) A Board may, for the speedy and efficient working of the Centre, delegate to the Director such of its powers as it may deem necessary. 7. Director.—(1) The Director shall be appointed by the Federal Government after consultation with the Commission and the University in which the Centre concerned is established on such remuneration and other terms and conditions of service as may be determined by the Federal Government. (2) The Director shall be the academic and executive head of the Centre and Secretary of the Board, and shall be responsible to the Board for carrying out the objectives of the Centre. (3) The Director shall perform such other functions and exercise such powers as may be assigned or delegated to him by the Board. (4) The Director may, by writing under his hand addressed to the Chairman, resign his office. 8. Academic Committee.—(1) At each Centre there shall be an Academic Committee consisting of the following members, namely:— (a) Director of the Centre, who shall also be its convener; (b) all Professors and Associate Professors of the Centre; and (c) two experts to be nominated by the Commission. (2) The Committee may associate such other experts as it may consider necessary. (3) The Committee shall prepare and submit to the Board the academic and research programmes of the Centre. 9. Fund. Each Center shall have a fund to which shall be credited— (a) grants made by the Federal Government, the Provincial Government and the Commission; (b) contributions and donations from individuals, local bodies, corporations, institutions, organizations and agencies; and (c) income from fees. 10. Audit and accounts, etc.(1) The accounts of a Centre shall be maintained in such form and manner as may be prescribed by rules. (2) The accounts of a Centre shall be audited once in every year by an auditor appointed by the Commission on such remuneration, if any, to be paid by the Centre, as the Commission may fix. (3) A Center shall submit, through the Commission, to the Federal Government a copy of its audited annual accounts, together with the observations of the Director, if any thereon, and a report on the activates of the Centre during the preceding year. (4) A Centre shall furnish to the Federal Government such information relating to its activities as may be asked for by the Federal Government from time to time. 1[10A. Power to transfer Centres. The Federal Government may, by Order published in the official Gazette and subject to such terms and conditions as may be specified therein, transfer any Centre to a University or, as the case may be, the Provincial Government.] 11. Power to make rules. The Federal Government may, by notification in the official Gazette, make rules for carrying out the purposes of this Act, including rules to regulate the financial and administrative matters relating to a Centre. 12. Power to make regulations. A Centre may, with the approval of the Commission, make such regulations concerning academic matters, not inconsistent with the rules, as it may consider necessary for carrying out the purposes of this Act. 1Ins. by Ord. LVIII of 02, s. 2 and Sch."
}