{
  "file": "administrator253828764c02df35a2ed7930e508796f.pdf",
  "law_name": "The Pakistan Boy Scouts Association Ordinance, 1959",
  "text": "THE PAKISTAN BOY SCOUTS ASSOCIATION ORDINANCE, 1959 CONTENTS 1. Short title, extent and commencement 2. Incorporation of Association 3. Constitution, powers and functions of Association 4. Exclusive right to titles, uniforms, badges, etc. 5. Penalty, etc. 6. [Omitted] THE PAKISTAN BOY SCOUTS ASSOCIATION ORDINANCE, 1959. ORDINANCE NO. XLIII OF 1959 [29th July, 1959] An Ordinance to incorporate the Pakistan Boy Scouts Association and to provide for certain matters connected therewith. WHEREAS it is expedient to incorporate the Pakistan Boy Scouts Association and to provide for certain matters connected therewith ; NOW, THEREFORE, in pursuance of the Proclamation of the seventh day of October, 1958, and in exercise of all powers enabling him in that behalf, the President is pleased to make and promulgate the following Ordinance :___ 1. Short title, extent, and commencement.___(1) This Ordinance may be called the Pakistan Boy Scouts Association Ordinance, 1959. (2) It extends to the whole of Pakistan. (3) It shall come into force on such date1 as the 2[Federal Government] may, by notification in the official Gazette, appoint. 2. Incorporation of Association.___Notwithstanding anything in the Societies Registration Act, 1860 (XXI of 1860), or in any other law, the Pakistan Boy Scouts Association, for the time being registered thereunder, shall, on the commencement of this Ordinance, cease to be so registered, and shall be deemed to be a body corporate, by the name of the Pakistan Boy Scouts Association (hereafter in this Ordinance referred to as the Association), having perpetual succession and a common seal, with power, subject to the rules made or deemed to have been made under section 3, to acquire, hold and dispose of property, movable or immovable, for the purposes of the Association, and shall by the said name sue and be sued. 3. Constitution powers and functions of Association.___The constitution, powers and functions of the Association shall, notwithstanding anything in the Companies Act, 1913 (VII of 1913), be such as may be prescribed by rules to be made by the Association, with the previous approval in writing of the 2[Federal Government], and until such rules are made, the rules of the Pakistan Boy Scouts Association registered under the Societies Registration Act, 1860 (XXI of 1860), and in force immediately before the commencement of this Ordinance, shall continue in force and be deemed to have been made under this section. 4. Exclusive right to titles, uniforms, badges, etc.___The Association shall have the sole and exclusive right to have and to use all emblems, badges, uniforms and decorations, descriptive or designating marks and titles, now or heretofore used by the Association, and also the title “Boy Scouts” or (saving the title of any unit of the Armed Forces of Pakistan or any Forces attached to or serving with such Forces), any title containing the word “Scouts” or any grammatical variation thereof, and shall also have the sole and exclusive right to manufacture, have or use any emblem, badge, decoration, uniform, descriptive or designating mark or title hereafter adopted by the Association for carrying out its objects. 1 The 14th day of August, 1959, see Gaz. of P., 1959, Ext., p. 1397. 2 Subs. by the Federal Adaptation of Laws Order, 1975 (President’s Order No. 4 of 1975), Art. 2 and Table. 5. Penalty, etc.___(1) Whoever contravenes any provision of section 4 shall be punishable with fine. (2) If such contravention is committed by a company, association or body of individuals, every member thereof who is knowingly a party to the contravention shall be deemed to be guilty of such contravention. 6. 1[Omitted] _____________ 3614 Date: 17-02-2025 _________________________________________________________________________________ 1Omitted by the Federal Laws (Revision and Declaration Ordinance, 1981 (Ordinance No. XXVII of 1981), s. 3 and II Sch."
}