{
  "file": "administrator1e3813f2332b8766f11c84b8a33bc0fb.pdf",
  "law_name": "THE CENTRAL EXCISE DUTY ON SUGAR (VALIDATION) ORDINANCE,",
  "text": "THE CENTRAL EXCISE DUTY ON SUGAR (VALIDATION) ORDINANCE, 1979 CONTENTS 1. Short title and commencement 2. Validation of levy and collection of central excise duty on enhanced rate, etc. THE CENTRAL EXCISE DUTY ON SUGAR (VALIDATION) ORDINANCE, 1979. ORDINANCE No. XXXIV OF 1979 [16th July, 1979] An Ordinance to validate the levy and collection of excise duty on enhanced rate on stocks of sugar held by sugar mills on the 7th June, 1975. WHEREAS it is expedient to validate the levy and collection of excise duty on enhanced rate on stocks of sugar held by sugar mills on the 7th June, 1975, and to provide for the collection of excise duty on such enhanced rate on the said stocks; AND WHEREAS the President is satisfied that circumstances exist which render it necessary to take immediate action; NOW, THEREFORE, in pursuance of the Proclamation of the fifth day of July 1977, read with the Laws (Continuance in Force) Order, 1977 (C. M. L. A. Order No. 1 of 1977), and in exercise of all powers enabling him in that behalf, the President is pleased to make and promulgate the following Ordinance:__ 1. Short title and commencement.____ (1) This Ordinance may be called the Central Excise Duty on Sugar (Validation) Ordinance, 1979. (2) It shall come into force at once. 2. Validation of levy and collection of central excise duty on enhanced rate, etc.__ Notwithstanding anything contained in the Central Excise and Salt Act, 1944 (I of 1944) or in any rule or notification made or issued thereunder, or in any judgment of a Court, the central excise duty levied and collected on stocks of sugar held by sugar mills on 7th June, 1975, at the rate of twenty- seven rupees and twenty-two paisa per cwt in additional to the excise duty chargeable from the sugar mills under subsection (4) of section 3 of the said Act for the year 1974-75 shall be deemed to have been validly levied and collected and shall not be liable to be refunded and so much of such duty as has not been paid, collected or realised before the corning into force of this Ordinance shall be recoverable in accordance with provisions of the said Act and the rules made thereunder. __________ Date: 13-09-2024"
}