{
  "file": "administrator43948dd87dbd8f689bcb2d1583247464.pdf",
  "law_name": "The Karachi Rent Restriction Act, 1953",
  "text": "THE KARACHI RENT RESTRICTION ACT, 1953 CONTENTS 1. Short title, extent and commencement 2. Definitions 4. Rent Controller to fix fair rent 5. Re-determination of fair rent when improvements made 6. Repairs by tenant 7. Restriction on raising rent 8. Increase of rent on account of payment of rates excepted 9. Fine, premium, Pagri or Mithai not to be charged for grant, renewal or continuance of tenancy 10. Eviction of tenant 11. Easement not to be disturbed 12. Controller may determine fair rent in certain cases 13. Punishment for contravention of the provisions of section 11 14. Review 15. Appeals and revision 16. [Omitted] 17. [Omitted] 18. Execution of orders 19. Controller may require information to be furnished and summon witnesses 20. Use of force in certain cases 21. Control of Provincial Government 22. Bar of jurisdiction 23. Cognizance of offence 24. Act does not permit increase of rent if not otherwise permissible 25. Validation of appointments and Acts 26. Effect of provisions inconsistent with other enactments 27. Rules 28. Savings 29. Repeal THE KARACHI RENT RESTRICTION ACT, 1953 1ACT NO. VIII OF 1953 [15th April, 1953] An Act to make certain provisions regarding accommodation, whether residential or non-residential furnished or unfurnished, in the 2[Karachi Division]. WHEREAS it is expedient to make certain provisions regarding accommodation, whether residential or non-residential, furnished or unfurnished, in the 2[Karachi Division], and in particular to provide for controlling the rents chargeable for such accommodation and for preventing eviction in certain cases ; It is hereby enacted as follows:___ 1. Short title, extent and commencement.___ (1) This Act may be called the Karachi Rent Restriction Act, 1953. (2) It extends to the 2[Karachi Division]. (3) It shall come into Force at once. 2. Definitions. ___In this Act, unless there is anything repugnant in the subject or context,___ 3[(1) “Controller” means a judicial officer who is appointed by the Provincial Government to perform the functions of a Controller under this Act; ] (2) “fair rent” means___ (a) in relation to residential premises constructed before the 15th day of August, 1947,___ (i) the rent at which the premises were let on the first day of December 1941, or where they were not let on that date, the rent at which they were last let before that date, with the addition, in neither of the foregoing cases, of the permitted increase ; or (ii) in the case of any premises let under a lease for a period of five years or upwards commencing on or before the first day of January 1937, which has expired after the first day of December 1941, the rent fixed by such lease for the period including the first day of December, 1941, with the addition of the permitted increase ; or 1The Chief of Karachi has been authorised to exercise the powers and discharge the functions of the Central Government under section 2 (4) (b) (i) and section 3 of this Act, see Gaz. of P., 1953, Pt. I, p. 176. This Act has been repealed in its application to areas other than Cantonment areas by the West Pakistan Ordinance No. 38 of 1962, s. 3 (1) (with effect from the 1st July, 1963), see Gazette of West Pakistan, 1963, Ext., P. 2889. 2Subs. by A.O., 1964, Art. 2 and Sch. 3Subs. by the Karachi Rent Restriction (Amdt.) Ordinance No. XLVIII of 1962, s. 2. (iii) in any of the cases specified in section 12 such rent, as having regard to the provisions of this Act and the circumstances of the case, the Controller deems just; or (iv) in any other case, such rent as may be determined by the Controller having due regard to the prevailing rates of rent for the same or similar accommodation in similar circumstances during the twelve months prior to the first day of December 1941, and the permitted increase, and in the case of any premises which have been constructed after that date, also to any general increase in the cost of sites and building construction ; (b) in relation to premises other than residential premises constructed before the 15th day of August, 1947,___ (i) the rent at which the premises were let on the first day of December 1942, or where they were not let on that date, the rent at which they were last let before that date, with the addition, in either of the foregoing cases, of the permitted increase ; or (ii) in the case of any premises let under a lease for a period of five years or upwards commencing on or before the first day of January, 1938, which has expired after the first day of December, 1942, the rent fixed by such lease for the period including the first day of December 1942, with the addition of the permitted increase ; or (iii) in any other case, such rent as may be determined by the Controller having regard to the prevailing rates of rent for the same or similar accommodation in similar circumstances during the twelve months prior to the first day of December, 1942, and in the case of premises which have been constructed after that date, also to any general increase in the cost of sites and building construction ; (c) in relation to all premises, residential or otherwise, constructed after the 15th day of August 1947, such rent as shall secure to the landlord a net return of six per centum 1[and in the case of premises first let on or after the twentieth of October, 1959, eight per centum] per annum on the total cost, after deducting the taxes, insurance premium for insurance against fire and earthquake but not otherwise and an amount equal to one and a half per centum per annum of the total cost by way or expenses for maintenance and repairs. The total cost shall include the value of the land and the cost of the construction of the premises; (3) “landlord” means any person for the time being entitled to receive rent in respect of any premises whether on his own account or on account or on behalf or for the benefit of any other person or as a trustee, guardian or receiver for any other person, and includes any tenant, who, having been granted a lease of any premises by such landlord, sublets the same and every person from time to time deriving title under a landlord ; 1Ins. by the Karachi Rent Restriction (Amdt.) Ordinance No. XLVIII of 1962, s. 2. (4) “permitted increase” in relation to any premises means:___ (a) in a case to which clause (2) (a) (i) or clause (2) (a) (if) applies___ (i) twenty-five per centum of the rent of the premises let on the first day of December 1941, or where they were not let on that date, the rent at which they were last let before that date or the rent referred to in sub-clause (2) (a) (ii) ; and (ii) an amount not exceeding seven and a half per centum 1[, or in the case of any addition, improvement or alteration, made on or after the twentieth day of October, 1959, eight per centum] of the cost of any addition, improvement or alteration (not included in necessary repairs or repairs usually made to premises in the locality) made, at the land- lord’s expense, to or in the premises since the first day of December, 1941, or as the case may be, since the date when the premises were last let before that date ; (b) in a case to which clause (2) (b) (i) or clause (2) (b) (ii) applies___ (i) where the rent of the premises let on the first day of December,1942, or where they were not let on that date the rent at which they were last let before that date or the rent referred to in clause (2) (b) (ii) does not exceed fifty rupees per month, or where the premises are used for accommodating a school, a hospital dispensary, library, maternity home, nursing home, or such charitable or public institution as may be notified in this behalf by the 2[Federal Government] in the Official Gazette, ten per cent of the rent payable in each such case and in all other cases, fifty percent of such rent, and (ii) an amount not exceeding seven and a half per cent 1[, or in the case of any addition made after the 20th day of October, 1959, eight per centum] of the cost of any addition, improvement or alteration (not included in necessary repairs or repairs usually made to premises in the locality) made, at the landlord’s expense, to or in the premises since the first day of December, 1942, or, as the case may be, since the date when the premises were last let before that date ; (c) in a case to which clause 2 (c) applies, an amount which would secure to the landlord a net return of six per centum 1[, or in the case of any addition improvement or alteration made on or after the 20th day of October, 1959, eight per centum] per annum on the cost of any addition, improvement or alteration made by the landlord after allowing for the deductions referred to in clause 2 (c) ; ______________________________________________________________________________ 1Ins. by the Karachi Rent Restriction (Amdt.) Ordinance No. XLVIII of 1962, s. 2. 2Subs. by F.A.O., 1975, Art. 2 and Table. (5) “premises” means any building or part of a building let for any purpose and includes___ (i) the garden, grounds and out-houses, if any, appurtenant to such building or part of a building ; and (ii) any furniture supplied by the landlord for use in such building or part of a building ; but shall not include a room in a hotel or a lodging house ; (6) “residential premises” means premises let or occupied or intended to be let or occupied for residential purposes ; (7) “tenant” means any person by whom or on whose account rent is payable for any premises and includes every person from time to time deriving title under a tenant and also every person remaining in possession of the premises leased to him after the determination of the lease with or without the consent of the landlord. 3. [Appointment of Rent Controller and Additional Rent Controller.] Omitted by the Karachi Rent Restriction (Amdt.) Ordinance, 1962 (48 of 1962), s. 3. 4. Rent Controller to fix fair rent. ___The Controller___ (a) shall, in the case of premises in respect of which an application is made by the landlord or the tenant, on such application, and (b) may in the case of any other premises, of his own motion, determine after making such enquiry as he deems fit, the fair rent in accordance with the provisions of this Act : Provided that the 1[Controller] shall not___ (a) entertain any application, or (b) take any action on his own motion, for determining the fair rent after the lapse of a period of four months next after the date on which the premises are first occupied: Provided further that the foregoing proviso shall not have effect until the expiry of a period of four months from the commencement of this Act. 5. Re-determination of fair rent when improvements made. ___(1) If at any time after the fair rent of any premises has been determined in accordance with the provisions of this Act it appears to the Controller that subsequent to such determination some addition, improvement or alteration, not included in necessary repairs or repairs usually made to premises in the locality, has been made to the premises at the landlord's expense the Controller may, after making such enquiry as he thinks fit, redetermine the fair rent of the premises. 1Ins. by the Karachi Rent Restriction (Amdt.) Ordinance No. XLVIII of 1962, s. 4. (2) An increase in the fair rent may be allowed under subsection (1) with effect from any date not earlier than the date on which the addition, improvement or alteration was completed. 6. Repairs by tenant. ___A tenant may, after notice to the landlord, make necessary repairs or repairs usually made to premises in the locality and deduct the cost thereof from the rent: Provided that___ (a) such cost shall riot exceed one and a half per centum of the total cost of construction within the meaning of clause (c) of subsection (2) of section 2, and (b) the previous permission of the 1[Controller] shall be obtained to the making of the repairs. 7. Restriction on raising rent. ___Where the fair rent of any premises has been determined in accordance with this Act___ (a) the landlord shall not claim and shall not be entitled to any rent in excess of the fair rent ; (b) any agreement for the payment of rent in excess of the fair rent shall be null and void in respect of such excess and shall be construed as an agreement for the payment of the fair rent ; (c) when the fair rent of any premises has been determined before the commencement of this Act, any sum in excess of the fair rent paid, before the commencement of this Act in respect of any use or occupation of the premises___ (i) after the first day of April 1942, in the case of residential premises, or (ii) after the first day of October, 1943, in the case of premises other than residential premises, shall be refunded to the person by whom it was paid, or, at the option of such person, otherwise adjusted; (d) where the fair rent of any premises has been determined under this Act after the commencement of this Act, any sum paid in excess of the fair rent for the period commencing from the date of the application for the fixation of the fair rent shall be refunded to the person by whom it was paid or, at the option of such person, otherwise adjusted. 8. Increase of rent on account of payment of rates excepted. ___Where the landlord pays any municipal rates, cesses or taxes in respect of any premises, an increase of the rent thereof shall not be deemed to be an increase for the purposes of this Act and the landlord shall be entitled to the amount thereof in addition to the fair rent if such amount does not exceed any increase in the amount for the time being payable by the landlord in respect of such rates, cesses or taxes over the amount paid, in respect of residential premises, in the period of assessment which included the first day of December, 1941, and, in the case of premises other than residential premises, in the period of assessment which included the first day of December,1942: 1Subs. by the Karachi Rent Restriction (Amdt.) Ordinance No. XLVIII of 1962, s. 4. Provided that no such sum in excess of the fair rent shall be payable until the expiry of four clear weeks after the landlord has served on the tenant a notice in writing of his intention to increase the rent, accompanied by a statement showing particulars of the increased amount charged in respect of such rates, cesses or taxes. 9. Fine, premium, Pagri or Mithai not to be charged for grant, renewal or continuance of tenancy.___ (1) No landlord, tenant, occupant, or any person acting on their behalf shall in consideration of the grant, renewal or continuance of a tenancy of any premises require the payment of any fine, premium, Pagri or Mithai or any other like sum in addition to the rent. (2) Where any such payment has been made, the amount shall be recoverable by the tenant by whom it was made from the landlord, tenant, occupant or any person acting on their behalf and may, without prejudice to any other method of recovery, be deducted from any rent payable by him to the landlord, tenant, occupant or any person acting on their behalf. (3) Nothing in this section shall apply to any payment made under any agreement entered into____ (a) in the case of residential premises, before the first day of December, 1941; (b) in the case of premises other than residential premises, ,before the first day of December, 1942. (4) Any landlord, tenant, occupant or any person acting on their behalf who receives directly or through an agent any fine, premium, Pagri or Mithai or other like sum in addition to rent in contravention of sub-section (1) shall be punishable with imprisonment for a term which may extend to six months or with fine or with both. 10. 1[Eviction of tenant.___ (1) A tenant in possession of a premises shall not be evicted therefrom, except in accordance with the provisions of this section. (2) A landlord who seeks to evict his tenant shall apply to the Controller for a direction in that behalf and if the Controller, after giving the tenant a reasonable opportunity of showing cause against the application, is satisfied that___ the tenant has not paid or tendered rent due buy him in respect of the premises, within fifteen days after the expiry of the time fixed in the agreement of tenancy with his landlord, or in the a sence of any such agreement, within thirty days of the date on which the rent became payable; or the tenant has, without the written consent of the landlord,___ (i) transferred his right under the lease or sub-let the entire premises or any portion thereof; or (ii) used the premises for a purpose other than that for which they were leased, 1Subs. by the Karachi Rent Restriction (Amdt.) Ordinance No. XLVIII of 1962, s. 5. or has infringed any condition of the tenure on which the premises are held by the landlord; or (c) the tenant has committed such acts as are likely to impair materially the value or utility of the premises; or (d) the tenant has been guilty of such acts and conduct as are a nuisance to the occupants of premises in the neighbourhood ; or (e) the tenant has ceased to occupy the premises for a continuous period of four months without reasonable cause; or (f) the premises are reasonably and in good faith required by the landlord,___ (i) for the erection or reconstruction of a building, or (ii) for his own use or for the use of any person for whose benefit the premises are held, the Controller may make an order directing the tenant to put the landlord in possession of the premises and if the Controller is not so satisfied he shall make an order rejecting the application: Provided that the Controller may give the tenant a reasonable time for putting the landlord in possession of the premises and may extend such time so as not to exceed four months in the aggregate: Provided further that where the tenancy is for a specified period agreed upon between the landlord and the tenant, the landlord shall not be entitled to apply on the grounds mentioned in clause (f), before the expiry of such period. Explanation.___ For the purpose of clause (a),___ (i) where the water charges or electricity charges or both are payable by the tenant to the landlord such charges shall be deemed to be rent ; (ii) rent remitted by money-order to the landlord or deposited in the office of the Controller having jurisdiction in the area where the premises is situated shall be deemed to have been duly tendered.] (3) Where a landlord has got back possession of any premises from a tenant on the ground that they were reasonably and in good faith required by the landlord for the erection or reconstruction of a building or for his own occupation or for the occupation of any person for whose benefit the premises are held, if the erection or reconstruction of the building is not commenced or the premises are not occupied by the landlord or the other person aforesaid within fifteen days of the vacation of the premises by the original tenant, or having been so occupied are re-let within two months of the said date to any person other than the original tenant, the Controller may, on the application of the original tenant made within three months of his vacating the premises, direct the landlord to place the original tenant in possession of the premises on the original terms and conditions and to pay him such compensation as may be fixed by the Controller. (4) When the Controller directs under subsection (3) that the landlord should pay compensation to the tenant the Controller may recover the amount of such compensation as an arrear of land revenue and may, for the purpose of such recovery, exercise all or any of the powers conferred upon a Collector under Chapter XI of the Bombay Land Revenue Code, 1879 (Bom. Act V of 1879). (5) Nothing in sub-section (1) shall apply in the case of any premises___ (a) which being situated within the municipal limits of the City of Karachi have been specially certified for the purpose of this Act to be in a ruinous or dangerous condition by the Chief officer of the Corporation, (b) which, being situated in a cantonment, have been so certified to be in an insanitary state or unfit for human habitation by the cantonment authority, and (c) in respect of which notice has been issued under section 190 of the City of Karachi Municipal Act, 1933 (Bom.Act XVI of 1933), or under section 119 of the Bombay District Municipal Act, 1901 (Bom. Act III of 1901), or under section 140 or 142 of the Cantonments Act, 1924 (II of 1924). 1[(6) In proceedings under this section on the first date of hearing or as soon as possible after that date and before issues are framed, the Controller shall direct that tenant to deposit all the rent due from him and also to deposit regularly till the final decision of the case, before the fifth day of each month the monthly rent due from him. If there is any dispute about the amount of rent due or the rate of rent, the Controller shall determine such amount approximately and direct that the same be deposited by the tenant before a date to be fixed for the purpose. If the tenant makes default in the compliance of such an order, then if he is the petitioner, his application shall be dismissed summarily and if he is the respondent, his defence shall be struck off and the landlord put into possession of the property without taking any further proceedings in the case. The controller shall finally determine the amount of rent due from the tenant and direct that the same be paid to the landlord, subject to adjustment of the approximate amount deposited by the tenant.] 11. Easement not to be disturbed.___ 2[(1)] No landlord or his contractor workman or servant shall, without the previous written consent of the Controller or save for the purposes of effecting repairs or complying with a municipal requisition, wilfully disturb any convenience or easement annexed to the premises, or remove, destroy or render unserviceable anything provided for permanent use therewith or discontinue or cause to be discontinued any supply or service comprised in the fair rent. 1[(2) Where a landlord contravenes the provisions of sub-section (1) the tenant in occupation of a premises may make an application the Controller complaining of such contravention. (3) If the Controller, on enquiry, finds that the tenant has been in enjoyment of the amenities and that they were cut off or withheld by the landlord without just or sufficient cause, he shall make an order directing the landlord to restore such amenities.] 1Added. by the Karachi Rent Restriction (Amdt.) Ordinance No. XLVIII of 1962, ss. 5 and 6. 2Section 11 renumbered as sub-section (1) of that section, by the Karachi Rent-Restriction (Amdt.) Ordinance, 1962, (48 of 1962), s. 6. 12. Controller may determine fair rent in certain cases. ___In any of the following cases, the Controller may fix the fair rent at such amount as, having regard to the provisions of this Act and the circumstances of the case, he deems just___ (a) where, by reason of any premises having been let at one time as a whole and at another time in parts or where a tenant has sublet or sublets a part of any premises let to him, or for any other reason, any difficulty arises in giving effect to this Act, or (b) where in the case of any premises let furnished, it is necessary to distinguish for the purpose of giving, effect to this Act, the amount payable as rent from the amount payable as hire of furniture; or (c) where, any premises have been or are let rent-free or at a nominal rent or for some consideration in addition to rent. 13. Punishment for contravention of the provisions of section 11. ___Whoever contravenes the provisions 1[of sub-section (1)] of section 11 shall, on conviction, be punished with imprisonment which may extend to six months, or with fine, or with both. 14. Review. ___The Controller may review any order made or deemed to be made by him under this Act and the provisions of Order XLVII in the First Schedule to the Code of Civil Procedure, 1908 (V of 1908), shall so far as may be, apply to such review. 1[15. Appeals and revision. ___(1) Any party, aggrieved by an order passed by a Controller may, within thirty days from the date of such order, prefer an appeal in writing to the District Judge, Karachi, or such other judicial officer as may be empowered by the Provincial Government to hear such appeals. (2) The provisions of the Code of Civil Procedure, 1908 (Act V of 1908), shall apply to an appeal from an order under this Act as they apply to an appeal from a decree of a Civil Court. (3) The provisions of section 115 of the aforesaid Code shall apply to a proceeding or appeal decided under this Act as if such appeal or proceeding were a case which has been decided by a Court subordinate to the High Court within the meaning of that section.] 16. [Omitted] 17. [Omitted] 1[18. Execution of orders. ___Every order made under section 10 or section 11 and every order passed on appeal or revision under section 15 shall be executed by a Civil Court having jurisdiction in the area as if it were a decree of that court.] 1Ins and Subs. by the Karachi Rent Restriction (Amdt.) Ordinance No. XLVIII of 1962, ss. 7, 8 and 10. 19. Controller may require information to be furnished and summon witnesses. ___For the purposes of an enquiry under this Act the Controller may___ (a) require the landlord to produce any book of account, document or other information relating to the premises ; (b) enter and inspect the premises ; (c) authorise any officer subordinate to him to enter and inspect the premises ; or (d) summon and enforce the attendance of witnesses and compel the production of documents by the same means and so far as may be, m the same manner as is provided in the case of a Court by the Code, of Civil Procedure, 1908 (V of 1908). Explanation.___ In this section, the word “land-lord” shall include a servant or an agent of the landlord who is in charge of or looks after the premises on behalf of the landlord. 20. Use of force in certain cases. ___The Controller may, for the purpose of enforcing a direction issued under subsection (3) of section 10 (requiring a landlord to deliver possession of the premises to the original tenant), take or cause to be taken such steps and use or cause to be used such force as may, in his opinion, be reasonably necessary, and for the removal of doubts it is hereby declared that the power to take steps under this section includes the power to require the assistance of the Police and to enter upon the property. 21. Control of Provincial Government. ___The 1[Provincial Government] may from time to time issue general directions for the guidance of officers of Government in all matters connected with the administration of this Act and not therein specially provided for. 22. Bar of jurisdiction. ___No suit or other legal proceeding shall be instituted against any person in respect of anything which is in good faith done or intended to be done under this Act. 23. Cognizance of offence. ___No Court shall take cognizance of an offence under this Act except with the previous sanction in writing of the Controller. 24. Act does not permit increase of rent if not otherwise permissible. ___Nothing in this Act shall be deemed to entitle a landlord to increase the rent of any premises in any case in which he would not be entitled to do so if this Act had not been enacted. 25. Validation of appointments and Acts.___ (1) Every person from time to time appointed or deemed to have been appointed or purporting to have been appointed as Controller under either of the two Acts or the Ordinance referred to in section 29, namely, the Sind Rent Restriction Act, 1947 (Sind Act X of 1947), in so far as it is applicable to the Capital of the Federation, the Sind Rent Restriction (Amendment) Act, 1952 (XXXVII of 1952), and the Karachi Rent Restriction Ordinance, 1953 (Ord. I of 1953)(hereinafter referred to as “the said enactments”) shall be deemed to have been so appointed under and for the purpose of this Act. 1Subs. by the Karachi Rent Restriction (Amdt.) Ordinance No. XLVIII of 1962, s. 11. (2) The fair rent of any premises determined or deemed to have been determined under the said enactments shall be deemed to have been determined under section 4 and every order made or deemed to have been made or act done or deemed to have been done by any officer or authority acting or purporting to act in exercise of the powers conferred by the said enactments shall be deemed to have been made or done by such officer or authority under the corresponding provisions of this Act. (3) Every proceeding pending or purporting to be pending under or by virtue of the said enactments shall be continued and completed in accordance with the corresponding provisions of this Act. 26. Effect of provisions inconsistent with other enactments. ____The provisions of this Act shall have effect notwithstanding anything inconsistent therewith contained in any enactment for the time being in force. 27. Rules. ____The 1[Provincial Government] may, by notification in the Official Gazette, make rules for the purpose of carrying out the provisions of this Act. 28. Savings. ____(1) Any order or rule at any time made or purporting to have been made under any of the said enactments shall, in so far as it is not inconsistent with the provisions of this Act, be deemed to have been made under the provisions of this Act, and shall have effect accordingly. (2) No suit, prosecution or other legal proceedings whether by way of petition or otherwise shall lie in respect of anything which has been in good faith done or intended to be done in pursuance of or in exercise of the powers in good faith believed to have been conferred by or under any of the said enactments. 29. Repeal. ____The said enactments, namely___ (1) The Sind Rent Restriction Act, 1947 (Sind Act X of 1947), in so far as it is applicable to the Capital of the Federation ; (2) The Sind Rent Restriction (Amendment) Act, 1952 (XXXVII of 1952) ; and (3) The Karachi Rent Restriction Ordinance, 1953 (Ord I of 1953), are hereby repealed. RI - Date: 14-05-2024 1Subs. by the Karachi Rent Restriction (Amdt.) Ordinance No. XLVIII of 1962, s. 11."
}