{
  "file": "administratordeb5b58d7fd5b7b6fa804b8b9919915c.pdf",
  "law_name": "THE EX-EMPLOYEES OF THE FORMER GOVERNMENT OF EAST",
  "text": "THE EX-EMPLOYEES OF THE FORMER GOVERNMENT OF EAST PAKISTAN (APPOINTMENT TO FEDERAL POSTS) ORDINANCE, 1983 CONTENTS 1. Short title, extent and commencement 2. Definitions 3. Appointment 4. Seniority 5. Pension THE EX-EMPLOYEES OF THE FORMER GOVERNMENT OF EAST PAKISTAN (APPOINTMENT TO FEDERAL POSTS) ORDINANCE, 1983 ORDINANCE No. XI OF 1983 [25th May, 1983] An Ordinance to provide for the appointment of former employees of the Government of East Pakistan to posts under the Federal Government. WHEREAS it is expedient to provide for the appointment of former employees of the Government of East Pakistan to posts under the Federal Government; AND WHEREAS the President is satisfied that circumstances exist which render it necessary to take immediate action; NOW, THEREFORE, in pursuance of the Proclamation of the fifth day of July 1977, and in exercise of all powers enabling him in that behalf, the President is pleased to make and promulgate the following Ordinance:___ 1. Short title, extent and commencement.___ (1) This Ordinance may be called the Ex-Employees of the former Government of East Pakistan (Appointment to Federal Posts) Ordinance, 1983. (2) It extends to the whole of Pakistan. (3) It shall come into force at once and shall be deemed to have taken effect on the sixteenth day of December, 1971. 2. Definitions. In this Ordinance, unless there is anything repugnant in the subject or context,__ (a) “employee” means an employee of the former Government of East Pakistan who was repatriated or who migrated from East Pakistan to Pakistan during the period commencing on the 16th December, 1971, and ending on the 31st December, 1974, in consequence of occupation of the territory by enemy troops or establishment of Bangladesh ; (b) “former post” means the post which was held by an employee at the time of his repatriation or migration to Pakistan; (c) “Grade” means the Grade of the National Pay Scale in which a post or group of posts is placed; and (d) “post” means a post in an All-Pakistan Service or a service of the Federation or a post in connection with the affairs of the Federation. 3. Appointment. An employee may, with the approval of the competent Authority, be appointed to an existing or supernumerary post in the Grade, as far as practicable, equivalent to the scale of the former post of such employee from the date he holds such post. Explanation.___ In this section, “competent authority”, in relation to a post, means the authority competent under the Civil Servants Act, 1973 (LXXI of 1973), to make appointment to that post. 4. Seniority. The service rendered under the former Government of East Pakistan by an employee shall count towards seniority in the Grade of the post to which he may be appointed under section 3. 5. Pension. The service rendered under the former Government of East Pakistan, which qualified for pension under that Government by an employee who is appointed to a post under section 3 shall count for the purposes of pension under the Federal Government."
}