{
  "file": "administrator557e8cd273c8f3d495ac64336718409f.pdf",
  "law_name": "The Metal Tokens Act, 1889",
  "text": "THE METAL TOKENS ACT, 1889 CONTENTS 1. Title and extent. 2. Definition. 3. Prohibition of making by private persons of pieces of metal to be used as money. 4. Penalty for unlawful making, issue or possession of such pieces. 5. Cognizance of offences under the last foregoing section. 6. Application of certain of the foregoing provisions of this Act to importation of pieces of metal for use as money. 7. Addition to section 98, Act X of 1882. 8. Prohibition of receipt by local authorities and railways as money of metal which is not coin. 9. Amendment of section 28 of the Indian Penal Code. THE METAL TOKENS ACT, 1889 1 ACT NO. I OF 1889 [1st February, 1889] An Act for the Protection of Coinage and other purposes WHEREAS it is expedient to prohibit the making, or the Possession for issue or the issue, by private persons, of pieces of metal for use as money; And whereas it is also expedient to amend section 28 of the Pakistan Penal Code (XLV of 1860); It is hereby enacted as follows:— 1. Title and extent.—(1) This Act may be called the Metal Tokens Act, 1889. 2 [(2) It extends to the whole of Pakistan]; 3 * 3[* * * * * * *] 2. Definition. In this Act “issue” means to put a piece of metal into circulation for the first time for use as money in 4[Pakistan] such piece having been made in contravention of this Act or brought into 4[Pakistan] by 5[air, sea or land] in contravention of any notification for the time being in force under section 6[16 of the customs Act, 1969 (IV of 1969)]. 3. Prohibition of making by private persons of pieces of metal to be used as money. No piece of copper or bronze or of any other metal or mixed metal, which, whether stamped or unstamped, is intended to be used as money, shall be made except by the authority of the 7[Federal Government]. 4. Penalty for unlawful making, issue or possession of such pieces.—(1) In either of the following cases, namely:— (a) if any person makes in contravention of the last foregoing section, or issues or attempts to issue, any such piece as is mentioned in that section, (b) if, after the expiration of three months from the commencement of this Act, any person has in his possession, custody or control any such piece as is mentioned in the last foregoing section, with intent to issue the piece, 1For Statement of Objects and Reasons, see Gazette of India, 1888, Pt. V; p 19; for Report of the Select Committee. see ibid., 1889, Pt. IV. p. 3; and for Debates in Council, see ibid., 1888, Pt. VI, pp 40 and 81, and ibid., 1889, Pt. VI, pp. 3 and 9. 2Sub-section (2) as amended by A. O., 1949, Arts. 3(2) and 4, has been subs. by the Central Laws (Statute Reform) Ordinance, 1960 (21 of 1960), s. 3 and 2nd Sch. (with effect from the 14th October, 1955). 3The word “and” at the end of sub-section (2), and sub-section (3), were rep. by the Repealing and Amending Act, 1914 (10 of 1914), s. 3 and Sch. II. 4Subs. by Ord. 21 of 1960, s. 3 and 2nd Sch. (with effect from the 14th October, 1955), of “the Provinces and the Capital of the Federation” which had been subs. by A. O., 1949, Arts. 3(2) and 4, for “British India”. 5Subs. by the Federal Laws (Revision and Declaration) Ordinance, 1981 (27 of 1981), s. 3 and 2nd Sch., for “sea or by land”. 6Subs. ibid., for “19 of the Sea Customs Act, 1878”. 7Subs. by F.A.O., 1975, Art. 2 and Table, for “Central Government”, which was previously subs. by A. O., 1937, for “G. G. in C.”, to read as above. the person shall be punished, (i) if he has not been previously convicted under this section, with imprisonment which may extend to one year, or with fine, or with both; or, (ii) if he has been previously convicted under this section, with imprisonment which may extend to three years, or with fine, or with both. (2) If any person is convicted of an offence under sub-section (1), he shall, in addition to any other punishment to which he may be sentenced, forfeit all such pieces as aforesaid, and all instruments and materials for the making of such pieces, which may have been found in his possession, custody or control. (3) If in the trial of any such offence the question arises whether any piece of metal or mixed metal was intended to be used or to be issued for use as money, the burden of proving that the piece was not intended to be so used or issued shall lie on the accused person. 5. Cognizance of offences under the last foregoing section.—(1) The offence of making, in contravention of section 3, any such piece as is mentioned in that section shall be a cognizable offence. (2) Notwithstanding anything in the 1[Code of Criminal Procedure, 1898], (V of 1898) no other offence punishable under section 4 shall be a cognizable offence, or 2* * * be taken cognizance of by any Magistrate, except a District Magistrate or Sub-Divisional Magistrate, without the previous sanction of the District Magistrate or Sub-Divisional Magistrate. 6. Application of certain of the foregoing provisions of this Act to importation of pieces of metal for use as money. 3[If at any time the Federal Government sees fit, by notification under section 16 of the Customs Act, 1969, (IV of 1969) to prohibit to restrict the bringing by air, sea or land into Pakistan of any such pieces of metal as are mentioned in section 3, it may by notification direct that any person contravening the prohibition or restriction shall be liable to the punishment to which he would be liable if he were convicted under this Act of making such pieces in Pakistan, instead of to the penalty mentioned in section 156 of the Customs Act, 1969 (IV of 1969), and that the provisions of sub-section (3) of section 4 and sub-section (1) of section 5, or of either sub- section, in relation to the offence of making such pieces shall, notwithstanding anything in the Customs Act, 1969, apply, so far as they can be made applicable, to the offence of contravening the prohibition or restriction notified under section 16 of that Act.] 7. [Addition to section 98, Act X of 1882.] Rep. by the Code of Criminal Procedure, 1898 (V of 1898). 1Subs. by the Federal Laws (Revision and Declaration) Ordinance, 1981 (27 of 1981), s. 3 and 2nd Sch., for “Code of Criminal Procedure, 1882”. 2The words “beyond the limits of a presidency town” omitted by A. O., 1949, Sch. 3Section 6 subs. by Ord. 27 of 1981, s. 3 and 2nd Sch. 8. Prohibition of receipt by local authorities and railways as money of metal which is not coin.—(1) No piece of metal which is not coin as defined in the Pakistan Penal Code (XLV of 1860) shall be received as money by or on behalf of any railway-administration or local authority. (2) If any person on behalf of a railway-administration, or on behalf of a local authority, or on behalf of the lessee of the collection of any toll or other impost leviable by a railway is administration or local authority, receives as money any piece of metal which is not such coin as aforesaid, he shall be punished with fine which may extend to ten rupees. 9. [Amendment of section 28 of the Indian Penal Code.] Rep. by the Repealing Act, 1938 (I of 1938), s. 2 and Sch. ___________ Date: 05-09-2024"
}