{
  "file": "administratorb3773d0bd821991632eb6c517251e76c.pdf",
  "law_name": "The National Bank Of Pakistan Ordinance, 1949",
  "text": "THE NATIONAL BANK OF PAKISTAN ORDINANCE, 1949 CONTENTS PREAMBLE CHAPTER I PRELIMINARY 1. Short title, extent and commencement. 2. Definitions. CHAPTER II ESTABLISHMENT, INCORPORATION AND SHARE CAPITAL OF THE NATIONAL BANK OF PAKISTAN 3. Establishment and incorporation of the Bank. 4. Share Capital. CHAPTER III SHARES 5. Nature of shares. 6. Principal register of shareholders. 7. Branch registers. 8. Qualifications of shareholders. 9. Federal Government a shareholder. 10. No notice to be taken of trusts. CHAPTER IV MANAGEMENT 11. Head Office of the Bank. 12. Central Board. 13. Local Boards. 14. Constitution of the Central Board. 15. Constitution of Local Boards. 16. Managing Director and Deputy Managing Directors. 17. Qualifications and disqualifications of Directors and Members. 18. Removal of Directors and Members. 19. [Omitted.] 20. Terms of office of Directors and Members. 21. Vacancies. 22. General and Special Meetings. 23. Local and special local meetings. 24. Votes of shareholders. CHAPTER V BUSINESS OF THE BANK 25. Business which the Bank is authorised to transact. 26. Business which the Bank is not authorised to transact. 26 A. Exceptions. CHAPTER VI MISCELLANEOUS 27. Auditors. 28. Government Auditors. 29. Rights and duties of auditors. 30. Acceptance of liabilities. 31. Liquidation of the Bank. 32. Power of the Central Board to make bye laws. 33. [Omitted.] THE NATIONAL BANK OF PAKISTAN ORDINANCE, 1949 1ORDINANCE NO. XIX OF 1949 [9th November, 1949] An Ordinance to constitute a National Bank of Pakistan. WHEREAS an emergency has arisen which renders it necessary to extend banking facilities generally and also to provide credit for agriculture and agricultural produce; NOW, THEREFORE, in exercise of the powers conferred by section 42 of the Government of India Act, 1935 (26 Geo.5,c.2.), the Governor-General is pleased to make and promulgate the following Ordinance:___ CHAPTER I PRELIMINARY 1. Short title, extent and commencement.—(1) This Ordinance may be called the National Bank of Pakistan Ordinance, 1949. 2[(2) It extends to the whole of Pakistan.] (3) It shall come into force at once. 2. Definitions.___In this Ordinance, unless there is anything repugnant in the subject or context,— (a) “the Bank” means the National Bank of Pakistan constituted by this Ordinance; (b) “the Central Board” means the Central Board of Directors of the Bank; (c) “Local Board” means a Local Board of Members at Karachi, Dacca or Lahore; (d) “Director” means a Director for the time being of the Central Board; (e) “Member” means a Member for the time being of a Local Board; (f) “dividend” includes bonus; (g) “goods” includes bullion, wears and merchandise; (h) “general meeting” means the annual meeting of the shareholders of the Bank; (i) “local meeting” means the annual meeting of the shareholders whose names are registered in a branch register; (j) “meeting” includes an adjourned holding of a meeting; 1 The Ordinance has been applied__ (i) to Baluchistan, with effect from the 9th day of November, 1949, see Gaz. of P., 1952, Pt. I, p. 150; (ii) in the Federated Areas of Baluchistan, see ibid., 1953, Part I, p. 152; and (iii) extended to the Leased Areas of Baluchistan, by the Leased Areas (Laws) Order, 1950 (G. G. O. 3 of 1950). It has also been extended to___ (a) the State of Bahawalpur, subject to certain modifications, see the Bahawalpur (Federal Laws) (Extension) Order, 1952 (G. G. O. 11 of 1952); (b) the Baluchistan States Union, see the Baluchistan States Union (Federal Laws) (Extension) Order, 1953 (G. G. O. 4 of 1953); and (c) the Khairpur State, seethe Khaipur (Federal Laws) (Extension) Order, 1953 (G. G. O. 5 of 1953). The Act has been and shall be deemed to have been brought into force in Gwadur with effect from the 8th September, 1958, by the Gwadur (Application of Central Laws) Ordinance 1960 (37 of 1960), s. 2. The Acts/Ordinance and the rules, notifications and orders made thereunder, have been applied to the whole of the Federally Administered Tribal Areas or to the parts of those Areas to which they do not already apply, by Regulation No. I of 1975, s. 2 and the Schedule. The Act/Ordinance and the rules, notifications and order made thereunder, as in force in N.W.F.P. before the 15th July, 1975, have been applied to the Districts of Chitral, Dir, Swat and Malakand Protected area of the N.W.F.P. by Regulation No. III of 1975, s. 2 and the Sch. 2 Subs. by the Central Laws (Statute Reform) Ordinance, (21 of 1960), s. 3., and 2nd Sch., for the original sub-section (2) (with effect from the 14th October, 1955). (k) “prescribed” means prescribed by bye-laws made under this Ordinance; 1[(1) “Managing Director” means the Managing Director of the Bank;] (m) “special meeting” means a meeting of the shareholders of the Bank convened for transacting some particular business specified in the notice convening the meeting; (n) “special local meeting” means a meeting of the shareholders whose names are registered in a branch register, convened for transacting some particular business specified in the notice convening the meeting; (o) “special resolution” means a resolution passed at a special meeting; and (p) “special local resolution” means a resolution passed at a special local meeting. CHAPTER II ESTABLISHMENT, INCORPORATION AND SHARE CAPITAL OF THE NATIONAL BANK OF PAKISTAN 3. Establishment and incorporation of the Bank.____(1) As soon as may be after the commencement of this Ordinance, there shall be constituted in accordance with the provisions of this Ordinance a bank to be called the National Bank of Pakistan to carry on the business of banking. (2) The Bank shall be a body corporate having perpetual succession and a common seal, and shall by the said name sue and be sued. 4. Share Capital.___(1) Subject to the provisions of this Ordinance the authorised 2[Capital] of the Bank shall be 3[such as the Federal Government, may by notification in the official Gazette, specify and the amount so specified shall be divided into] 4[Ordinary shares of ten] rupees each. (2) Out of the said capital there shall, from time to time, be issued such number of shares and on such terms, if any, including the terms of brokerage and underwriting, as the Central Board may decide 5[.] 6* * * * * * * (3) The liability of the shareholders of the Bank shall be limited to the amount not fully paid up on their shares. (4) The shareholders of the Bank may, subject to the sanction of the 7[Federal Government], 8* * * by special resolution, increase or reduce the capital of the Bank. CHAPTER III SHARES 5. Nature of shares.___The shares of the Bank shall be movable property and each share shall be distinguished by its appropriate number. 6. Principal register of shareholders.___The Bank shall maintain at its Head Office established under section 11 a register, to be called the principal register, of all shareholders of the Bank, and shall enter therein such particulars as may be prescribed. 1 Subs. by the National Bank of Pakistan (Amdt.) Ordinance, 1960 (52 of 1960), s. 2, for the original cl. (1). 2 Subs. by the National Bank of Pakistan (Amdt.) Ordinance, 1960 (52 of 1960), s. 3, for “share capital”. 3 Subs. by the National Bank of Pakistan (Amdt.) Ordinance, 1981 (42 of 1981), s. 2, for “[three crores] or rupees divided into thirty lakh” The words in crotchets were subs. by the National Bank of Pakistan (Amdt.) Ordinance, 1960 (52 of 1960), s., 3, for “six crores”. 4 Subs. by the National Bank of Pakistan (Amdt.) Ordinance, 1970 (14 of 1971), s. 2, for “six hundred thousand Ordinary shares of fifty”. 5Subs. by Ord. 52 of 1960, s. 3 for the colon. 6 Proviso omitted ibid. 7 Subs. by the National Bank of Pakistan (Amdt.) Act, 1973 (11 of 1973), s. 6, for “Central Government”. 8 The original words “and subject to the provision of the proviso to sub-section (2),” omitted by the National Bank of Pakistan (Amdt.) Ordinance, 1960 (52 of 1960), s. 2. 7. Branch registers.___(1) The Bank shall cause to be maintained at the offices of its Local Boards branch registers of the shareholders qualified and entitled to be registered therein, containing such particulars as may be prescribed. (2) Subject to the provisions of this Ordinance shares shall be transferable from one branch register to another. 8. Qualifications of shareholders.___(1) No person shall be qualified to be registered as a shareholder who by reason of anything contained in any law for the time being in force is not competent to enter into any contract. (2) A person who subsequent to his registration, is discovered to have been not qualified as aforesaid at the time of registration shall not be entitled to exercise any of the rights of a shareholder otherwise than for the purpose of the sale of his shares under the orders of a competent Court. (3) (a) A shareholder shall be entitled to be registered in any area defined in sub-section (5) in which he ordinarily resides or has his principal place of business. (b) A shareholder who neither resides nor has a place of business in the areas defined in sub-section (5) shall be registered in such branch register as the Central Board 1[may from time to time]. (c) No person shall be registered as a shareholder in more than one branch register. 2[* * * * * * *] 3[(5) The area served by the branch register maintained at Karachi shall consist of the 4[the Provinces of Sind and Baluchistan including the Provincially Administered Tribal Areas; 5[and] the area served by the branch register maintained at Lahore shall consist of the Provinces of the Punjab and North West Frontier including the Provincially Administered Tribal Areas, 5[and] the Islamabad Capital Territory and the 6[Federally] Administered Tribal Areas] 5[* * *]. 9. Central Government a shareholder.___Notwithstanding anything contained in section 8, the Central Government shall be a shareholder of the Bank and shall purchase at par not less than twenty-five percent of the shares issued by the Bank from time to time. 10. No notice to be taken of trusts.___No notice of any trust, express, implied or constructive shall be entered on the principal or any branch register or be receivable by the Bank. CHAPTER IV MANAGEMENT 11. Head office of the Bank.___The Head Office of the Bank shall be at Karachi. 12. Central Board.___The general superintendence and direction of the affairs and business of the Bank shall be entrusted to the Central Board which may exercise all powers and do all such acts and things as may be exercised or done by the Bank and are not by this Ordinance expressly directed or required to be done by the Bank in general meeting. 13. Local Boards.___7[Two] Local Boards shall be established for the areas mentioned in sub-section (5) of section 8, one each at 8[Karachi] and Lahore, and shall without prejudice to the powers conferred by section 12, have power, within the prescribed limits, generally to transact all the usual business of the Bank. 1 Subs. by the National Bank of Pakistan (Amdt.) Ordinance, 1960 (52 of 1960), s. 4 for certain original words. 2 Omitted by the Federal Laws (Revision and Declaration) Ordinance, 1981 (27 of 1981), s. 3 and Sch. II. 3 Subs. by the National Bank of Pakistan (Amdt.) Ordinance, 1960 (52 of 1960), s. 4, for the original sub-section (5), as amended by the Federal Laws (Revision and Declaration), Act, 1951 (26 of 1951), and the Central Laws (Statute Reforms), Ordinance, 1960 (21 of 1960). 4 Subs. by the National Bank of Pakistan (Amdt.) Act, 1973 (11 of 1973), s. 2. 5 Ins. and omitted by F.A.O., 1975, Art. 2 and Sch. 6 Subs. ibid., Art. 2 and Table. 7 Subs. by F.A.O., 1975, Art. 2 and Sch., for “three”. 8 Subs. ibid., for “Karachi, Dacca”. 114. Constitution of the Central Board.___(1) The Central Board shall consist of the following Directors, namely:___ (a) the Managing Director appointed by the 2[Federal Government] under section 16; 3[(b) four Directors elected in local or special local meetings by the shareholders in such manner that the shareholders registered in a branch register maintained for an area mentioned in sub-section (5) of section 8 shall elect from amongst themselves such number of Directors for that area as may be decided before election by the Central Government having regard to the proportion which the share capital subscribed by the shareholders of that area bears to the whole: Provided that the Federal Government may, at any time, by order in writing, direct that, for such period as may be specified in the order, no Director Shall be elected for any area so specified, and, where it makes such an order, shall allocate to the other areas the seats of the Directors who would have been elected for that area had no such order been made;] 4[(c) Five Directors appointed by the Federal Government:] (2) The 4[Chairman] of the Central Board shall be appointed by the 5[Federal Government] from amongst the Directors. 15. Constitution of Local Boards.___A Local Board shall consist of the following members, namely:___ (a) the Managing Director 6[* * *]: Provided that in the event of the inability of 7[Managing Director] to attend the meeting of a Local Board 8[he] may nominate an officer of the Bank to attend as an ex-officio Member; (b) one Member appointed by the Central Board from amongst the Directors elected by the shareholders registered in the branch register of that area; (c) two Members appointed by the 5[Federal Government] from the area in which the Local Board is established; (d) 9[three] Members elected in a local or special local meeting from amongst themselves by the shareholders registered in the branch register of that area. 16. Managing Director and Deputy Managing Directors.___10[(1) The Managing Director shall be appointed by the 2[Federal Government] for a period not exceeding 11[five] years and on such salary and terms and conditions of service as the 2[Federal Government] may determine: Provided that neither the salary nor the terms and conditions of service shall be varied to his disadvantage during his tenure of office 12[ : ]] 1 For notification under this section, see Gaz. of P., 1953, Ext., p. 299. 2 Subs. by the National Bank of Pakistan (Amdt.) Act, 1973 (11 of 1973), s. 6, for “Central Government”. 3 Subs. ibid., s. 3. 4 Subs. by the National Bank of Pakistan (Amdt.) Act, 1973 (11 of 1973), s. 3. 5 Subs. ibid., s. 6, for “Central Government”. 6 The original words “or a Deputy Managing Director” omitted by the National Bank of Pakistan (Amdt.) Ordinance, 1960 (52 of 1960), s. 6. 7 Subs. ibid., for “either of them”. 8 Subs. ibid., for “the Managing Director”. 9 Subs. ibid., s. 6, for “two”. 10 Subs. by the National Bank of Pakistan Ordinance (Amdt.) Act, 1953 (29 of 1953), s. 2 for the original sub-section (1). 11 Subs. by the National Bank of Pakistan (Amdt.) Ordinance, 1960 (52 of 1960), s. 7, for “three”. 12 Subs. ibid., for full-stop. 1[Provided further that the appointment may be terminated by six months’ notice in writing given by the 2[Federal Government] to him or by him to the 2[Federal Government.] 3[* * * * * * *] (3) The Managing Director 4[* * *] shall on the expiry of 5[his term] of office be eligible for re-appointment: Provided that no person shall hold office as Managing Director 6[* * *] who is a member of the 7[Federal] or a Provincial Legislature. 8[(4) The Managing Director shall be the chief executive officer of the Bank and shall, subject to any bye-laws made in this behalf, direct and control, on behalf of the Central Board, the affairs of the Bank.]. 17. Qualifications and disqualifications of Directors and Members.___(1) No person not appointed by the 2[Federal Government] to serve as a Director or Member shall be qualified to serve as a Director or Member unless he is a holder in his own right of unencumbered shares of the Bank to the nominal amount of ten thousand rupees at the least. (2) No person shall be qualified to serve as a Director or Member___ 9[* * * * * * *] 10[*] (b) if he is a salaried officer of any Government 11[,whether within or without Pakistan, and is] not authorised by the 2[Federal Government] to serve as a Director or Member 12[;] 13[(c) if he has been convicted of an offence involving moral turpitude; (d) if he was at any time in the service of the Bank and was dismissed or his services had been terminated by the bank; (e) if he is a Director of any commercial bank other than a bank sponsored or established by or under the authority of the 2[Federal Government] or the State Bank of Pakistan for the development of industry or agriculture in the country, or a bank which is a society registered under the Cooperative Societies Act, 1912 (Act II of 1912) or any other law for the time being in force in Pakistan relating to co-operative societies; (f) if he is in the employment of any banking company, whether on salary or on commission, or is engaged in the performance of any continuous service for remuneration for any such company; 14* 1 Second proviso added . by the National Bank of Pakistan (Amdt.) Ordinance, 1960 (52 of 1960 ), s.7 2 Subs. by the National Bank of Pakistan (Amdt.) Act, 1973 (11 of 1973), s. 6, for “Central Government”. 3 Sub-section (2) omitted ibid. 4 The original words “and Deputy Managing Director” omitted ibid. 5 Subs. ibid. for “their respective terms”. 6 The original words “or Deputy Managing Director” omitted ibid. 7 Subs. by F.A.O., 1975, Art. 2 and Table, for “Central”. 8 Added by the National Bank of Pakistan (Amdt.) Ordinance, 1970 (14 of 1970), s. 3. 9 The original cl. (a) omitted by the National Bank of Pakistan (Amdt.) Ordinance, 1962 (61 of 1962), s. 2. 10 The original word “or” omitted by the National Bank of Pakistan (Amdt.) Ordinance, 1960 (52 of 1960), s. 8. 11 Subs. ibid., “in Pakistan”. 12 Subs. ibid., for full-stop. 13 New cls. (c) to (g) added, ibid. 14 Omitted by the National Bank of Pakistan (Amdt.) Ordinance, 1970 (14 of 1970), s. 4. 1[(g) if he is for the time being disqualified for membership of any body established by or under any law (P.O 13 of 1959) for the time being in force of which the Constituent members are wholly or partly chosen by means of election 2[;] 2[(h) if having been a Director or Member, his office as such has been vacated, or deemed to be vacated under the provisions of clause (h) of sub-section (3); or (i) If he has vacated his office as Director or, as the case may be, Member under clause (i) of sub-section (3) unless a period of three years has elapsed since the date he so vacated his office.]. (3) The office of a Director or Member shall be vacated___ (a) if the person holding it resigns his office or dies; (b) if he accepts or holds any other office of profit under the Bank; (c) if he is, or at any time has been, adjudicated an insolvent, or compounds with his creditors or suspends payment; (d) if he is found lunatic, or becomes of unsound mind; (e) if he has absented himself from three consecutive meetings of the Central or a Local Board, as the case may be, or from all such meetings for a continuous period of six months, whichever is longer, without leave of absence from the Board concerned; 3[*] (f) if he ceases to hold in his own right the amount of shares required to qualify him for the office 4[;] 5[*] 6[(g) if he incurs any of the disqualifications mentioned in sub-section (2) 7[;] 8[(h) if, in relation to the Bank he has failed to pay any advance, loan or credit limit or any installment thereof or interest thereon, or any amount due on any guarantee, or to do or perform any act agreed or undertaken in writing to be done or performed by him, and such failure continues for a period of one month after notice in writing has been served on him by the Bank calling upon him to make the payment or to do or perform the act; or (i) if he has been a Director or Member for a continuous period of six years from the date when he was first elected as such Director or Member or, as the case may be, was appointed by name and otherwise than by designation of office, as such Director or Member.] 9[Explanation.___ In computing the period of six years for the purpose of this clause any break of less than three years in the continuity of office shall be disregarded.]. (4) No two persons who are partners of the same mercantile firm, or who are directors of the same private company, or one of whom is the general agent of, or holds a power of procuration from the other or from a mercantile firm of which the other is a partner, shall be eligible or qualified to serve as Directors of the Central Board, or as Members of the same Local Board at the same time 10[:] 1 Subs. by the Federal Laws (Revision and Declaration) Ordinance, 1981 (27 of 1981), s. 3 and II Sch. 2 Subs. and added by Ord. 14 of 1970, s. 4. 3 The original word “or” omitted by the National Bank of Pakistan (Amdt.) Ordinance, 1960 (52 of 1960), s. 8. 4 Subs. ibid., for full-stop. 5 The word “or” which was added ibid., have been omitted by the National Bank of Pakistan (Amdt.) Ordinance, 1970 (14 of 1970), s. 4. 6 Cl. (g) added ibid. 7 Subs. by Ord. 14 of 1970, s. 4. 8 Added, ibid. 9 Added by the National Bank of Pakistan (Amdt.) Act, 1973 (11 of 1973), s. 4. 10 Subs. omitted and added by the National Bank of Pakistan (Amdt.) Ordinance, 1970 (14 of 1970), s. 4. 1[* * * * * * *] 1[(5) Nothing in sub-section (1), or in clause (b) of sub-section (2), or in clauses (b) and (i) of sub-section (3) shall apply to the Managing Director or an officer nominated by the Managing Director or an officer nominated by the Managing Director under the proviso to clause (a) of section 15.]. 18. Removal of Directors and Members.___(1) The shareholders may, by a special resolution passed by the votes of shareholders holding in the aggregate more than one half of the paid-up capital for the time being, removed any Director, other than a Director appointed by the 2[Federal Government], before the expiration of his period of office, and appoint in his stead a qualified person who shall hold office subject to sub-section (2) of section 21. (2) The shareholders on a branch register may, by a special local resolution passed by the votes of shareholders holding in the aggregate more than one half of the paid-up capital for the time being on the branch register concerned, remove any Member, other than a Member appointed by the 2[Federal Government] or the Central Board of the Local Board concerned, before the expiration of his period of office, and appoint in his stead a qualified person who shall hold office subject to sub-section (2) of section 21. (3) Directors and Members appointed by the 2[Federal Government] and the Central Board may be removed and replaced by other Director and Members at the discretion of the appointing authorities concerned. 19. [First Constitution of the Central and Local Boards.] Omitted by the National Bank of Pakistan (Amdt.) Ordinance, 1960 (52 of 1960), s. 9. 20. Terms of office of Directors and Members.___(1) 3[At every general meeting] one third of the 4[elected] Directors and Members for the time being, or if their number is not three or a multiple of three then the number nearest to one third, shall retire from office 5[; but the retired Director or Members shall, subject to the provisions of section 17, be eligible for re-election]. (2) The Directors and Members to retire at every general 6[* *] meeting shall be those who have been longest in office, and as between those Directors and Members who are to retire and who have been in office for an equal length of time the Director and Member to retire shall in default of agreement amongst themselves be determined by lot, the length of time a Director or Member has been in office being subject to subsection (2) of section 21, computed from his last election. 7[* * * * * * *] 8[(3) A Director or Member appointed by the Federal Government, other than the Managing Director, shall hold office during the pleasure of the Federal Government. (4) A Member appointed by the Central Board shall cease to hold office when he ceases to be a Director.] 21. Vacancies.____ (1) Any vacancy occurring on the Central or a Local Board by the death, resignation 9[, removal] or disqualification of any Director or Member shall be filled by the remaining Directors or Members, as the case may be, who shall co-opt a duly qualified person to fill the vacancy: 1 Subs. omitted and added by the National Bank of Pakistan (Amdt.) Ordinance, 1970 (14 of 1970), s. 4. 2 Subs. by Act 11 of 1973, s. 6, for “Central Government”. 3 Subs. by the National Bank of Pakistan (Amdt.) Ordinance, 1960 (52 of 1960), s. 10, for certain original words. 4 Ins. by the National Bank of Pakistan Ordinance (Amdt.) Act, 1953 (29 of 1953), s. 3. 5 Added by the National Bank of Pakistan (Amdt.) Ordinance, 1970 (14 of 1970), s. 5. 6 The original words “and local” omitted by Ordinance 52 of 1960, s. 10. 7 Sub-section (2A) which was originally inserted by Ord. 52 of 1960, s. 10 have been omitted by Ord. 14 of 1970, s. 5. 8 The original sub-section (3) which was subs. by Ord. 14 of 1970, s. 5 has been subs. by the National bank of Pakistan (Amdt.) Act, 1973 (11 of 1973), s. 5. 9 Ins. by the National Bank of Pakistan (Amdt.) Ordinance, 1960 (52 of 1960), s. 11. Provided that where a vacancy occurs in the office of a Director or Member appointed by the 1[Federal Government] or the Central Board, the vacancy shall be filled only by appointment by the 1[Federal Government] or the Central Board, as the case may be. (2) Any Director or Member so 2* * appointed shall be deemed to have held office from the date on which the Director or Member in whose place he is 2[* *] appointed was 3[* *] appointed, or, when such Director or Member was co-opted or appointed under this sub-section, from the date on which his mediate or immediate predecessor was 2[* *] appointed, as the case may be. 4[(3) Any Director or Member co-opted under sub-section (1) shall retire at the next general or local meeting, as the case may be, and the vacancy so occurring on the Central or a Local Board shall be filled by election as provided in clause (b) of sub-section (1) of section 14 or clause (d) of section 15, as the case may be.] 22. General and Special meetings.___(1) In the first week of March in every year, or as soon thereafter as is convenient, a general meeting shall be held annually in rotation at the towns where the Local Boards are established, at such time as may be determined by the Central Board and at the meeting the 5[shareholders present shall be entitled to discuss the annual account, the report of the Central Board on the working of the Bank throughout the year, and the auditors report on the annual balance sheet and accounts, made up to the preceding thirty-first day of December]. Provided that the first general meeting shall be held at Karachi. (2) Special meetings shall be convened and held in such manner and at such time and place as may be prescribed. 23. Local and special local meetings.___Local and special local meetings shall be convened and held in such manner and at such time and place as may be prescribed. 24. Votes of shareholders.___(1) Every shareholder shall be entitled to attend any meeting and each shareholder who has been registered as such for a period of not less than three months prior to the date of such meeting shall when present in person and on a show of hands, have one vote; and on a poll each shareholder so registered for a like period shall have one vote for every ten shares 6[, subject to a maximum of 7[ten] votes]: Provided that no shareholder shale be entitled to vote at any meeting unless all calls or other sums presently payable by him in respect of shares of the Bank have been paid. 8[(2) On a poll votes may be given either personally or by proxy, but the 4[Federal Government], as a shareholder may appoint any person to be present at any general meeting and to vote on its behalf.]. CHAPTER V BUSINESS OF THE BANK 25. Business which the Bank is authorised to transact.___The Bank is authorised to carry on and transact the 13 several kinds of business hereinafter specified, namely:___ (1) the advancing and lending of money, and opening of cash-credits upon the security of___ (a) stocks, funds and securities 9[* * *] in which a trustee is authorised to invest trust money by any law for the time being in force in Pakistan and shares of the State Bank of Pakistan; 1 Subs. by the National Bank of Pakistan (Amdt.) Act, 1973 (11 of 1973), s. 6, for “Central Government”. 2 The original words “co-opted or” omitted by Ordinance, 52 of 1960, s. 11. 3 The original words “elected or” omitted ibid. 4 Sub-section (3) added, ibid. 5 Subs. ibid., s. 12, for certain original words. 6 Ins . by the National Bank of Pakistan (Amdt.) Ordinance, 1960 (52 of 1960 ), s.13 7 Subs. by the National Bank of Pakistan (Amdt.) Ordinance, 1970 (14 of 1970), s. 6 for “fifty”. 8Sub-section (2) subs. Ibid. 9The original brackets and words “(other than immoveable property)” omitted by the National Bank of Pakistan (Amdt.) Ordinance, 1960, (52 of 1960), s. 14. (b) debentures or other securities for money issued under the authority of any law or a time being in force in Pakistan by, or on behalf of, a port trust authority or a district board or a municipal board or committee 1[* * *]; (c) goods which, or the documents of title to which, are deposited with, or assigned to, the Bank as security for such advances, loans or credits; (d) subject to such directions as may be issued by the Central Board, debentures of companies with limited liability; (e) shares of companies with limited liability, in accordance with such directions in this regard as may be issued from time to time by the State Bank of Pakistan; (f) goods which are hypothecated to the Bank as security for such advances, loans or credits 2[* * *]; (g) accepted bills of exchange and promissory notes endorsed by the payees and joint and several promissory notes of two or more persons or firms unconnected with each other in general partnership; 3[*] 4[(h) immovable property or documents of title relating thereto, subject to such directions as may be issued by the Central Board;] 5[(i) subject to such directions as may be issued by the Central Board, tea crops;] Provided that any advances or loans which are guaranteed by the 6[Federal Government] or any Provincial Government in Pakistan may be made without any specific security; (2) the selling and realisation of proceeds of sale of any such promissory notes, debentures, stock receipts, bonds, annuities, stocks, shares, securities or goods which, or the documents of title to which, have been deposited with, or pledged, hypothecated, assigned or trans- ferred to, the Bank as security for such advances, loans or credits or which are held by the Bank or over which the Bank is entitled to any lien or charge in respect of any such advance or loan or credit or any debt or claim of the Bank, and which have not been redeemed in due time in accordance with the terms and conditions (if any) of such deposit, pledge, hypothecation, assignment or transfer; (3) the advancing and lending of money to Courts of Wards upon the security of estates in their charge or under their superintendence and the realisation of such advances or loans and any interest due thereon: Provided that no such advance or loan shall be made without the previous sanction of the Provincial Government concerned; (4) the drawing, accepting, discounting, buying and selling of bills of exchange and other negotiable securities; 7[(5)the investing of the funds of the Bank in or the underwriting of, any stocks, funds, shares, securities, debentures, bonds or scripts or other securities for money issued by any public limited company or any corporation established by or under any law for the time being in force or under the authority of the 6[Federal Government] or the State Bank of Pakistan, and converting the same into money when required, and altering, converting and transposing any such investment for or into any other of such investments;] 1 Omitted by the Federal Laws (Revision and Declaration) Ordinance, 1981 (27 of 1981), s. 3 and II Sch. 2 The original comma and words “, if so authorised by special directions of the Central Board” omitted by Ordinance, 52 of 1960, s. 14. 3 The original word “and” omitted by the National Bank of Pakistan (Amdt.) Ordinance, 1960 (52 of 1960), s. 14. 4 Subs. ibid., for the original sub-clause (h). 5 New sub-clause (i) added, ibid. 6 Subs. by the National Bank of Pakistan (Amdt.) Act, 1973 (11 of 1973), s. 6, for “Central Government”. 7 Sub-section (5) which was previously amended by the National Bank of Pakistan (Amdt.) Ordinance, 1960 (52 of 1960), s. 14 have been subs. by the National Bank of Pakistan (Amdt.) Ordinance, 1970 (14 of 1970), s. 7. (6) the issuing of letters of credit; (7) the buying and selling of gold and silver whether coined or uncoined; (8) the receiving of deposits and keeping cash accounts on such terms as may be agreed on; (9) the acceptance of the charge of plate, jewels, titledeeds or other valuable goods o such terms as may be agreed on; (10) the 1[managing,] selling and realising of all property whether movable or immovable which may in any way come into the possession of the Bank in satisfaction or part satisfaction of any of its claims, and the acquisition and holding of, and generally the dealing with, any right, title or interest in any property movable or immovable which may be the Bank’s security for any advance or loan or may be connected with any such security 2[:] 3[Provided that the Bank shall not take over the management of any such property except in pursuance of an agreement with the debtor or of an order, judgment or decree of a court of competent jurisdiction;] (11) the transacting of pecuniary agency business on commission and the entering into of contracts of indemnity, suretyship or guarantee with specific security or otherwise 4[, and the under-writing, participating in, and carrying out of the issue of any stock, shares, debentures and other securities]; (12) the administration of estates for any purpose whether as an executor, trustee or otherwise and the acting as agent on commission in the transaction of the following kinds of business, namely:___ (a) the buying, selling, transferring and taking charge of any securities or any shares in any public company; (b) the receiving of the proceeds whether principal, interest or dividends, of any securities or shares; (c) the remittance of such proceeds by public or private bills of exchange, payable either in Pakistan or elsewhere; (13) the drawing of bills of exchange and the granting of letters of credit payable out of Pakistan; (14) the buying of bills of exchange payable out of Pakistan; (15) the borrowing of money for the purpose of the Bank’s business, and the giving of security for money so borrowed by pledging assets or otherwise; (16) the paying, receiving, collecting and remitting money, bullion and securities under any agreement with the State Bank of Pakistan as its agent on behalf of any Government in Pakistan, or undertaking and transacting any business which the State Bank of Pakistan may from time to time entrust to it; (17) the establishing and discontinuing of branches and agencies; (18) the acquiring, maintaining and transferring of the Bank’s residential and business premises; (19) the taking over of the business, including the capital assets and liabilities of any other bank, with the sanction of the 5[Federal Government]; 1 Ins. by the National Bank of Pakistan (Amdt.) Ordinance, 1960 (52 of 1960), s. 14. 2 Subs. ibid., for semi-colon. 3 Proviso added ibid. 4 Added by the National Bank of Pakistan (Amdt.) Ordinance, 1962 (61 of 1962), s. 3. 5 Subs. by the National Bank of Pakistan (Amdt.) Act, 1973 (11 of 1973), s. 6, for “Central Government”. (20) the granting of advances or loans to any other bank for the purpose of averting or facilitating its winding up; 1[*] 2[* * * * * * *] 3[(21) with the previous permission in writing of the State Bank of Pakistan,___ (a) the investing of the funds of the Bank in any bank incorporated outside Pakistan, and (b) participating in the management and administration of any such bank in which the funds of the Bank have been invested; and] (22) generally, the doing of all such matters and things as may be incidental or subsidiary to the transacting of the various kinds of business including foreign exchange business hereinbefore specified. 26. Business which the Bank is not authorised to transact.___The Bank shall not transact any kind of banking business other than those specified in section 25, and in particular___ 4[(1) the Bank shall not make any advance or loan upon the security of its shares;] 5[* * * * * * *] (2) the Bank shall not discount or buy or advance or lend to any individual or partnership-firm an amount exceeding in the whole at any one time such sum as may be prescribed; (3) the Bank shall not discount or buy or advance or lend or open cash-credits on the security of any negotiable instrument of any individual or partnership-firm, payable in the town or at the place where it is presented for discount, which does not carry on it the several responsibilities of at least two persons or firms unconnected with each other in general partnership: Provided that nothing in this section shall be deemed to prevent the Bank from 6[granting overdrafts and loans], without security, to such extent as may be prescribed 7[;] 7[(4) the Bank shall not grant to any person who has been elected or appointed as a Director or Member and for so long as he continues to hold that office any advance, loan, credit limit, guarantee or other facilities, or alter to his advantage the terms and conditions of any advance, loan, credit limit, guarantee or other facilities granted before his election or appointment as a Director or Member : Provided that nothing in this clause shall prevent the Bank from continuing or renewing any such advance, loan, credit limit, guarantee or other facilities as may have already been granted to such person before his election or appointment as a Director or Member.]. 8[26A. Exceptions___Notwithstanding anything contained in sections 25 and 26 the Bank is authorised to___ (1) grant advances or loans to its officers and staff for the purpose of building residential houses, including the cost of land, on such security, including immovable property, and on such terms and conditions and for such periods as may be prescribed; 1 The word “and” which was added by the National Bank of Pakistan (Amdt.) Ordinance, 1960 (52 of 1960), s. 14, has been omitted by the National Bank of Pakistan (Amdt.) Ordinance, 1963 (5 of 1963), s. 2. 2 The original cl. (21) omitted by Ordinance 52 of 1960, s. 14 3 New cl. (21) ins. by the National Bank of Pakistan (Amdt.) Ordinance, 63 (5 of 1963), s. 2. 4 Subs. by the National Bank of Pakistan (Amdt.) Ordinance, 1970 (14 of 1970), s. 8. for original sub-section. (1) 5 The original sub-clause (c) omitted, by the National Bank of Pakistan (Amdt.) Ordinance, 1960 (52 of 1960), s. 15. 6 Subs. by the National Bank of Pakistan (Amdt.) Ordinance, 1960 (52 of 1960), s. 15, for “allowing any person who keeps an account with the Bank of overdraw such account”. 7 Subs. and added by the National Bank of Pakistan (Amdt.) Ordinance, 1970 (14 of 1970), s. 8. 8 Subs. ibid., s. 16, for section 26A which was ins. by the National Bank of Pakistan Ordinance (Amdt.) Act, 1953 (29 of 1953), s.4. 1[(1a) grant advances or loans, or any period exceeding one year but not exceeding five years, to such small and medium industries as may, from time to time, be specified by the Central Board on such terms and conditions as may be prescribed: Provided that the amount of advances and loans outstanding at any time under this clause shall not exceed five percent of the total amount of bank deposits at such time;] (2) grant or subsidise, from time to time, pensions, gratuities, bonuses or other funds created for the benefit of its officers and staff or their dependents; (3) contribute to the promotion of research in banking and allied subjects; and (4) donate funds for any charitable objects or to any charitable institutions or societies.] CHAPTER VI MISCELLANEOUS 27. Auditors.___(1) Not more than two auditors who shall be Registered Accountants shall be elected and their remuneration fixed at the general meeting. The auditors may be shareholders, but no Director or Member or other officer of the Bank shall be eligible during his continuance in office. Any auditor shall be eligible on quitting office for re-election. (2) The first auditors of the Bank may be appointed and their remuneration fixed by the Central Board before the general meeting and if so appointed shall hold office only until the first general meeting. All auditors elected under this section shall severally be and continue to act as auditors until the first general meeting after their respective elections: Provided that if any casual vacancy occurs in the office of any auditor elected under this section, the vacancy may be filled by the Central Board. 28. Government auditors.___Without prejudice to anything contained in the foregoing provisions, the 2[Federal Government] may appoint such auditors as it thinks fit to examine and report upon the accounts of the Bank. 29. Rights and duties of auditors.___(1) Every auditor shall be supplied with a copy of the annual balance sheet and statement of profit and loss and it shall be his duty to examine the same, with the accounts and vouchers relating thereto. Every auditor shall have list livered to him of all books kept by the Bank, and shall at all reasonable times have access to the books, accounts and other documents of the Bank, and may, at the expense of the Bank if appointed by it, and at the expense of the 1[Federal Government] if appointed by it, employ accountants or other persons to assist him in investigating such accounts, and may, in relation to Such accounts examine any Director, or any Member or any other officer of the Bank. (2) The auditors shall make a report to the shareholders or to the 2[Federal Government] as the case may be, upon the annual balance sheet, the statement of profit and loss and accounts, and in every such report they shall state whether, in their opinion, the balance sheet and the statement of profit and loss are full and fair statements containing the prescribed particulars and properly drawn up so as to exhibit a true and correct view of the state of the Bank's affairs, and in case they have called for any explanation or information from the Central Board or a Local Board, whether it has been given and whether it is satisfactory. Any such report made to the shareholders shall be read together with the report of the Central Board at the general meeting. 30. Acceptance of liabilities ___The Bank shall accept and honour all liabilities, obligations and commitments incurred and made by the Promotors Company, Limited, formed to provide for the establishment of the Bank in accordance with the rights and powers with which that Company, is invested by its Memorandum of Association. 1 New cl. (1a) ins. by the National Bank of Pakistan (Amdt.) Ordinance, 1962 (61 of 1962), s. 4. 2 Subs. by the National Bank of Pakistan (Amdt.) Act, 1973 (11 of 1973), s. 6, for “Central Government” 31. Liquidation of the Bank.___Nothing in the Companies Act, 1913 (VII of 1913), shall apply to the Bank, and the Bank shall not be placed in liquidation save by order of the 1[Federal Government], and in such manner and under such terms and conditions, including the terms as to calls on and forfeiture of shares, as the 1[Federal Government] may by its order of liquidation direct. 32. Power of the Central Board to make bye-laws.___(1) The Central Board may, with the previous approval of the 1[Federal Government], make bye-laws not inconsistent with this Ordinance to provide for all matters for which provision is necessary or convenient for the purpose of giving effect to the provisions of this Ordinance. (2) In particular and without prejudice to the generality of the foregoing provisions, such bye-laws may provide for all or any of the following matters, namely :___ (i) the maximum amounts which may be advanced or lent to, or for which bills may be discounted for or purchased from, any individual or partnership-firm with or without security; (ii) the conditions subject to which alone advances may be made to Directors, Members or 2[*] officers 3[or other staff] of the Bank, or the relative of such Directors, Members or officers, 4[or other staff] or to companies, firms or individuals with which or with whom such Directors, Members, officers 4[or other staff] or relatives are connected as partners, directors, managers, servants, shareholders or otherwise; (ii) the manner in which and the conditions subject to which the Bank may take over the business, including the capital, assets and liabilities, of any other bank; (iii) the granting of advances or loans to any other bank for the purpose of averting or facilitating its winding up; (iv) the procedure and manner in which the capital of the Bank may be increased or reduced; (vi) the acquisition, maintenance and transfer of the Bank's residential and business premises; (vii) the contents, maintenance, inspection and closure of the principal and branch registers of shareholders; (viii) the books and accounts to be kept at the various offices of the Bank; (ix) the balancing of accounts and ascertainment of profit and loss; (x) the form and manner in which the balance sheet and the statement of profit and loss shall be drawn up; (xi) the determination and payment of dividend and transfer of profits to reserves; (xii) the preparation and transmission of returns to the Registrar of Joint Stock Companies and to the 1[Federal Government]; (xiii) the evidentiary value, form, issue and renewal of certificates of shares; (xiv) the calls on shares, the payment of such calls, joint and several liabilities of shareholders respect of such calls, the Bank's lien on the manner of its enforcement, the application of proceeds of sale; 1 Subs. by the National Bank of Pakistan (Amdt.) Act, 1973 (11 of 1973), s. 6, for “Central Government”. 2 The word “other” omitted by the National Bank of Pakistan Ordinance (Amdt.) Act, 1953 (29 of 1953), s. 5. 3 Ins. ibid. 4 Ins. by the National Bank of Pakistan Oridnance (Amdt.) Act, 1953 (29 of 1953), s. 5. (xv) the manner in which and the conditions subject to which shares may be allotted, held, transferred and transmitted and generally all matters relating to the rights and duties of shareholders; (xvi) the manner in which general and special meetings shall be convened and held, the quorum thereat, the procedure to be followed at such meetings, the manner in which votes may be exercised and the appointment and election of Chairmen of such meetings; (xvii) the manner in which local and special local meetings shall be convened and held, the quorum thereat, the procedure to be followed at such meetings, the manner in which votes may be exercised and the appointment and election of Chairmen of such meetings; (xviii) the powers exercisable by local and special local meetings; (xix) the holding and conduct of elections under this Ordinance; (xx) the final decisions on doubts and of disputes regarding the qualifications of candidates, or the validity of elections; (xxi) the manner in which meetings of the Central and Local Boards shall be convened and held, their quorum, the procedure to be followed at such meetings, votes of Directors, Members and ex officio Members and the manner in which they may be exercised, and the appointment or and election of Chairmen of such Boards; (xxii) the effect of vacancies in the Central or Local Boards and of subsequent discovery of disqualifications of a Director or Member; (xxiii) the obligations and immunities of Directors and Members and their remuneration, if any; (xxiv) the distribution of business amongst the Directors and Member, and their remuneration, if any; (xxv) the powers of the Local Boards and the limits within which they shall exercise such powers; (xxvi) the delegation of any powers of the Central or Local Boards to committees consisting of Directors or Members, as the case may be, and the conduct of business in such committees; (xxvii) the establishment and discontinuance of branches and agencies in Pakistan or elsewhere and the nature and extent of the business any branch or agency may transact; (xxviii) the recruitment of officers and staff of the Bank including the terms and conditions of their service, and the constitution and management of staff and superannuation funds for the officers and servants of the Bank; (xxix) the authority to draw, accept, endorse and execute documents on behalf of the Bank; (xxx) the provision of common and official seals of the Bank and the manner and effect of their use; (xxxi) the manner and form in which contracts binding on the Bank may be executed; (xxxii) the conduct 1[, institution] and defence of legal proceedings and the manner of signing pleadings; (xxxiii) the addresses of shareholders and the issue and service of notices; (xxxiv) the service of notice on the Bank; and (xxxv) generally, for the efficient conduct of the business, discharge of functions and management of the Bank. 33. [Transitional provisions.] Omitted by the National Bank of Pakistan (Amdt.) Ordinance, 1960 (52 of 1960), s. 18. 1 Ins. by the National Bank of Pakistan (Amdt.) Ordinance, 1960 (52 of 1960), s. 17."
}