{
  "file": "administrator73bab03e326bc445d88192ab8cbc16e7.pdf",
  "law_name": "THE WEIGHTS AND MEASURES (INTERNATIONAL SYSTEM) ACT, 1967",
  "text": "THE WEIGHTS AND MEASURES (INTERNATIONAL SYSTEM) ACT, 1967 CONTENTS 1. Short title, extent and commencement. 2. Definitions. 3. Certain units of measure. 4. Scale of temperature. 5. Certain primary units of measure. 6. National prototype of certain primary units. 7. Secondary units of measure. 8. Standard of measure. 9. Conversion of existing weights and measures into standard of measure. 10. Reference standards. 11. Secondary standards. 12. Working standards. 13. Standard weighing and measuring instruments. 13 A. Working weighing and measuring instruments. 14. Appointment of Controllers, Inspectors, etc. 15. Verification and stamping by inspectors. 16. Power to inspect and verify (working standards and working instruments.) 17. [Omitted.] 18. [Omitted.] 19. [Omitted.] 20. [Omitted.] 21. [Omitted.] 22. Prohibition of use of weights and measures other than standard weights and measures. 23. [Omitted.] 24. Power to direct the use of weights only, or measures only, in certain areas 25. [Omitted.] 26. [Omitted.] 27. [Omitted.] 28. [Omitted.] 29. [Omitted.] 30. [Omitted.] 31. [Omitted.] 32.. Validity of weights and measures duly stamped. 33. [Omitted.] 34. Limits of error to be tolerated in weights and measures. 35. [Omitted.] 36. Indemnity. 37. Cognizance of offences. 38. [Omitted.] 39. Power to exempt. 40. Delegation of powers. 41. Power to make rules. 42. Repeal. THE FIRST SCHEDULED THE SECOND SCHEDULE THE WEIGHTS AND MEASURES (INTERNATIONAL SYSTEM) ACT, 1967 1Act No. V of 1967 [10th June, 1967] An Act to establish standards of weights and measures based on the 2 [International] system. WHEREAS it is expedient to establish standards of weights and measures based on the 3 [International] system and to provide for matters connected therewith; It is hereby enacted as follows:__ 1. Short title, extent and commencement.__ This Act may be called the Weights and Measures 3 [International] system Act, 1967. (2) It extends to the whole of Pakistan. (3) It shall come into force on such date as the 4[Federal Government] may, by notification in the official Gazette, appoint and different dates may be appointed in respect of different provisions of this Act, or for different areas or for different classes of goods or classes of undertakings. 2. Definitions. In this Act, unless there is anything repugnant in the subject or context,__ (1) “ampere” means that constant current which, flowing in two parallel straight conductors of infinite length, of negligible circular cross section and placed at a distance of one meter from each other in vacuum, produces a force of 2 x 10 __7 newtons per metre length between the conductors; (2) “Assistant Controller” means an Assistant Controller of Weights and Measures appointed under section 14; (3) “candela” means one-sixtieth part of luminous intensity normally emitted by one centimetre square of integral radiator (black body) at the temperature of solidification of platinum; (4) “commercial weight or measure” means a weight or measure used or intended to be used in any transactions of trade or commerce; (5) “Controller” means the Controller of Weights and Measures appointed under section 14 and includes a Deputy Controller of Weights and Measures and an Assistant Controller of Weights and Measures; (6) “Deputy Controller” means a Deputy Controller of Weights and Measures appointed under section 14; 1For Statement of Objects and Reasons, see Gaz. of P. 1966, Ext. (Dacca),p.213. The Act has been brought into force with ef ect from the 1st day of july, 1974, in respect of certain undertaking specified in S.R.O. 893 (I)/74, see , Gaz. of P., 974, Ext.pt. II, pp. 1070 1071. For such Notifin.enforcing the Act in respect of certain undertaking see Gaz. of p., 1974, Ext.pt. II.pp. 10701071 and 1782; ibid., (Islamabad), p.1922; ibid., 1975, Ext. Pt.III., p. 18, ibid, p.841. 2Subs. by the Weights and Measures (Metric System) (Amdt.) Act, 1974 (29 of 1974),s.2, for “Metric”. 3Subs. ibid., for “Metric”. 4Subs. ibid., for “Central Government”. (7) “First General Conference of Weights and Measures” means the Conference General des poids et measures held at Paris in 1889; (8) “Inspector” means an Inspector of Weights and Measures appointed under section 14 and includes an Assistant Inspector of Weights and Measures; (9) “International Bureau of Weights and Measures” means the Bureau International des poids et measures et Sevres in France; (10) \"kilogram” means the mass of the Platinum-irridium cylinder deposited at the International Bureau of Weights and Measures and declared international prototype of the kilogramme by the First General Conference of Weights and Measures; (11) “litre” is the volume occupied by the mass of one kilogram of pure air free water at the temperature of its maximum density and under normal atmospheric pressure; (12) “measuring instrument” includes any instrument for measuring length, area, volume or capacity but does not include a weighing instrument; (13) “metre” means the length equal to 1,650,763.73 wave-lengths, in vacuum, of the radiation corresponding to the transition between the 2p and 5d levels of the Krypton atom of mass 86; 1 [(13a) “mole” means the amount of substance of a system which contains as many elementary entities as there are atoms in 0.012 Kilograms of carbon 12 ;] (14) “normal atmospheric pressure” means the pressure exercised by 1,01, 325 newtons per square metre, a newton being the force which imparts to a mass of one kilogram an acceleration of one meter per second per second; (15) “prescribed” means prescribed by rules; (16) “reference standards” means the sets of weights and measures prepared under section 10; (17) “rules” means rules made under this Act; 2[(18) “second” means the duration of 9,192, 631, 770 periods of the radiation corresponding to the transition between the two hyperfine levels of the ground state of the cesium-133 atom;] (19) “secondary standard” means the sets of weights and measures prepared under Section 11; (20) “stamping” means marking in such manner as to be, so far as practicable, indelible and includes casting, engraving, etching and branding; 1 Ins. by the Weights and Measures (Metric System) (Amdt.) Act, 1974 (29 of 1974), s.3. 2 subs. By the Weights and Measures (Matric system) (Amdt.) Act, 1974 (29 of 9074), s.3 for cl. 18 1[(20 A) “standard instrument” means the set of weighing instruments and measuring instruments prepared under section 13;] (21) “standard measure” means such a standard of measure specified in sub-section (1) of section 8, as does not relate to mass; (22) “standard weight” means such a standard of measure specified in sub-section (1) of section 8 as relates to mass; (23) “trade”, with its grammatical variations, means any sale, bargain, transaction, dealing or contract and includes collection of tolls and duties; (24) “verify”, with its grammatical variations, means verify or reverify in accordance with the provisions of this Act and the rules; (25) “weighing instrument” means any instrument for measuring weight and inciudes scales, with the weights belonging thereto, scalebeams, balances, spring balances, steelyards and other weighing machines; 2 [(25A) “working instrument” means the set of weighing instruments and measuring instruments prepared under section 13A;] (26) “working standard” means the sets of weights and measures prepared under section 12. 3. Certain units of measure.__ (1) The unit of electric current shall be an ampere. (2) The unit of luminous intensity shall be a candela. 2[4. Scale of temperature.__ The kelvin, unit of thermodynamic temperature, is the fraction 1/273.16 of the thermodynamic temperature of the triple point of water.]. 5. Certain primary units of measure.__ (1) The primary unit of mass shall be a kilogram: Provided that in the case of pearls and precious stones the primary unit of mass shall be a carat which is equal to one five-thousandth of one kilogram. (2) The primary unit of length shall be a metre. (3) The primary unit of area shall be the square metre. (4) The primary unit of volume shall be the cubic metre. (5) The primary unit of capacity shall be a litre. (6) The primary unit of time shall be a second. 6. National prototype of certain Primary units.__ (1) The 2 [Federal Government] shall cause to be prepared a national prototype of the kilogram and shall cause the same to be certified in terms of the international prototype of kilogram and shall deposit the same in such custody and at such place as it may deem fit. _________________________________________________________________________________ 1Subs. by the Weights and Measures (Metric System) (Amdt.) Act, 1974 (29 of 1974), s.3, for cl.18. 2 Ins. by the Weights and Measures (International Systems) (Amdt.) Ordinance, 1978 (16 of 1978), s.4, for “section 4” 3 Subs. ibid s. 2, for \"Central Government”. (2) The 1[Federal Government] shall cause to be prepared a national prototype of the metre and shall cause the same to be certified by the International Bureau of Weights and Measures and shall deposit the same in such custody and at such place as it may deem fit. 7. Secondary units of measure. The 1[Federal Government] may, by notification in the official Gazette, declare the magnitude and denomination of such units of measure as it deems fit to be the secondary units of measure under this Act: Provided that every such secondary unit except that of time shall be an integral positive or negative power of ten of the relevant primary unit. 8. Standard of measure.__ (1) The primary units of measure referred to in section 5 and the secondary units of measure declared under section 7 shall be the standards of measure. (2) The weight at any place of the primary unit of mass referred to in sub-section (1) of section 5 shall be the standard unit of weight at that place. 9. Conversion of existing weights and measures into standard of measure.__ (1) The value expressed in terms of any weight set forth in subsection (1) of Section 3 of the Standards of Weight Act, 1939 (IX of 1939), or in terms of any Measure expressed in inches, feet, yards, miles or nautical miles or in gallons may be converted into the value expressed in terms of the appropriate standard of measure at the rate specified in the First Schedule. (2) The 2[Federal Government] may, by notification in the official Gazette, specify the rates at which the value expressed in terms of any weight or measure other than those referred to in sub-section (1) may be converted into the value expressed in terms of the standard of measure. (3) All references in any enactment or in any notification, rule or order under any enactment or in any contract, deed or other instrument to a value expressed in terms of any weight or measure shall be construed as references to that value expressed in terms of the appropriate standard of measure converted thereto at the rates specified in the First Schedule or in a notification issued under sub-section (2), as the case may be. (4) Where in any transaction the value expressed in terms of any weight or measure is required to be converted into the value expressed in terms of the standard of measure under this section, the calculation, for the purposes of such transaction, shall be made in such manners as may be prescribed. 10. Reference standards.__ (1) The 2[Federal Government] shall cause to be prepared as many sets of such standards of measure specified in sub-section (1) of Section 8 or multiples or sub-multiples thereof, to be called reference standards as it may consider expedient and shall cause the measure of each such set to be authenticated as having been ascertained from the primary units of measure. (2) The reference standards shall be kept at such place, in such custody and in such manner as may be prescribed. _________________________________________________________________________ 1subs. ibid s. 2, for “Central Government”. 2Subs. by the Weights and Measures (Metric System) (Amdt.) Act, 1974 (29 of 1974), s.3, for “Central Government” 11. Secondary standards.__ (1) For the purpose of verifying the correctness of the working standards the 1[Federal Government] may cause to be prepared as many sets of standard weights and standard measures, to be called secondary standards, as it may consider expedient and shall cause each such set to be authenticated as having been verified with the reference standards. (2) The secondary standards shall be kept at such places, in such custody and in such manner as may be prescribed and shall be verified with the reference standards at least once in every five years and marked with the date of such verification. 12. Working standards.__ (1) For the purpose of verifying the correctness of commercial weights and measures 2[each Provincial Government] may cause to be prepared as many sets of standard weights and standard measures, to be called working standards, as it may consider expedient and shall cause each such set to be authenticated as having been verified with the secondary standards [.]3 4 * * * * * * * (2) The working standards shall be kept at such place, in such custody and in such manner as may be prescribed 5[by the Provincial Government] and shall be verified with the secondary standards or reference standards, as the case may be, at such intervals and in such manner as may be prescribed and marked with the date of such verification (3) A working standard which has not been verified at any interval prescribed therefor shall not, after the expiry of the day closing the interval, be used until it has been verified and marked with the date of verification. 13. Standard weighing and measuring instruments.__ 6[(1) For the purpose of verifying the correctness of the working weighing instruments and working measuring instruments, the Federal Government may cause to be prepared as many sets of standard weighing instruments and standard measuring instruments, to be called the standard instruments, as it may consider expedient, and the correctness of such instruments shall be verified, and the date of such verification shall be marked, in such manner as may be prescribed]; (2) The standard weighing instruments and standard measuring instruments shall be kept at all places where the secondary standards 7 * * * are kept. 87[13A. Working weighing and measuring instruments.__ (1) For the purpose of verifying the correctness of the weighing instruments and measuring instruments used in trade or commerce, the Provincial Government may cause to be prepared as many sets of working weighing instruments and working measuring instruments, to be called the working instruments, as it may consider expedient and shall cause each such set to be authenticated as having been verified with the standard weighing instruments and standard measuring instruments. ___________________________________________________________________________ 1 Subs. by the Weights and Measures (International System) (Amdt.) Act, 1974 (29 of 1974), s. 3, 2Subs. by the Weights and Measures (International System) (Amdt.) Ordinace, 1978 (16 of 1978), s. 3, for “the Federal”, which was previously amended by Act 29 of 1974, s. 2, for “Central Government”. 3Subs. ibid., for colon. 4Proviso omitted ibid., 5Ins. ibid., 6Subs. ibid., for sub-section (1), s.4. 7Omitted ibid.,ss.,4 and 6. 8New section 13 A ins. ibid., s.5 (2) The working instruments shall be kept at such place, in such custody and in such manner as may be prescribed by the Provincial Government and shall be verified with the standard instruments at such intervals and in such manner as may be prescribed and marked with the date of such verification. (3) A working instrument which has not been verified at an interval prescribed therefor shall not, after the expiry of the day closing the interval, be used until it has been verified and marked with the date of verification.] 14. Appointment of Controllers, Inspectors, etc.__ (1) The 1 [Federal Government] may appoint a Controller of Weights and Measures 2* * * and as many Deputy Controllers, Assistant Controllers, Inspectors and Assistant Inspectors of Weights and Measures as it may deem fit. (2) Subject to the provisions of this Act and the rules, all Deputy Controllers, Assistant Controllers, Inspectors, and Assistant Inspectors shall perform their functions under the general superintendence and control of the Controller. (3) The Deputy Controllers and Assistant Controllers may, in addition to the powers and duties conferred or imposed on them by or under this Act, exercise any power or discharge any duty so conferred or imposed on an Inspector. (4) The 1 [Federal Government] may, by general or special order, define the local limits within which each 3 [Deputy Controller, Assistant Controller and] Inspector shall exercise the powers and discharge the duties conferred or imposed on an Inspector by or under this Act. (5) Every Controller, Deputy Controller.__ Assistant Controller, Inspector and Assistant Inspector shall be deemed to be a public servant within the meaning of section 21 of the Pakistan Penal Code ( ACT XLV of 1860). 15. Verification and stamping by Inspectors.__ An Inspector shall, at such place 4 [and at such time as the Controller may direct, verify a working standard or working instrument brought or referred] to him for the purpose and shall, if he finds it correct and in conformity with this Act and the rules, stamp it with a stamp of verification in the prescribed manner. 5[16. Power to inspect and verify working standards and working instruments.__ (1) An Inspector may, after notice to the Provincial Government by the Controller, inspect and verify with a reference standard, secondary standard or standard instrument any working standard or working instrument. (2) Where a working standard or working instrument inspected and verified under sub-section (1) is not found to be what it purports to be, the Inspector may detain it under seal and shall inform the Controller of such detention, and the Controller shall refer the matter to the Provincial Government for such action as it thinks necessary.] ________________________________________________________________________________ 1Subs. by the Weights and Measures (Metric System) (Amdt.) Act, 1974 (29 of 1974), s.2. for “Central Government”. 2Omitted by the Weights and Measures (International System) (Amdt.) Ordinance, 1978 (16 of 1978), s.6. 3 Ins, ibid., s.6. 4Subs. ibid., s.7, for certain words. 5Subs. ibid., s. 8, for section 16. 17. [Power to inspect and verify the contents of sealed packages and containers.] Omitted by the Weights and Measures (International System) (Amendment) Ordinance, 1978 (XVI of 1978), s.9. 18. [Power to adjust weights and measures.] Omitted by the Weights and Measures (International System) (Amdt.), Ordinance, 1978 ( XVI of 1978),s. 9. 19. [ Manufacturers, etc., to maintain records and documents] Omitted by the Weights and Measures (International System) (Amdt.) Ordinance, 1978 (XVI of 1978), s. 9. 20. [Penalty for neglect or refusal to produce weight or measure, etc. for inspection.] Omitted by the Weights and Measures (International System) (Amdt.) Ordinance, 1978 (XVI of 1978), s. 9 21. [Penalty for breach of duty by Controller, etc.,] Omitted by the Weights and Measures (International System) (Amdt.) Ordinance, 1978 (XVI of 1978), s. 9. 22. Prohibition of use of weights and measures other than standard weights and measures.__ (1) Notwithstanding anything contained in any other law or any custom or usage or practice, no unit of measure, other than a standard weight or standard measure, shall, after the expiry of six months from the date on which this section has come into force in any area or in relation to any goods or undertakings, be used, except as permitted under sub-section (2), in such area or in relation to such goods or undertakings in any transaction of trade or commerce or in any dealing or contract. (2) The 1 [Federal Government] may, by notification in the official Gazette, permit the continuance of the use in any area in which, or in relation to any class of goods or undertakings in respect of which, this section has come into force, of such weight or measure which was in use immediately before the date of such coming into force, for such period not exceeding three years from that date, as may be specified in the notification. (3) Whoever contravenes the provisions of sub-section (1) shall be punishable with rigorous imprisonment for a term which may extend to six months, or with fine which may extend to two thousand and five hundred rupees, or with both. 23. [Prohibition of demanding or receiving a quantity different from that determined in terms of standard weight, etc.,] Omitted by the Weights and Measures International System (Amdt.), Ordinance, 1978 (XVI of 1978), s. 9. 24. Power to direct the use of weights only, or measures only, in certain areas.__ (1) The 1 [Federal Government] may, by notification in the official Gazette, direct that no transaction, dealing or contract shall be made in such area, from such date, subject to such conditions and in respect of such trade or class of trades as may be specified therein, except by weight only or except by measure only. (2) Whoever contravenes the provisions of sub-section (1) shall be punishable with fine which may extend to five thousand rupees. 25. [Commercial weights and measures to bear mark of denomination] Omitted by the Weights and Measures (International System) (Amdt.) Ordinance, 1978 (XVI of 1978), s. 9. _________________________________________________________________________________ 1Subs. by the Weights and Measures (Metric System) (Amdt.) Act, 1974 (29 of 1974), s. 2, for “Central Government”. 26. [Prohibition of sale, etc.,of unstamped commercial weights and measures] Omitted by the Weights and Measures (International System) (Amdt.) Ordinance, 1978 (XVI of 1978), s. 9. 27. [Prohibition of the manufacture, etc., of weights and measures without licence.] Omitted by the Weights and Measures (International System) (Amdt.) Ordinance, 1978 (XVI of 1978), s. 9. 28. [Marking of weight or measure on sealed containers.] Omitted by the Weights and Measures (International System) (Amdt.) Ordinance, 1978 (XVI of 1978), s. 9. 29. [Penalty for forging or using forged stamps or weights, measures etc.] Omitted by the Weights and Measures (International System) (Amdt.) Ordinance, 1978 (XVI of 1978), s. 9. 30. [Penalty for using or selling forged weight, measure, etc.] Omitted by the Weights and Measures (International System) (Amdt.) Ordinance, 1978 (XVI of 1978), s. 9. 31. [Offences by companies.] Omitted by the Weights and Measures (International System) (Amdt.) Ordinance, 1978 (XVI of 1978), s. 9. 32. Validity of weights and measures duly stamped. A weight, measure, weighing instrument or measuring instrument, stamped in the 1[manner prescribed by the Provincial Government] shall be a legal weight, measure, weighting instrument or measuring instrument in all areas in which this Act has come into force, unless it is found to be false or defective, and shall not be liable to be re-stamped by reason merely of the fact that it is used in any place other than that in which it was originally stamped. 33. [Stamped weight, etc. to be presumed to be correct.] Omitted by the Weights and Measures (International System) (Amdt.) Ordinance, 1978 (XVI of 1978), s.11. 34. Limits of error to be tolerated in weights and measures. The 2[Federal Government] may prescribe the limits of error which may be tolerated.__ (a) in secondary standards referred to in Section 11; (b) in working standards referred to in Section 12; (c) in commercial weights and measures or in selling articles by weight or measure generally or as regards any trade or class of trades; and (d) in weighing instruments and measuring instruments. 35. [Appeal.] Omitted by the Weights and Measures (International System) (Amdt.) Ordinance, 1978 (XVI of 1978), s. 11. 36. Indemnity. No suit, prosecution or other legal proceeding shall lie against any person in respect of anything which is in good faith done or intended to be done in pursuance of this Act or the rules. 37. Cognizance of offences.__ No Court shall take cognizance of an offence punishable under this Act except upon complaint in writing made by the Controller or Inspector or any other person authorised in this behalf by the 2[Federal Government] by a general or special order. 1Subs. by the Weights and Measures (International System) (Amdt.) Ordinance, 1978 (16 of 1978), s. 10, for “prescribed manner”. 2Subs. by the Weights and Measures (Metric System) (Amdt.) Act, 1974 (29 of 1974), s. 2, for “Central Government”. 38. [Forfeiture of weights, measures, etc.]. Omitted by the Weights and Measures (International System) (Amdt.) Ordinance, 1978 (XVI of 1978), s. 11. 39. Power to exempt.__ (1) The 2[Federal Government] may, subject to such conditions, if any, as it may deem fit to impose, by notification in the official Gazette, exempt any Government institution or any commodity or trade from all or any of the provisions of this Act. (2) Any notification issued under sub-section (1) shall, at the earliest opportunity, be laid before the National Assembly which may, by a resolution passed by it, amend, vary or rescind such notification. 1Subs. by the Weights and Measures (Metric System) (Amdt.) Act, 1974 (29 of 1974), s. 2 for “Central Government”. (3) A notification issued under sub-section (1) shall stand amended, varied or rescinded, according as a resolution to that effect is passed by the National Assembly, upon the passing of such resolution. 40. Delegation of powers. The 1[Federal Government] may, by notification in the official Gazette, direct that all or any of the powers exercisable by it under this Act, other than those under Section 39, or the rules shall, in relation to such matters as may be specified in the notification, be exercisable also by a Provincial Government. 41. Power to make rules.__ (1) The 1[Federal Government] may, by notification in the official Gazette, make rules to carry out the purposes of this Act. (2) In particular and without prejudice to the generality of the foregoing power, such rules may provide for all or any of the following matters, namely:__ (a) the preparation of the standards of measure; (b) the custody of the sets of reference standards, secondary standards and 2 [standard instruments], and the periodical verification and adjustment thereof; (c) the limits of error which may be tolerated in secondary standards working standards, 3 [standard instruments, working instruments,] weights, measures, weighing instruments and measuring instruments used or intended to be used in trade or commerce, or in the actual weighing or measuring of articles in the course of any trade or class of trades; (d) the manner in which the value expressed in terms of any weight or measure other than in terms of standard of measure may be converted thereto; (e) the material of which and the designs and specifications according to which working standards may be made the agency, by which such standards may be made, the person by whom or the authority by which and the manner in which such standards may be stamped and authenticated 4 * * * ; _________________________________________________________________________________ 1Subs. by the Weights and Measures (Metric System) (Amdt.) Act, 1974 (29 of 1974), s. 2, for “Central Government”. 2Subs. by the Weights and Measures (International System) (Amdt.) Act, 1978 (16 of 1978), s. 12, for “working standards”. 3 Ins. ibid., 4Certain words omitted ibid. (f) the procedure for the verification and marking of working standards, the person by whom, the place at which and the intervals at which, they may be marked; (g) the material of which and the designs and specifications according to which secondary standards may be made, the place at which and the custody and manner in which such standards may be kept; (h) the procedure for verification and marking of secondary standards and the manner in which they may be marked; (i) the number of 1[standard weighing instruments and standard measuring instruments] to be kept, the manner in which they may be verified and stamped and necessary particulars regarding the same; 2* * * * * * * (l) the powers, functions and duties of the Controller 3Deputy Controller, Assistant Controllers, Inspector and Assistant Inspector]; (m) the qualifications, powers, functions and duties of Inspectors; (n) the verification and stamping of 4[working standards and working instruments]. 2 * * * * * * * (t) any other matter necessary for giving effect to the purposes of this Act. (3) In making any rules under this section, the 5[Federal Government] may provide that a breach thereof shall be punishable with fine which may extend to five hundred rupees. 42. Repeal.__ (1) The enactments specified in Part I of the Second Schedule shall stand repealed in an area in which or in relation to any goods or undertaking in respect of which this Act comes into force. (2) The enactments specified in Part II of the Second Schedule shall, to the extent to which they contain any provision which corresponds to any provision of this Act, stand repealed. (3) If, immediately before the commencement of this Act or any provision thereof in any area or in relation to any class of goods or undertakings, there is in force in that area or in relation to that class of goods or undertakings, any law which corresponds to this Act or to any such provision thereof and which is not repealed by sub-section (1) or sub-section (2), that corresponding law shall stand repealed. ________________________________________________________________________________ 1Subs. by the Weights and Measures (International (System (Amdt.) Ordinance, 1978 (16 of 1978), s. 12, for certain words. 2Cls.(j) (k),(o),(p),(q)’ (r) and (s) ibid. 3Added ibid., 4Subs. ibid., for certain words. 5Subs. by the Weights and Measures (Metric System) (Amdt.) Act, 1974 (29 of 1974), s. 2, for “Central Government THE FIRST SCHEDULE [See section 9(1)] STANDARD OF WEIGHT 1 grain __ 0.000064799 kilogram 1 ounce __ 0.0283495 kilogram 1 pound __ 0.4535924 kilogram 1 cwt __ 50.802 kilograms 1 ton __ 1016.05 kilograms 1 tola __ 0.0116638 kilogram 1 seer __ 0.93310 kilogram 1 maund __ 37.3242 kilograms STANDARD OF LENGTH AND CAPACITY 1 inch __ 0.0255 metre (exact) 1 foot __ 0.3048 metre (exact) 1 yard __ 0.9144 metre (exact) 1 mile __ 1609.344 metres (exact) 1 nautical mile __ 1852 metres 1 Imperial gallon __ 4.54596 litres THE SECOND SCHEDULE (See section 42) PART I 1. The Measures of Length Act, 1889 (II of 1889). 2. The Standards of Weight Act, 1939 (IX of 1939) PART II 1. The Weights and Measures of Capacity Act, 1871 (XXXI of 1871). 2. The Sind Weights and Measures Act, 1932(Sindh Act XV of 1932). 3. The Bombay Weights and Measures Act, 1932, as applicable to Karachi Division. 4. The Punjab Weights and Measures Act, 1941 (Punjab Act XII of 1941). 5. The Bahawalpur State Weights and Measures Act, 1946. 6. The NorthWest Frontier Weights and Measures Act, 1947 (N.W.F.P. Act XXIII of 1947)."
}