{
  "file": "administratorf9396ed16f308a520606b5299d8c7dac.pdf",
  "law_name": "The Cotton Act, 1957",
  "text": "THE COTTON ACT, 1957 CONTENTS 1. Short title, extent and commencement 2. Definitions 3. Constitution of the Cotton Board 4. Functions of the Board 5. Control of the Board 6. Requisition of factories etc. 7. Power to secure fulfillment of contracts 8. Power to call for information 9. Registration of contracts 10. Control of contracts through recognised associations 11. Delegation of powers 12. Penalty, etc. 13. False statements 14. Power to make rules 15. Cognizance of offences 16. Special provision regarding fines 17. Presumption as to orders 18. Repealed THE COTTON ACT, 1957 ACT No. XXXVIII OF 1957 [10th September, 1957] An Act to provide for measures for the promotion of international trade in cotton. WHEREAS it is expedient to provide for measures for the promotion of international trade in cotton; It is hereby enacted as follows:___ 1. Short title extent and commencement.___(1) This Act may be called the Cotton Act, 1957. (2) It extends to the 1[Karachi Division], and with the exception of section 6, to the rest of Pakistan. (3) It shall come into force at once. 2. Definitions. In this Act, unless there is anything repugnant in the subject or context,___ (a) “contract” means a contract for the purchase or sale of cotton, and includes a factory selection contract; (b) “cotton” means unginned cotton (kapas) or ginned cotton (rui) or pressed and baled cotton but does not include wool cotton or silk cotton; (c) “factory selection contract” means a contract for the sale of cotton entered into in Pakistan and providing for selection by the buyer at the factory and for delivery of the cotton selected in full pressed bales at Karachi within the period and at the price specified in the contract; (d) “notified order” means an order published in the official Gazette; (e) “pressing factory” means a place wherein steam, water or other mechanical power or electric power is used and where cotton is pressed into bales. 3. Constitution of the Cotton Board. The 2[Federal Government] may, for the promotion of international trade in cotton, constitute, by notification in the official Gazette, a Cotton Board with a Chairman and such other members, of whom one 3[each may be nominated by the Governments of Baluchistan, the North-West Frontier Province, the Punjab and Sind], as may be specified in the notification. 1Subs. by the Central Adaptation of Laws Order, 1964 (P. O. No. 1 of 1964), Art. 2 and Sch. 2Subs. by the Federal Adaption of Laws Order, 1975 (P. O. No. 4 of 1975), Art. 2 and Table. 3Subs. by Ordinance No. XXIV of 1970, s. 4. 4. Functions of the Board. The Board shall have power to supervise and regulate all dealings in cotton, in so far as they are connected with the promotion of international trade therein, and shall perform such functions as the 1[Federal Government] may, from time to time, direct for the purposes of this Act. 5. Control of the Board. The Board shall be subject to the superintendence and control of the 1[Federal Government], and in the discharge of its functions shall be guided by such general or special instructions as may, from time to time, be given to it by the 1[Federal Government]. 6. Requisition of factories etc.___(1) The 1[Federal Government] may, by general or special order, requisition any pressing factory or any place, whether open or enclosed, and use the same for pressing or storing cotton belonging to Government, and for purposes incidental thereto. (2) If any such factory or place is requisitioned under this section, there shall be paid compensation which shall be determined either with the agreement of the parties concerned, or by an arbitrator chosen with their consent, and in the absence of such consent, by an arbitrator to be appointed in accordance with the provisions of section 8 of the Arbitration Act, 1940 (X of 1940). (3) The arbitrator in determining the compensation under sub-section (2) shall have regard to the provisions of sub-section (1) of section 23 of the Land Acquisition Act, 1894 (I of 1894), so far as the same can be made applicable to acquisition of a temporary nature. 7. Power to secure fulfillment of contracts. If in the opinion of the 1[Federal Government] it is expedient or necessary so to do for the purpose of securing the fulfilment of any contract relating to export of cotton on which the exporter has defaulted, it may buy cotton elsewhere and appropriate it to the contract, and the defaulter shall be liable for any loss which the 1[Federal Government] may sustain on that account, but the defaulter shall not be entitled to any gain on the purchase made against default. Explanation.___ In this section “exporter” means a seller of cotton to a foreign buyer or to his agent in Pakistan. 8. Power to call for information.___(1) The 1[Federal Government] may, at any time, by an order in writing, direct such person or class of persons as may be specified in the order to furnish such particulars relating to the fulfillment of any contract relating to export of cotton, in such manner and to such person, as may be specified in the order. (2) The 1[Federal Government] may, by order in writing, require any person to furnish to it, or to such person as may be specified in this order, any information in his possession, being information which the 1[Federal Government] may require for the purposes of this Act. 9. Registration of contracts. The 1[Federal Government] may, by general or special order in writing, require any contract relating to export of cotton to be registered with such organisation and in such manner as may be specified in the order. 1Subs. by the Federal Adaptation of Laws Order, 1975 (P. O. No. 4 of 1975), Art. 2 and Table. 10. Control of contracts through recognised associations.___ (1) The 1[Federal Government] if satisfied that it could be in the interests of the trade and also of the public to do so, may, by a notified order and subject to such conditions, if any, as may be specified in the order, prohibit any specified kind or class of contracts, such as forward contracts or hedge contracts, unless such contracts are made through and under the control of, and in the manner prescribed by, an association recognised by the 1[Federal Government] under sub-section (2). (2) For the purposes of this section, the 1[Federal Government] may, by a notified order, recognize any association, constituted for the purpose of regulating and controlling contracts, which applies for such recognition. (3) A recognition under sub-section (2) may be granted subject to the condition that the association shall by such amendments of its articles of association, rules or bye-laws as may be necessary provide for the appointment by the 1[Federal Government] of not more than four persons, representing interests not directly represented through membership of the association, as members of the governing body of the association. (4) Every association, which is recognised under sub-section (2), shall furnish to the 1[Federal Government] such information and such periodical returns relating to the affairs of the association as the 1[Federal Government] may by order in writing require. (5) The 1[Federal Government] may, by order in writing, give such directions, as it considers necessary in the interests of the trade and the public, to an association recognised under sub-section (2) in respect of contracts to which this section applies. (6) No articles, rules or bye-laws of an association recognised under sub-section (2) shall be altered save with the previous approval of the 1[Federal Government]. (7) Whenever the 1[Federal Government] considers it expedient to do so, it may by order in writing direct any association recognised under sub-section (2) to make, repeal or amend any articles, rules or bye-laws of the association in the manner and within a period specified in the order ; and if the recognised association refuses, fails or neglects to comply with the direction within the specified period, the 1[Federal Government] may, by a notified order, make, repeal or amend the articles, rules or bye-laws in the manner specified in the order giving the direction or with such modifications as the 1[Federal Government] may think fit, and the making, repeal or amendment of the articles, rules or bye-laws shall be deemed to have been duly effected by the association. (8) If the 1[Federal Government] is of the opinion that the interests of the trade and the public require that the recognition accorded to an association under sub-section (2) should be terminated, the 1[Federal Government] may, after giving the association a reasonable opportunity of being heard in the matter, by a notified order, terminate the recognition on and from the date of such order or any specified date subsequent thereto, and the association shall cease to be an association recognised under sub-section (2) from the date of such termination: Provided that such termination shall not affect the validity of any contract entered into or made before the date of such termination. _________________________________________________________________________________ 1Subs. by the Federal Adaptation of Laws Order, 1975 (P. O. No. 4 of 1975), Art. 2 and Table. 11. Delegation of powers.___1[(1)] The 2[Federal Government] may, by a notified order, direct that any power conferred upon it by or under this Act shall, in relation to such matters and subject to such conditions, if any, as may be specified in the order, be exercisable by the Cotton Board. 2[(2) The Cotton Board may, by general or special order in writing, direct that such of its powers, including powers which have been directed under sub-section (1) to be exercised by the Cotton Board, shall, in relation to such matters and subject to such conditions, if any, as may be specified in the order, be exercisable also by the Chairman of the Board or such member thereof as may be so specified: Provided that orders passed under the powers thus delegated shall be laid before the Board at its next meeting.] 12. Penalty, etc.___ (1) Any person who contravenes or fails to comply with an order made or direction given under this Act shall be punishable as if he had contravened a provision of this Act. (2) Any person who contravenes any provision of this Act shall be punishable with imprisonment for a term which may extend to three years or with fine or with both. (3) Where any person as aforesaid is a company or a body corporate, every director, manager, secretary or other officer, and every agent and servant thereof, and in the case of an unlimited company or a company limited by guarantee, also any of its members, shall, subject to the provisions of the next succeeding sub-section, be punishable as if he had contravened the provisions of this Act. (4) No such director, manager, secretary or other officer and no such agent, servant or member as is referred to in sub-section (3) shall be prosecuted under this Act unless he has been given an opportunity by the 2[Federal Government] to show cause, within such time as the 2[Federal Government] may specify, why he should not be prosecuted, and if it is made to appear to the satisfaction of the 2[Federal Government] at any time before the institution of the prosecution that he has used due diligence to enforce the observance of the provisions of this Act and the orders and directions issued thereunder and that the offence has been committed without his knowledge or against his consent, the 2[Federal Government] may forbear further proceedings against him: Provided that nothing in this sub-section shall prevent the 2[Federal Government] from proceeding against him further if it sees reason to do so. 13. False statements. If any person___ (i) when required by an order under this Act to make any statement or furnish any information, makes any statement or furnishes any information which is false in any material particular and which he knows or has reasonable cause to believe to be false, or does not believe to be true, or (ii) makes any such statement as aforesaid in any book, account, record, declaration, return or other documents which he is required by any such order to maintain or furnish, he shall be punishable with imprisonment for a term which may extend to three years or with fine or with both. 1Re-numbered and added by Act No. V of 1973, s. 2. 2Subs. by the Federal Adaptation of Laws Order, 1975 (P. O. No. 4 of 1975), Art. 2 and Table. 14. Power to make rules.___(1) The 1[Federal Government] may, by notification in the official Gazette, makes rules for carrying out the purposes of this Act. (2) Without prejudice to the generality of the foregoing power, such rules may prescribe the procedure for determining, whether by means of arbitration or otherwise, the loss that may be sustained by Government in securing the fulfilment of any contract on which an exporter has defaulted, and the manner in which the liability of the defaulter for such loss may be discharged by him. (3) Rules made under this section shall be laid before the National Assembly at its meeting held next after the publication of the notification under sub-section (1). 15. Cognizance of offences. No court shall take cognizance of any offence punishable under this Act except on a report in writing of the facts constituting such offence made by a person who is a public servant as defined in section 21 of the Pakistan Penal Code (Act XLV of 1860). 16. Special provision regarding fines. Notwithstanding anything contained in section 32 of the Code of Criminal Procedure, 1898 (Act V of 1898), it shall be lawful for any Magistrate of the First Class specially empowered by the Provincial Government in this behalf to pass a sentence of fine exceeding one thousand rupees on any person convicted under this Act. 17. Presumption as to orders. Where an order purports to have been made and signed by an authority in exercise of any power conferred by or under this Act, a court shall, within the meaning of the Evidence Act, 1872 (I of 1872), presume that such order was so made by that authority. 18. 2[* * * * * * *] ____________ 62403 Date: 13-01-2025 1Subs. by the Federal Adaptation of Laws Order, 1975 (P. O. No. 4 of 1975), Art. 2 and Table, for “Central Government”. 2Rep By the Repealing and Amending Ordinance 1965 (10 of 1965), s.2 and 1st Sch."
}