{
  "file": "administrator0ec3cfea1b3f330a93b185f57df04634.pdf",
  "law_name": "The Board Of Investment Ordinance, 2001",
  "text": "THE BOARD OF INVESTMENT ORDINANCE, 2001 CONTENTS CHAPTER.__ I PRELIMINARY 1. Short title, extent and commencement 2. Definitions CHAPTER.__ I ESTABLISHMENT OF THE BOARD OF INVESTMENT 3. Establishment of the Board of Investment 4. Chairman 5. Secretary 6. Non-official members 7. Meetings of the Board 8. Validity of proceedings 9. Functions of BOI 10. Directive of the Federal Government 10A. Establishment of a Special Investment Facilitation Council 10B. Scope of work of the Special Investment Facilitation Council 10C. Functions of the Special Investment Facilitation Council 10D. Formation of Committees 10E. Power to issue directions 10F. Power to relax or exempt from regulatory compliance 10G. Immunity 10H. Overriding effect 10I. Power to make rules 10J. Removal of difficulties CHAPTER.__ III FINANCE AND ACCOUNTS 11. Grants 12. Fund 13. Budget and accounts 14. Annual Report CHAPTER.__ IV PROVINCIAL INVESTMENT COMMITTEES 15. Provincial Investment Committees CHAPTER.__ V MISCELLANEOUS 16. Delegation of powers 17. Recruitment etc 18. Members, officers, staff, etc. deemed to be public servants 19. Assistance from other agencies 20. Indemnity 21. Transfer of employees and assets 22. Committees 23. Power to make rules 24. Power to make regulations 25. Removal of difficulties THE BOARD OF INVESTMENT ORDINANCE, 2001 ORDINANCE No. XV OF 2001 [22nd March, 2001] An Ordinance to provide for the establishment of the Board of Investment as an apex agency to promote, encourage and facilitate both local and foreign investment WHEREAS it is expedient to provide for the establishment of Board of Investment to promote, encourage and facilitate local and foreign investment, and for matters connected therewith and ancillary thereto; AND WHEREAS the National Assembly and the Senate stand suspended in pursuance of the Proclamation of Emergency of the fourteenth day of October, 1999, and the Provisional Constitution Order No. l of 1999; AND WHEREAS the President is satisfied that circumstances exist which render it necessary to take immediate action; NOW, THEREFORE, in pursuance of the Proclamation of Emergency of the fourteenth day of October, 1999, and the Provisional Constitution Order No. l of 1999, read with the Provisional Constitution (Amendment) Order No.9 of 1999, and in exercise of all powers enabling him in that behalf, the President of the Islamic Republic of Pakistan is pleased to make and promulgate the following Ordinance:__ CHAPTER.__ I PRELIMINARY 1. Short title, extent and commencement.__ (1) This Ordinance may be called the Board of Investment Ordinance, 2001. (2) It extends to the whole of Pakistan. (3) It shall come into force at once. 2. Definitions.__ In this Ordinance, unless there is anything repugnant in the subject or context,__ (a) \"Board\" or \"BOI\" means the Board of Investment established under section 3; (b) \"Chairman\" means the Chairman of the Board; (c) \"CCOI\" means the Cabinet Committee on Investment constituted by Notification No.38(Cab)/97, dated 13th September, 1997; (d) \"Investment Policy\" means the investment policy, the CCOI may, from time to time, approve; (e) \"member\" means the member of the Board; (f) \"National Industrial Zone\" means an industrial estate, an export processing zone, a free industrial zone and export oriented unit or a free trade zone, notified as such by the Federal Government; (g) \"President\" means President of the Board; (h) \"Provincial Investment Committee\" means any Provincial Investment Committee established under section 16; (i) \"regulations\" means regulations made under this Ordinance; (j) \"rules\" mean rules made under this Ordinance; (k) \"Secretary\" means the Secretary of the BOI; and (l) \"Vice-President\" means the Vice-President of the Board. CHAPTER.__ II ESTABLISHMENT OF THE BOARD OF INVESTMENT 3. Establishment of the Board of Investment.__ (1) There is hereby established a Board to be called the Board of Investment (BOI) for carrying out the purposes of this Ordinance. (2) The Board shall consist of__ (a) the Chief Executive of the Islamic Republic of Pakistan who shall be its President; (b) Federal Minister in Charge of the Division, to which the business relating to the BOI is allocated, who shall be its Vice-President; (c) Chairman of the BOI; and (d) not less than seven and not more than twenty-five ex-officio members and non- official members, provided that not less than three non-official members shall be appointed from private sector from amongst persons of renowned integrity, expertise, experience and knowledge including, inter alia, academia, science, agriculture, banking, business, commerce, economic, engineering, finance, industry, investment, law, marketing, mathematics, statistics and technology. (3) The ex officio and the non-official members shall be appointed by the Federal Government and the terms and conditions of non-official members shall be such as the Federal Government may determine by notification in the official gazette. (4) An ex officio member shall hold office as member till such time he holds the office by virtue of which he is a member and upon his transfer, retirement, resignation, or removal from office, the person appointed in such person's place shall be the member. (5) The headquarters of the Board shall be at Islamabad and it may, with the approval of the President, establish its regional offices or sub-offices within Pakistan and abroad. 4. Chairman.__ The Chairman shall__ (a) be appointed by the Federal Government on such terms and conditions as it may determine by notification in the official Gazette; and (b) exercise such powers and perform such functions as may be assigned to him by the Board. 5. Secretary.__ (l) The Federal Government may, either from the Federal Government or from the private sector, appoint a Secretary who shall attend meetings of the Board and perform such functions as the Chairman may assign. (2) The Secretary shall be the principal staff officer and principal accounting officer of the BOI and shall have the status of a Secretary to the Federal Government. 6. Non-official members.__ (1) The members of the Board who are not appointed ex- officio by the Federal Government hereinafter referred to as non-official members, shall hold office for a term of two years and shall be eligible for re-appointment. (2) A non-official member may, by writing under his hand addressed to the Federal Government, resign his office. (3) A casual vacancy of any non-official member shall be filled in by appointment of another member for the residue of the term of his predecessor. (4) A non-official member shall hold office during the pleasure of the Federal Government, and may be removed from office if such member has, in the opinion of the Federal Government, so abused the position as to render his continuance in office detrimental to public interest: Provided that no member shall be removed from office until he has been given a reasonable opportunity of being heard. 7. Meetings of the Board.__ (1) Except as hereinafter provided, the Board shall regulate the procedure for its own meetings. (2) The Board shall meet at least once every three months. (3) Meetings of the Board shall be presided__ (a) by the President; (b) in the absence of the President, by the Vice-President; (c) in the absence of both the President and the Vice-President by the Chairman, or (d) in the absence of the President, the Vice-President and the Chairman, by a member nominated by the President. (4) The quorum for meeting shall be one-third of the total membership of the Board. (5) All questions in the meetings of the Board shall be decided by a majority of the members present and voting; and in case of equality of votes, the person presiding over the meeting shall have a second or casting vote. (6) Any urgent business of the Board may be transacted by circulation among all its members and any proposal so circulated and approved by a majority of the members shall be as effective and binding as if such proposal had been passed at a regular meeting of the Board. 8. Validity of proceedings.__ No act, proceedings, decision or order of the Board or a Committee thereof shall be invalid by reason only of existence of any vacancy or defect in the constitutional of the Board or, as the case may be, a Committee of the Board. 9. Functions of BOI.__ (1) Notwithstanding anything contained in any law the BOI shall__ (a) from time to time, review the national investment policy and laws, and propose any amendments, modifications and relaxations therein it may deem appropriate to the Cabinet for approval; (b) initiate and consider sectoral investment proposals and categories of investment which may require specific treatment and propose such sectoral incentives or conditions or criteria requiring rationalization of existing policies; and (c) be associated by the Federal Government in the formulation of all policies that may have an impact on investment in Pakistan, including inter alia, economic, fiscal and trade policies; (d) identify and promote the investment opportunities in different sectors and their promotion in Pakistan and abroad; (e) co-ordinate with concerned Ministries, Departments, agencies and Provincial Governments with regard to policies and their implementation having impact on investment; (f) provide one window facilities for provision of all services and utilities to investors by concerned Federal and Provincial Agencies; (g) deal with matters relating to National Industrial Zones as may be referred to it by the Federal Government; (h) monitor the progress of investment programmes and projects at all stages and ensure, through inter-agency and inter-provincial coordination, prompt implementation and operation; (i) review investment promotion plans, formulate institutional arrangements, make transparent and simplified procedures and guidelines for investment promotion; (j) appraise, evaluate and process all investment proposals and projects received from the investors for submission to the Cabinet or a Committee of the Cabinet or the Board; (k) appoint commissions, expert bodies and consultants to study various aspects of attracting investment in all sectors and improving the investment climate, procedures and other related matters; (l) maintain a data-base of investment projects in the private sector that involve local and foreign capital; (m) negotiate and finalize agreements for protection and promotion of investment with other countries and represent Pakistan on regional and international organizations pertinent to investment promotion; (n) liaise with private sector trade bodies and associations for their active participation in promotion of investment; (o) collect, compile, analyze, maintain and distribute investment-related information and, from time to time publish periodical analytical reports in investment trends; (p) promote a congenial environment for investment by ensuring de-regulation and other measures to remove obstacles to investment; (q) develop a marketing, image-building and public relations strategy to generate interest in the potential and opportunities of the Pakistani market, and publicize its activities; (r) communicate all major important administrative, financial and policy matters to the management of business undertakings falling within the purview of the investment policy approved by the Government; (s) establish Overseas Commissions consisting of prominent overseas Pakistani entrepreneurs and other individuals to act as investment promotion counsellors purely in an honorary capacity; (t) consider individual investment proposals and categories of investment which require special treatment and recommend, where appropriate, additional incentives or relaxation of conditions or criteria required under existing policies; (u) from time to time, determine and review the scale of fees and charges for services provided to the investors by it; and (v) any other function assigned by the Cabinet and the CCOI. 10. Directive of the Federal Government.__ For furthering the functions of the BOI, the Federal Government may, as arid when it considers necessary, issue directives to the BOI on matters of policy, and such directives shall be binding on the BOI. If a question arises whether any matter is a matter of policy or not, the decision of the Federal Government shall be final. 1[CHAPTER.__ IIA SPECIAL INVESTMENT FACILITATION COUNCIL (SIFC) 10A. Establishment of a Special Investment Facilitation Council.__ (1) The Federal Government shall, by notification in the official gazette, establish a Special Investment Facilitation Council (SIFC), for carrying out the purposes envisioned under this Chapter of the Ordinance. 1Ins. by Act XLI of 2023, s.2. (2) The SIFC shall consist of a Secretary, who shall also serve as the Principal Accounting Officer, and such members, as may be notified by the Federal Government, from time to time. (3) The President of the SIFC shall be the Prime Minister of Pakistan. (4) The President of the SIFC may co-opt any person as a member, or may require attendance of any person by special invitation, as deemed appropriate. 10B. Scope of work of the Special Investment Facilitation Council.__ (1) The SIFC shall facilitate investment and privatization in areas, including, but not limited to, Defence, agriculture, infrastructure development, strategic initiatives, logistics, minerals, information technology, telecommunication and energy (hereinafter referred to as the ‘Relevant Fields’) , and shall take all necessary measures in order to establish, facilitate, encourage and promote opportunities for investment, as well as, inter alia, business in and for Pakistan. (2) The Federal Government may notify any other area, sector, industry or projects as Relevant Field through a notification in the official Gazette to be processed under this Chapter. (3) The Provincial Government or an entity authorized by the said Government in this behalf may also refer any sector, industry or project to SIFC to be processed under this Chapter. 10C. Functions of the Special Investment Facilitation Council.__ (1) Without prejudice to the generality of section 10B, the SIFC shall, inter alia.__ (a) act as Single Window for multi-domain cooperation in Relevant Fields with GCC countries, in particular, and other countries in general, for facilitation of investment and development of an enabling policy environment; (b) recommend approvals, execute commercial transactions, and/or enter into arrangements and agreements, directly or indirectly, with local and foreign investors; (c) enter into commercial engagements and transact with governmental as well as corporate entities, for the purposes envisioned under this Chapter of the Ordinance; (d) prepare long-term road-map for growth, development and investment in the 'Relevant Fields', while capitalizing on fast track initiatives; (e) enhance awareness of Pakistan's latent potential in the 'Relevant Fields'; (f) improve ease of doing business by, inter alia, facilitating timely decision making, avoiding duplication of effort, fast-tracking investment and projects implementations, etc.; (g) monitor the progress of investment programs projects at all stages and ensure, through inter-agency and inter-provincial coordination, prompt implementation and operations thereof; (h) review investment promotion plans, formulate institutional arrangements, make transparent and simplified procedures and guidelines for investment promotion; (i) appraise, evaluate and process all investment proposals and projects received from the investors; (j) appoint commissions, expert bodies and consultants to study various aspects of attracting investment in all sectors; (k) promote an enabling environment for investment by encouraging deregulation and other measures to remove unnecessary obstacles in the process; (l) consider individual investment proposals as well as categories of investments that require special treatment, and recommend, where appropriate, additional incentives or relaxation in the regulatory and policy framework; and (m) perform any other function assigned by the Federal Government. (2) In order to carry out its functions, the SIFC may adopt any procedure or process, with the approval of the Federal Government. 10D. Formation of Committees.__ (1) For implementation of provision of this Chapter, SIFC may constitute executive and implementation committees. (2) The committees shall perform such functions as may be assigned to them by SIFC, in addition to facilitation and supervision of projects, transactions, arrangements and agreements made or carried out under this Chapter of the Ordinance. 10E. Power to issue directions.__ (1) For furthering the objectives of this Chapter, the SIFC may, as and when it considers necessary, issue recommendation, advice of directions to the respective regulatory bodies, authorities public sector entities, divisions and departments of the Federal Government, on matters within their respective domains, which shall, to the extent not inconsistent with applicable law be binding. (2) SIFC shall have powers to summon any regulatory bodies, authorities, public sector entities, divisions and departments of the Federal Government, or a representative thereof, in case requisite regulatory licenses, certificates and/or any other legal permits and permissions required to commence, foster or grow investment operations are delayed unnecessarily which may hamper investor (s) sentiment and inflow of investment (3) Powers specified in sub-sections (1) and (2) shall mutatis mutandis be exercisable by SIFC in respect of projects referred to the SIFC by the Provincial Government. 10F. Power to relax or exempt from regulatory compliance.__ The Federal Government, upon recommendation of the SIFC, by notification in the official Gazette and subject to such conditions, limitations or restriction’s if any as may be specified therein, may relax or exempt from a regulatory requirement or operation necessitated by any law for the time being in force for implementing projects, transactions, arrangements and agreements under this Chapter: Provided that the relaxation or exemption, granted under this section, shall be granted in accordance with the provisions of the respective laws. 10G. Immunity.__ (1) No suit, prosecutions or any other legal proceedings or action, in damages or otherwise shall lie against SIFC or any of its members or consultants for any act done, procedural lapse sufferd, or omission made, in exercise or performance of any functions, power or duty conferred or imposed by or under this Chapter. (2) Notwithstanding anything contained in any other law for the time being inforce, as investigating agency, anti-graft agency, law enforcement agency or a court shall not inquire into or initiate investigation in relation to, inter alia, any commercial transaction, arrangement or agreement made under this chapter, unless there exists material evidence of mala fides or bad faith on part of any person involved in the said commercial transaction, arrangement or agreement. (3) No person shall be liable in his personal capacity for any action taken in his official capacity. (4) Any procedural irregularity or lapse shall not affect, vitiate, set-aside, annul or rescind, inter alia, any transaction, arrangement or agreement under this Chapter. 10H. Overriding effect.__ The provisions of this Chapter shall have effect notwithstanding anything contrary contained in any other law or instrument having the force of law for time being in force and in the event of any inconsistency between the provisions of this Chapter and any other law whether enacted prior or subsequent to the commencement of the Board of Investment (Amendment) Act, 2023, the provisions of this Chapter shall prevail. 10I. Power to make rules.__ The SIFC may with prior approval of the Federal Government and by notification in the official Gazette, make rules for carrying out the purposes of this Chapter. 10J. Removal of difficulties.__ Where any difficulty arises in giving effect to any provision of this Chapter, the Federal Government may by notification in the official Gazette, make an order for the removal of the difficulty.] CHAPTER.__ III FINANCE AND ACCOUNTS 11. Grants.__ The Federal Government may, from time to time, place annual grants at the disposal of the BOI for the smooth discharge of its affairs. 12. Fund.__ (1) There shall be constituted a fund to be called the BOI Fund to which shall be credited all sums received by the BOI and out of which shall be defrayed all its expenditure. (2) The Fund shall consist of__ (a) grants made by the Federal Government; (b) foreign aid or loans obtained or raised by the BOI with the special or general sanction of the Federal Government; and (c) all other sums including fees and charges receivable by the BOI. 13. Budget and accounts.__ (1) In respect of each financial year, the BOI shall submit for approval of the Federal Government, by such date and in such form as may be specified by the Federal Government, a statement showing the estimated receipts and expenditure and the sums which are likely to be required from the Federal Government during the next financial year. (2) The BOI may open accounts with the State Bank of Pakistan or with any scheduled bank in Pakistan. (3) The accounts of the BOI shall be maintained in such form and manner as the Federal Government may, in consultation with the Auditor-General of Pakistan, determine. (4) The accounts of the BOI shall be audited every year by the office of the Auditor-General of Pakistan. (5) The accounts of the BOI shall be expended for the purposes of__ (a) paying any expenditure lawfully incurred by it including the remuneration and allowances of the Chairman, the members, employees, advisers and consultants, accountants, lawyers, valuers, and other experts appointed and employed by its provident fund contributions, superannuation allowances or gratuities, legal fees and costs, and other fees and costs, if any; (b) paying for expenditure incurred on__ (i) marketing and publicity; and (ii) seminars and conferences; (c) purchasing or hiring equipment, machinery and any other materials, acquiring land, erecting buildings and conducting other work and undertakings in the performance of its functions or the exercise of its powers under this Ordinance; and (d) paying any other expenses, costs or expenditure properly incurred or accepted by the BOI in the performance of its functions or the exercise of its powers under this Ordinance. 14. Annual Report.__ (1) The BOI shall prepare and submit to the Federal Government, as soon as possible after the end of each financial year but not later than the last day of December of the next year, a report on the conduct of its affairs for that year. (2) The report shall include__ (a) an audited statement of income and expenditure; (b) an audited balance sheet; (c) a short financial statement of the preceding financial year; (d) activities of the BOI during the preceding financial year; (e) an outline of the investment programme for the year ahead; and (f) any other matter which the Federal Government may direct or the BOI may consider appropriate. CHAPTER.__ IV PROVINCIAL INVESTMENT COMMITTEES 15. Provincial Investment Committees.__ (1) The Provincial Government shall, by Notification in the official Gazette, establish a Committee to be called the Provincial Investment Committee. (2) The Provincial Investment Committee shall consist of such members as the Provincial Government may appoint, by Notification in the Official Gazette and the Chairman and the Secretary shall be its ex-officio members. (3) Subject to any directions given by the BOI, the Provincial Investment Committee shall perform the following functions, namely:__ (a) encourage and promote investment, including joint ventures in the Province, in collaboration with the BOI; (b) assist the BOI to discharge its functions; (c) maintain a continuing working relationship and coordination with the BOI to facilitate and promote local and foreign investment in the Province; (d) help and facilitate effective implementation of investment policies of the Federal Government including the speedy development of National Industrial Zones; (e) identify investment opportunities and priority areas for investment in the Province, and assist the BOI in marketing those opportunities to prospective investors; and (f) ensure infrastructure facilities such as roads, water and drainage in the existing and future industrial estates and National Industrial Zones in the Province. CHAPTER.__ V MISCELLANEOUS 16. Delegation of powers.__ The BOI may by general or special order, delegate to the Chairman, the Secretary or any officer of the BOI, any of its powers or functions subject to such conditions as it may deem fit to impose. 17. Recruitment etc.__ (1) The BOI may appoint such officers, advisers, consultants and employees as it considers necessary for the efficient performance of its functions on such terms and conditions as may be prescribed under the rules made with the prior approval of the Federal Government: Provided that all appointments shall be made in accordance with the prescribed educational, technical or professional qualifications and experience. (2) The age of superannuation shall be sixty years for the employees of the BOI. 18. Members, officers, staff, etc. deemed to be public servants.__ Subject to other provisions of this Ordinance, every officer and employee of the BOI shall be deemed to be a public servant within the meaning of section 21 of the Pakistan Penal Code (Act XLV of 1860). 19. Assistance from other agencies.__ (1) The BOI may require any information from all sources including private sector organizations and agencies, any Ministry, Division Department, statutory body, corporation, agency of the Federal Government or a Provincial Government which, in its opinion, concerns any matter relating to the BOI, and the requisite information shall be provided to the BOI within a fortnight of the receipt of such request. (2) The BOI may request any Ministry, Division Department, statutory body, corporation, agency of the Federal Government or a Provincial Government, to review such proposals, policies, directions, guidelines, notifications, circulars, orders, regulations and rules, which, in its opinion, concern any matter relating to the BOI, and the concerned Ministry, Division, Department, statutory body, corporation, agency of the Federal Government or a Provincial Government shall give its decision in writing based on sound reasons within a fortnight of such request. (3) Subject to subsection (4), if, upon receiving the decision under subsection (2), the BOI is of opinion that the decision adversely affects any policy relating to its working, it may request the concerned Ministry, Division, Department, statutory body, corporation, agency of the Federal Government or a Provincial Government to review such decision in consultation with it or its authorized officer. (4) In case the BOI is not satisfied with the revised decision of the Ministry, Division, Department, statutory body, corporation, agency of the Federal Government or a Provincial Government under subsections (2) and (3), the unresolved issue shall be placed before the CCOI or the BOI wherein the representative from the concerned Ministry, Division, Department, statutory body, corporation etc., would be invited by special invitation to assist the CCOI or the BOI to arrive at a final decision. 20. Indemnity.__ No suit, prosecution, or other legal proceeding shall lie against the BOI, the Chairman, the Secretary, the members, the employees and consultants of the BOI for anything done in good faith or intended to be done under this Ordinance or any rule or regulation made thereunder. 21. Transfer of employees and assets.__ (1) Notwithstanding anything contained in any law, contract or agreement or in the terms and conditions of service, every person, other than employees of other Departments and members of regularly constituted Service Groups posted on deputation or employed in the Board of Investment and serving in or under it immediately before the commencement of this Ordinance including employees of the BOI on deputation to other organizations, shall cease to be civil servants and stand transferred to and become employees of the BOI on such terms and conditions as may be prescribed by rules to be made under section 23: Provided the terms or conditions of the persons so transferred shall not be less favourable than those applicable to them before the commencement of this Ordinance. (2) Notwithstanding anything contained in any other law for the time being in force, no person who has been transferred to the BOI under subsection (1) shall be entitled to any compensation on account of such transfer. (3) All funds, properties, rights and interests of whatsoever kind issued, used, enjoyed, possessed, owned or vested in the BOI, in existence before the commencement of this Ordinance, and all liabilities legally subsisting against the said Board shall vest in and become the liabilities of the BOI established under this Ordinance. (4) All suits, other legal proceedings instituted by or against the BOI in existence immediately before the commencement of this Ordinance and all orders issued, instructions executed, measures taken, etc., in relation thereto, shall be deemed to pertain to the BOI established under this Ordinance, and may proceed and be dealt with accordingly. (5) All debts and liabilities incurred, contracts entered into or rights acquired and all matters and all things, engaged to be done, by with or for the BOI, in existence before the commencement of this Ordinance, shall be deemed to have been incurred, entered into, acquired or engaged to be done by, with or for the BOI established under this Ordinance. 22. Committees.__ To assist it in the performance of its functions, the BOI may constitute such committees consisting of such persons as it may deem fit. 23. Power to make rules.__ (1) The BOI may, with the prior approval of the Federal Government, make rules for carrying out the purposes of this Ordinance and to regulate appointments and conditions of service of officers and employees in the service of the BOI; and (2) Until the rules referred to in subsection (1) are made, the officers and employees of the BOI shall continue to be governed, in respect of the matters terms and conditions of service by rules applicable to them immediately before the commencement of this Ordinance. 24. Power to make regulations.__ The BOI may, by Notification in the Official Gazette, make regulations, not inconsistent with the provisions of this Ordinance or the rules, for carrying out the purposes under this Ordinance. 25. Removal of difficulties.__ If any difficulty arises in giving effect to the provisions of this Ordinance, the Federal Government may, within two years of the commencement of this Ordinance, make such order, not inconsistent with the express provisions of this Ordinance, as may appear to it to be necessary or expedient for the purpose of removing such difficulty. _______"
}