{
  "file": "administrator6f054cd7e4fad383e1981a1a71da7742.pdf",
  "law_name": "THE AGRICULTURAL PRODUCE (GRADING AND MARKING) ACT, 1937",
  "text": "THE AGRICULTURAL PRODUCE (GRADING AND MARKING) ACT, 1937 CONTENTS 1. Short title and extent 2. Explanations 3. Prescription of grade designations 4. Penalty for unauthorized or incorrect marking with grade designation mark 5. Penalty for counterfeiting grade designation mark 6. Extension of application of Act THE SCHEDULE THE AGRICULTURAL PRODUCE (GRADING AND MARKING) ACT, 1937 1ACT No. I OF 1937 [24th February, 1937] An Act to provide for the grading and marking of agricultural 2[and other] produce. WHEREAS it is expedient to provide for the grading and marking of Agricultural 2[and other] produce; It is hereby enacted as follows:___ 1. Short title and extent. ___ (1) This Act may be called the Agricultural Produce (Grading and Marking) Act, 1937. 3[(2) It extends to the whole of Pakistan.] 2. Explanations.___In this Act, unless the contrary appears from the subject or context,___ (a) “agricultural produce” includes all produce of agriculture or horticulture and all articles of food or drink wholly or partly manufactured from any such produce, and fleeces and the skins of animals ; 4[(aa) “appropriate Government” means, in relation to the grading and marking of agricultural produce intended for consumption within a Province, the Provincial Government, and in relation to the grading and marking of agricultural produce intended for export or for trade between the Provinces, the Federal Government; ] (b) “counterfeit” has the meaning assigned to that word by section 28 of the Pakistan Panel Code (XLV of 1860); (c) “covering” includes any vessel, box, crate, wrapper, tray or other container ; (d) “grade designation” means a designation prescribed as indicative of the quality of any scheduled article ; (e) “grade designation mark” means a mark prescribed as representing a particular grade designation ; (f) “quality”, in relation to any article, includes the state and condition of the article; (g) “prescribed” means prescribed by rules made under this Act; (h) “scheduled article” means an article included in the Schedule; and (i) an article is said to be marked with a grade designation mark, if the article itself is marked with a grade designation mark or any covering containing or label attached to such article is so marked. 1The Act has been extended to the Leased Areas of Balochistan, see the Leased Areas (Laws) Order, 1950 (G. G. O. 3 of 1950) ; and applied in the Federal Areas of Balochistan, see Gazette of India, 1937. Pt. I., p. 1499. It has also been extended to the State of Bahawalpur by the Bahawalpur (Extension of Federal Laws) Order, 1953 (G. G. O. 11 of 1953), as amended. 2Ins. by Act No. XIII of 1942, s. 2. 3Subs. by the Central Laws (Statute Reform) Ordinance, 1960 (Ordinance No. XXI of 1960), s. 3 and 2nd Sch. (with effect from the 14th October, 1955). 4Ins. by Act No. XX of 1972, s. 3. 3. Prescription of grade designations.___The 1[appropriate Government] may, after previous publication by notification in the 2[official Gazette], make rules___ (a) fixing grade designations to indicate the quality of any scheduled article ; (b) defining the quality indicated by every grade designation ; (c) specifying grade designation marks to represent particular grade designations ; (d) authorising a person or a body of persons, subject to any prescribed conditions, to mark with a grade designation mark any article in respect of which such mark has been prescribed or any covering containing or label attached to any such article ; (e) specifying the conditions referred to in clause (d) including in respect of any article conditions as to the manner of marking, the manner in which the article shall be packed, the type of covering to be used, and the quantity by weight, number or otherwise to be included in each covering; (f) providing for the payment of any expenses incurred in connection with the manufacture or use of any implement necessary for the reproduction of a grade designation mark or with the manufacture or use of any covering or label marked with a grade designation mark 3[or with measures for the control of the quality of articles marked with grade designation marks including testing of samples and inspection of such articles or with any publicity work carried out to promote the sale of any class of such articles] ; and (g) providing for the confiscation and disposal of produce marked otherwise than in accordance with the prescribed conditions with a grade designation mark. 4. Penalty for unauthorised or incorrect marking with grade designation mark.___ 1[Whoever marks any schedule article with a grade designation mark, not being authorised to do so by rule made under section 3, or being so authorised marks any scheduled article with a grade designation mark which does not indicate the grade designation of the article correctly, shall be punishable with rigorous imprisonment for a term which may extend to three years, or with fine, or with both.] 5. Penalty for counterfeiting grade designation mark.___Whoever counterfeits any grade designation mark or has in his possession any die, plate or other instrument for the purpose of counterfeiting a grade designation mark shall be punishable with imprisonment which may extend to two years, or with fine, or with both. 6. Extension of application of Act.___The 1[appropriate Government], after such consultation as 2[it] thinks fit of the interests likely to be affected, may by notification in the 2[official Gazette] declare4 that the provisions of this Act shall apply to an article of agriculture produce not included in the Schedule 4[or to an article other than an article of agricultural produce], and on the publication of such notification such article shall be deemed to be included in the Schedule. 1Subs. by Act No. XX of 1972, ss. 2 and 3. 2Subs. by A. O., 1937. 3Ins. by Act No. XX of 1943, s. 2. 4Ins. by Act No. XIII of 1942, s. 3 (with effect from the 24th February 1937). THE SCHEDULE (See section 2) 1. Fruit. 2. Vegetables. 3. Eggs. 4. Dairy Produce. 5. Tobacco. 6. Coffee. 7. Hides and Skins. 1[8. Fruit Products. 9. Atta. 10. Oilseeds. 11. Vegetable Oil (including hydrogenated Oils and Vegetable fats). 12. Cotton. 13. Rice]. 2[14.Lac]. 3[15.Wheat]. 4[16.Sann Hemp]. 5[17.Sugarcane gur (jaggery)]. 6[18.Myrobalans.] 7[19. Bura.] 8[20. Wool.] 1Added by Govt. of I., Deptt. Of Edn. Health and Lands Notifin. No. F. 357-3/39-A, dated the 23rd March, 1939. 2Added by Govt. of I., Deptt. Of Edn., Health and Lands Notifin. No. F. 57-18/59-A, dated the 10th October, 1939. 3Added by Govt. of I., Deptt. Of Edn. Health and Lands Notifin. F. 3-9(1) 41-A, dated the 17th March, 1941. 4Added by Govt. of I., Deptt. Of Edn., Health and Lands Notifin.No. F.3-9(3)/41-A, dated 21st April, 1941. 5Added by Govt. of I., Deptt. Of Edn., Health and Lands Notifin.No. F.3-26(5)/41-A, dated 16th February, 1942. 6Added by Govt. of I., Deptt. Of Edn., Health and Lands Notifin.No. F.3-26(5)/41-A, dated 16th February, 1962. 7Added by Govt. of I., Deptt. Of Edn., Health and Lands Notifin.No. F.3-26/41-A, dated 5th June, 1942. 8Added by Notification. No. F.11-3/53-CS, dated 12th Nov., 1953. see Gaz. Of P, 1953, Pt.I, p.252. 1[* * *] 2[24.Animal Hair.] 1[* * *] 3[26.Oilcakes.] 27. Bones. 28. Bloods. 29. Casings. 4[30.Fish and fish products.] 5[31. All spices and condiments.] _________ 51323 Date: 20-01-2025 1The entries “21. Chillies (Powdered form), 22. Turmeric (Powdered form) and 23. Cooriander-seed (Powdered form)” added by Notification No.4-2/58 C&M dated 9th January, 1959 and “25. Corriander Seed (Whole)” added by Notification. S.R.O. 1275 (K)/62, dated 29th Novermber, 1962 superseded by entry 31, see S.R.O. 104(I)/69, dated 25th June, 1969, Gaz. Of P., 1969, Ext. P. 395. 2Added by Notification No.4-17/50-MPP, dated 10th June, 1959. see Gaz. Of P., 1959, Pt.I, p.275. 3Added by Notification No. S.R.O. 490(K)/66, dated 24th May, 1966, see Gaz. of P., 1959, Pt.I, p.255. 4Added by Notification No. S.R.O 84(K)/68, dated 13th Jan., 1968, see, Gaz., of P.,1968, Pt.I.,p.55. 5Added by Notification No.S.R.O. 104(I)/69, dated 25th June, 1969, see, Gaz., of P., 1969, Ext., p.395."
}