{
  "file": "administrator51c7baaf4df7518b66b24a25efff3a72.pdf",
  "law_name": "THE CIVIL SERVANTS (VALIDATION OF RULES) ORDINANCE, 2001",
  "text": "THE CIVIL SERVANTS (VALIDATION OF RULES) ORDINANCE, 2001 CONTENTS 1. Short title and commencement 2. Validation of certain rules THE CIVIL SERVANTS (VALIDATION OF RULES) ORDINANCE, 2001 ORDINANCE NO. II OF 2001 [9th January, 2001] An Ordinance to validate certain rules made under the Civil Servants Act, 1973 and certain actions taken thereunder WHEREAS it is expedient to validate certain rules made under the Civil Servant Act, 1973 (LXXIII of 1973), for the purpose hereinafter appearing; AND WHEREAS the National Assembly and the Senate stand suspended in pursuance of the Proclamation of Emergency of the fourteenth day of October, 1999, and the Provisional Constitution Order No.1 of 1999; AND WHEREAS the President is satisfied that circumstances exist which render it necessary to take immediate action; NOW, THEREFORE, in pursuance of the Proclamation of Emergency of the fourteenth day of October, 1999, and the Provisional Constitution Order No.1 of1999, read with the Provisional Constitution (Amendment) Order No.9 of 1999, and in exercise of all powers enabling him in that behalf, the President of the Islamic Republic of Pakistan is pleased to make and promulgate the following Ordinance:— 1. Short title and commencement.___ (1) This Ordinance may be called the Civil Servants (Validation of Rules) Ordinance, 2001. (2) It shall come into force at once. 2. Validation of certain rules.___(1) The Civil Servants Occupational Group and Services (Probation, Training and Seniority) Rules, 1990, the Civil Servants (Seniority) Rules, 1993 and the Civil Servants (Confirmation) Rules, 1993 and all notification amending the aforesaid Rules immediately before the commencement of this Ordinance are hereby affirmed and shall be deemed always to have been validly made. (2) All orders made, proceedings taken, acts done, instructions issued, powers exercised, appointments made thereunder by any authority which were made, taken, done or purported to have been, made taken, done, issued, or exercised immediately before the commencement of this Ordinance shall be deemed to have been validly made, taken, done, issued or exercised and deemed always to have had effect accordingly."
}