{
  "file": "administratore1b5ab79c2c1975670e6aa7fe57e57d6.pdf",
  "law_name": "The Competition Act, 2010",
  "text": "THE COMPETITION ACT, 2010. CONTENTS CHAPTER-I PRELIMINARY 1. Short title, extent, application and commencement 2. Definitions CHAPTER-II PROHIBITION OF ABUSE OF DOMINANT POSITION, CERTAIN AGREEMENTS, DECEPTIVE MARKETING PRACTICES AND APPROVAL OF MERGERS 3. Abuse of dominant position 4. Prohibited agreements 5. Individual exemption 6. Cancellation, etc., of individual exemptions 7. Block exemption 8. Block exemption procedure 9. The criteria for individual and block exemptions 10. Deceptive marketing practices 11. Approval of mergers CHAPTER-III COMPETITION COMMISSION OF PAKISTAN 12. Establishment of Commission 13. Head Office 14. Composition of Commission 15. The Chairman 16. The Acting Chairman 17. Term of office 18. Restriction on employment of the Chairman and other Members in certain cases 19. Termination of appointment of Members 20. Commission Fund 21. Accounts and audits 22. Annual report 23. Appointments by Commission 24. Meetings of Commission 25. Disclosure of interest by Members 26. Notification of interest by staff of Commission 27. Officers and employees, etc., to be public servants CHAPTER-IV FUNCTIONS AND POWERS OF THE COMMISSION 28. Functions and powers of the Commission 29. Competition advocacy 30. Proceedings in cases of contravention 31. Orders of the Commission 32. Power to issue interim orders 33. Powers of the Commission in relation to a proceeding or enquiry 34. Power to enter and search premises 35. Forcible entry 36. Power to call for information relating to undertaking 37. Enquiry and studies CHAPTER-V PENALTIES AND APPEALS 38. Penalty 39. Leniency 40. Recovery of penalties 41. Appeal to the Appellate Bench of the Commission 42. Appeal to the Court 43. Competition Appellate Tribunal 44. Appeal to Supreme Court CHAPTER-VI GENERAL 45. Common Seal 46. Service of notices and other documents 47. Compensation 48. Indemnity 49. Agreement for exchange of information 50. Sharing and supply of information 51. Obligation of confidentiality 52. Permitted disclosure 53. Assistance and advice to the Commission 54. Power to exempt 55. Act not to apply to trade unions 56. Powers of the Federal Government to issue directives 57. Power to make rules 58. Power to make regulations 59. Act to override other laws 60. Removal of difficulties 61. Repeals and savings 62. Validation of actions, etc. THE COMPETITION ACT, 2010 ACT NO. XIX OF 2010 [6th October, 2010] An Act to provide for free competition in all spheres of commercial and economic activity to enhance economic efficiency and to protect consumers from anti competitive behavior. WHEREAS it is expedient to make provisions to ensure free competition in all spheres of commercial and economic activity to enhance economic efficiency and to protect consumers from anti-competitive behavior and to provide for the establishment of the Competition Commission of Pakistan to maintain and enhance competition; and for matters connected therewith or incidental thereto; It is hereby enacted as follows:___ CHAPTER I PRELIMINARY 1. Short title, extent, application and commencement.__ (1) This Act may be called the Competition Act, 2010. (2) It extends to the whole of Pakistan. (3) It shall apply to all undertakings and all actions or matters that take place in Pakistan and distort competition within Pakistan. (4) It shall come into force at once. 2. Definitions.__ (1) In this Act, unless there is anything repugnant in the subject or context;__ (a) “acquisition” means any change of control of any undertaking by way of acquisition of Shares, assets or any other means; (b) “agreement” includes any arrangement, understanding or practice, whether or not it is in writing or intended to be legally enforceable; (c) “Chairman” means the Chairman of the Commission and includes the Acting Chairman; (d) “Commission” means the Competition Commission of Pakistan established under section 12; (e) “dominant position” of one undertaking or several undertakings in a relevant market shall be deemed to exist if such undertaking or undertakings have the ability to behave to an appreciable extent independently of competitors, customers, consumers and suppliers and the position of an undertaking shall be presumed to be dominant if its share of the relevant market exceeds forty percent; (f) “goods” includes any item, raw material, product or by-product which is sold for consideration; (g) “Member” means a member of the Commission; (h) “merger” means the merger, acquisition, amalgamation, combination or joining of two or more undertakings or part thereof into an existing undertaking or to form a new undertaking; and expression “merge” means to merge, acquire, amalgamate, combine or join, as the context may require; (i) “Minister” means the Federal Minister for Finance and in his absence, the Adviser to the Prime Minister on Finance; (j) “Ordinance” means the Companies Ordinance, 1984 (XLVII of 1984); (k) “relevant market” means the market which shall be determined by the Commission with reference to a product market and a geographic market and a product market comprises all those products or services which are regarded as interchangeable or Substitutable by the consumers by reason of the products' characteristics, prices and intended uses. A geographic market comprises the area in which the undertakings concerned are involved in the supply of products or services and in which the conditions of competition are sufficiently homogeneous and which can be distinguished from neighboring geographic areas because, in particular, the conditions of competition are appreciably different in those areas; (l) “retailer”, in relation to the sale of any goods, means a person who sells the goods to any other person other than for re-sale; (m) “regulations” means the regulations made by the Commission under this Act; (n) “rules” means the rules made by the Federal Government under this Act; (o) “services” means a service of any description whether industrial, trade, professional or otherwise; (p) “Tribunal” means Competition Appellate Tribunal under section 43 of the Act; (q) “undertaking” means any natural or legal person, governmental body including a regulatory authority, body corporate, partnership, association, trust or other entity in any way engaged, directly or indirectly, in the production, supply, distribution of goods or provision or control of services and shall include an association of undertakings; and (r) “wholesaler”, in relation to the sale of any goods, means a person who purchases goods and sells them to any other person for re-sale. (2) The words and expressions used but not defined in this Act shall have the same meanings respectively assigned to them in the Ordinance. CHAPTER II PROHIBITION OF ABUSE OF DOMINANT POSITION, CERTAIN AGREEMENTS, DECEPTIVE MARKETING PRACTICES AND APPROVAL OF MERGERS 3. Abuse of dominant position.__ (1) No person shall abuse dominant position. (2) An abuse of dominant position shall be deemed to have been brought about, maintained or continued if it consists of practices which prevent, restrict, reduce or distort competition in the relevant market. (3) The expression “practices referred to in sub-section (2) shall include, but are not limited to___ (a) limiting production, sales and unreasonable increases in price or other unfair trading conditions; (b) price discrimination by charging different prices for the same goods or services from different customers in the absence of objective justifications that may justify different prices; (c) tie-ins, where the sale of goods or service is made conditional on the purchase of other goods or services; (d) making the conclusion of contracts subject to acceptance by the other parties of supplementary obligations which by their nature or according to commercial usage, have no connection with the subject of the contracts; (e) applying dissimilar conditions to equivalent transactions on other parties, placing them at a competitive disadvantage; (f) predatory pricing driving competitors out of a market, prevent new entry, and monopolize the market; (g) boycotting or excluding any other undertaking from the production, distribution or sale of any goods or the provision of any service; or (h) refusing to deal. 4. Prohibited agreements.__ (l) No undertaking or association of undertakings shall enter into any agreement or, in the case of an association of undertakings, shall make a decision in respect of the production, supply, distribution, acquisition or control of goods or the provision of services which have the object or effect of preventing, restricting, or reducing competition within the relevant market unless exempted under section 5. (2) Such agreements include, but are not limited to___ (a) fixing the purchase or selling price or imposing any other restrictive trading conditions with regard to the sale or distribution of any goods or the provision of any service; (b) dividing or sharing of markets for goods or services, whether by territories, by volume of sales or purchases, by type of goods or services sold or by any other means; (c) fixing or setting the quantity of production, distribution or sale with regard to any goods or the manner or means of providing any services; (d) limiting technical development or investment with regard to the production, distribution or sale of any goods or the provision of any service; or (e) collusive tendering or bidding for sale, purchase or procurement of any goods or services. (f) applying dissimilar conditions to equivalent transactions with other trading parties, thereby placing them at a disadvantage; and (g) make the conclusion of contracts subject to acceptance by the other parties of supplementary obligations which, by their nature or according to commercial usage, have no connection with the subject of such contracts. (3) Any agreement entered into in contravention of the provision in sub-section (1) shall be void. 5. Individual exemption.___ (1) The Commission may grant an exemption from section 4 with respect to a particular practice or agreement, if a request for an exemption has been made to it by a party to the agreement or practice and the agreement is one to which section 9 applies. (2) The exemption under sub-section (1) may be granted subject to such conditions as the Commission considers it appropriate to impose and has effect for such period as the Commission considers appropriate. (3) That period must be specified in the grant of the exemption. (4) An individual exemption may be granted so as to have effect from a date earlier than that on which it is granted. (5) On an application made in such a way as may be specified by the rules made under section 55, the Commission may extend the period for which an exemption has effect; but, if the rules so provide, the Commission may do so only in specified circumstances. 6. Cancellation, etc., of individual exemptions.__ (1) If the Commission has reasonable grounds for believing that there has been a material change of circumstances since it granted an individual exemption, it may by notice in writing__ (a) cancel the exemption; (b) vary or remove any condition or obligation; or (c) impose one or more additional conditions or obligations. (2) If the Commission has reasonable suspicion that the information on which it based its decision to grant an individual exemption was incomplete, false or misleading in a material particular, the Commission may by notice in writing take any of the steps mentioned in sub-section (1). (3) Breach of a condition has the effect of cancelling the exemption. (4) Failure to comply with an obligation allows the Commission, by notice in writing to take any of the steps mentioned in sub-section (1). (5) The Commission may act under this section on its own initiative or on complaint made by any person. 7. Block exemption.__ (1) If agreements which fall within a particular category of agreements are, in the opinion of the Commission, likely to be agreements to which section 9 applies, the Commission may make a block exemption order giving exemption to such agreements. (2) A block exemption order may impose conditions or obligations subject to which a block exemption is to have effect. (3) A block exemption order may provide__ (a) that breach of a condition imposed by the order has the effect of canceling the block exemption in respect of an agreement; (b) that if there is a failure to comply with an obligation imposed by the order, the Commission may, by notice in writing, cancel the block exemption in respect of the agreement; (c) that if the Commission considers that a particular agreement is not one to which section 9 applies, the Commission may cancel the block exemption in respect of that agreement. (4) A block exemption order may provide that the order is to cease to have effect at the end of a period specified in the block exemption order. 8. Block exemption procedure.__ (1) Before making a block exemption order, the Commission must__ (a) publish details of its proposed order in such a way as the Commission thinks most suitable for bringing it to the attention of those likely to be affected; and (b) consider any representations about it which are made to the Commission. (2) A block exemption order may provide for a block exemption to have effect from a date earlier than that on which the order is made. 9. The criteria for individual and block exemptions.__ (1) The Commission may grant individual or block exemption in respect of an agreement, which substantially contributes to___ (a) improving production or distribution; (b) promoting technical or economic progress, while allowing consumers a fair share of the resulting benefit; or (c) the benefits of that clearly outweigh the adverse effect of absence or lessening of competition. (2) The onus of claiming an exemption under this Act shall lie on the undertaking seeking exemption. 10. Deceptive marketing practices.__ (1) No undertaking shall enter into deceptive marketing practices. (2) The deceptive marketing practices shall be deemed to have been resorted to or continued of an Undertaking resorts to__ (a) the distribution of false or misleading information that is capable of harming the business interests of another undertaking; (b) the distribution of false or misleading information to consumers, including the distribution of information lacking a reasonable basis, related to the price, character, method or place of production, properties, suitability for use, or quality of goods; (c) false or misleading comparison of goods in the process of advertising; or (d) fraudulent use of another's trademark, firm name, or product labeling or packaging. 11. Approval of mergers.__ (1) No undertaking shall enter into a merger which substantially lessens competition by creating or strengthening a dominant position in the relevant market. (2) Notwithstanding the provisions contained in the Act where an undertaking, intends to acquire the shares or assets of another undertaking, or two or more undertakings intend to merge the whole or part of their businesses, and meet the pre-merger notification thresholds stipulated in regulations prescribed by the Commission, such undertaking or undertakings shall apply for clearance from the Commission of the intended merger. (3) The concerned undertakings shall submit a pre-merger application to the Commission as soon as they agree in principle or sign a non-binding letter of intent to proceed with the merger. (4) Application referred to in sub-section (3) shall be in the form and accompanied by a processing fee as may be prescribed by the Commission. The concerned undertakings shall not proceed with the intended merger until they have received clearance from the Commission. (5) The Commission shall by way of an order reffered to in section 31, decide on whether the intended merger meets the thresholds and the presumption of dominance as determined in section 3. Such order shall be made within thirty days of receipt of the application. (6) If so determined, the Commission shall initiate a second phase review and for that purpose the Commission may require the concerned undertakings to provide such information as it considers necessary to enable the Commission to make the necessary determination. (7) Failure to make a determination within the prescribed period of thirty days for the first phase review shall mean that the Commission has no objection to the intended merger. (8) On initiation of the second phase review the Commission shall, within ninety days of receipt of the requested information under sub-section (6), review the merger to assess whether it substantially lessens competition by creating or strengthening a dominant position in the relevant market, and shall give its decision on the proposed transaction. In case concerned undertakings fail to provide the information requested, the Commission may reject the application. (9) Failure to render a decision within ninety days shall be deemed to mean that the Commission has no objection to the intended merger. (10) If after the second phase review the Commission determines that the intended merger substantially lessens competition by creating or strengthening a dominant position, it may nonetheless approve the transaction, if it is shown that__ (a) it contributes substantially to the efficiency of the production or distribution of goods or to the provision of services; (b) such efficiency could not reasonably have been achieved by a less restrictive means of competition; (c) the benefits of such efficiency clearly outweigh the adverse effect of the absence or lessening of competition; or (d) it is the least anti-competitive option for the failing undertaking's assets, when one of the undertakings is faced with actual or imminent financial failure: Provided that the burden of proof shall lie with the undertaking seeking the approval. (11) In case the Commission determines that the transaction does not qualify the criteria specified in sub-section (10), the Commission may; (a) prohibit the consummation of the transaction; (b) approve such transaction subject to the conditions laid by the Commission in its order; (c) approve such transaction on the condition that the said undertakings enter into legally enforceable agreements specified by the Commission in its order. (12) Where an undertaking has consummated the merger without complying with the provisions of sub-section (1) to sub-section (4), the Commission shall, after giving the undertaking an opportunity of being heard, make appropriate orders under section 31. (13) Where the Commission has granted approval subject to conditions, the Commission may, within one year, review the order of approval of merger on its own or on the application of the undertakings concerned on the ground that it is satisfied that the circumstances of the relevant market or the undertakings have so changed as to warrant review of the conditions imposed. (14) If the Commission determines that the approval was based on false or misleading information submitted by the undertaking, or the conditions prescribed in the relevant order of the Commission have not been fully complied with, the Commission may after affording the undertakings concerned an opportunity of being heard___ (a) undo such merger or acquisition; or (b) prescribe modifications or additions in the original order. CHAPTER III COMPETITION COMMISSION OF PAKISTAN 12. Establishment of Commission.___ (1) There is hereby established a Commission to be called the Competition Commission of Pakistan. (2) The Commission shall be a body corporate with perpetual succession and common seal, and may sue and be sued in its own name and, subject to and for the purpose of this Act, may enter into contracts and may acquire, purchase, take, hold and enjoy moveable and immovable property of every description and may convey, assign, surrender, yield up, charge, mortgage, demise, reassign, transfer or otherwise dispose of or deal with any moveable or immovable property or any interest vested in it, upon such terms as it deems fit. (3) The Commission shall be administratively and functionally independent, and the Federal Government shall use its best efforts to promote, enhance and maintain the independence of the Commission. 13. Head Office.__ The head office of the Commission shall be in Islamabad and the Commission may establish and close down offices at such other places in Pakistan as it considers necessary. 14. Composition of Commission.__ (1) The Commission shall consist of not less than five and not more than seven members: Provided that the Federal Government may increase or decrease the number of Members, from time to time, as it may consider appropriate. (2) The Members shall be appointed by the Federal Government and from amongst the Members of the Commission, the Federal Government shall appoint the Chairman. (3) All Members of the Commission shall serve on a full-time basis. (4) Not more than two Members of the Commission shall be employees of the Federal Government. (5) No person shall be recommended for appointment as a Member unless that person is known for his integrity, expertise, eminence and experience for not less than ten years in any relevant field including industry, commerce, economics, finance, law, accountancy or public administration: Provided that the Federal Government may prescribe qualifications and experience and mode of appointment of such Members in such manner as it may prescribe. (6) No person shall be appointed or continued as a Member if he__ (a) has been convicted of an offence involving moral turpitude; (b) has been or is adjudged insolvent; (c) is incapable of discharging his duties by reason of physical, psychological or mental unfitness and has been so declared by a registered medical practitioner appointed by the Federal Government; (d) absents himself from three consecutive meetings of the Commission, without obtaining leave of the Commission; (e) fails to disclose any conflict of interest at or within the time provided for such disclosure under this Act or contravenes any of the provisions of this Act pertaining to unauthorized disclosure of information; or (f) deemed incapable of carrying out his responsibilities for any other reason. (7) No act or proceeding of the Commission shall be invalid by reason of absence of a member or existence of vacancy among its members or any defect in the constitution thereof. (8) No Member or officer of the Commission shall assume his office until he has made such declaration affirming secrecy and fidelity. 15. The Chairman.__ (l) The Chairman shall be the chief executive of the Commission and shall, together with the other Members, be responsible for the administration of the affairs of the Commission. (2) The Chairman may subject to such conditions as he may deem fit, from time to time delegate all or any of his powers and functions to any of the Members. 16. The Acting Chairman.__ At any time when the position of the Chairman is vacant, or the Chairman is unable to perform his functions due to any cause, the Federal Government shall appoint the most senior Member of the Commission to be the Acting Chairman of the Commission until the appointment of a Chairman on a regular basis. 17. Term of office.__ The Chairman and Members of the Commission shall be appointed for a term of three years on such salary, terms and conditions of service as the Federal Government may by rules prescribe: Provided that the Chairman and Members shall be eligible for re-appointment for such term or terms but shall cease to hold office on attaining the age of sixty-five years or the expiry of the term whichever is earlier. 18. Restriction on employment of the Chairman and other Members in certain cases.__ The Chairman and other Members shall not, for a period of one year from the date on which they cease to hold office, accept any employment in, or connected with the management or administration of, any undertaking with has been a party to any investigation before the Commission under this Act. 19. Termination of appointment of Members.__ (1) Subject to sub-section (2), the appointment of any Member or the Chairman may, at any time, be revoked and he may be removed from his office by order of the Federal Government if it is found that such person has become disqualified under sub-section (6) of section 14. (2) Unless a disqualification referred to in section (1) arises from the judgment or order of a Court or tribunal of competent jurisdiction under any relevant provision of applicable law, a Member or the Chairman shall not be removed or his appointment revoked without an enquiry by an impartial person or body of persons constituted in accordance with such procedure as may be prescribed by rules made by the Federal Government and such rules shall provide for a reasonable opportunity for the Member or the Chairman to be heard in defence. (3) A Member or the Chairman may resign his office at any time by notice in writing addressed to the Federal Government. (4) A vacancy in the Commission caused by the death, resignation or removal of any Member or the Chairman shall be filled by the Federal Government within thirty days of the occurrence of such vacancy. 20. Commission Fund.__ (l) There shall be established a fund to be known as the “CCP Fund” which shall vest in the Commission and shall be utilized by the Commission to meet charges in connection with the functioning of the Commission including payment of salaries and other remuneration to the Chairman, Members, officers, officials, experts, advisers, and consultants of the Commission. (2) The Fund shall consist of, (a) allocations or grants by the Federal Government; (b) charges and fees levied by the Commission; (c) contributions from local and foreign donors or agencies with the approval of the Federal Government; (d) returns on investments and income from assets of the Commission; and (e) all other sums which may in any manner become payable to or vested in the Commission; (f) a percentage of the fees and charges levied by other regulatory agencies in Pakistan as prescribed by the Federal Government in consultation with the Commission and the percentage so prescribed shall not be varied to the disadvantage of the Commission. (3) The Commission shall make regulations for incurring expenditures as well as investments from the Fund. (4) The Commission may open and maintain accounts at such scheduled banks as it may from time to time determine. The Commission may with the approval of the Federal Government, open and maintain foreign currency accounts. 21. Accounts and audits.__ (1) The Commission shall cause proper accounts to be kept and shall as soon as practicable after the end of each financial year cause to be prepared for that financial year a statement of accounts of the Commission which shall include a balance sheet and an account of income and expenditure. (2) Within sixty days after the end of each financial year, the annual financial statements of the Commission shall be audited by the Auditor-General of Pakistan or by a firm of chartered accountants nominated by the Auditor-General of Pakistan. (3) The auditors shall make a report to the commission upon the balance sheet and accounts and in such report they shall state whether in their opinion the balance sheet is a full and fair balance sheet containing all necessary particulars and properly drawn up so as to exhibit a true and correct view of the affairs of the Commission and, in case they have called for any explanation or information from the Commission, whether it has been given and whether it is satisfactory. 22. Annual report.__ (1) Within ninety days from the end of each financial year, the Commission shall cause a report to be prepared on the activities of the Commission (including investigations, advocacy activities, enquiries and merger reviews made by the Commission) during that financial year. (2) The Commission shall, within one hundred and twenty days of the end of each financial year send a copy of the annual report of the Commission under sub-section (1) together with a copy of the statement of accounts of the Commission certified by the auditors and a copy of the auditors' report to the Federal Government which shall cause them to be published in the official Gazette and laid before both Houses of the Majlis-e-Shoora (Parliament) within two months of their receipt. 23. Appointments by Commission.__ (1) The Commission may appoint such officers, officials, experts, advisers and consultants as it considers necessary to carry out such functions as may be prescribed by the Commission with such powers and on such terms and conditions as it may determine from time to time. (2) The Commission may, by notification in the official Gazette, make regulations in respect of the terms and conditions of service of its employees. 24. Meetings of Commission.__ (1) Subject to this section, the Chairman may convene such meetings of the Commission at such times and places as he considers necessary for the efficient performance of the functions of the Commission. (2) The Chairman shall preside at every meeting of the Commission, and in the absence of Chairman, the Members may elect a Member to preside at the meeting. (3) At any meeting of the Commission the quorum shall be three Members. (4) All questions arising at any meeting of the Commission shall be determined by a majority of votes of the Members present and voting. (5) In the event of an equality of votes, the Chairman shall have a casting vote. (6) Subject to the provisions of this Act, the Chairman may give directions regarding the procedure to be followed at or in connection with any meeting of the Commission. 25. Disclosure of interest by Members.___ (1) For the purpose of this and the next following section, a person shall be deemed to have an interest in a matter if he has any interest, pecuniary or otherwise, in such matter which could reasonably be regarded as giving rise to a conflict between his duty to honestly perform his functions under this Act and such interest, so that his ability to consider and decide any question impartially or to give any advice without bias, may reasonably be regarded as impaired. (2) A Member having any interest in any matter to be discussed or decided by the Commission shall, prior to any discussion of the matter, disclose in writing, to the Commission, the fact of his interest and the nature thereof. (3) A disclosure of interest under sub-section (2) shall be recorded in the minutes of the Commission, prior to any discussion of, or decision on, the matter and, after the disclosure, the Member:___ (a) shall not, save in the cases provided in sub-sections (4) to (6), take part nor be present in any deliberation or decision of the Commission; and (b) shall be disregarded for the purpose of constitution of a quorum of the Commission. (4) If a Member is not the Chairman and the Chairman becomes aware that a Member has a conflict of interest, the Chairman shall:__ (a) if the Chairman considers that the Member should not take part, or continue to take part, as the case may require, in determining the matter, direct the Member accordingly; or (b) in any other case, cause the Member's interest to be disclosed to the persons concerned in the matter including any person whose application is pending decision or adjudication by the Commission, the Member in respect of whom a direction has been given under clause (a) shall comply with the direction. (5) If the Member is the Chairman, he shall disclose his interest to the persons concerned in the matter including any person whose application is pending decision or adjudication by the Commission. (6) Subject to sub-section (4), the Chairman or the Member who has any interest in any matter referred to in this section shall not take part, or continue to take part, as the case may require, in determining the matter unless everyone concerned in it consents to the Chairman or, as the case may be, the Member so taking part. 26. Notification of interest by staff of Commission.__ (1) Where a person who, in the course of___ (a) performing a function, or exercising a power, as an officer of the Commission, (b) performing functions or service as an employee, or (c) performing a function or services in any capacity by way to assisting or advising the Commission, or any officer of the Commission, is required to consider a matter in which he has an interest, such person shall forthwith give to the Commission a written notice stating that he is required to consider the matter and has an interest in it and setting out particulars of the interest. (2) The person referred to in sub-section (1) shall also declare his interest in accordance with the said sub-section whenever it is necessary to avoid the conflict of interest. 27. Officers and employees, etc., to be public servants.__ The Chairman, Members, employees, experts, consultants and advisers of the Commission authorized to perform any function or exercise any power under this Act shall be deemed to be public servants within the meaning of section 21 of the Pakistan Penal Code, 1860 (Act XLV of 1860). CHAPTER-IV FUNCTIONS AND POWERS OF THE COMMISSION 28. Functions and powers of the Commission.__ (1) The functions and powers of the Commission shall be___ (a) to initiate proceedings in accordance with the procedures of this Act and make orders in cases of contravention of the provisions of the said Act; (b) to conduct studies for promoting competition in all sectors of commercial economic activity; (c) to conduct enquiries into the affairs of any undertaking as may be necessary for the purposes of this Act; (d) to give advice to undertakings asking for the same as to whether any action proposed to be taken by such undertakings is consistent with the provisions of this Act, rules or orders made thereunder; (e) to engage in competition advocacy; and (f) to take all other actions as may be necessary for carrying out the purposes of this Act. (2) The Commission may, subject to such conditions as it may think fit to impose, delegate all or any of its functions and powers to any of its Members or officers as it deems fit. 29. Competition advocacy.__ The Commission shall promote competition through advocacy which, among others, shall include__ (a) creating awareness and imparting training about competition issues and taking such other actions as may be necessary for the promotion of a competition culture; (b) reviewing policy frameworks for fostering competition and making suitable recommendations for amendments to this Act and any other laws that affect competition in Pakistan to the Federal Government and Provincial Governments; (c) holding open hearings on any matter affecting the state of competition in Pakistan or affecting the country's commercial activities and expressing publicly an opinion with respect to the issues; and (d) posting on its website all decisions made, inquiries and completed, merger guidelines, educational material and the like. 30. Proceedings in cases of contravention.__ (1) Where the Commission is satisfied that there has been or is likely to be, a contravention of any provision of Chapter II, it may make one or more of such orders specified in section 31 as it may deem appropriate. The Commission may also impose a penalty at rates prescribed in section 38, in all cases of contravention of the provisions of Chapter II. (2) Before making an order under sub-section (1), the Commission shall___ (a) give notice of its intention to make such order stating the reasons therefore to such undertaking as may appear to it to be in contravention; and (b) give the undertaking an opportunity of being heard on such date as may be specified in the notice and of placing before the Commission facts and material in support of its contention: Provided that in case the undertaking does not avail the opportunity of being heard, the Commission may decide the case ex parte. (3) The Commission shall publish its Orders in the official Gazette, for the information of the public. (4) An order made under sub-section (1) shall have effect notwithstanding anything to the contrary contained in any other law for the time being in force or in any contract or memorandum or articles of association. (5) Any order issued under this section shall include the reasons on which the order is based. 31. Orders of the Commission.__ The Commission may in the case of___ (a) an abuse of dominant position, require the undertaking concerned to take such actions specified in the order as may be necessary to restore competition and not to repeat the prohibitions specified in Chapter II or to engage in any other practice with similar effect; and (b) prohibited agreements, annul the agreement or require the undertaking concerned to amend the agreement or related practice and not to repeat the prohibitions specified in section 4 or to enter into any other agreement or engage in any other practice with a similar object or effect; or (c) a deceptive marketing practice, require___ (i) the undertaking concerned to take such actions specified in the order as may be necessary to restore the previous market conditions and not to repeat the prohibitions specified in section 10; or (ii) confiscation, forfeiture or destruction of any goods having hazardous or harmful effect. (d) A merger, in addition to the provisions contained in section 11__ (i) authorize the merger, possibly setting forth the conditions to which the acquisition is subject, as prescribed in regulations; (ii) decide that it has doubts as to the compatibility of the merger with Chapter II, thereby opening a second phase review; or (iii) undo or prohibit the merger, but only as a conclusion of the second phase review. 32. Power to issue interim orders.__ (1) Where, during the course of any proceeding under section 30, the Commission is of opinion that the issuance of a final order in the proceedings is likely to take time and that, in the situation that exists or is likely to emerge, serious or irreparable damage may occur and an interim Order is necessary in the public interest, it may, after giving the undertaking concerned an opportunity of being heard, by order, direct such undertaking to do or refrain from doing or continuing to do any act or thing specified in the order. (2) An order made under sub-section (1) may, at any time, be reviewed, modified or cancelled by the Commission and, unless so cancelled, shall remain in force for such period as may be specified therein but not beyond the date of the final order made under section 31. 33. Powers of the Commission in relation to a proceeding or enquiry.__ (1) The Commission shall, for the purpose of a proceeding or enquiry under this Act, have the same powers as are vested in a civil court under the Code of Civil Procedure, 1908 (Act V of 1908), while trying a suit, in respect of the following matters, namely: (a) summoning and enforcing the attendance of any witness and examining him on oath; (b) discovery and production of any document or other material object producible as evidence; (c) accept evidence on affidavits; (d) requisitioning of any public record from any court or office; and (e) issuing of a commission for the examination of any witness, document or both. (2) Any proceeding before the Commission shall be deemed to be a judicial proceeding within the meaning of sections 193 and 228 of the Pakistan Penal Code (Act XLV of 1860), and the Commission shall be deemed to be civil court for the purposes of section 195 and Chapter XXXV of the code of Criminal Procedure, 1898 (Act V of 1898). (3) The Commission may, for the purpose of a proceeding or enquiry under this Act, require any undertaking: (a) to produce before, and to allow to be examined and kept by, an officer of the Commission specified in this behalf, any books, accounts, or other documents in the custody or under the control of the undertaking so required, being documents relating to any matter the examination of which may be necessary for the purposes of this Act; and (b) to furnish to an officer so specified such information in its possession, relating to any matter as may be, necessary for the purpose of this Act. 34. Power to enter and search premises.__ (1) Notwithstanding anything contained in any other law for the time being in force, the Commission for reasonable grounds to be recorded in writing shall have the power to authorize any officer to enter and search any premises for the purpose of enforcing any provision of this Act. (2) For the purpose of sub-section (1), the Commission__ (a) shall have full and free access to any premises, place, accounts, documents or computer; (b) may stamp, or make an extract or copy of any accounts, documents or computer-stored information to which access is obtained under clause (a); (c) may impound any accounts or documents and retain them for as long as may be necessary for the purposes of the Act; (d) may where a hard copy or computer disk of information stored on a computer is not made available, impound and retain the computer for as long as is necessary to copy the information required; and (e) may make an inventory of any article found in any premises or place to which access is obtained under clause (a). (3) Any officer of the Commission who seeks to exercise the right to enter and search premises shall be required to provide evidence of his authority to act on behalf of the Commission. (4) The Commission may authorize any valuer to enter any premises or place to inspect such accounts and documents as may be necessary to enable the valuer to make a valuation of an asset for the purpose of this Act. (5) The occupier of any premises or place to which access is sought under sub-section (1) shall provide all reasonable facilities and assistance to ensure the effective exercise of the right of access. (6) Any accounts, documents or computer impounded and retained under sub-section (2) and (3) shall be signed for by the Commission or an authorized officer. (7) An undertaking whose accounts, documents or computer have been impounded and retained under sub-section (2) may examine them and make an extract or copy from them during regular office hours under such supervision as the Commission may determine. Explanation.__ In this section, the expression “Occupier”, in relation to any premises or place, includes the owner, manager or any other person found present on the premises or place. 35. Forcible entry.__ (l) In the event that an undertaking refuses without reasonable cause to allow the Commission to exercise the powers contained in section 34, an investigating officer of the Commission may by written order, signed by any two Members enter any place or building by force, if necessary. (2) Notwithstanding anything contained in sub-section (1), no investigating officer of the Commission shall enter any premises by the use of force without a written order of the Commission signed by two Members. (3) If, on enquiry conducted in accordance with the rules it is found that the exercise by an investigating officer of his power under sub-section (2) was vexatious, excessive or with mala fide intent such officer shall be dismissed from service, and shall be guilty of an offence and shall be liable on conviction to a fine which may extend to five hundred thousand rupees or to imprisonment for a term not exceeding one year or both. (4) Whenever a criminal court imposes a fine under sub-section (3) it shall, when passing judgment, order that a sum equal to the whole or any part of the fine recovered, be paid to the person on whose complaint the investigating officer was convicted, and in case the fine is not recovered the sum shall be paid out of the Fund. (5) Any sum paid under sub-section (4) shall be without prejudice to the right of the aggrieved person to avail any other remedies available to him under the law but at the time of awarding compensation in any subsequent proceedings relating to the, same matter the court shall take into account any sum recovered from the convict and paid to the aggrieved person. 36. Power to call for information relating to undertaking.__ Notwithstanding anything contained in any other law for the time being in force, the Commission may, by general or special order, call upon an undertaking to furnish periodically or as and when required any information concerning the activities of the undertaking, including information relating to its organization, accounts, business, trade practices, management and connection with any other undertaking, which the Commission may consider necessary or useful for the purposes of this Act. 37. Enquiry and studies.__ (1) The Commission may, on its own, and shall upon a reference made to it by the Federal Government, conduct enquiries into any matter relevant to the purposes of this Act. (2) Where the Commission receives from an undertaking or a registered association of consumers a complaint in writing of such facts as appear to constitute a contravention of the provisions of Chapter II, it shall, unless it is of opinion that the application is frivolous or vexatious or based on insufficient facts, or is not substantiated by prima facie evidence, conduct an enquiry into the matter to which the complaint relates. (3) The Commission may outsource studies by hiring consultants on contract. (4) If upon the conclusion of an inquiry under sub-section (1) or sub-section (2), the Commission is of opinion that the findings are such that it is necessary in the public interest so to do, it shall initiate proceedings under section 30. CHAPTER-V PENALTIES AND APPEALS 38. Penalty.__ (1) The Commission may by order direct any undertaking or any director, officer or employee of an undertaking, to pay by way of penalty such sum as may be specified in the order if, after giving the undertaking concerned an opportunity of being heard, it determines that such undertaking:___ (a) has been found engaged in any activity prohibited under this Act; (b) has failed to comply with an order of the Commission made under this Act; (c) has failed to supply a copy of the agreement or any other documents and information as required under this Act or requisitioned by the Commission; (d) has furnished any information or made any statement to the Commission which such undertaking knows or has reason to believe to be false or found by the Commission to be inaccurate; or (e) knowingly abuses, interferes with, impedes, imperils, or obstructs the process of the Commission in any manner: Provided that fair comments made in good faith and in the public interest on the working of the Commission or on any order of the Commission issued after the completion of any proceedings, shall not be subject to the imposition of a penalty. (2) The Commission may impose penalties at the following rates, namely:___ (a) for a contravention of any provision of Chapter II of the Act, an amount not exceeding seventy-five million rupees or an amount not exceeding ten percent of the annual turnover of the undertaking, as may be decided in the circumstances of the case by the Commission; or (b) for non-compliance of any order, notice or requisition of the Commission an amount not exceeding one million rupees, as may be decided in the circumstances of the case by the Commission; and (c) for clause (e) in sub-section (1), an amount not exceeding one million rupees as may be decided in the circumstances of the case by the Commission. (3) If the violation of the order of the Commission is a continuing one, the Commission may also direct the undertaking guilty of such violation shall pay by way of penalty a further sum which may extend to one million rupees for every day after the first such violation. (4) Any penalty imposed under this Act shall be recoverable as provided in section 40. (5) Notwithstanding anything contained in this Act or any other law for the time being in force, failure to comply with an order of the Commission shall constitute a criminal offence punishable with imprisonment for a term which may extend to one year or with fine which may extend to twenty five million rupees and the Commission may, in addition to, or in lieu of, the penalties prescribed in this Act, initiate proceedings in a Court of competent jurisdiction. 39. Leniency.__ (l) The Commission may, if it is satisfied that any undertaking which is a party to a prohibited agreement and is alleged to have violated Chapter II prohibitions, has made a full and true disclosure in respect of the alleged violation, impose on such undertaking a lesser penalty as it may deem fit, than that provided in section 38. (2) Any exemption from a penalty or imposition of a lesser penalty shall be made only in respect of an undertaking that is a party to a prohibited agreement which first made the full and true disclosure under this section. (3) The Commission may, if it is satisfied that any undertaking which has been granted lenient treatment under sub-section (1) failed to comply with the conditions on which a lesser penalty was imposed had given false evidence, revoke the leniency provision and impose on the undertaking the penalty provided under section 38. 40. Recovery of penalties.__ (1) For the recovery of any amount from an undertaking, the Commission may serve upon the concerned person or the chief executive or director of the said undertaking, a copy of a notice in the prescribed form requiring such person to pay the said amount within the time specified in the notice. (2) If the amount referred to in the notice under sub-section (1) is not paid within the prescribed time, the Commission may proceed to recover the said amount from the person or undertaking in default in any one or more of the following manners, namely:__ (a) attachment of immovable or sale of any movable property, including bank account of the person or undertaking; (b) appointment of a receiver for the management of the movable or immovable property of the person or undertaking; (c) recovery of the amount as arrears of land revenue through the District Revenue Officer; (d) require any of the following, by notice in writing, the person to deduct and pay the sum specified in the notice on or before such date as may be so specified, namely:__ (i) from whom any money is due or may become due to the undertaking; (ii) who holds, or controls the receipt or disposal of or may subsequently hold, or control the receipt or disposal of, any money belonging to the undertaking or on account of the undertaking; or (iii) who is responsible for the payment of any sum to the undertaking. (3) Any bank, receiver, District Revenue Officer or undertaking who has paid any sum in compliance with a notice under sub-section (2) shall be deemed to have paid such sum to the Commission in respect of the undertaking, and the receipt of the Commission shall constitute a good and sufficient discharge of the liability of such bank, receiver, District Revenue Officer or undertaking to the extent of the sum referred to in such receipt. (4) If any bank, receiver, District Revenue Officer or undertaking on whom a notice is served, fails to attach, receive, recover, deduct and pay, as the case may be, the amount specified in the said notice, such bank, receiver, District Revenue Officer or undertaking shall be treated as a defaulter and the amount specified in the said notice shall be recoverable from him or it, as the case may be, by the Commission in accordance with the provisions of this Act. (5) The Commission may, by order, direct any bank, receiver, District Revenue Officer or undertaking which is a defaulter as referred to in sub-section (4), to pay by way of penalty, such sum as specified in the order, after giving to the bank, receiver, District Revenue Officer or undertaking an opportunity of being heard, it determines that such bank, receiver, District Revenue Officer or undertaking has wilfully failed to comply with the order of the Commission. (6) For the purposes of the recovery of the amount under sub-section (2), the Commission shall have the same powers as a civil court has under the Code of Civil Procedure 1908 (Act V of 1908). (7) The Commission may make rules regulating the procedure for the recovery of amounts under this section and any other matters connected with or incidental to the operation of this section. (8) All penalties and fines recovered under this Act shall be credited to the Public Account of the Federation. 41. Appeal to the Appellate Bench of the Commission.__ (1) An appeal shall lie to an Appellate Bench of the Commission in respect of an order made by any Member or authorized officer of the Commission. The person aggrieved by such order may, within thirty days of the passing of the order submit an appeal, to the Appellate Bench of the Commission. (2) The Commission shall constitute Appellate Benches comprising not less than two Members to hear appeals under sub-section (1). (3) The decisions of the Appellate Bench shall be made unanimously or by a majority of votes if the Appellate Bench comprises of more than two members. In the event of a split verdict, the original order appealed against shall hold and have effect as the final order of the Commission. (4) No Member shall be included in an Appellate Bench who has participated or been involved in the decision being appealed against. (5) The form in which an appeal is to be filed and the fees to be paid therefore and other related matters shall be prescribed by rules. 42. Appeal to the Court.__ Any person aggrieved by an order of the Commission comprising two or more Members or of the Appellate Bench of the Commission may within sixty days of the communication of the order, prefer appeal to the Competition Appellate Tribunal. 43. Competition Appellate Tribunal.__ (1) As soon as may be within thirty days of he commencement of this Act, the Federal Government shall constitute the Competition Appellate Tribunal which shall consist of a Chairperson who shall be a person who has been a judge of the Supreme Court or is a retired Chief Justice of a High Court and two technical members who shall be persons of ability, integrity and have special knowledge and professional experience of not less than ten years in international trade, economics, law, finance and accountancy. (2) The Chairperson and members shall hold office for a period of three years and shall be eligible for reappointment for a similar term and shall cease to hold office on attaining the age of sixty-eight years or the expiry of the term whichever is earlier. (3) The Chairperson and the members shall be entitled to such salary and other terms and conditions of service as the Federal Government may by rules prescribe. (4) The Competition Appellate Tribunal may, in consultation with the Federal Government, make rules governing procedure in proceedings before the Tribunal. (5) The Competition Appellate Tribunal shall decide an appeal expeditiously within six months of its presentation to the Tribunal. 44. Appeal to Supreme Court.__ Any person aggrieved by an order of the Competition Appellate Tribunal may prefer an appeal to Supreme Court within sixty days. CHAPTER-VI GENERAL 45. Common seal.__ (l) The Commission shall have a common seal which shall be kept in the custody of the Chairman or such other person as may be authorized by the Chairman by regulations made by the Commission. (2) Documents required or permitted to be executed under the seal shall be specified and authenticated in such manner as shall be authorized by regulations. 46. Service of notices and other documents.__ For the purpose of this Act any notice, requisition, letter or order required to be served on an undertaking shall be treated as properly served on the undertaking, if such service is made in the manner prescribed for the service of a summons under the Code of Civil Procedure, 1908 (V of 1908) or as may be prescribed by the Commission. 47. Compensation.__ (1) No undertaking shall be entitled to or be paid any compensation or damages by the Commission for any loss or injury suffered on account of the termination of any agreement or employment or the divestment of any share or property or any other action taken in pursuance of any order made under this Act. (2) Nothing in sub-section (1) shall prevent an undertaking from recovering compensation or damages from any other party for any loss or injury suffered on account of the termination of any agreement or employment or the divestment of any share or property or any other action taken in pursuance of any order made under this Act. 48. Indemnity.__ Subject to sub-section (3) of section 35 no suit, prosecution or other legal proceeding shall lie against the commission or any Member, officer or servant of the Commission for anything in good faith done or intended to be done under this Act or any regulations or order made thereunder. 49. Agreement for exchange of information.__ The Commission may, with approval of the Federal Government, enter into agreement with competition agencies in any part of the world for the exchange and assistance in performance of its function under this Act. 50. Sharing and supply of information.__ In order that information relevant to the performance of its functions is available to the Commission and for carrying out the purposes of this Act,___ (a) all offices and agencies of the Federal Government and Provincial Government shall supply free of cost or charges information requested by the Commission in the discharge of its functions under this Act; and (b) the State Bank of Pakistan, Security and Exchange Commission of Pakistan, the Central board of Revenue, the Federal Bureau of Statistics and all regulatory authorities shall arrange to provide requisite information as permissible under their own laws to the Commission, from time to time, at its request in the discharge of its functions under this Act. 51. Obligation of confidentiality.___ (1) Subject to this section, any person who is or was at any time,___ (a) acting as a Member of the Commission, or (b) engaged as an officer or employee of the Commission, or (c) authorized to perform or exercise any function or power of the Commission or any function or power on behalf of the Commission or to render services to the Commission in the capacity of a consultant or adviser; shall not, except to the extent necessary to perform his official duties, or in the performance or exercise of such a function or power, either directly or indirectly, make a record of, or disclose to any person, any information that is or was acquired by him because of having been so appointed, engaged or authorized, or make use of any such information, for any purpose other than the performance of his official duties or the performance or exercise of that function or power. (2) Any person who contravenes sub-section (1) shall be guilty of an offence which shall be punishable with imprisonment for a term which may extend to one year, or with fine which may extend to one million rupees or with both. (3) The Commission shall take all reasonable measures to protect from unauthorized use or disclosure of the information given to it in confidence in connection with the performance of its functions or the exercise of its powers. (4) For the purpose of sub-section (1) the disclosure of information as required or permitted by any law for the time being in force in Pakistan or any other jurisdiction shall be taken to be authorized use and disclosure of the information. (5) For the purposes of sub-section (1), the disclosure of information by a person for the purposes of:__ (a) performing his functions as,____ (i) a Member or employee of the Commission; (ii) an officer, or employee or who is authorized to perform or exercise a function or power of, or on behalf of, the Commission; or (b) the performance of functions or service by the person by way of assisting a Member or an officer of the Commission, shall be taken to be authorized use and disclosure of the information. (6) Where the Chairman is satisfied that any particular information,___ (a) may enable or assist the Commission to perform or exercise any of its functions or powers; (b) may enable or assist the Federal Government, or an agency of the Federal Government to perform a function or exercise a power; or (c) may enable or assist the Federal Government, an agency of the Federal Government, or of a foreign country to perform a function, or exercise a power, conferred by a law in force in that foreign country, the disclosure of the information to such persons by a person whom the Chairman authorizes for the purpose shall be taken to be authorized use and disclosure of the information. (7) The Chairman may impose conditions to be complied with in relation to information disclosed under sub-section (6). (8) The Chairman may delegate all or any of his functions and powers under sub-sections (6) and (7) to a Member or an officer of the Commission. (9) Nothing in any of sub-sections (4), (5), (7) and (8) shall limit what may otherwise constitute, for the purposes of sub-section (1), authorized use or disclosure of information. 52. Permitted disclosure.__ Nothing in section 49 shall preclude a person from,__ (a) producing a document to a court in the course of criminal proceedings or in the course of any proceedings under this Act, the Act or any other law for the time being in force; (b) disclosing to a court in the course of any proceedings referred to in clause (a) any matter or thing, that came under his or her notice in the performance of his or her official duties or in the performance of a function or the exercise of a power referred to in that section; (c) producing a document or disclosing information to a person to whom, in the opinion of the Commission, it is in the public interest that the document be produced or the information be disclosed; (d) producing a document or disclosing information that is required or permitted by any law for the time being in force in Pakistan or any other jurisdiction to be produced or disclosed, as the case may be; or (e) producing a document or disclosing information to the Commission. 53. Assistance and advice to the Commission.__ (1) The Commission may seek the assistance of any person, authority or agency for the performance of its functions under this Act. (2) All officers of an agency and any person whose assistance has been sought by the Commission in the performance of its functions shall render such assistance to the extent it is within their power or capacity. (3) Subject to sub-section (3) of section 35, no statement made by a person or authority in the course of giving evidence before the Commission or its staff shall use against him or subject such person or authority to civil or criminal proceedings except for prosecution of such person or authority for giving false evidence. 54. Power to exempt.__ The Federal Government may, by notification in the official Gazette, exempt from the application of this Act or any provision thereof and for such period as it may specify in such notification,__ (a) any class of undertaking if such exemption is necessary in the interest of security of the State or public interest; (b) any practice or agreement arising out of and in accordance with any obligation assumed by Pakistan under any treaty, agreement or convention with any other State or States; or (c) any undertaking Which performs a sovereign function on behalf of the Federal Government or a Provincial Government. 55. Act not to apply to trade unions.__ Nothing in the Act shall apply to trade unions or its member functioning in accordance with any law pertaining to trade unions for the time being in force. 56. Powers of the Federal Government to issue directives.__ The Federal Government may, as and when it considers necessary, issue policy directives to the Commission, not inconsistent with the provisions of this Act, and the Commission shall comply with such directives. 57. Power to make rules.__ (1) Subject to sub-section (2), the Commission may, by notification in the official Gazette and with the approval of Federal Government, make rules for all or any of the matters in respect of which it is required to make rules or to carry out the purposes of this Act. (2) The power to make rules conferred by this section, except for the first occasion, shall be subject to the condition of previous publication and before making any rules the draft thereof shall be published in the official Gazette for eliciting public opinion thereon within a period of not less than thirty days from the date of publication. 58. Power to make regulations.__ (1) Subject to sub-section (2), the Commission may, by notification in the official Gazette, make such regulations as may be required to carry out the purposes of this Act. (2) The power to make regulations conferred by this section, except for the first occasion, shall be subject to the condition of previous publication and before making any regulations the draft thereof shall be published in two newspapers of wide circulation for eliciting public opinion thereon within a period of not less than thirty days from the date of publication. 59. Act to override other laws.__ The provisions of this Act shall have effect notwithstanding anything to the contrary contained in any other law for the time being in force. 60. Removal of difficulties.__ If any difficulty arises in giving effect to the provisions of this Act, the Commission may make such order, not inconsistent with the provisions of this Act, as may appear to it to be necessary for the purpose of removing the difficulty. 61. Repeals and savings.__ On the commencement of this Act__ (a) the Monopolies and Restrictive Trade Practices (Control and Prevention) Ordinance, 1970 (V of 1970), hereinafter referred to as the repealed Act, shall stand repealed; (b) the Monopoly Control Authority established under the repealed Act shall stand dissolved; (c) all assets, rights, powers, authorities and privileges and property, movable and immovable, cash and bank balances, reserve funds, investments and all other interests and rights in, or arising out of such property and all debts, liabilities and obligations of whatever kind of the Monopoly Control Authority subsisting immediately before its dissolution shall stand transferred to and vest in the Competition Commission of Pakistan established under this Act; (d) no officer, employee, servant, or any other person holding any post in connection with the affairs of the Monopoly Control Authority shall have any right or lien to appointment to any post in the Competition Commission of Pakistan established under this Act; (e) officers, employees, servants, or any other person holding any post in connection with the affairs of the Monopoly Control Authority, not considered for appointment in the Commission shall have the option to be discharged from service on payment of admissible relieving benefits, or alternatively, their services shall be placed at the disposal of the Finance Division for absorption on the terms and conditions to be determined by that Division but not less favorable than those which they were entitled to in Monopoly Control Authority, and unless sooner they are absorbed elsewhere they shall continue to draw their pay, allowances, privileges or other benefits from the Commission as they were drawing while holding their posts in the Authority; (f) save as otherwise provided in clause (c), all the debts and obligations incurred or contracts entered into or rights acquired and all matters and things engaged to be done by, with or for the Monopoly Control Authority before the enforcement of this Act shall be deemed to have been incurred, entered into, acquired or engaged to be done by with or for the Commission, established under this Act, as the case may be; and (g) all suits and other legal proceedings instituted by or against the Monopoly Control Authority before the commencement of this Act shall be deemed to be suits and proceedings by or against the Competition Commission of Pakistan as the case may be and may proceed and be dealt with accordingly. 62. Validation of actions, etc.__ Anything done, actions taken, orders passed, instruments made, notifications issued, agreements made, proceedings initiated, processes or communication issued, power conferred, assumed or exercised, by the Commission or its officers on or after the 2nd October, 2007 and before the commencement of this Act, shall be deemed to have been validly done, made, issued, taken, initiated, conferred, assumed, and exercised and provisions of the Act shall have, and shall be deemed always to have had, effect accordingly. ________ Last Uploaded on 20.11.2023"
}