{
  "file": "administrator6c674827f1366a165f5fa6c7387798b5.pdf",
  "law_name": "Trust Ordinance, 1965",
  "text": "THE NATIONAL INVESTMENT (UNIT) TRUST ORDINANCE, 1965 CONTENTS 1. Short title, extent and commencement 2. Definitions 3. Units to be transferable movable property 4. Power of Federal Government to authorize issue of Bearer Certificates 5. Units to be approved securities 6. Trust Deed to be binding on the holders of Units 7. Notice of trust not receivable 8. Act XVIII of 1891 to apply 9. Power to make rules THE NATIONAL INVESTMENT (UNIT) TRUST ORDINANCE, 1965 ORDINANCE No. VII OF 1965 [8th April, 1965] AN ORDINANCE to provide for certain matters relating to the National Investment (Unit) Trust WHEREAS it is expedient to provide for certain matters relating to the National Investment (Unit) Trust and for matters connected therewith; AND WHEREAS the National Assembly is not in session and the Acting President is satisfied that circumstances exist which render immediate legislation necessary; NOW, THEREFORE, in exercise of the powers conferred by clause (1) of Article 29 of the Constitution and of all other powers enabling him in that behalf, the Acting President makes and pro- mulgates the following Ordinance:⸻ 1. Short title, extent and commencement.___(1) This Ordinance may be called the National Investment (Unit) Trust Ordinance, 1965. (2) It extends to the whole of Pakistan. (3) It shall come into force at once. 2. Definitions.___(1) In this Ordinance, unless there is anything repugnant in the subject or context,___ (a) “Management Company” means the National Investment Trust Limited, and includes any other company for the time being managing the affairs of the Trust; (b) “rules” means rules made under this Ordinance; (c) “Trust” means the National Investment (Unit) Trust constituted under the Trust Deed or, if that Trust is reconstituted, the reconstituted trust; (d) “Trustee” means the National Bank of Pakistan, as trustee under the Trust Deed and includes its successors, or if the Trust is reconstituted, the trustees of the reconstituted trust; (e) “Trust Deed” means the deed of trust dated the 12th November, 1962, constituting the National Investment (Unit) Trust, made between the National Investment Trust Limited, a limited liability company registered under the Companies Act, 1913 (VII of 1913), with its registered office at Karachi as Management Company of the one part, and the National Bank of Pakistan, a bank constituted under the National Bank of Pakistan Ordinance, 1949 (XIX of 1949), having its head office at Karachi as Trustee of the other part, and includes any supplemental deeds made in accordance with the aforesaid deed. (2) All other expressions defined or used in the Trust Deed but not defined in this Ordinance shall have the same sense as is given to them in the Trust Deed. 3. Units to be transferable movable property.—Subject to the rules and the provisions of the Trust Deed, Units shall be deemed to be transferable movable property. 4. Power of 1[Federal Government] to authorize issue of Bearer Certificates.— Notwithstanding anything to the contrary contained in any other law for the time being in force, but subject to rules, the 1[Federal Government] may, by notification in the official Gazette, authorise the Trust to issue Bearer Certificates in respect of the Units sold, and no Bearer Certificates shall be issued by the Trust unless so authorised. 5. Units to be approved securities.—Notwithstanding anything to the contrary contained in any law for the time being in force, the Units shall be deemed to be included among the securities enumerated in section 20 of the Trust Act, 1882 (II of 1882), and to be approved securities and approved investments for the purposes of the Insurance Act, 1938 (IV of 1938) and section 282B (2) of the Companies Act, 1913 (VII of 1913). 6. Trust Deed to be binding on the holders of Units.—Notwithstanding anything to the contrary contained in any other law for the time being in force but subject to section 4 of this Ordinance, the provisions of the Trust Deed shall be binding upon every Certificate Holder and his heirs, successors and legal representatives as if he were a party to the Trust Deed having full knowledge of its contents. 7. Notice of trust not receivable.—No notice of a trust, express, implied or constructive, shall be receivable by or on behalf of the Trust: Provided that the Management Company or the Trustee may, without creating any liability on their part, record in their books and comply with such directions of the holders of Units for the distribution of income as they think fit. 8. Act XVIII of 1891 to apply.—The provisions of the Bankers Books Evidence Act, 1891 (XVIII of 1891), shall apply to the books of the Trust as if it were a bank as defined in section 2 of the Act. 9. Power to make rules.—The 1[Federal Government] may, by notification in the official Gazette, make rules to provide for all matters for which provision is necessary for the purpose of giving effect to the provisions of this Ordinance. _______________ RGN Uploaded Date: 27.03.2024 1Subs. by F.A.O., 1975, Art. 2 and Table, for “Central Government”."
}