{
  "file": "administratorbf3c739041f23d1715243047f9bab24c.pdf",
  "law_name": "The Pakistan Standards And Quality Control Authority Act, 1996",
  "text": "THE PAKISTAN STANDARDS AND QUALITY CONTROL AUTHORITY ACT, 1996 CONTENTS CHAPTER I PRELIMINARY 1. Short title, extent and commencement. 2. Definitions. CHAPTER II CONSTITUTION 3. Constitution of the Authority. 4. Management. 5. Constitution of the Board. 6. Advisory Council. 7. Director-General. CHAPTER III POWERS 8. Powers and functions of the Authority. 9. Authentication of orders and other instruments of the Authority. 10. Prohibition of improper use of Authority marks. 11. Prohibition of use of certain names, etc. 12. Prohibition of registration in certain cases. 13. Power to prohibit or restrict export of certain articles. 14. Power to prohibit, manufacture, keeping in stock and sale of certain articles. 15. Inspectors. 16. Power to obtain information, etc. 17. Powers of Authority to other bodies, etc. 18. Appeals. 19. Certain matters to be kept confidential. 20. Penalty for improper use of Authority marks, etc. 21. Penalty for contravention of section 13. 22. Penalty for other contraventions. 23. Cognizance of offences by courts. 24. Protection of action taken under this Act. 25. Power to exempt. 26. Power to make rules. 27. Power to make regulations. CHAPTER IV ESTABLISHMENT 28. Appointment of officers, servants, etc., by the Authority. 29. Appointment of officers, servants etc., by the Director-General in cases of urgency. 30. Members and officers etc., to be public servants. 31. Delegation of powers to the Director-General etc. CHAPTER V FINANCE 32. Funds. 33. Budget. 34. Audit and Accounts. 35. Saving. CHAPTER VI MISCELLANEOUS 36. Submission of yearly reports and returns. 37. Dissolution of the department of Central testing laboratories and the Pakistan Standards Institution. 38. Removal of difficulties. 39. Repeal. THE PAKISTAN STANDARD AND QUALITY CONTROL AUTHORITY ACT, 1996 ACT NO. VI OF 1996 An Act to provide for the establishment of Pakistan Standards and Quality Control Authority WHEREAS it is expedient to establish a Pakistan Standards and Quality Control Authority to provide for the standardization and quality control services ; It is hereby enacted as follows:— CHAPTER I PRELIMINARY 1. Short title, extent and commencement.—(1) This Act may be called the Pakistan Standards and Quality Control Authority Act, 1996. (2) It extends to the whole of Pakistan. (3) It shall come into force at once. 2. Definitions.—In this Act, unless there is anything repugnant in the subject or context,— (a) “Authority” means the Pakistan Standards and Quality Control Authority established under section 3 ; (b) “Advisory Council” means the Advisory Council appointed under section 6 ; (c) “article” means (as respect standardization and marking) any substance, artificial or natural, or partly artificial or partly natural, whether raw or partly or wholly processed or manufactured, but does not include any article to which the Agricultural Produce (Grading and Marking) Act, 1937 (I of 1937), for the time being applies: (d) “Board” means the Board of Directors constituted under section 5 ; (e) “certificate” means certificate granted under this Act to use either Authority standard quality mark or the Authority conformity mark or Authority safety mark in relation to any article ; (f) “Director-General” means the Director General of the Authority ; (g) “Inspector” means an Inspector appointed by the Authority under section 15 ; (h) “license” means a license granted under this Act to use Pakistan standard and quality mark in relation to any article, product or process which conforms to the relevant Pakistan standard ; (i) “metrology” means the field of knowledge concerned with measurements and includes units of measurement and their field of application and all theoretical and practical problems relating to measurements ; (j) “Pakistan standard” means the standard (including any tentative or provisional standard) established and published by the Directorate of Standards of the Authority ; (k) “Pakistan Standards Institution” means the institution set-up under the Resolution of the Government of Pakistan in the Late Ministry of Commerce and (Industries Division) No. l-l-22(I)/58, dated the 3rd day of October, 1958, and registered under the Societies Registration Act, 1860 (XXI of 1860) ; (l) “prescribed” means prescribed by rules made under this Act; (m) “process” includes any practice, treatment and mode of manufacture of any article ; (n) “product” means raw material, semi­finished or finished products ; (o) “quality” means conformity to a given requirement or specification of a product or service; (p) “quality assurance” means a system of activities whose purpose is to provide an assurance that the overall quality control is in fact being done effectively ; (q) “quality control” means control over the quality of all the industrial and processed goods, their manufacturing processes and testing methods by the Authority ; (r) “rules” means rules made under this Act; (s) “standard” means a technical specification or other document available to the public, drawn up with the cooperation and consensus or general approval of all interests affected by it, based on the consolidated results of science, technology and experience aimed at the promotion of optimum community benefits and approved by the Authority ; (t) “testing” means the action or process of examining a substance under known condition in order to determine its identity and quality or one of the constituents and includes the action by which the physical properties, materials and machines are tested in order to determine their particular requirements or performances ; and (u) “training” means training of technical staff in the field of standardization, testing, quality control, legal, metrology, inspection and industrial research of the concerned departments and industries in Pakistan as well as of trainees from other friendly countries. CHAPTER II CONSTITUTION 3. Constitution of the Authority.—(1) There shall be established an Authority to be known as the Pakistan Standards and Quality Control Authority to carry out the purposes of this Act. (2) The Authority shall be a body corporate having perpetual succession and a common seal, with power subject to the provisions of this Act, to acquire and hold property, both movable, and immovable, shall by said name sue and be sued. (3) The headquarters of the Authority shall be at Karachi and it may, with the prior approval of the Federal Government set-up regional offices at such places as, when and where required. 4. Management.—(1) The general direction and administration of the Authority and its affairs shall vest in the Board which may exercise all powers and do all acts and things which may be exercised, or done by, the Authority. (2) The Board shall in discharging its functions act on sound principles of standardization, quality control, testing and metrology and shall be guided on questions of policy by such directions as the Federal Government may give from time to time. (3) If any question arises as to whether any matter is a matter of policy or not, the decision of the Federal Government shall be final. 5. Constitution of the Board.—(1) The Board shall consist of the following members, namely:— (i) Minister for 1[Science and Technology], Government of Pakistan Chairman. (ii) Director General of the Authority Vice- Chairman. (iii) Deputy Director General (Finance) of the Authority Member. (iv) Deputy Director General (Standards Development) of the Authority Member. (v) Deputy Director General (Quality Control) of the Authority Member. (vi) Deputy Director General (Technical Services) of the Authority Member. (vii) A representative of the Ministry of Commerce, Government of Pakistan Member. (viii) A representative of the Federation of Pakistan Chambers of Commerce and Industry Member. (ix) Secretary of the Authority Member/ Secretary. (2) No act or proceeding of the Board shall be invalid merely on the ground of the existence of any vacancy, or any defect, in the constitution of the Board. (3) The members of the Board, except the Chairman, shall received such salary and allowances and shall be subject to such conditions of service as may be determined by the Federal Government. (4) No person shall continue to be a member who (a) is or, at any time, has been convicted of an offence involving moral turpitude ; or (b) is or, at any time, has been adjudicated insolvent; or (c) is found to be a lunatic or of unsound mind ; and (d) has a financial interest in any scheme or a conflicting interest directly or indirectly and has failed to disclose such interest in writing to the Federal Government. 1 Subs. by the Pakistan Standards and Quality Control Authority (Amdt.) Act, 1997 (29 of 1997),s.2, for “Industries”. 6. Advisory Council.—(1) There shall be an Advisory Council to be appointed by the Federal Government for carrying out the activities of various directorates of the Authority. (2) The Advisory Council shall consist of the following members, namely:— (i) Secretary, Ministry of 1[Science and Technology], Government of Pakistan. Chairman. (ii) Three Members of the National Assembly and one Senator. Vice- Chairman. (iii) A representative of Ministry of Finance. Member. (iv) A representative of Ministry of 2[Industries and Production]. Member. (v) A representative of Ministry of Commerce. Member. (vi) A representative of Ministry of Defence. Member. (vii) A representative of Ministry of Eduction. Member. (viii) A representative of Ministry of Communications. Member. (ix) A representative of Ministry of Food and Agriculture. Member. (x) A representative of Ministry of Health. Member. (xi) A representative of Ministry of Petroleum and Natural Resources. Member. (xii) A representative of Ministry of Water and Power. Member. (xiii) A representative of Ministry of Housing and Works. Member. (xiv) A representative of each Provincial Government Member. (xv) A representative of University Grants Commission Member. (xvi) A representative of Pakistan Council of Engineers. Member. (xvii) A representative of Scientific and Research Institutions. Member. (xviii) A representative of Consumers Organizations Member. (xix) A representative of Federation of Pakistan Chambers of Commerce and Industry and one representative each of the Chambers of Commerce and Industry at Karachi, Lahore, Quetta and Peshawar. Member (xx) Director General, Pakistan Standards and Quality Control Authority Member/Secretary 7. Director-General.—(1) There shall be a Director General of the Authority who shall be the chief executive of the Authority and shall be appointed by the Federal Government. (2) The Director General and other members shall discharge such duties and perform such functions as are assigned to them by or under this Act. (3) Until the Board is duly constituted, the Director General shall, subject to such directions as the Federal Government may give from time to time, exercise the powers, and perform the function of the Board. (4) The officers of the Authority shall have such powers and shall perform such functions as may be assigned to them by the Director General. 1Subs. by the Pakistan Standards and Quality Control Authority (Amdt.) Act, 1997 (29 of 1997), s. 3, for “Industries”. 2Subs. ibid., for “Science and Technology”. CHAPTER III POWERS 8. Powers and functions of the Authority.—The powers ad functions of the Authority shall be— (i) designing, measuring and testing instruments and test procedures; (ii) inspection and testing of products and services for their quality, specification and characteristics, during use and for import and export purposes ; (iii) to review the matters which may be necessary for quality improvement of products or processes ; (iv) Preparation, implementation, co-ordination or arranging of the training programmers on standardization, quality control testing and weights and measures, for technical staff of the Authority, other organizational and trainees from foreign countries ; (v) setting up, assisting in, establishing and authorizing various inspection and testing centres and agencies at important industrial sites and towns ; (vi) providing for the quality labelling standards which shall specify ingredients, performance, specification, usage, methods and other relevant quality control matters ; (vii) grading the products when requested by manufacturers, or whenever necessary for the purpose of quality improvement ; (viii) setting up the mode of inspection and the manner in which samples may be obtained ; (ix) examination of manufacturing plants for the designated products or processes for approval of marks of the Authority ; (x) to stop manufacture, storage and sale of such products which do not conform to the Pakistan or any other country's standards recognized by the Authority ; (xi) inspection and taking of samples of any material or product for examination as to whether any article or process in relation to which any of Authority mark has been used conforms to the Pakistan standard or a standard of any other country recognized by the Authority or whether any of the Authority mark has been improperly used in relation to any article or process with or without license or certificate ; (xii) specification of the manner and condition subject to which a license or certificate to use any of the Authority marks may be granted or renewed, suspended, cancelled or withdrawn ; (xiii) granting, renewal, suspension, cancellation or with-drawl of a license or certificate for the use of any of the Authority marks ; (xiv) levying of fees, for marking, grant or renewal of any license or certificate in relation to use of any of the Authority marks ; (xv) levying of fees for checking, inspection and testing of products for import, export of local consumption ; (xvi) framing and publishing, amending , revising or with-drawl of the Pakistan standards in relation to any article, product, process ; (xvii) determination of Pakistan standards for the measurement of length, weight, volume energy and materials ; (xvii) collection, circulation of statistics and other information relating to standardization, quality control, metrology, applied research ; (xix) establishment, maintenance of libraries, museum, laboratories and accreditment of other laboratories for the purpose of furthering the practices of standardization, metrology and quality control; (xx) communication with public and Government agencies on national and international levels, on matters connected with standardization and other activities of the Authority through circulars, books, public media or through seminars, symposia workshops and printing and publishing such circulars and books ; (xxi) securing recognition of the Pakistan Standards and confidence in Pakistani products abroad ; (xxii) registration of inspection agencies ; (xxiii) coordination and cooperation with other national, regional and international organizations, associations, societies, institutions or councils, whether incorporate or not, whose objects are wholly or in part similar to those of the Authority ; and (xxiv) constitution of committees for carrying out the schemes and programmers of the Authority. 9. Authentication of orders and other instruments of the Authority.—All orders, decisions and all other instruments issued by the Authority shall be authenticated only by the signatures of such officer or officers who are authorized by the Authority in this behalf. 10. Prohibition of improper use of Authority marks.—No person shall use, in relation to any article, product or process or in the title of any patent or in any trade marks or design the Authority marks except under a license or certificate issued under this Act. 11. Prohibition of use of certain names, etc.—No person shall without the previous permission of the Authority and subject to such conditions as may be prescribed, use— (a) any name which may resemble the name of the Authority or contain the expressions “Pakistan standard” or “Pakistan standard specification” or any abbreviation of such expression ; or (b) any mark or trade mark in relation to any article or process containing the expressions “Pakistan standards” or “Pakistan standard specification” or any abbreviation of such expressions. 12. Prohibition of registration in certain cases.— (1) Notwithstanding anything contained in any law for the time bing is force, no registering body shall register any company, firm or any body or persons or a trade mark or design or grant a patent, in respect of an invention which hears a title containing any name or mark in contravention of provision of sections 10 or 11. (2) Where any question arises before a registering authority whether the use of any name or mark is in contravention of section 10 or section 11, the registering authority may refer the question to the Federal Government whose decision thereon shall be final. 13. Power to prohibit or restrict export of certain articles.—(1) The Federal Government may, by notification in the official Gazette and subject to such conditions and exceptions imposed by the Authority issuing a license or certificate, prohibit, restrict or otherwise control the taking out of Pakistan of articles of any specified description which do not bear the Authority mark or regulate practices, including trade practice and procedure connected with the export of such articles. (2) Any article specified in the notification issued under sub-section (1) shall be deemed to be the goods of which taking out of Pakistan has been prohibited or restricted under section 16 of the Customs Act, 1969 (IV of 1969), and all the provisions of that Act shall have effect accordingly. 14. Power to prohibit, manufacture, keeping in stock and sale of certain articles.—(1) The Federal Government may, in consultation with the Authority and by notification in the official Gazette, prohibit, with effect from such date as may be specified in the notification, the manufacture, storage and sale of any article specified therein which does not conform to the Pakistan standard. (2) The Federal Government may, by notification in the official Gazette, require any article which conforms to a particular Pakistan standard to be marked with such distinctive mark as may be specified in the notification. 15. Inspectors.—(1) The Authority may appoint Inspectors for the purpose of enforcing quality control and inspection of article or process in relation to which any of the Authority mark has been used and for the purpose of performing such functions as may be assigned to them. (2) Subject to any rules made under this Act, an Inspector shall have power to— (a) Inspect any operation carried on in connection with any article or process in relation to which any of the Authority mark has been used ; (b) take samples of any article, or of any material or substance used in any article or process, in relation to which any Authority mark has been used ; (c) seize and detain for such time as may be necessary any article to which he believes any provision of this Act has been contravened ; and (d) stop, search or seize any aircraft, ship or any transport vehicle in which he believes on reasonable grounds that any article subject to the provisions of this Act, is being transported thereon does not conform to Pakistan standard. (3) Every Inspector shall be issued by the Authority a certificate of appointment which shall be produced by the Inspector on demand. (4) Any person who obstructs or impedes in performance of duties of an Inspector or any other authorized officer shall be guilty of an offence punishable under section 22. (5) Any article seized under this Act may, at the option of the Inspector, be kept or stored in the premises where it was seized or may at the direction of the Inspector be removed to any other place. (6) The Inspector shall release any article seized by him under this Act when he is satisfied that all the requirements of the Act with respect thereto have been complied with. (7) Any person who, without the authority of an Inspector, removes, alters, or interferes in any way with any article seized under this Act, shall be guilty of an offence punishable under section 22. (8) Any person who knowingly makes any false or misleading statements either verbally or in writing to any Inspector engaged in carrying out his duties under this Act shall be guilty of an offence punishable under section 22. 16. Power to obtain information, etc.—Every licensee shall supply the Authority with such information and with such samples of any material or substance used in relation to any article or process as the Authority may require. 17. Powers of Authority to other bodies, etc.—The Federal Government may, in consultation with the Authority and by notification in the official Gazette, direct that any power exercisable by the Authority under this Act shall, in relation to such matters and subject to such conditions as may be specified in the direction, be exercisable also by such body or such organization as may be specified in the notification. 18. Appeals.—(1) Any person aggrieved by an order passed by the Authority or by a person or body acting as Authority under clause (xiii) of section 8, may prefer an appeal to the Court of Session. (2) The appeal shall be presented in such form and manner and within such time and on payment of such fee as may be prescribed. (3) The Court of Session shall dispose of the appeal after giving the appellant an opportunity of being heard and shall, in dealing with appeals under this section, follow such procedure as specified in the Code of Criminal Procedure, 1898 (V of 1898). 19. Certain matters to be kept confidential.—Any information coming into notice of the Authority or any of its officer in relation to any article or process subject to this Act shall be treated as confidential and shall not be communicated or revealed to any person : Provided that nothing in this section shall apply to the disclosure of any information for the purpose of prosecution under this Act. 20. Penalty for improper use of Authority marks, etc.—(1) Any person who contravenes the provisions of sections 10, 11 or 12, shall be punishable with imprisonment of either description for a term which may extend to one year, or with fine which shall not be less than thirty thousand rupees, or with both. (2) A court convicting a person under this section may direct that any property in respect of which the contravention was made shall be forfeited to the Federal Government. 21. Penalty for contravention of section 13.—If any person contravenes the provisions of any notification issued under section 13 or of any license or certificate issued thereunder, he shall without prejudice to confiscation of property or penalty to which he may be liable under the provision of the Customs Act, 1969 (IV of 1969) as applied by sub-section (2) of the said section 13, be punishable with imprisonment of either description for a term which may extend to one year, or with fine which shall not be less than fifty thousand rupees, or with both. 22. Penalty for other contraventions.—Whoever contravenes any of the provisions of this Act or any rule made or notification issued thereunder, including a notification issued under Section 14, prohibiting, manufacture, storage or sale of an article not conforming to the Pakistan Standard shall, if no other penalty is elsewhere provided under this Act, be punishable with imprisonment of either description for a term which may extend to one year, or with fine which shall not be less than fifty thousand rupees, or with both. 23. Cognizance of offences by courts.—No court inferior to that of a Magistrate of the First Class shall try any offence punishable under this Act. 24. Protection of action taken under this Act.—No suit, prosecution or other legal proceeding shall lie against the Federal Government or the Authority or any person acting under the authority of the Federal Government or the Authority for anything which is in good faith done or intended to be done in pursuance of this Act or any rule or regulation made thereunder. 25. Power to exempt.—The Federal Government may, by notification in the official Gazette, exempt any article or class of articles from the operation of all or any of the provisions of this Act. 26. Power to make rules.—The Federal Government may, by notification in the official Gazette, make rules to carry out the purposes of this Act. 27. Power to make regulations.—The Authority may, with the previous approval of the Federal Government, by notification in the official Gazette, make regulations not inconsistent with this Act or the rules to carry out the purposes of this Act, including procedure for holding meetings of the Authority. CHAPTER IV ESTABLISHMENT 28. Appointment of officers, servants, etc., by the Authority.—(1) The Authority may, from time to time, create posts and appoint such officers, servants, experts or consultants as it may consider necessary for the performance of its functions on such terms and conditions as may be prescribed : Provided that appointment to the posts in Basic Pay Scale 20 or above shall not be made except with the previous approval in writing of the Federal Government. (2) The Authority shall lay down the procedure for the appointment of its officers, servants, experts and consultants, and the terms and conditions of their service, including the constitution and management of pension and gratuity for them, and shall be competent to take disciplinary action against them. 29. Appointment of officers, servants etc., by the Director-General in cases of urgency.— Subject to section 28, the Director-General may, in cases of urgency, appoint such officers, servants, experts or consultants and on such terms and conditions as may be recommended by a selection committee, constituted under the rules : Provided that every appointment made under this section shall be reported to the Board and Authority without unreasonable delay and in no case beyond six months. 30. Members and officers etc. to be public servants.—The Director-General, members, officers, servants, experts and consultants of the Authority shall, when acting or purporting to act in pursuance of any of the provisions of this Act, be deemed to be public servants within the meaning of section 21 of the Pakistan Penal Code. (XLV of I860). 31. Delegation of powers to the Director-General etc.—The Authority may, by general or special order and subject to such conditions as it may think fit to impose, delegate to the Director- General or a member, or an officer of the Authority, all or any of its powers or functions under this Act. CHAPTER V FINANCE 32. Funds.—(1) There shall be created a fund to be known as the Pakistan Standards and Quality Control Authority Fund which shall vest in the Authority and shall be utilized by the Authority to meet charges in connection with its functions under this Act including the payment of salaries and other remuneration to the Director-General, members, officers, servants, experts and consultants of the Authority. (2) The Pakistan Standards and Quality Control Authority Fund shall be financed from the following sources:— (a) grants or loan made by the Federal Government; (b) loans, aid and donations from the national or international agencies ; and (c) revenue earned from the levy of various types of fees, such as marking fee, testing fee, registration fee and from the sale of standards. (3) All sums payable to the Authority may be recovered as an arrear of land revenue. 33. Budget.—The Authority shall, in respect of each financial year, submit for approval of the Federal Government, on such date as may be prescribed, a statement of the estimated receipts and expenditure, including requirements of foreign exchange for the next financial year. 34. Audit and Accounts.—(1) The accounts of the Authority shall be audited every year by the Auditor General of Pakistan Revenue in such manner as may be prescribed. (2) Copies of the audit reports shall be sent to the Federal Government alongwith the comments of the Authority. (3) The audit report shall be available for public inspection. (4) The Federal Government may issue directions to the Authority for rectification of any item objected to by the Auditor General of Pakistan Revenue and the Authority shall comply with such directions. 35. Save, as provided in the rules or regulations, the Deputy Director-General (Finance) of the Authority shall be consulted on every new proposal of expenditure. CHAPTER VI MISCELLANEOUS 36. Submission of yearly reports and returns.—(1) As soon as possible after the end of every financial year but before the last day of the month of December of that year, the Authority shall submit to the Federal Government a report on the conduct of its affairs for that year. (2) The Federal Government may, after giving sufficient notice to the Authority, require it to furnish the Government with— (a) any return, statement, estimate, statistics, or other information regarding any matter under the control of the Authority ; (b) a report on any subject with which the Authority is concerned ; and (c) a copy of any document in the charge of the Authority. 37. Dissolution of the department of Central testing laboratories and the Pakistan Standards Institution.—Upon the commencement of this Act, the department of Central Testing Laboratories and the Pakistan Standards Institution, hereinafter referred to as the said organisations, shall stand dissolved, and— (i) all assests, rights, powers, authorities and privileges and all properties, movable and immovable, cash and bank balance, reserve funds, investment and all other interests and rights in, or arising out of such properties and all debts, liabilities and obligations of whatever kind of the said organizations subsisting immediately before their dissolution shall stand transferred to and vest in the Authority. (ii) all officers and other employees of the said organizations shall, notwithstanding anything constrained in any law or in any agreement, deed, document or other instrument, stand absorbed and transferred to the Authority after obtaining prior option from the employees of the said organizations and shall be deemed to have been appointed or engaged by the Authority in accordance with the terms and conditions which shall not be less favourable than in their previous organizations; and no officer or other employee whose services are so absorbed and transferred shall be entitled to any compensation because of such absorption or transfer ; (iii) all debts and obligations incurred or contracts entered into or rights acquired and all matters and things engaged to be done by, with or for the said organizations before their dissolution shall be deemed to have been incurred, entered into, acquired or engaged to be done by, or for, the Authority ; and (iv) all suits and other legal proceedings instituted by or against the said organizations before their dissolution shall be deemed to be suits and proceedings by or against the Authority and may be proceeded or otherwise dealt with accordingly. 38. Removal of difficulties.—The Federal Government may, for the purpose of removing any difficulty in relation to the absorption and transfer and other matters specified in section 37, make such order as it considers expedient and any such order shall be deemed to be, and given effect to, as a part of the provisions of this Act. 39. Repeal.—The Pakistan Standards Institution (Certification Marks) Ordinance, 1961(XLVIII of 1961), is hereby repealed. _______________"
}