{
  "file": "administrator9d4c986b4fe62903074252ddba5eeca3.pdf",
  "law_name": "CUTTING OF TREES (PROHIBITION) ACT, 1992 CONTENTS 1.",
  "text": "CUTTING OF TREES (PROHIBITION) ACT, 1992 CONTENTS 1. Short title, extent and commencement 2. Definitions 3. Cutting of trees etc. Prohibited 4. Penalty 5. Cognizance of offences 6. Seizure and confiscation of Property 7. Power to prevent commission of offences 8. Provincial Governments to demarcate zones 9. Power to enter etc. 10. Rules 11. Repeal THE CUTTING OF TREES (PROHIBITION) ACT, 1992 ACT NO. XVIII OF 1992 [29th July, 1992] An Act to provide for the prohibition of cutting of trees near the external frontiers of Pakistan WHEREAS it is expedient to provide for the prohibition of cutting of trees or causing damage to trees near the external frontiers of Pakistan and matters ancillary thereto ; It is hereby enacted as follows :— 1. Short title, extent and commencement. This Act may be called the Cutting of Trees (Prohibition) Act, 1992. (2) It extends to the whole of Pakistan. (3) It shall come into force at once. 2. Definitions. In this Act, unless there is anything repugnant in the subject or context,— (a) ‘authorised officer’ means an officer authorised by a Provincial Government; (b) ‘field’ means a khasra number as defined in the Provincial law relating to land revenue; (c) ‘first zone’ means an area adjacent to and beyond the external frontier of Pakistan extending towards Pakistan to a line at four kilometers measured from the external frontiers of Pakistan; (d) ‘second zone’ means an area adjacent to and beyond the first zone extending towards Pakistan to a line at four kilometers measured from the first zone ; and (e) ‘tree’ means a large plant with a self-supporting trunk. 3. Cutting of trees etc. Prohibited.—(1) Except as hereinafter provided, no person shall, without the prior written approval of the authorised officer, cut, fell or damage or cause to be cut, felled or damaged any tree growing— (i) in the first zone,, if the number of remaining trees in any field falls short of the number to be calculated at the rate of fifteen trees per acre ; and (ii) in the second zone, if the number of remaining trees in any field falls short of the number to be calculated at the rate of ten trees per acre. (2) Nothing contained in sub-section (1) shall apply to a tree growing on land occupied as the site of a town or village or in a dwelling-house, including its curtilage. 4. Penalty. Whoever contravenes the provisions of this Act shall be guilty of an offence punishable— (i) with fine which may extend to five thousand rupees, if he contravention relates to the first zone ; and (ii) with fine which may extend to two thousand and five hundred rupees, if the contravention relates to the second zone. 5. Cognizance of offences. No court shall take cognizance of an offence under this Act, except on a complaint by the authorised officer or the local formation commander of the Pakistan Army. 6. Seizure and confiscation of Property.— (1) When any tree has been cut, felled or damaged in contravention of the provisions of this Act or rules made thereunder, such tree together with all tools used in committing any such contravention may be seized by the authorised officer. (2) Every officer seizing any property under this section shall place on such property a mark indicating that the same has been so seized and shall, as soon as may be, make report of such seizure to the Magistrate having jurisdiction to try the offence under this Act. (3) Upon the receipt of any such report, the Magistrate shall, with all convenient despatch, take such measures as may be necessary for the trial of the offender and the disposal of the property according to law. (4) Any tree in respect of which an offence has been committed under this Act and all tools used in committing any such offence shall be liable to confiscation, and such confiscation shall be in addition to any other punishment prescribed for such offence. 7. Power to prevent commission of offences. The authorised officer shall prevent the commission of any offence under this Act and for that purpose may take such measures as may be prescribed by the rules under this Act. 8. Provincial Governments to demarcate zones. The Provincial Governments may, whenever it may deem expedient, cause the zones defined in section 2 to be demarcated and the trees growing in any zone to be enumerated. 9. Power to enter etc. Any authorised officer or any other person authorized to demarcate the zones and enumerate the trees shall be entitled to enter upon any land, and— (i) to survey and land; (ii) to make map of any zone ; (iii) to erect or cause to be erected boundaries marks ; and (iv) to blaze any tree. 10. Rules. The Provincial Government may make rules for carrying out the purposes of this Act. 11. Repeal. The Cutting of Trees (Prohibition) Act, 1975 (LXXIV of 1975) is hereby repealed."
}