{
  "file": "administrator02b600b49ea24e787b8b7a99aaf4202f.pdf",
  "law_name": "The Standards Of Weight Act, 1939",
  "text": "THE STANDARDS OF WEIGHT ACT, 1939 CONTENTS 1. Short title, extent and commencement 2. Unit for weight 3. Standard weights 4. Sets of standard weights 5. Rules 6. [Repeal] THE STANDARDS OF WEIGHT ACT, 1939 ACT No. IX OF 1939 [28th March, 1939] An Act to establish standards of weight throughout 1[Pakistan] WHEREAS it is expedient to establish standards of weight throughout 1[Pakistan] ; It is hereby enacted as follows:___ 1. Short title, extent and commencement.__(1) This Act may be called the Standards of Weight Act, 1939. 1[(2) It extends to the whole of Pakistan.] (3) It shall come into force on such date2 as the 3[Federal Government] may, by notification in the official Gazette, appoint. 2. Unit for weight.__(1) The unit for weight shall be the standard grain, that is to say, that weight which when multiplied by 1799.84585 is the weight in vacuo of the iridio-platinum cylinder in the custody of the 4[Mint Master, Lahore], certified by the Standards Department of the British Board of Trade as having a weight of 1799.84585 grains in vacuo. (2) The standard grain shall be the only unit from which all other standard weights shall be ascertained. 3. Standard weights.__ (1) There shall be the following standard weights, namely : __ (a) the standard tola, being a weight of 180 standard grains; (b) the standard seer, being a weight of 80 standard tolas or 14,400 standard grains; (c) the standard maund, being a weight of 40 standard seers; (d) the standard pound, being a weight of 7,000 standard grains; (e) the standard ounce, being one-sixteenth part of the weight of a standard pound; (f) the standard hundredweight, being a weight of 112 standard pounds; (g) the standard ton, being a weight of 2,240 standard pounds. 1Subs. by the Central Laws (Statute Reform) Ordinance, 1960 (XXI of 1960), s. 3 and 2nd Sch. (w. e. f. fourteenth day of October, 1955). 2The 1st July, 1942, see Notification No. 33-C (b)/37-A., dated the 13th June, 1942, Gazette of India, 1942, Pt. I, p. 1012. 3Subs. by the Federal Adaptation of Laws Order, 1975 (P.O. No. 4 of 1975), Art. 2 and Table. 4Subs. by the Adaptation of Central Acts and Ordinance Order, 1949 (Order No. 4 of 1949). (2) No weight other than the weights set forth in sub-section (1) and integral multiples or sub-multiples of any such weight shall be used as a standard weight. 4. Sets of standard weights.__(1) The 1[Federal Government] shall cause to be prepared one set of such of the standard weights specified in sub-section (1) of section 3 or multiples or sub-multiples thereof as the 1[Federal Government] may consider expedient, and shall cause each weight of such set to be authenticated as having been ascertained from the standard grain, and shall deposit the set in such custody as the 1[Federal Government] may think fit. (2) The 1[Federal Government] shall cause similar sets of weights, similarly authenticated, to be prepared, and shall supply one set to each Provincial Government. (3) The 1[Federal Government] shall cause similar sets of weights, similarly authenticated, to be prepared and shall supply one set to the Government of any 2[Acceding State or non Acceding State] 3[* * *] which applies for it and pays the price fixed by the 1[Federal Government]. 5. Rules.__(1) The 1[Federal Government] may, by notification in the official Gazette, make rules for carrying into effect the provisions of this Act. (2) Without prejudice to the generality of the foregoing power, rules made under this section may regulate__ (a) the preparation of the sets of standard weights referred to in section 4 ; (b) the custody of the set of such weights which is to be maintained by the 1[Federal Government] and the periodical verification and adjustment thereof ; (c) the periodical verification and adjustment of the sets of standard weights supplied to Provincial and other Governments. 6. 4[Repeal.] ___________ Date: 31-07-2024 1Subs. by the Federal Adaptation of Laws Order, 1975 (P. O. No. 4 of 1975), Art. 2 and Table. 2Subs. by the Adaptation of Central Acts and Ordinance Order, 1949 (Order No. 1 of 1949). 3Omitted by the Federal Laws (Revision and Declaration) Act, 1951 (XXVI of 1951), s. 3 and 2nd Sch. 4Rep. by the Repealing and Amending Act, 1942 (XXV of 1942), s. 2 and 1st Sch."
}