{
  "file": "administratorb93e618520500701f18b8d6bfac22794.pdf",
  "law_name": "The Accounts Of The Institute Shall Be Audited By One Or More Auditors Who Are Chartered Accountants Within The Meaning Of The Chartered Accountants Ordinance, 1961",
  "text": "THE NATIONAL INSTITUTE OF CARDIOVASCULAR DISEASES (ADMINISTRATION) ORDINANCE, 1979 CONTENTS PREAMBLE CHAPTER I PRELIMINARY 1. Short title, extent and commencement 2. Definitions 3. Ordinance to override other laws 4. Vesting of powers, etc, of the Board of Trustees of the Trust in the Governing Body 5. Incorporation of the Institute CHAPTER II GENERAL 6. Functions of the Institute 7. Governing Body 8. Powers of the Governing Body 9. Term of office of members 10. Executive Director. 11. Meetings of the Governing Body. 12. Setting up of working groups and Committees 13. Funds 14. Audit and accounts 15. Appointments of officers, etc. 16. International cooperation CHAPTER III MISCELLANEOUS 17. Industrial relations ordinance, 1969, not to apply 18. Terms and conditions of service, etc. of Government servants working in the Institute 19. Terms and conditions of service of the employees of the Institute 20. Medical practice by officers 21. Power to make rules 22. Power to make regulations THE NATIONAL INSTITUTE OF CARDIOVASCULAR DISEASES (ADMINISTRATION) ORDINANCE, 1979 ORDINANCE NO. I OF 1979 [7th January, 1979] An Ordinance to provide for the proper administration of the affairs of the National Institute of Cardiovascular Diseases, Karachi. WHEREAS it is expedient to provide for the proper administration of the affairs of the National Institute of Cardiovascular Diseases, Karachi, and for matters connected therewith or ancillary thereto; AND WHEREAS the President is satisfied that circumstances exist which render it necessary to take immediate action; NOW, THEREFORE, in pursuance of the Proclamation of the fifth day of July, 1977, read with the Laws (Continuance in Force) Order, 1977, (C. M. L. A. Order No. 1 of 1977), and in exercise of all powers enabling him in that behalf, the President is pleased to make and promulgate the following Ordinance :— CHAPTER I PRELIMINARY 1. Short title, extent and commencement.—(1) This Ordinance may be called the National Institute of Cardiovascular Diseases (Administration) Ordinance, 1979. (2) It extends to the whole of Pakistan. (3) It shall come into force at once. 2. Definitions. In this Ordinance, unless there is anything repugnant in the subject or context,— (a) “Chairman” means the Chairman of the Governing Body ; (b) “Executive Director” means the Executive Director of the Institute ; (c) “Governing Body” means the Governing Body of the Institute ; (d) “Institute” means the National institute of Cardiovascular Diseases set up in 1963 and registered as such under the Societies Registration Act, 1860 (XXI of 1860); and (e) “Trust” means the National institute of Cardiovascular Diseases Trust, Karachi. 3. Ordinance to override other laws. This Ordinance shall have effect notwithstanding anything contained in any other law for the time being in force, or in the Trust Deed of the National Institute of Cardiovascular Diseases Trust, Karachi, dated the 8th May 1976. 4. Vesting of powers, etc., of the Board of Trustees of the Trust in the Governing Body. All the powers and functions of the Board of Trustees of the Trust shall vest in, and be exercised and performed by, the Governing Body and every member of the said Board shall cease to hold office. 5. Incorporation of the Institute.— (1) The Institute shall be a body corporate, to be called the National Institute of Cardiovascular Diseases, having perpetual succession and a common seal with power, subject to the provisions of this Ordinance, to acquire, hold and dispose of property, both movable and immovable, and shall by the said name sue and be sued. (2) The Headquarters of the Institute shall be at Karachi. ______________ CHAPTER II GENERAL 6. Functions of the Institute. The functions of the Institute shall be— (1) to undertake modern treatment of cardiovascular diseases ; (2) to acquire latest physical facilities required for carrying out necessary investigation and treatment of cardiovascular diseases; (3) to seek and enter into cooperation with international and other foreign agencies with the prior approval of the Federal Government in furtherance of the objectives of the Institute; (4) to carry out research in Cardiovascular Diseases for prevention and control of cardiovascular diseases as well as for its treatment ; (5) to undertake training of medical students and nurses, both undergraduate and post-graduate, in cardiovascular diseases; and (6) to develop itself into a Centre of super excellence for the treatment of cardiovascular diseases. 7. Governing Body. The general direction and administration of the affairs of the Institute shall vest in the Governing Body which shall consist of— 1. Minister for Health, Social Welfare and Population ……... Chairman. 2. Secretary, Ministry of Health, Social Welfare and Population…………………………………………………. Vice-Chairman 3. Director General, Health, Ministry of Health and Population………………………………………………… Member. 4. Executive Director, to be appointed by the Federal Government………………………………………………... Member/Secretary. 5. A nominee of the Pakistan Federation of Chambers of Commerce and Industry. ………………………………….. Member. 6. Two persons to be nominated by the Federal Government, of whom one shall be a person possessing medical qualifications………………………………………………. Member. 7. A nominee of the Auditor-General of Pakistan……………. Member. 8. The elected Mayor of the Karachi Metropolitan Cor- poration or, if there is no elected Mayor, a social worker of Karachi to be nominated by the Government of Sind……... Member. 9. A social worker of Sind, excluding Karachi, to be nominated by the Government of Sind……………………. Member. 8. Powers of the Governing Body.—(1) The Governing Body may,— (a) frame bye-laws to govern the working of the Institute and issue instructions to any committee or sub-committee of the Institute; and (b) generally supervise the administration and management of the affairs of the Institute and do all such acts and take all such steps as are necessary for the promotion and fulfilment of the objects and purpose of the Institute. (2) In the discharge of its functions, the Governing Body shall be guided on questions of policy by the instructions, if any, given to it from time to time by the Federal Government which shall be the sole judge as to whether a question is a question of policy, and the Governing Body shall be bound to carry out such directions. 9. Term of office of members.—(1) Unless earlier removed by the Federal Government, the term of members, other than ex-officio members, shall be three years. (2) A member, other than an ex-officio member, may resign his office by writing under his hand addressed to the Federal Government. (3) When a person is appointed to be a member of the Governing Body by virtue of his holding an office or appointment, he shall cease to be such member when he ceases to hold that office or appointment. 10. Executive Director.—(1) The Executive Director shall be the Secretary and Chief Executive Officer of the Institute and shall have the following functions and duties, namely :— (i) to keep in custody the records and seal of the Institute ; (ii) to appoint officers and staff upto Grade-17 and superintend and control the administration of the Institute ; (iii) to authorise payments of monthly salaries and allowances to the employees of the Institute ; (iv) to propose budget estimates and supplementary budget estimates and place the same before the Governing Body for approval ; (v) to pass payment of bills under any heads of the budget duly approved and authorised ; (vi) to issue notices of meetings of the Governing Body and its committees in consultation with the Chairman and to maintain proper record of minutes and proceedings thereof ; (vii) to take steps for the implementation of decisions of the Governing Body, committees and sub-committees ; (viii) to prepare and present the annual budget ; (ix) to carry on all the correspondence of the Institute ; (x) to execute deeds and documents on behalf of the Governing Body ; and (xi) to perform any other duties which may be assigned to him by the Governing Body. (2) The Executive Director shall be the ex-officio member of a committee or sub-committee set up by the Governing Body. (3) The Executive Director shall not, except with the previous approval of the Governing Body in each case or unless already approved in the Budget duly itemised, allow expenditure on items of civil works, or capital expenditure on equipment or automobiles. 11. Meetings of the Governing Body.—(1) The meetings of the Governing Body shall be convened by the Chairman on such date and at such time and place as may be specified by him: Provided that— (i) not less than four meetings shall be held every year ; (ii) not less than eight day’s notice shall be given to the members specifying the date, time and place of the meeting. (2) The Governing Body may regulate by regulations the procedure for its meetings. (3) No act or proceeding of the Governing Body shall be invalid merely on the ground of the existence of a vacancy in, or defect in the constitution of, the Governing Body. 12. Setting up of working groups and Committees. The Governing Body may from time to time appoint such working groups or committees from amongst its members as it may consider necessary to assist it in the performance of its functions and to discharge such of its functions as it may assign to them. 13. Funds. The funds of the Institute shall consist of— (a) grants made by the Federal Government ; (b) donations and endowments ; (c) income from investments and deposits ; (d) foreign aid and loans obtained with the approval of the Federal Government ; and (e) Trust Fund of the Institute. 14. Audit and accounts.—(1) The Executive Director shall prepare the annual budget of the Institute for the ensuing financial year and submit it for approval to the Governing Body. (2) The funds of the Institute, other than the Trust Fund, shall be kept in the personal ledger account of the Institute with the National Bank of Pakistan acting as an agent of the State Bank of Pakistan. (3) The Trust Fund shall be invested in Government and other approved securities and the income accruing therefrom shall be used for the purposes of the Institute. (4) The accounts of the Institute shall be maintained in such form and manner as the Auditor-General of Pakistan may determine in consultation with the Federal Government. (5) The accounts of the Institute shall be audited by one or more auditors who are chartered accountants within the meaning of the Chartered Accountants Ordinance, 1961 (X of 1961), and are appointed by the Institute in consultation with the Auditor-General of Pakistan. 15. Appointments of officers, etc. The Governing Body may appoint, subject to such general or special orders as the Federal Government may give from time to time, such officers in Grade-18 and above, and engage such consultants or expects, as it may consider necessary for the efficient performance of the functions of the Institute, on such terms and conditions as it may deem fit. 16. International cooperation. The Institute may, with the approval of the Federal Government, cooperative with any foreign agency or International Organization for the further development of its technical capabilities and research activities, pursuant to an international agreement or arrangement made before or after the establishment of the Institute. CHAPTER III MISCELLANEOUS 17. Industrial Relations Ordinance, 1969, not to apply. The provisions of the Industrial Relations Ordinance 1969, (XXIII of 1969), shall not apply to or in relation to the Institute or any of the officers or employees of the Institute. 18. Terms and conditions of service, etc., of Government servants working in the Institute.—(1) All persons in the service of Pakistan and serving in connection with the affairs of the Institute in any capacity immediately before the commencement of this Ordinance shall stand transferred for service under the Institute: Provided that such persons shall— (i) continue to be Government servants ; (ii) be deemed to be on deputation to the Institute ; (iii) be entitled to receive from the Institute for the period of their service under the Institute, pay and allowances which shall not be less than those to which they were entitled immediately before their transfer to the Institute ; (iv) be governed by such regulations as the Institute may, with the approval of the Federal Government, make, provided that such regulations shall not be less favourable than the rules which would have been applicable to them if their services had not been transferred to the Institute. (2) The Institute shall, in respect of the persons whose services have been transferred to it under sub-section (1),— (i) exercise all such administrative and financial powers as were exerciseable by the Federal Government or any authority subordinate to that Government ; and (ii) initiate disciplinary proceedings against any such person and refer the case of such person to the Federal Government for further action. (3) The persons whose services have been transferred to the Institute under sub-section (1) shall be entitled to receive from the Federal Government for the whole of their service, including the service under the Institute, pension, gratuity and the amount of commutation of pension in accordance with the rules which would have been applicable to them had they not been transferred for service under the Institute; Provided that the Institute shall pay to the Federal Government in respect of each such person a sum equal to the sum which bears the same proportion to the total sum paid to such person as the total period of service of such person bears to the period of service rendered by him in the Institute. (4) The pension, gratuity and the amount of commutation of pension shall be sanctioned by such officer of the Institute as the Federal Government may authorise in this behalf: Provided that, if such pension is required to be reduced, such officer shall, before sanctioning such pension, obtain formal orders of the Federal Government. (5) The General Provident Fund accumulations of persons whose services have been transferred to the Institute under sub-section (1) shall remain with the Federal Government, and they shall continue to contribute towards their Provident Fund account; Provided that temporary advances from such Fund may be sanctioned by the Institute in accordance with the rules applicable to them. 19. Terms and conditions of service of the employees of the Institute.—(1) The officers and stall employed in the Institute before the commencement of this Ordinance shall be entitled to the same terms and conditions to which they were entitled immediately before such commencement and such terms and conditions shall not be varied to their disadvantage. (2) The officers and staff employed by the Institute after the commencement of this Ordinance shall be entitled to the same pay, allowances and other terms and conditions of service to which the officers and staff of the Federal Government of the corresponding grade may be entitled from time to time. 20. Medical practice by officers. Private practice by officers of the Institute, who are qualified to practise medicine or surgery, shall be governed by regulations made under this Ordinance. 21. Power to make rules. The Federal Government may, by notification in the official Gazette, make rules for carrying out the purposes of this Ordinance. 22. Power to make regulations.—(1) The Governing Body may, with the previous approval of the Federal Government by notification in the official Gazette, make such regulations not inconsistent with the provisions of this Ordinance and the rules made thereunder as it may consider necessary or expedient for the administration and management of the affairs of the Institute. (2) In particular and without prejudice to the generality of the fore-going power, such regulations may provide for— (a) the uniform pay scales of all categories of employees of the Institute ; and (b) private practice by officers of the Institute who are qualified to practise medicine or surgery. ___________________"
}