{
  "file": "administratorb22dc23f6d59ddbc5546f72fc5606b85.pdf",
  "law_name": "The Pakistan Civil Aviation Authority Ordinance, 1982",
  "text": "THE PAKISTAN CIVIL AVIATION AUTHORITY ORDINANCE, 1982 CONTENTS 1. Short title, extent and commencement 2. Definitions 3. Establishment of the Authority 4. Power of the Federal Government to issue directives 5. Powers and functions of the Authority 6. Control of air transport and aviation services 7. Management 8. Executive Committee 9. Director-General his duties, functions and powers 10. Delegation of powers 11. Transfer of assets and liabilities of the Department of Civil Aviation to the Authority 12. Recruitment of officers, etc 13. Members, officers etc, to be public servants 14. Transfer of civil servants, etc, to the Authority 15. Budget 16. Civil Aviation Authority Fund 17. Maintenance of accounts 18. Audit 19. Authority to be deemed to be a local authority 20. Liability of the Federal Government to be limited 21. Submission of yearly reports, returns, etc 22. Exemption from taxes 23. Ordinance XXIII of 1969 not to apply to Authority 24. Indemnity 25. Certain existing arrangements to continue 26. Power of Federal Government to make rules 27. Power of the Authority to make regulations 28. Winding up of the Authority 29. Removal of difficulties THE PAKISTAN CIVIL AVIATION AUTHORITY ORDINANCE, 1982. *ORDINANCE No. XXX OF 1982 [4th December, 1982] An Ordinance to establish a Civil Aviation Authority WHEREAS it is expedient to establish a Civil Aviation Authority to provide for the promotion and regulation of civil aviation activities and to develop an infrastructure for safe, efficient, adequate, economical and properly coordinated civil air transport service in Pakistan ; AND WHEREAS the President is satisfied that circumstances exist which render it necessary to take immediate action ; NOW, THEREFORE, in pursuance of the Proclamation of the fifth day of July, 1977, and in exercise of all powers enabling him in that behalf, the President is pleased to make and promulgate the following Ordinance:― 1. Short title, extent and commencement.―(1) This Ordinance may be called the Pakistan Civil Aviation Authority Ordinance, 1982 (2) It extends to the whole of Pakistan. (3) It shall come into force at once. 2. Definitions. In this Ordinance, unless there is anything repugnant in the subject or context,― (i) “aerodrome” means any area of land or water designed, equipped, set apart or commonly used or intended to be used, either wholly or in part, for affording facilities for the landing and departure of aircraft, and includes all buildings, sheds, vessels and other structures and roads thereon or apper taining thereto ; (ii) “airport” means an aerodrome at which facilities have, in the opinion of the Federal Government, been sufficiently developed to be of importance to civil aviation ; (iii) “Authority” means the Civil Aviation Authority established under section 3 ; (iv) “Board” means the Board referred to in section 7 ; (v) “Chairman” means the Chairman of the Board ; (vii) “Director‑General” means the Director‑General of the Authority *Has been applied to the F ATA, by S.R.O. 1312(1)/97, dt. 25-1-97 (viii) “licence” means the certificate of competency which a licence‑holder is required by the law of the country granting the licence to hold connection with his licence ; and (ix) “member” means a member of the Board. 3. Establishment of the Authority.― (1) As soon as may be after the commencement of this Ordinance, the Federal Government shall, by notification in the official Gazette, establish an authority to be known as the Civil Aviation Authority for carrying out the purposes of this Ordinance. (2) The Authority shall be a body corporate, having perpetual succession and a common seal with power, subject to the provisions of this Ordinance, to acquire and hold property, both movable and immovable, and shall sue and be sued by the name assigned to it by sub-section (1). 4. Power of the Federal Government to issue directives. The Federal Government may, as and when it considers necessary, issue directives to the Authority on matters of policy, and such directives shall be binding on the Authority, and if a question arises whether any matter is a matter of policy or not; the decision of the Federal Government shall be final. 5. Powers and functions of the Authority.―(1) The Authority shall be responsible for the regulation and control of civil aviation activities in the country. (2) The Authority shall from time to time prepare for the approval of the Federal Government five‑year plans for the development of infrastructure for the promotion of safe, efficient, adequate, economical and properly coordinated civil air transport service and control and regulate civil aviation activities in Pakistan. (3) The Authority shall frame schemes in respect of (i) provision of civil airports and aerodromes in the country ; (ii) rovision of air traffic services to aircraft ; (iii) provision of navigational services to aircraft ; (iv) provision of communication services at the civil airports and aerodromes in the country ; (v) provision of aeronautical and flight inspection services to all aircraft registered in Pakistan; (vi) provision of search and rescue services ; (vii) provision of crash, fire and rescue services at all airports and aerodromes to aircraft in need ; (viii) management of estates at airports and aerodromes ; and (ix) any other matter facilitating the achievement of the objects of this Ordinance (4) The Authority may, if it considers necessary, (i) cause studies, surveys, experiments or technical research to be made or contribute towards the cost of any such studies, surveys, experiments or technical research made by any, other agency at the request of the Authority; 1[(ii) approve estimates of development projects and maintenance works and award of contracts for construction, maintenance and operation of airports and its establishment;] (iii) subject to clause (ii) undertake any approved works, incur any expenditure, procure vehicles, plants, machinery and material, required for its use and enter into and perform all such contracts as it may consider necessary or expedient ; (iv) acquire by purchase, lease, exchange or otherwise any land or immovable property or any interest in such land or property ; (v) 1* * * pledge any property vested in it, including the immovable assets transferred to it under section 11, to raise finances for the development projects to be undertaken by it ; and (vi) seek and obtain advice and assistance in the preparation or execution of a scheme from any local body or agency of the Government and such local body or agency shall give the advice and assistance sought by the Authority to the best of its ability, and additional expenditure, if any, involved in such advice or assistance shall be borne by the Authority. 1* * * * * * * (6) Notwithstanding anything contained in this Ordinance, the Authority may undertake the execution of any scheme relating to civil aviation activity as framed or sponsored by any local body or agency or exercise technical supervision and administrative and financial control over the execution thereof on such terms and conditions as may be agreed to between the Authority and the local body or agency. (7) The Authority and the Director‑General may exercise such powers under the Civil Aviation Rules, 1978, and the Schedule to the Aircraft Rules, 1937, as the Federal Government may, by notification in the official Gazette, specify. (8) The acquisition of any land or any interest in land for the Authority or for any scheme under this Ordinance shall be deemed to be an acquisition for a public purpose within the meaning of the Land Acquisition Act, 1894 (I of 1894), and the provisions of the said Act shall apply to all such proceedings. (9) The Director‑General or any person authorised by him in writing may enter upon any survey and land, erect pillars for the determination of intended lines of works, make borings and excavations and do all other acts which may be necessary for the preparation of any scheme, provided that, when the affected land does not vest in the Authority, the power conferred by this subsection shall be exercise in such manner as to cause the least interference with and the least damage to the rights of the owner thereof. 1Subs. and omitted by Ordinance XI of 1999, s. 2. (10) When any person enters into or upon any land in pursuance of sub-section (9), he shall at the time of entering or as soon thereafter as may be practicable pay or tender payment for all necessary damage to be done as aforesaid and in case of dispute as to the sufficiency of the amount so paid or tendered the dispute shall be referred to the Deputy Commissioner of the District whose decision shall be final. 6. Control of air transport and aviation services.― (1) Subject to the provisions of any other law for the time being in force, the Authority shall have control over (i) all the civil airports and aerodromes in the country including their planning, construction, operation and maintenance ; (ii) air routes in Pakistan, in consultation with the Federal Government ; (iii) airspace management of civil airports and aerodromes ; and (iv) collection of revenues at airports and aerodromes and at various offices of the Authority. (2) The Authority may, with the approval of the Federal Government, hold negotiations with foreign countries to settle technical matters arising out of bilateral air transport agreements. (3) Nothing in this section shall entitle the Authority to exercise any power in respect of such works, airports, aerodromes, airfields and things connected therewith as are owned by the Federal Government and established for the exclusive use of Defence Services. (7) Management.― (1) The general direction and administration of the Authority and its affairs shall vest in a Board which may exercise all powers, perform all functions and do all acts and things which may be exercised, performed or done by the Authority. 1[(2) The Board shall consist of the following members, namely:― (i) Secretary of the Division to which the affairs of the Authority are allocated. Chairman (ii) Vice‑Chief of Air Staff. Member (iii) Secretary, Planning and Development, Division. Member (iv) Secretary, Culture, Sports, Tourism and Youth Affairs Division. Member (v) Managing Director, Pakistan International Airlines Corporation. Member (vi) 2[Special] Secretary (military) Finance Division. Member (vii) Director‑General, Civil Aviation Authority. Member 1Subs. and omitted by Ordinance XI of 1999, s. 3. 2Subs. by SRO. 73(KE)/2004, dts 29-5-04. (3) The Federal Government may, by notification in the official Gazette, amend sub-section (2) so as to add any clause thereto, or modify or omit any clause thereof.] (4) The Federal Government may appoint not more than three additional members on such terms and conditions and for such period as it may determine. (5) The meetings of the Board shall be held at such times and places and in such manner as may be prescribed by regulations: Provided that until regulations are made in this behalf, the meetings shall be held as and when convened by the Chairman. (6) The Chairman or, in his absence, a member authorised by him in this behalf and three members shall constitute a quorum for a meeting of the Board. 8. Executive Committee.― (1) There shall be an Executive Committee of the Authority Consisting of the Director‑General, who shall be its head, and four other members, of whom three shall be nominated by the Board from amongst the most senior Officers of the Authority, and one to be nominated by the Ministry of Finance and designated as Finance Member. (2) The Executive Committee shall exercise such administrative, executive, financial and technical powers as may be delegated to it by the Authority: Provided that the Executive Committee may, in an emergency which in its opinion requires immediate action take such action as it considers necessary, and shall report it for approval to the Board in its next meeting. 9. Director‑General, his duties, functions and powers.― (1) The Federal Government shall appoint the Director‑General who shall be the executive head of the Authority and shall exercise such powers and perform such functions as may be specified under sub-section (7) of section 5 or delegated to him by the Board from time to time. (2) The Director‑General shall receive such salary and allowances and be subject to such conditions of service as may be determined by the Federal Government. 10. Delegation of powers. The Authority may, by general or special order, delegate to the Executive Committee, the Director‑General or an officer of the Authority any of its powers, duties or functions under this Ordinance, subject to such conditions as it may think fit to impose. 11. Transfer of assets and liabilities of the Department of Civil Aviation to the Authority.―(1) All assets and undertakings, including lands, buildings, airports and aerodromes, works, machinery, apparatus, equipment, material and plants vested in the Department of Civil Aviation, hereinafter referred to as the Department, shall vest in the Authority, and all liabilities in respect of the said assets shall be the liability of the Authority. (2) The assets and liabilities of the Department shall be evaluated by the Federal Government and taken on books, and the excess of the assets over the liabilities will be deemed to be the Federal Government's contribution to the Authority either as equity or loan as may be determined by the Federal Government. (3) The evaluation of the net assets transferred to the Authority under sub-section (2), the terms governing the transfer, the return on equity, if any, and the conditions governing the loan shall be determined by the Federal Government. 1* * * * * * * 2[(5) The Federal Government Lands and Buildings (Recovery of Possession) Ordinance 1965, (LIV of 1965) shall apply to lands and buildings vesting in the Authority and for the purpose of such application shall have effect as if reference therein to the Federal Government included a reference to the Authority.] 12. Recruitment of officers, etc.―(1) The Authority may, from time to time, appoint such Officers, servants, experts and consultants as it may consider necessary for the performance of its functions. (2) The Authority shall prescribe by regulations the procedure for appointment of its officers, servants, experts and consultants, and the terms and conditions of their service. 13. Members, officers etc., to be public servants. The Director‑General, members, officers, servants, experts and consultants of the Authority, shall, when acting or purporting to act in pursuance of any of the provisions of this Ordinance or the rules or regulations made thereunder, be deemed to be public servants within the meaning of section 21 of the Pakistan Penal Code (Act XLV of 1860). 14. Transfer of civil servants, etc., to the Authority.― (1) Notwithstanding anything contained in any law, contract or agreement or in the conditions of service.— (a) every civil servant employed in the Department immediately before the establishment of the Authority, including a person on deputation to any other organisation in Pakistan or abroad but not being a person on deputation to the Department from any other organisation, shall, on such establishment, stand transferred to, and become an employee of, the Authority on such terms and conditions as may be prescribed by regulations: Provided that the pay and allowances to which such civil servant shall be entitled shall not be less favourable than those to which he was entitled immediately before such transfer ; and (b) unless the Authority otherwise directs, every person on deputation to the Department from any other organisation immediately before the establishment of the Authority shall, on such establishment, stand transferred to the Authority on the same terms and conditions to which he was entitled immediately before such transfer. (2) No person who stands transferred to the Authority by virtue of sub-section (1) shall, notwithstanding anything contained in any laws, be entitled to any compensation because of such transfer. 1 Omitted by Ordinance No. XI of 1999, s. 4. 2 New sub-section (5), added by the Pakistan Civil A viation Authourity (Second Amdt.) Ordinance, 1984 (22 of 1984), s. 2. (3) The Federal Government shall pay to the Authority pension charges and gratuity in respect of, and provident fund accumulations of, persons transferred by virtue of sub-section (1), in such manner and to such extent as the Federal Government may determine. 15. Budget. The Authority shall, in respect of each financial year, submit for the approval of the Federal Government by such date and in such form as may be specified by the Federal Government a statement showing the estimated receipts and current and development expenditure and the sums which are likely to be required from the Federal Government during the next financial year. 16. Civil Aviation Authority Fund. (1) There shall be a fund to be known as the \"Civil Aviation Authority Fund\" which shall vest in the Authority and shall be utilised by the Authority to meet charges in connection with its functions under this Ordinance including the payment of salaries and other remuneration to the Director‑General, officers, servants, experts and consultants of the Authority. (2) The Civil Aviation Authority Fund shall consist of— (i) grants made by the Federal Government ; (ii) loans obtained from the Federal Government ; (iii) sale proceeds of bonds issued under the authority of the Federal Government; (iv) loans obtained by the Authority with the special or general sanction of the Federal Government ; (v) foreign aid and loans obtained with the sanction of and on such terms and conditions as may be approved by, the Federal Government ; and (vi) all otsher sums received and fees collected by the Authority. (3) The Authority shall be competent to levy and collect, at such rates as may be prescribed by the Authority by regulations from time to time. (i) air route navigation charges. (ii) embarkation charges to be paid by the passengers travelling by air ; (iii) fees paid by individuals in respect of issue and renewal of licences and any examination prescribed by the Authority ; (iv) fees and charges in respect of commercial exploitation of the Authority's properties, including land and aircraft ; and (v) landing and housing charges. (4) The Civil Aviation Authority Fund shall be kept in 1[any of the banks nationalized under the Banks (Nationalization) Act, 1974 (XIX of 1974)]. 17. Maintenance of accounts. The accounts of the Authority shall be maintained in such form and manner as the Federal Government may determine in consultation with the Auditor‑General of Pakistan. 18. Audit.― (1) The accounts of the Authority shall be audited every year by the Auditor‑General of Pakistan 2* * *. (2) Copies of the audit report shall be sent to the Authority and the Authority shall forward the report alongwith its comments to the Federal Government. (3) The audit report shall be available for public inspection. (4) The Federal Government may issue directions to the Authority for the rectification of matters objected to by the Auditor‑General and the Authority shall comply with every such direction. (5) The Authority may, in addition to the audit under sub-section (1), cause to be carried out internal audit of its accounts. 19. Authority to be deemed to be a local Authority. The Authority shall be deemed to be a local authority for the purpose of borrowing money under the Local Authorities Loans Act, 1914 (IX of 1914), and the making and execution of any scheme under this Ordinance shall be deemed to be a work which such authority is legally authorised to carry out. 20. Liability of the Federal Government to be limited. The liability of the Federal Government to the creditors of the Authority shall be limited to the extent of grants made by it and the loans raised by the Authority with the sanction of the Federal Government. 21. Submission of yearly report, returns, etc.―(1) The Authority shall submit to the Federal Government, as soon as possible after the end of every financial year but before the last day of September next following, a report on the conduct of its affairs for that year. (2) A copy of the report mentioned in sub-section (1) together with a copy of the audit report referred to in section 18 shall be placed by the Federal Government before the National Assembly. (3) The Public Accounts Committee shall scrutinise and examine the reports referred to in sub- section (2) in the same manner, and perform the same functions and exercise the same powers in respect thereof, as is or are required by it to be examined, performed and exercised in respect of appropriation accounts of the Federal Government and the report of the Auditor-General of Pakistan thereon. 1Subs. by the Pakistan Civil Aviation Authority (Amdt.) Ordinance, 1984 (14 of 1984), s. 2, for certain words. 2The words in such manner as may be specified by the Federal Government” omitted by the Pakistan Civil A viation (Amdt.) Ordinance, 1983 (12 of 1983), s. (4) The Federal Government may require the Authority to supply any return, statement estimate, statistics or other information regarding any matter under the control of the Authority or a copy of any document in the charge of the Authority; and the Authority shall comply with every such requisition. 22. Exemption from taxes. Notwithstanding anything contained in the Wealth Tax Act, 1963 (XVI of 1963), the Income‑tax Ordinance, 1979 (XXXI of 1979), or any other law for the time being in force relating to income‑tax, super‑tax, wealth‑tax or gift‑tax, the Authority shall not be liable to pay and be exempt from paying any such taxes as aforesaid on its incomes, profits or gains for a period of five years beginning from the date of its establishment. 23. Ordinance XXIII of 1969 not to apply to Authority. The Industrial Relations Ordinance, 1969 (XXIII of 1969), shall not apply to or in relation to the Authority or any person in the service of the Authority. 24. Indemnity. No suit, prosecution or other legal proceedings shall lie against the Authority, the Director‑General, or any member, officer, servant, expert or consultant of the Authority in respect of anything, done or intended to be done in good faith under this Ordinance. 25. Certain existing arrangements to continue. All contracts and working arrangement made and all liabilities incurred by the Federal Government in connection with, or for the purpose of, the Department, before the establishment of the Authority, shall be deemed to have been made or incurred by the Authority and have effect accordingly. 26. Power of Federal Government to make rules. The Federal Government may, by notification in the official Gazette, make rules for carrying out the purposes of this Ordinance. 27. Power of the Authority to make regulations. The Authority may make regulations, not inconsistent with this Ordinance and the rules made thereunder, to provide for all matters for which provision is necessary or expedient for carrying out the purposes of this Ordinance. 28. Winding‑up of the Authority. No provision of any law relating to the winding‑up of bodies corporate shall apply to the Authority and the Authority shall not be wound up except by order of the Federal Government and in such manner as the Federal Government may direct. 29. Removal of difficulties. If any difficulty arises in giving effect to any of the provision of this Ordinance, the President may make such order, not inconsistent with the provisions of this Ordinance, as may appear to him to be necessary for the purpose of removing the difficulty: Provided that no such power shall be exercised after the expiry of one year from the coming into force of this Ordinance."
}