{
  "file": "administrator73253a0ac882a843e2ee9a1262c193b4.pdf",
  "law_name": "The National College Of Arts Ordinance, 1985",
  "text": "THE NATIONAL COLLEGE OF ARTS ORDINANCE, 1985 CONTENTS 1. Short title and commencement 2. Definitions 3. Establishment of the College 4. The purpose, powers and functions of the College 5. Teaching and Examinations 6. Patron 7. The Controlling Authority 8. Visitation 9. The Principal 10. Board of Governors 11. Powers and functions of the Board 12. Chairman of the Board 13. Committees 14. Regulations 15. First Regulations 16. Rules 17. Fund of the College 18. Audit and accounts 19. Transfer of assets and liabilities, etc 20. Removal of difficulties THE SCHEDULE THE NATIONAL COLLEGE OF ARTS ORDINANCE, 1985 ORDINANCE XXVIII OF 1985 [31st March, 1985] An Ordinance to confer on the National College of Arts, Lahore, the power to award degrees. WHEREAS it is expedient to confer on the National College of Arts, Lahore, the power to award degrees and to provide for matters connected therewith or ancillary thereto; AND WHEREAS the President is satisfied that circumstances exist which render it necessary to take immediate action ; NOW, THEREFORE, in pursuance of the Proclamation of the fifth day of July, 1977, and in exercise of all powers enabling him in that behalf, the President is pleased to make and promulgate the following Ordinance:___ 1. Short title and commencement. ___ (1) This Ordinance may be called the National College of Arts Ordinance, 1985. (2) It shall come into force at once. 2. Definitions. ___In this Ordinance, unless there is anything repugnant in the subject or context, ___ (a) “Board” means the Board of Governors of the College; (b) “Chairman” means Chairman of the Board; (c) “College” means the National College of Arts, Lahore, established by the late Government of West Pakistan under letter No. C-II-26/58, dated the 14th October, 1958; (d) “Commission” means the University Grants Commission; (e) “Controlling Authority” means the Controlling Authority of the College ; (f) “Member” means member of the Board ; (g) “Patron” means the President of the Islamic Republic of Pakistan ; (h) “prescribed” means prescribed by Regulations or Rules made under this Ordinance ; and (i) “Principal” means Principal of the College. 3. Establishment of the College. ___The National College of Arts Lahore as reconstituted in accordance with the provisions of this Ordinance shall be a body corporate having perpetual succession and a common seal with power to acquire, hold and dispose of property, both movable and immovable, and shall by the said name sue and be sued. 4. The purpose, powers and functions of the College. ___(1) The purpose of the College shall be to provide for instruction, training, research, demonstration and service in the fields of arts and allied disciplines at the under-graduate, graduate and post graduate levels. (2) The College shall, under prescribed conditions, perform academic functions to achieve its objectives, in particular, to___ (a) admit and examine students ; (b) award degrees, diplomas, certificates and other academic distinction; (c) select, appoint and promote academic and administrative staff; (d) frame and prescribe courses of study ; (e) pursue research ; (f) establish and support other sites and facilities for educations, training and research; (g) affiliate or associate itself with other institutions for better discharge of its functions and responsibilities; (h) decide teaching methods and strategies in order to ensure the most effective educational and other programmes ; and (i) undertake such other activities as would ensure effective and efficient operation of the College. 5. Teaching and Examinations. ____(1) All academic programmers of the college shall be conducted in the prescribed manner and the Commission shall ensure that the courses of study, the curriculum, and the practical work at the college are comparable in standard with other similar institutions. (2) The college shall associate external examiners in the conduct of its examinations. (3) No degree shall be granted unless a student has passed an examination in Islamic and Pakistan Studies, or, in the case of a non-Muslim student, in Ethics and Pakistan Studies. 6. Patron. ___The President of the Islamic Republic of Pakistan shall be the Patron of the College. 7. The Controlling Authority. ___(1) The Federal Minister for Education shall be the Controlling Authority of the College. (2) The Controlling Authority shall preside at the Convocation and when present at the meetings of the Board or Committees. (3) If the Controlling Authority is satisfied that the proceedings of the Board or Committees are not in accordance with the provisions of this Ordinance, the Regulations and the Rules, it may annul such proceedings. 8. Visitation. ___(1) The Controlling Authority may cause an inspection or inquiry to be made in respect of any matter connected with the affairs of the College and shall, from time to time, direct the Commission to carry out, or appoint such person or persons as it may deem fit for the purpose of carrying out, inspection of :__ (i) the College, its buildings, laboratories, library and other facilities ; (ii) any department or teaching unit or hostel maintained by the College ; (iii) the instruction, training, research, curriculum, examinations and overall performance, of the College; (iv) such other matters as the Controlling Authority may determine. (2) The Controlling Authority shall communicate to the Board its views with regard to the result of the inspection or the inquiry and, after ascertaining the views of the Board, advise the Board as to the action to be taken by it. (3) Where the Board does not take action within a specified time, to the satisfaction of the Controlling Authority, the Controlling Authority may issue such directions as it may deem fit to the Principal who shall comply with all such directions. 9. The Principal. ___(1) The Principal shall be appointed by the Controlling Authority in consultation with the Chairman, on such terms and conditions as may be determined by the Controlling Authority. (2) The Principal shall hold office during the pleasure of the Controlling Authority for a term not exceeding four years, and shall be eligible for re-appointment. (3) The Principal shall be the academic and executive head of the College and shall be responsible to the Board for carrying out the day to day administration of the College. (4) The Principal shall perform such other functions and exercise such powers as may be assigned to him by the Chairman. (5) The Principal shall ensure that the provisions of this Ordinance and the Regulations and Rules framed thereunder are faithfully complied with by the College. 10. Board of Governors. ___(1) There shall be a Board of Governors consisting of the following: (i) Chairman, University Grants Commission, Islamabad. (ii) Secretary, Ministry of Education, Government of Pakistan, or his nominee not below the rank of a Joint Educational Adviser. (iii) Vice-Chancellor, University of the Punjab. (iv) Vice-Chancellor, University of Engineering and Technology, Lahore. (v) One Judge of the Lahore High Court to be nominated by the Chief Justice of the Court. (vi) Principal, Pakistan Administrative Staff College, Lahore. (vii) Secretary Education, Government of the Punjab, Lahore. (viii) Chairman, Pakistan Television Corporation, Islamabad. (ix) Outstanding professionals, one each in the fields of Architecture, Commercial Design and Fine Arts, to be nominated by the Controlling Authority. (x) One outstanding industrialist to be nominated by the Controlling Authority. (xi) Two distinguished Educationists to be nominated by the Chairman. (xii) One outstanding alumnus to be nominated by the Chairman. (xiii) Secretary, Ministry of Finance, Government of Pakistan, or, if nominated by him, Financial Adviser to the Ministry of Education, Islamabad. (xiv) Two distinguished citizens to be nominated by the Controlling Authority. (xv) Two eminent women representatives to be nominated by the Controlling Authority. (xvi) Principal Member/Secretary. (2) Members other than ex-officio member shall hold office for two years. (3) The quorum for a meeting of the Board shall be one half of the total number of members, a fraction being counted as one. 11. Powers and functions of the Board. ___(1) The Board shall be the principal executive body of the College, and shall, subject to the provisions of this Ordinance and the Rules and Regulations made thereunder, exercise general supervision over the affairs of the College. (2) In particular and without prejudice to the generality of the foregoing provisions, the Board shall have the power :__ (i) to conduct teaching and research in arts and allied or auxiliary disciplines at the Bachelor and higher levels ; (ii) to prescribe courses of studies and curricula ; (iii) to hold examinations through external evaluation and grant degrees, diplomas, certificates and other academic distinctions ; (iv) to create, suspend or abolish such posts for teaching, research, administration and other related matters as may be necessary ; (v) to prescribe the terms and conditions of service of teaching and non-teaching staff including their qualifications, experience and eligibility for appointment, and to appoint, confirm, suspend, remove, dismiss or take disciplinary action against the staff ; (vi) to institute fellowships, scholarships, medals and prizes ; (vii) to devise and adopt ways and means for the promotion of education and research in arts and related subjects ; (viii) to hold, control and administer the property and funds of the College ; (ix) to consider and approve the annual report and the annual and revised budget estimates of the college and re-appropriate funds from one head of expenditure to another ; (x) to enter into, vary, carry out and cancel contracts on behalf of the College ; (xi) to invest any money belonging to the College ; (xii) to receive and manage property, grants, bequests, trusts, gifts, donations, endowments and other contributions made, to the College ; (xiii) to decide about the location of the College and its constituent institutes, if any; (xiv) to regulate the conduct and enforce discipline among the teachers and students of the College; (xv) to govern, maintain, regulate and operate the finances, accounts and investments of the College ; (xvi) to take all steps necessary for the proper and efficient functioning of the College ; and (xvii) to perform such other functions as may be necessary for the advancement of arts in the country. (3) The meetings of the Board shall be presided at by the Chairman or, in his absence by one of the members to be elected by the members present. (4) The quorum for a meeting of the Board shall not be less than half of its members. (5) The Board may for speedy and efficient working of the College delegate to the Principal or a Committee or a Sub-Committee or any other person such of its powers as it may deem fit. 12. Chairman of the Board. ___(1) The Chairman of University Grants Commission shall be the Chairman of the Board. (2) The Chairman shall ensure that the provisions of this Ordinance, the Regulations and Rules are faithfully observed in the College. (3) The Chairman shall perform such other functions as may be entrusted to him by the Board or the Controlling Authority. 13. Committees. ___(1) There shall be the following Committees of the College, namely:_ (i) the Executive Committee ; (ii) she Academic Committee; (iii) the Selection Committee ; (iv) the Finance and Planning Committee ; and (v) such other Committees as may be constituted by the Board. (2) The decisions of the Executive, Finance and Selection Committee shall be subject to the approval of the Board. (3) The constitution, functions and powers of the Committees shall be such as may be prescribed. 14. Regulations. ___(1) Subject to the provisions of this Ordinance, Regulations may be made by the Board with the approval of the Controlling Authority to regulate all or any of the following matters, namely : ___ (a) the constitution of pension, insurance, gratuity, provident fund and benevolent fund for College employees ; (b) the scales of pay and other terms and conditions of service of officers, teachers and other employees of the college ; (c) the establishment of Departments ; (d) the conditions under which the College may enter into arrangements with other institutions or with public bodies for purposes of research, consultancy and advisory services ; (e) the general scheme of studies, including the duration of courses and the number of subjects or pacers for an examination ; (f) the conduct of examination ; (g) the formation of Institutes and Boards of Studies ; (h) the constitution, functions and powers of the Committees ; and (i) all other matters which are to be or may be prescribed by Regulations. (2) The draft of Regulations shall be proposed by the Board to the Controlling Authority who may approve it, or refer it back to the Board for reconsideration or may reject it. 15. First Regulations. ___Notwithstanding anything contained in section 14 the Regulations set out in the Schedule shall be deemed to be Regulations framed under the said section and shall remain in force until they are amended or replaced by new Regulations framed in accordance with this Ordinance. 16. Rules. ___(1) The Board and other bodies of the College may make Rules consistent with this Ordinance and the Regulations to regulate the conduct of their business and the time and place of meetings and related matters: Provided that the Board may direct the amendment or the annulment of any Rules made by another body under this section: Provided further that, if such other body is dissatisfied with such direction, it may appeal to the Controlling Authority whose decision in the matter shall be final. (2) The Board may make Rules to regulate any matter relating to the affairs of the College particularly on the following: (a) the powers and duties of officers and teachers ; (b) the courses of study for degrees, diplomas and certificates of the College ; (c) the manner in which the recognised teaching referred to in sub-section (1) of section 4 shall be organised and conducted ; (d) the admission of students to the College ; (e) fees and other charges to be paid by the students for admission to the courses of study and the examinations of the College ; (f ) the conduct and discipline of students of the College ; (g) conditions of residence of the students of the College including the levying of fees for residence in halls of residence and hostels ; (h) the institution of stipends and free and half-free studentships ; (i) the academic costume. 17. Fund of the College. ___The College shall have a fund to which shall be credited: (i) grants made by the Federal Government ; (ii) contribution and donations from individuals, local bodies, corporations, institutions, organisations and agencies ; and (iii) income from fees, publications and such other sources as may be approved by the Board. 18. Audit and accounts. ___(1) The accounts of the College shall be maintained in the prescribed form and manner and shall be audited annually by an auditor appointed by the Accountant General, Pakistan Revenue. (2) No expenditure shall be made from the funds of the College unless a bill for its payment has been audited by the Audit Officer of the College in accordance with the rules made under this Ordinance. (3) The College shall furnish to the Federal Government each year a report on annual audited accounts, a report on the activities of the College during the preceding year and such information relating to its activities as may be asked for by the Federal Government. 19. Transfer of assets and liabilities, etc. ___Upon the commencement of this Ordinance,__ (i) everything done, action taken, obligations and liabilities incurred, persons appointed or authorised, fellowships or scholarships instituted and orders issued prior to such commencement shall be continued and, so far as may be, be deemed to have been respectively done, taken, incurred, appointed or authorised, instituted or issued by the College. (ii) all moneys and properties held by the College immediately before such commencement shall stand transferred to, and vest in, the College ; and (iii) any rules made by the College shall, in so far as they are not inconsistent with the provisions of this Ordinance, continue to be in force until they are repealed, rescinded or modified under this Ordinance. 20. Removal of difficulties. ___If any difficulty arises in giving effect to any of the provisions of this Ordinance, the Controlling Authority may, on the recommendations of the Board, give such directions, not inconsistent with the said provisions, as it may consider necessary for the removal of such difficulty. _____ THE SCHEDULE (See section 15) THE FIRST REGULATIONS 1. The Executive Committee.— (1) The Executive Committee shall comprise the following, namely :— (i) The Chairman. (ii) Vice-Chancellor Punjab University………………………………….Member (iii) The Secretary Education, Government of the Punjab, Lahore………Member (iv) Principal, Pakistan Administrative Staff College……………………Member (v) Three nominees of the Board………………………………………..Member (vi) One nominee of the Academic Committee…………………………Member (vii) One woman representative of the Board…………………………..Member (viii) The Chairman of the Finance and Planning Committee………….Member (ix) The Principal of the College……………………………Member/Secretary (2) The Chairman of the Executive Committee shall be appointed by the Controlling Authority on such terms and conditions and for such period as it may determine. (3) Members other than ex-officio members shall hold office for two years. (4) The quorum for a meeting of the Committee shall be one-half of the total number of members, a fraction being counted as one. 2. Powers and functions of the Executive Committee.___ (1) Subject to the provisions of the Ordinance and the Regulations made thereunder and the general or special directions of the Board, the Executive Committee shall be responsible for the administration of the College and execution of policies and directions of the Board for carrying out the purpose of this Ordinance. (2) The Executive Committee shall exercise such powers as may be delegated to it by the Board from time to time. (3) The minutes of the meeting of the Executive Committee shall be circulated to all members of the Committee after approval by the Chairman. The decision shall be implemented only on receipt of the approval of the Chairman. (4) All decisions of the Executive Committee shall be placed before the Beard for approval. 3. Academic Committee.—(1) The Academic Committee shall comprise the following, namely :— (i) Principal…………………………………………................. Chairman (ii) All Professors and Chairman of the Departments…………. Member (iii) Chairman, Department of Fine Arts, University of the Punjab Lahore ………………………….. Member (iv) Chairman, Department of Architecture, University of Engineering and Technology, Lahore……….Member (v) One outstanding alumnus of the College to be nominated by the Chairman of the Board…………… Member (vi) Two representatives of the profession to be nominated by the Chairman of the Board on the recommendation of the Principal…………………..Member (vii) One representative of the Council of Architects of Pakistan to be nominated by the Council………………Member (viii) Chairman, Department of Architecture, Dawood College of Engineering & Technology, Karachi…Member (ix) Registrar of the College ………………………….………Member/ Secretary. (2) Members other than ex-officio members shall hold office for two years. (3) The quorum for meeting of the Committee shall be one half of the total number of members, a fraction being counted as one. 4. Functions and powers of the Academic Committee.—(1) The Academic Committee shall be the academic body of the College and shall, subject to the provisions of this Ordinance and the Regulations, have the power to lay down proper standards of instruction, research and examinations and to regulate and promote the academic life of the College. (2) In particular and without prejudice to the generality of the foregoing provision; the Academic Committee shall have the power:— (a) to advise the Board on academic matters ; (b) to regulate the conduct of teaching, research and examination ; (c) to regulate the admission of students to the courses of studies and examinations in the College; (d) to regulate the conduct and discipline of the students of the College ; (e) to consider and formulate proposals for the planning and development of teaching and research in the College; (f) to frame Regulations prescribing the courses of studies and the syllabi for submission to the Controlling Authority; (g) to regulate the award of student ships, scholarships exhibitions, medals and prizes ; (h) to perform such other functions as may be prescribed by Regulations. 5. Finance and Planning Committee.—(1) The Finance and Planning Committee shall comprise the following, namely:— (i) Whole-time-Member, University Grants Commission, Islamabad………………………….. Chairman (ii) Chairman, Punjab Planning Board, Lahore……………………………………………..Member (iii) Financial Adviser, Ministry of Education Member (iv) Director General, Academy of Planning and Management, Government of Pakistan, Islamabad…………………………………………Member (v) Treasurer of one of the Universities in Lahore to be nominated by the Chairman of the Board……………………………Member (vi) Chief of Education Section, Planning Division Government of Pakistan, Islamabad…….Member (vii) Principal…………………………………………..Member/Secretary. (2) The Members, other than ex-officio members, shall hold office for two years. (3) The quorum for a meeting of the Finance and Planning Committee shall be four. 6. Functions of the Finance and Planning Committee.—The functions of the Finance and Planning Committee shall be:— (a) to consider the annual statement of accounts, the annual and revised budget estimates and advise the Board thereon; (b) to review periodically the financial position of the College; (c) to advise the Board on all matters relating to planning, development, finance, investments, and accounts of the College ; and (d) to perform such other functions as may be prescribed by Regulations. 7. Selection Committee.—(1) The Selection Committee shall consist of (i) Members of the Executive Committee; (ii) the Chairman of the Teaching Department concerned ; (iii) one member of the Board and two other persons of eminence, to be appointed by the Board provided that none of the three is an employee of the College ; (iv) Principal …………… Member/ Secretary (2) The Chairman of the Executive Committee shall be the Chairman of the Selection Committee. (3) The members nominated under clause (iii) shall hold office for two years. (4) The quorum for a meeting of the Selection Committee shall be four. (5) No member who is a candidate, for the-post to which appointment is to be made shall take part in the proceedings of the committee. 8. Functions of Selection Committee.—(1) The Selection Committee for teaching and other posts shall consider the applications received in response to an advertisement and recommend to the Board the names of suitable candidates for appointment to such posts. (2) The Selection Committee may recommend to the Board the grant of a higher initial pay in a suitable case for reasons to be recorded. (3) The Selection Committee may recommend to the Board the appointment of an eminently qualified person to a position in the College on terms and conditions which may differ from those prescribed. (4) In the event of an unresolved difference of opinion between the Selection Committee and the Board the matter shall be referred to the Controlling authority whose decision shall be final. _______________ RI - Date: 13-05-2024"
}