{
  "file": "administrator21bb14bbc6e056e91de5499c01197754.pdf",
  "law_name": "THE KARACHI HOTELS AND LODGING HOUSES (CONTROL) ACT,",
  "text": "THE KARACHI HOTELS AND LODGING HOUSES (CONTROL) ACT, 1950 CONTENTS 1. Short title, commencement and extent 2. Definitions 3. Appointment of Controller and Additional Controllers 4. Registration of hotels and lodging-houses 5. Classification of hotels and lodging-houses 6. Controller to fix fair rates for accommodation 7. Controller to fix limit of persons to be accommodated in any room 8. Fair rates and limits of persons for rooms to be displayed 9. Reservation of accommodation at the instance of Controller 10. Charge in excess of fair rate prohibited 11. Conditions applicable to eviction of guests 12. Procedure and powers of the Controller 13. Further powers of Controller 14. Appeals 15. Penalty for failure to register hotel or lodging-house 16. Penalty for failing to display fair rates and accommodation, etc. 17. Penalty for disobeying reservation order 18. Penalty for charging in excess of fair rates and exceeding limit of accommodation 19. Constructive liability of owners of hotels, etc. 20. Cognizance of offences 21. Bar of suits 22. Rules 23. Exemption THE KARACHI HOTELS AND LODGING HOUSES (CONTROL) ACT, 1950 1ACT NO. LXV OF 1950 [23rd October, 1950] An Act to provide for special measures for control of rates chargeable in hotels and lodging-houses in Karachi, for the reservation of accommodation therein and for ancillary matters. WHEREAS it is expedient to provide for special measures for control of rates chargeable in hotels and lodging-houses in Karachi, for the reservation of accommodation therein and for ancillary matters; It is hereby enacted as follows:___ 1. Short title, commencement and extent.___(1) This Act may be called the Karachi Hotels and Lodging-houses (Control) Act, 1950. (2) It shall come into force at once. (3) It extends to the 2[Karachi Division]. 2. Definitions. In this Act, unless there is anything repugnant in the subject or context___ (1) the expression “accommodation” has reference to lodging, board and service, or any one or more than one of these facilities, as may be required by, or agreed to be provided to, a guest; (2) “fair rate” means the rate fixed under section 6, and includes a revised rate; (3) “guest” means a person who is in possession or enjoyment of accommodation engaged for him; (4) “Hotel or Lodging-house” means a building which is exclusively or mainly used, for providing accommodation for guests for a monetary consideration but shall not include a home or hostel which is maintained exclusively for aged or incurable persons, or, as the case may be, for students, by or under the control of a charitable or educational institution; (5) “manager of a hotel” means any person in charge of a hotel; (6) “owner of a lodging-house” means the person who receives or is entitled to receive payment from a guest on account of accommodation provided, and includes a person managing a lodging-house, as an agent or trustee or otherwise; (7) “prescribed” means prescribed by rules made under this Act; (8) “public rooms” means and includes all rooms in a hotel or lodging-house which are reserved and left open for the common use of all guests; 1The Chief Commissioner of Karachi has been authorised to exercise in respect of the Capital of the Federation, all the powers and duties conferred or imposed on the Central Government under sub-sections (1) and (2) of s. 3, sub-section (2) of s. 9. sub-section (4) of s.14 and s. 23, of this Act, see Gaz. of P., 1953, Pt. 1, pp. 171-172. 2Subs. by A. O., 1964, Art. 2 and Sch. (9) “service” means any service ordinarily provided in a hotel or lodging-house. 3. Appointment of Controller and Additional Controllers.___(1) The 1[Provincial Government] may, by notification in the official Gazette, appoint a person to be Controller for the purposes of this Act and may, also appoint such number of Additional Controllers as may be necessary for carrying out the said purposes. (2) Appointment of Advisory Committee. The 1[Provincial Government] may also constitute an Advisory Committee, consisting of not less than three and not more than five persons, to aid and advise the Controller in relation to such of his functions as may be prescribed. 4. Registration of hotels and lodging-houses. Within a period of two months from the commencement of this Act, or from the opening of any hotel or lodging-house, whichever is later, the owner of every hotel and lodging-house shall apply to the Controller for registration of his hotel or lodging-house, and for determination of fair rates in relation thereto. 5. Classification of hotels and lodging-houses.___(1) The Controller may, by order in writing, classify all hotels and lodging houses into categories according to the standard of board, lodging and service provided by them, for the purpose of determination of fair rates. (2) Nothing in sub-section (1) shall be deemed to prevent the determination of fair rates by the Controller in relation to any hotel or lodging-house, irrespective of any category in which it may have been placed, or whether it has been so classified. 6. Controller to fix fair rates for accommodation.___(1) The Controller may fix a fair rate to be charged for board, lodging and other service provided in a hotel or boarding-house, at such amount as, having regard to all the circumstances, he deems just. (2) A fair rate may be fixed separately for___ (a) lodging with reference to the nature of the accommodation and the number of guests to be accommodated; (b) board, partial or full; or (c) other service, or the Controller may fix a consolidated rate for lodging, board and service, or for lodging and service only, as above. (3) A fair rate may be fixed separately for daily and monthly guests. Explanation.___ A guest who agrees to reserve accommodation, or for whom accommodations reserved for a period of one month or more shall be deemed to be a monthly guest, provided he actually stays for one month or more or has actually paid in advance for one month: where the reservation is not for any specified period, or is for a period less than a month, the guest shall be deemed to be a daily guest. (4) The Controller may from time to time revise the fair rates determined by him under this section. 1Subs. by A. O., 1964, Art. 2 and Sch. (5) In making an order fixing or revising a fair rate, the Controller shall fix the date, being the first day of a month not earlier than the month in which the order is made, from which the order is to take effect. (6) Until such time as fair rates are fixed in relation to any hotel or lodging-house under this section, the rate, if any, charged by such hotel or lodging-house on the first day of July, 1947, for equivalent lodging, board or service to that provided, shall be deemed to be the fair rate chargeable. 7. Controller to fix limit of persons to be accommodated in any room.___(1) The Controller may fix the maximum number of guests to be accommodated in each room or other unit of accommodation in a hotel or lodging-house. (2) Save as hereafter provided, no room for which an order has been made under sub-section (1) shall be used to accommodate any number of guests in, excess of the number specified in the order except with the previous permission of the Controller in writing. (3) The Controller may from time to time revise any order made by him under sub-section (1) so as to increase or reduce the number of guests specified in such order. (4) The 1[Provincial Government] may by rule prescribe the conditions under and the circumstances in which the permission of the Controller under sub-section (2) shall not be necessary. 8. Fair rates and limits of persons for rooms to be displayed. The fair rate fixed by the Controller and the maximum number of guests who may be accommodated in relation to each room or unit of accommodation in a hotel or lodging-house shall be displayed in such room or place, and a consolidated chart showing such information in respect of all the rooms and other accommodation, in a hotel or lodging-house shall be displayed in a conspicuous manner in the office and in the public rooms, if any, of such hotel or lodging-house. 9. Reservation of accommodation at the instance of Controller.___(1) Subject to such rules as may be made in this behalf by 1[Provincial Government] the Controller may by order direct the manager of a hotel or the owner of a lodging-house to reserve in the hotel or lodging-house such accommodation as may be specified in the order. (2) Subject to any direction by the 1[Provincial Government] in this behalf, the Controller may allot the accommodation reserved under sub-section (1) to any person and such person shall thereupon be deemed to be a guest at the hotel or lodging-house, in relation to the accommodation allotted to him. (3) Where any accommodation is reserved under sub-section (1), the manager of the hotel or the owner of the lodging-house shall make the accommodation so reserved, or such portion of it as the Controller -may direct, available to the Controller, for occupation by the person to whom it has been allotted, at the expiry of twenty-four hours from the service upon him of a notice in writing in this behalf by the Controller. (4) Nothing in this section shall prevent the manager of a hotel or the owner of a lodging-house from letting any accommodation reserved under sub-section (1) to a guest other than the person to whom such accommodation is allotted by the Controller, upon the condition that if and when a notice is received from the Controller under sub-section (3), such guest will vacate the accommodation within twenty-four hours of the receipt of such notice. 1Subs. By A.O., 1964, Art. 2 and Sch. 10. Charge in excess of fair rate prohibited.___(1) Notwithstanding any agreement to the contrary, no manager of a hotel or an owner of a lodging-house shall charge a guest any amount in excess of the fair rate. (2) Any agreement for the payment of any charges in excess of the fair rate shall be void in respect of such excess, and shall be construed as if it were an agreement for payment of the said fair rate. (3) Any sum paid by a guest in excess of the fair rate shall be recoverable at any time within a period of six months from the date of payment from the manager of the hotel or the owner of the lodging-house to whom it was paid, or from the legal representative of either of these persons, and without prejudice to any other mode of recovery which may be open to him, the guest may deduct such amount from any sum payable by him for his accommodation. 11. Conditions applicable to eviction of guests.___(1) Except as provided hereinafter, no guest in a hotel or lodging-house shall be evicted or refused board or other service so long as he pays, or is ready and willing to pay the fair rate, and observes and performs the conditions of his agreement in so far as they are consistent with the provisions of this Act. (2) If the Controller is satisfied that___ (a) a guest in a hotel or lodging-house has been guilty of conduct which is a nuisance or source of annoyance to other guests or to persons living in the neighborhood; or (b) the accommodation he occupies is reasonably and bona fide required by the manager of the hotel or the owner of the lodging-house as the case may be, for his own occupation, or for occupation by any person for whose benefit the accommodation has been reserved to the knowledge of such guest, or for any other cause which may be deemed satisfactory by the Controller; or (c) the guest has failed to vacate the accommodation on the termination of the period of his agreement in respect thereof; the Controller may make an order to that effect and authorise the manager or owner, as the case may be, to recover possession of the accommodation provided to such guest, after giving him such notice, not exceeding seven days, as may be specified in the order. (3) An order under sub-section (2) shall not be made unless the guest has been given an opportunity to show cause against it. 12. Procedure and powers of the Controller.___(1) No order under section 5, 6, 7 or 11 of this Act shall be made by the Controller, except after holding an enquiry. (2) Every such enquiry shall be made summarily in the prescribed manner. (3) For the purpose of holding such enquiries and any other enquiries which he may deem necessary for the discharge of his functions under the Act, the Controller shall have the same powers as are vested in civil courts in respect of___ (a) proof of facts by affidavit; (b) summoning and enforcing the attendance of any person and examining him on oath; (c) compelling the production of documents and other material evidence; and (d) issuing commissions for the examination of witnesses. (4) The proceedings of every enquiry under sub-section (1) shall be deemed to be judicial proceedings for the purposes of sections 193 and 228 of the Pakistan Penal Code (XLV of 1860). 13. Further powers of Controller.___(1) For the purposes of this Act, the Controller may___ (a) require the manager of a hotel or the owner of a lodging-house to produce any book of account, document or other papers in his possession or power which contain or are believed to contain information relating to the hotel or lodging- house; and (b) enter, and by written order, authorise an officer subordinate to him to enter, any hotel or lodging-house. (2) Controller's power of summary eviction. The Controller may, on application by the manager of a hotel or the owner of a lodging-house evict any guest who fails to obey an order for delivery of possession under sub-section (2) of section 11. (3) If the manager of a hotel or the owner of a lodging-house fails to make available to the Controller, any accommodation reserved under sub-section (1) of section 9 and in respect of which a notice has been duly served under sub-section (3) of section 9, within the period allowed by the latter sub-section, the Controller may forthwith take possession of such accommodation, and may for that purpose summarily evict any person in occupation thereof after giving such notice to the latter, not exceeding twenty-four hours as he may think fit. (4) In exercising the powers of seizure and eviction under this section, the Controller may enter upon the premises, and may use such force as, in his opinion, is reasonably necessary. 14. Appeals.___(1) Any person aggrieved by an order of the Controller under section 5, 6, 7 or 9 may appeal there-from, in writing, to the appellate authority under this Act, within fifteen days from the date on which the order is communicated to him. (2) The appellate authority shall call for the record and shall direct issue of notice to the Controller and to all other persons who, in his opinion, may be directly affected by the result of the appeal, and after hearing all such parties and examining the record, and after such further enquiry, either by himself or by the Controller, as he may deem fit, shall decide the appeal. (3) The decision of the appellate authority, and subject only to such decision, the order of the Controller to which this section relates, shall be final and shall not be called in question in any court. (4) The expression “appellate authority” shall mean the 1[Commissioner of the Karachi Division] and shall include any other officer appointed by the 1[Provincial Government] to exercise the powers of an appellate authority under this section. 15. Penalty for failure to register hotel or lodging-house. Any owner of a hotel or a lodging- house who fails to register his hotel or lodging-house in compliance with section 4 shall be punishable with imprisonment of either description which may extend to one month, or with fine, or with both. 16. Penalty for failing to display fair rates and accommodation, etc. Any manager of a hotel or owner of a lodging-house who fails to display the fair rates and the limit of guests for each room or other unit of accommodation fixed by the Controller, as required by section 8, shall be punishable with fine. 17. Penalty for disobeying reservation order. Any manager of a hotel or owner of a lodging- house who fails when required by notice under sub-section (3) of section 9, to make reserved accommodation available to the Controller in compliance with the said sub-section, shall, unless he proves that the failure was due to circumstances beyond his control, be punishable with fine. 18. Penalty for charging in excess of fair rates and exceeding limit of accommodation. Any manager of a hotel or owner of a lodging-house who___ (a) charges any amount in excess of the fair rate fixed by the Controller under section 6, or (b) accommodates guests, or permits guests to be accommodated, in any room or other unit of accommodation in his hotel or lodging-house, in excess of the number fixed therefore by the Controller under section 7, shall be punishable with imprisonment of either description which may extend to six months or with fine, or with both. 19. Constructive liability of owners of hotels, etc.___(1) Every owner of a hotel which is in charge of a manager, and in relation to a hotel owned by a company or firm, every director, Secretary, partner or officer of such company or firm shall be liable to prosecution, equally with the manager of the hotel for any offence punishable under section 16, or section 17 or section 18. (2) If any person who is prosecuted under the provisions of sub-section (1) proves that the offence was committed without his knowledge or that he exercised all due diligence to prevent its commission, he shall be entitled to acquittal. 20. Cognizance of offences.___(1) No Court shall take cognizance of an offence under this Act except on a complaint made by the Controller in writing. (2) No court exercising powers inferior to those of a magistrate of the first class shall try any offence under this Act. 21. Bar of suits. No suit or other legal proceeding shall lie against the Controller or any person acting under his orders, in respect of anything which is in good faith done or intended to be done under this Act. 1Subs. by A.O., 1964, Art.2 and Sch. 22. Rules.___(1) The 1[Provincial Government] may make rules2 for carrying out the purposes of this Act. (2) Without prejudice to the generality of the power conferred by the foregoing sub-section, such rules may provide for- (a) the nature, scope and extent of the powers of a Controller which may be exercised by an Additional Controller under this Act; (b) The functions of the Controller in respect of which he is to receive the aid and advice of the Advisory Committee; and the mode in which such aid or advice is to be sought and tendered; (c) the conduct of its proceedings and business by the Advisory Committee; (d) the form and manner in which registration of hotels and lodging-houses is to be effected and the fees to be charged for registration; (e) the forms of notices displaying fair rates and maximum limits of persons to be accommodated, as required by section 8; (f) the procedure in regard to the reservation of accommodation under sub-section (1) of section 9; (g) the conditions ; under and the circumstances in which the permission of the Controller under subsection (2) of section 7 shall not be necessary; (h) the form and manner of service of notice to be issued under sub-section (3) of section 9; (i) the manner in which enquiries shall be held by the Controller; (j) the levy of court fees on applications and proceedings before the Controller. 23. Exemption. This Act shall not apply to any hostel or other premises belonging to or in the possession of the 3[Federal] or any Provincial Government where lodging, board or other service is provided mainly for Government officials, but it shall apply in respect of lodging, board or other service in any hotel or lodging-house which the manager or keeper has agreed or is required to provide to, or under the instructions of, the 1[Provincial Government]. RI - Date: 13-05-2024 1Subs. by A.O., 1964, Art. 2 and Sch. 2For the Karachi Hotels and Lodging-houses (Control) Rules, 1955. see Gaz. of P., 1955 Part. I, pp. 63___ 64. 3Subs. By F.A.O. 1975 Art. 2 and Table."
}