{
  "file": "administrator084fe1e8bb9f566b2f0023574816a68f.pdf",
  "law_name": "Repealing And Amending Ordinance, 1961",
  "text": "THE IMPORTS AND EXPORTS (CONTROL) ACT, 1950 CONTENTS ___________ SECTIONS: 1. Short title, extent, commencement and duration 2. Definitions 3. Powers to prohibit or restrict imports and exports 4. Continuance of existing orders 4A. Prohibition to sell or purchase import licence 4B. Prohibition regarding sale and transfer of goods by industrial consumer 5. Penalty 5A. [Repealed] 5B. [Repealed] 5C. [Repealed] 6. Cognizance of offences 7. Savings 8. Power to make rules 9. [Repealed] THE IMPORTS AND EXPORTS (CONTROL) ACT, 1950 *ACT No. XXXIX of 1950 [19th April, 1950] An Act to continue 1[* * *] powers to prohibit or control imports and exports. WHEREAS it is expedient to continue 2[* * *] powers to prohibit, restrict or otherwise control imports into and exports from Pakistan; It is hereby enacted as follows: ___ 1. Short title, extent, commencement and duration. ___ (1) This Act may be called the Imports and Exports (Control) Act, 1950. 3[(2) It extends to the whole of Pakistan.] (3) It shall come into force immediately 4[* * *]. 2. Definitions. In this Act___ (a) “Chief Controller” means the officer appointed by the 5[Federal Government] to perform the duties of Chief Controller of Imports and Exports under this Act; 6[(b) “Collector of Customs” means an officer appointed as such under section 7[(3)] of the Customs Act, 1969 (IV of 1969); and] (c) “import” and “export” mean respectively bringing into, and taking out of, the 8[Pakistan] 9[* * *] by sea, land or air. *This Act and Rules made thereunder, has been applied by Regulation No. I of 1968, to those of the Tribal Areas to which it does not already apply. The Act has been applied to___ (i) Baluchistan, subject to certain modifications, with effect on and from the 19th April, 1950 see Gaz. of P.,1953, Pt. I. p. 90; (ii) The Federated Areas of Baluchistan, see ibid., p. 152; and The Act has been extended to___ (i) the Leased Areas of Baluchistan, see the Leased Areas (Laws) Order, 1950 (G. G. O. 3 of 1950); and (ii) the Baluchistan States Union, see the Baluchistan States Union, (Federal Laws) (Extension) Order. 1953 (G. G. O. 4 of 1953); (iii) the Khairpur State see the Khairpur (Federal Laws) (Extension) Order, 1953 (G. G. . 5 of 1953); and (iv) the State of Bahawalpur, see the Bahawalpur (Extension of Federal Laws) Order, 1953 (G. G. O. 11 of 1953) as amended. The Act has been and shall be deemed to have been brought into force in Gwadur with effect from the 8th September, 1958, by the Gwadur (Application of Central Laws) Ordinance, 1960 (37 of 1960), s. 2. 1 Omitted by the Imports and Exports Control) (Amdt.) Act, 1975 (38 of 1975), s. 2. 2 Certain words previously amended by various laws have been omitted ibid., s. 3. 3Subs. by the Central Laws (Statute Reform) Ordinance, 1960 (21 of 1960), s. 3 and 2nd Sch, For the original sub-section (2) (with effect from the 14th October, 1955). 4 Certain words previously amended by various laws have been omitted by the Imports and Exports (Control) (Amdt.) Act, 1975 (38 of 1975), s. 3. 5 Subs. ibid., s. 5. for “Central Government”. 6 Subs. by the Imports and Exports (Control) (Amdt.) Ordinance, 1970 (8 of 1970), s. 3. 7Subs. by the Federal Laws (Revision and Declaration) Ordinance, 1981 (27 of 1981), s. 3 and 2nd Sch. 8 Subs. by F.A.O. 1975, Art. 2 and Sch. 9 The existing words “or the Federal Territory of Karachi or any Acceeding State, if the Federal Legislature has power to make laws for such State”, as amended by the Repealing and Amending Ordinance, 1961 (1 of 1961), has been omitted by the Imports and Exports (Control) (Amdt.) Ordinance, 1962 (29 of 1962), s. 3 (with effect from the 18th April, 1962). 3. Powers to prohibit or restrict imports and exports.___ (1) The 1[Federal Government] may, by order2 published in the official Gazette and subject to such conditions and exceptions as may be made by or under the order, prohibit3 restrict or otherwise control the import or export of goods of any specified descriptions, or regulate generally all practices (including trade practices) and procedure connected with the import or export of such goods, 4[and such order may provide for applications for licences under this Act, the evidence to be attached to such applications, the grant, use, transfer, sale or cancellation of such licences, and the form and manner in which and the periods within which appeals and applications for review or revision may be preferred and disposed of, and the charging of fees in respect of any such matter as may be provided in such order] 5[:] 5[Provided that the Minister-in-Charge may, by notification in the official Gazette, for reasons to be recorded in writing, on case-to-case basis and in the interest of trade and commerce of Pakistan, allow one-time permission to import, re-import, export or re-export goods in relaxation of the prohibition or restrictions contained in the order made under this sub-section for the time being in force.] (2) No goods of the specified description shall be imported or exported except in accordance with the conditions of a licence to be issued by the Chief Controller or any other officer authorised in this behalf by the 1[Federal Government]. (3) All goods to which any order under sub-section (1) applies shall be deemed to be goods of which the import or export has been prohibited or restricted under 6[section 16 of the Customs Act, 1969 (IV of 1969) and all the provisions of that Act shall have effect accordingly]. (4) Notwithstanding anything contained in the aforesaid Act the 1[Federal Government] may, by order7 published in the official Gazette, prohibit, restrict or impose conditions on the clearance whether for home consumption 8[or ware housing or] shipment abroad of any imported goods or class of goods. 4. Continuance of existing orders. All orders made under section 3 of the Imports and Exports (Control) Act, 1947, and in force immediately before the commencement of this Act, shall so far as they are not inconsistent with the provisions of this Act, continue in force and shall be deemed to have been made under this Act. 9[4A. Prohibition to sell or purchase import licence. No person shall sell, purchase or otherwise deal in any import licence 9[* * *]. 10[* * * * * * *] 1 Subs. by the Imports and Exports (Control) (Amdt.) Act, 1975 (38 of 1975), s. 5. 2 For the Registration (Importers and Exporters) Order, 1952, see Gaz. of P., 1952, Ext. pp. 1267___1271 ; for the Raw Jute Registered (Marks) Order, 1954, see ibid, 1954, Ext., pp. 1739-1741 for the Order made under this section, see ibid, 1957, Pt. I. p. 269; for the Review Appeal and Revision Order, 1957, see ibid, 1957, Ext., pp. 2219-2220 ; for the Licenses and Permits Fees Order, 1958, see ibid., 1958, Ext. pp. 653___ 655 ; for notification to import such goods into Gwadur without licence in respect of which firm commitments had been made with foreign supplier before 8th September, 1958 see ibid., 1958, Ext., p. 1855 ; and for the Wheat and Wheat Products, (Movements Restrictions) Order, 1961 see ibid., 1961 Ext., p. 975c. 3 For notifications prohibiting the export to and import from India of goods of all descriptions, see S.R.O. 126 (R)/65 and S.R.O. 128 (R) /65, dated the 9th September, 1965, Gaz. of P., 1965, Ext., p. 985. For notification prohibiting the export by see, land or air to any destination, other than Afghanistan, of any goods of the description specified in the Sch. annexed to therewith, see Gaz. of P., 1965, Ext. p. 985. 4 Subs. by the Imports and Exports (Control) (Amdt.) Act, 1957 (42 of 1957), s. 2., for certain original words. 5Subs. and added by the Imports and Exports (Control)(Amendment) Act, 2025 (V of 2025), s.2. 6 Subs. by the Imports and exports (Control) Ordinance, 1970 (8 of 1970) s. 4. 7 For such an order, see Gaz. of P., 1952, Ext., p. 985. 8 Subs. by the Imports and Exports (Control) (Amdt.) Ordinance 1970, (8 of 1970) s. 4. 9 New sections 4A and 4B ins. by the Imports and Exports (Control) (Amdt.) Ordinance, 1962 (29 of 1962), s. 4 (with effect from the 18th April, 1962). 10 Omitted by Act. 38 of 1975, s. 4. 4B. Prohibition regarding sale and transfer of goods by industrial consumer. Except with the previous permission in writing of the Chief Controller or any other officer authorised in this behalf by the 1[Federal Government] no person 2[who, in his capacity as industrial consumer, imports any goods against a licence issued to him or, where no licence is required for the import of such goods by an industrial consumer, without any licence,] shall sell or otherwise transfer such goods, or use the goods for a purpose other than the purpose or purposes for which the licence was issued 3[or such goods were imported].] 5. Penalty. 4[(1)] If any person contravenes 5[any provision of this Act or] any order made or deemed to have been made under this Act or the rules made thereunder, or makes use of an import or export licence otherwise than in accordance with any condition in that behalf imposed under this Act, he shall without prejudice to any confiscation or penalty to which he may be liable under the provisions of the 6[Customs Act, 1969 (IV of 1969)], as applied by sub-section (3) of section 3 of this Act be punishable with imprisonment for a term which may extend to one year, or with fine, or with both. 7[(2) If any person contravenes any provision of any order made or deemed to have been made under this Act or the rules, schemes or policies made thereunder or makes use of an export licence otherwise than in accordance with any condition subject to which it was granted, the Federal Government, or any officer authorized by it, may suspend, adjust, deduct or cancel the whole or, as the case may be, any part of export quotas whether granted to or acquired by such person on the basis of performance, purchase or by any other means whatsoever, and suspend or as the case may be, cancel the export registration of such person. (3) No order under sub-section (2) shall be passed unless the concerned person has been given an opportunity of being heard.] 5A. 8[Repealed] 5B. 8[Repealed] 5C. 8[Repealed] 6. Cognizance of offences. No court shall take cognizance of any offence punishable under section 5 except upon complaint in writing made, ___ (a) in the case of an offence which is punishable both under this Act or the rules made thereunder and also, whether by confiscation or otherwise, under the 9[Customs Act, 1969 (IV of 1969)] by a 9[Collector of Customs] or by an officer of Customs authorised in writing in this behalf by a Customs-Collector, or 1 Subs. by the Imports and Exports (Control) (Amdt.) Act, 1975 (38 of 1975), s. 5. 2 Subs. by the Imports and Exports (Control) (Amdt.) Ordinance, 1965 (8 of 1965), s. 3, for “who imports goods against a licence issued to him in his capacity as industrial consumer”. 3 Added ibid., s. 3. 4 Re-numbered as sub-section (1) by the Imports and Exports (Control) (Amdt.) Act, 1997 (37 of 1997) s. 2. 5 Ins. by Ordinance 29 of 1962, s. 5 (with effect from the 18th April, 1962). 6 Subs. by the Imports and Exports (Control) (Amdt.) Ordinance, 1970 (8 of 1970), s. 5. For “ Sea Customs Act, 1878”. 7 Sub-sections (2) and (3) added by the Imports and Exports (Control) (Amdt.) Act., 1997 (37 of 1997) s. 2. 8 Sections 5A, 5B & 5C Repealed by the Trade Dispute Resolution Act, 2022 (Act No. LVI of 2023) s. 63. 9 Subs. by the Imports and Exports (Control) (Amdt.) Ordinance, 1970 (8 of 1970), s. 6. (w.e.f. 18-4-1970 (b) in the case of any other offence, by the Chief Controller or by an officer authorized by him in writing in this behalf; and no court inferior to that of a Magistrate of the first class shall try any such offence. 7. Savings. No order made or deemed to have been made under this Act shall be called in question in any court, and no suit, prosecution or other legal proceeding shall lie against any person for anything in good faith done or intended to be done under this Act or any rules made thereunder or any order made or deemed to have been made thereunder. 8. Power to make rules. The 1[Federal Government] may make rules not inconsistent with this Act for carrying out the purposes of this Act 2[and may in such rules provide for the setting up of a Revolving Fund and for matters relating thereto]. 9. 3[Repealed] 52197 Dated: 03.03.2025 1 Subs. by the Imports and Exports (Control) (Amdt.) Act, 1975 (38 of 1975) s. 5. 2 Added by the Imports and Exports (Control) (Amdt.) Ordinance, 1980 (5 of 1980). s. 3. 3 Repealed by the Repealing and Amending Ordinance, 1965 (10 of 1965), s. 2 and 1st Sch."
}