{
  "file": "administrator8c0c9c8adfa3282499e0822eecaf710f.pdf",
  "law_name": "National Insurance Corporation Into A Public Limited Company For Incorporation Under The Companies Ordinance, 1984",
  "text": "THE NATIONAL INSURANCE CORPORATION (REORGANIZATION) ORDINANCE, 2000 CONTENTS 1. Short title, extent and commencement 2. Definitions 3. Vesting of the property, rights and liabilities of the Corporation 4. Transfer of employees from the Corporation to the Company 5. Exemption from registration fees 6. Registration 7. Power to make rules 8. Removal of difficulties 9. Repeal THE NATIONAL INSURANCE CORPORATION (REORGANIZATION) ORDINANCE, 2000 ORDINANCE No. XXXVII of 2000 [11th August, 2000] An Ordinance to provide for conversion of the National Insurance Corporation into a public limited company WHEREAS, it is expedient to provide for conversion of the National Insurance Corporation into a public limited company for incorporation under the Companies Ordinance, 1984. (XLVII of 1984). AND WHEREAS the National Assembly and the Senate stand suspended in pursuance of the Proclamation of Emergency of the fourteenth day of October, 1999, and the Provisional Constitution Order No. I of 1999; AND WHEREAS the President is satisfied that circumstances exist which render it necessary to take immediate action; NOW, THEREFORE, in pursuance of the Proclamation of Emergency of the fourteenth day of October, 1999, and Provisional Constitution Order No. 1 of 1999, as well as Order No. 9 of 1999, and in exercise of all powers enabling him in that behalf, the President of the Islamic Republic of Pakistan is pleased to make and promulgate the following Ordinance:— 1. Short title, extent and commencement.___ (1) This Ordinance may be called the National Insurance Corporation (Reorganization) Ordinance, 2000. (2) It extends to the whole of Pakistan. (3) It shall come into force at once. 2. Definitions.___ (1) In this Ordinance, unless there is anything repugnant in the subject or context— (a) “Company” means the National Insurance Company Limited incorporated under the Companies Ordinance, 1984. (XLVII of 1984) (b) “Corporation” means the National Insurance Corporation established under section 3 of the National Insurance Corporation Act, 1976; (XXIII of 1976) (c) “effective date” means the date on which property, rights and liabilities of the Corporation are vested in the Company under section 3; and (2) All words and expressions used but not defined in this Ordinance shall have the same meaning as in the Insurance Act, 1938. (IV of 1938) 3. Vesting of the property, rights and liabilities of the Corporation.___ (1) As soon as may be after the commencement of this Ordinance, the Federal Government may, by order, published in Official Gazette, direct that as and from the date, as may be specified in the order by the Federal Government, (hereinafter referred to as the effective date), all property, rights and liabilities to which the Corporation was entitled or subject, immediately before such orders, and identified therein, shall, on such terms and conditions as the Federal Government may determine, vest in the Company and become the property, rights and liabilities of the Company. (2) An order issued under sub-section (1) shall provide for all such matters consequential and incidental to the matters provided for in sub-section (1) as the Federal Government shall consider necessary or expedient. (3) An order issued under sub-section (1) shall provide for — (a) the continuation by the Company of the operations and undertaking of the Corporation on the same basis as were being carried on immediately prior to the date of the order; and (b) the dissolution of the Corporation from the effective date on which date the Corporation shall cease to exist. (4) In consideration of the vesting in the Company of the property, rights and liabilities of the Corporation under the order issued under sub-section (1), the Company shall issue in the name of the President of the Islamic Republic of Pakistan such number of fully paid ordinary shares, of the Company as the Federal Government may determine to be the estimated net asset value of the Corporation on the effective date. (5) No stamp duty shall be payable under any law for the time being in force or in relation to the transfer or vesting of property of the Corporation under any order issued under subsection (1), or on any shares or securities or the certificates or scripts evidencing title thereto issued to the President of the Islamic Republic of Pakistan. (6) The value ascribed to the property vested in the Company by the Federal Government under the order made under this section shall represent the actual acquisition cost of the property for the purposes of taxation and depreciation. (7) All contracts, bonds, agreement, powers of attorney, grants of legal representation and all other instruments of whatever kind in each case subsisting or having effect immediately before the effective date or to, which the Corporation may have been a party before the effective date shall be deemed to have been made with the Company, as if, instead of the Corporation, the Company had been a party thereto. (8) All suits, appeals or other legal proceedings of whatever nature by or against or relating to the Corporation pending on the effective date in any court, tribunal or other authority shall be continued, prosecuted and enforced in the same manner and to the same extent as they would or might have been continued, prosecuted and enforced by or against the Corporation. (9) On and after the effective date, any reference to the Corporation in any law other than the Ordinance, or in any rule, regulation, other notification or in any contract, deed or other document shall, except where the context otherwise requires or the Federal Government otherwise directs, be construed as reference to the Company. Explanation.—-For the purpose of this section the expression “property” includes assets and entitlements of every description and nature, wherever situated; and “liabilities” includes duties, obligations, loans, encumbrances, claims and charges of every description and nature, actual or contingent, whether or not they are capable, under any law of Pakistan or of any other State or under any agreement or otherwise, of being vested, transferred or assigned by the Corporation. 4. Transfer of employees from the Corporation to the Company.___ (1) All whole time employees of the Corporation who had continuously served for a period of not less than six months before the effective date shall be transferred to, and become the employees of the Company, hereinafter referred to as the “Transferred Employees”, on the same terms and conditions, including remuneration, tenure of office, rights, perquisites, privileges, pension benefits, gratuity, provident fund, group insurance and other matters, as were applicable to them immediately before the effective date. (2) No person transferred to the Company pursuance to sub-section (1) shall be entitled to any compensation as a consequence of transfer to the Company. (3) The terms and conditions of service of any Transferred Employee shall not be altered adversely by the Company except in accordance with the laws of Pakistan or with the consent of the Transferred Employees and the award of appropriate compensation. 5. Exemption from registration fees.___ Notwithstanding the provisions of section 470 and Sixth Schedule of the Companies Ordinance, 1984, (XLVII of 1984) the company shall be exempt from payment of the registration fees for the purpose of its incorporation. 6. Registration.___(1) The company shall be entitled to carry on non-life insurance business in accordance with the object clause of its Memorandum of Association, without obtaining the registration under the Insurance Ordinance 2000 for a period of one year from the effective date. (2) Within one year from the effective date, the Company shall either:— (a) get itself registered under the said Insurance Ordinance, or (b) cease to enter into new contracts or insurance and all the provisions under the law for the time being in force shall apply to the Company as they apply to the unregistered companies. 7. Power to make rules.___ The Federal Government may, by notification in the official Gazette, make rules for carrying out the purposes of this Ordinance. 8. Removal of difficulties.___ If any difficulty arises in giving effect to any of the provisions of this Ordinance, the Federal Government may make such order, not inconsistent with the provisions of this Ordinance, as may appear to it to be necessary for the purpose of removing the difficulty. 9. Repeal.___ Immediately after the incorporation and registration of the National Insurance Company as a public limited company, the National Insurance Corporation Act, 1976, (XXIII of 1976) shall stand repealed."
}