{
  "file": "administrator838fddea2bd84054cde358506b537096.pdf",
  "law_name": "THE MARRIED WOMEN'S PROPERTY ACT, 1874 CONTENTS I.___PRELIMINARY",
  "text": "THE MARRIED WOMEN'S PROPERTY ACT, 1874 CONTENTS I.___PRELIMINARY 1. Short title. 2. Extent and Application. 3. Repealed. II.___MARRIED WOMEN'S WAGES AND EARNINGS 4. Married womens earnings to be their separate property. III.___INSURANCE BY WIVES AND HUSBANDS 5. Married woman may effect policy of insurance. 6. Insurance by husband for benefit of wife. IV.___LEGAL PROCEEDINGS BY AND AGAINST MARRIED WOMEN 7. Married Woman may take legal proceedings. 8. Wife's liability for postnuptial debts. V. ___HUSBANDS LIABILITY FOR WIFE'S DEBTS 9. Husband not Liable for Wife's antenuptial Debts. VI.___HUSBANDS LIABILITY FOR WIFE'S BREACH OF TRUST OR DEVASTATION 10. Extant of husband's liability for wife's breach of trust or devastation. THE MARRIED WOMEN’S PROPERTY ACT, 1874 1ACT No. III of 1874 [24th February, 1874] An Act to explain and amend the law relating to certain married women, and for other purposes. Preamble. WHEREAS it is expedient to make such provision as hereinafter appears for the enjoyment of wages and earnings by women married before the first day of January, 1866, and for insurances on lives by persons married before or after that day: AND WHEREAS by 2[section 20 of the Succession Act, 1925] (XXXIX of 1925) it is enacted that no person shall by marriage acquire any interest in the property of the person whom he or she marries, nor become incapable of doing any act in respect of his or her own property, which he or she could have done, if unmarried: AND WHEREAS by force of the said Act all women to whose marriages it applies are absolute owners of all property vested in, or acquired by, them, and their husbands do not by their marriage acquire any interest in such property, but the said Act does not protect such husbands from liabilities on account of the debts of their wives contracted before marriage, and does not expressly provide for the enforcement of claims by or against such wives: It is hereby enacted as follows:_ I.___PRELIMINARY 1. Short title. This Act may be called the Married Women’s Property Act, 1874. 2. Extent and application. 3[It extends to the whole of Pakistan.] But nothing herein contained applies to any married woman who at the time of her marriage professed the Hindu, 4[Muslim], Buddhist, Sikh or Jaina religion, or whose husband, at the time of such marriage, professed any of those religions. And the 5[Provincial Government] may from time to time, by order, either retrospectively from the passing of this Act or prospectively, exempt from the operation of all or any of the provisions of this Act the members of any race, sect or tribe, or part of race, sect or tribe, to whom 6[it] may consider it impossible or inexpedient to apply such provisions. 1For the Statement of Objects and Reasons, see Gazette of India, 1873 Pt. V, p. 457; for Proceedings in Council, see ibid., Extra Supplements, dated 2nd August and 6th September, 1873, respectively pp. 9 and 12, and ibid., 1874, Supplement, p. 239. 2Subs. by the Federal Laws (Revision and Declaration) Ordinance, 1981 (27 of 1981), s. 3 and 2nd Sch., for “the Indian Succession Act, 1865”. 3This para, has successively been amended by A. O., 1937, A.O.,1949, Arts. 3(2) and 4, the Federal Laws (Revision and Declaration) Act, 1951 (26 of 1951), s. 4 and III Sch., and the Central Laws (Statute Reform) Ordinance, 1960 (21 of 1960), s. 3 and 2nd Sch. (with effect from the 14th October, 1955), to read as above. 4Subs. by F. A. O., 1975, Art, 2 and Table, for “Muhammadan”. 5Subs. by A. O., 1937 for “L. G.” which had been subs. by the Devolution Act, 1920 (38 of 1920), s. 2 and Sch. I, for “G.G. in C.”. 6Subs. by A.O., 1937, for “he”. The 1[Provincial Government] may also revoke any such order, but not so that the revocation shall have any retrospective effect. All orders and revocations under this section shall be published in the 2[official Gazette]. 3* * * * * * * 3. [Commencement.] Rep. by the Repealing Act, 1876 (XII of 1876). II. ___MARRIED WOMEN’S WAGES AND EARNINGS 44. Married women’s earnings to be their separate property. The wages and earnings of any married woman acquired or gained by her after the passing of this Act, in any employment, occupation or trade carried on by her and not by her husband, and also any money or other property so acquired by her through the exercise of any literary, artistic or scientific skill, and all savings from and investments of such wages, earnings and property, shall be deemed to be her separate property, and her receipts alone shall be good discharges for such wages, earnings and property. III.___INSURANCE BY WIVES AND HUSBANDS 55. Married woman may effect policy of insurance. Any married woman may effect a policy of insurance on her own behalf and independently of her husband; and the same and all benefit thereof, if expressed on the face of it to be so effected shall ensure as her separate property, and the contract evidenced by such policy shall be as valid as if made with an unmarried woman. 66. Insurance by husband for benefit of wife. 7[(1) A policy of insurance effected by any married man on his own life, and expressed on the face of it to be for the benefit of his wife, or of his wife and children, or any of them, shall ensure and be deemed to be a trust for the benefit of his wife, or of his wife and children, or any of them, according to the interest so expressed, and shall not, so long as any object of the trust remains, be subject to the control of the husband, or to his creditors, or form part of his estate. When the sum secured by the policy becomes payable, it shall, unless special trustees are duly appointed to receive and hold the same, be paid to the Official Trustee of the 8[Province] in which the office at which the insurance was effected is situate, and shall be received and held by him upon the trusts expressed in the policy, or such of them as are then existing. And in reference to such sum he shall stand in the same position in all respects as if he had been duly appointed trustee thereof by a High Court, under 9[The Official Trustees Act, 1913 (II of 1913)]. 1Subs. by A. O., 1937 for “L. G.” which had been subs. by the Devolution Act, 1920 (38 of 1920), s. 2 and Sch. I, for “G.G. in C.”. 2Subs. ibid, for “local official Gazette” which had been subs. by Act 38 of 1920, s. 2 and Sch. I, for the words “Gazette of India”. 3The last para. of section 2 was omitted by the Succession Act, 1925 (39 of 1925), s. 392, and Sch. IX. 4Cf. the Married Women’s Property Act, 1870 (33 and 34 Vict., c. 93) s.1, now repealed by the Married Women’s Property Act, 1882 (45 and 46, Vict., c. 75). 5Cf. the Married Women’s Property Act, 1870 (33 and 34 Vict., c. 93), s. 10, para 1. 6Cf. ibid., para 2. 7Re-numbered by the Married Women’s Property (Amdt.) Act, 1923 (13of 1923), s. 2. 8Subs. by A. O., 1937. for “Presidency”. 9Subs. by the Federal Laws (Revision and Declaration) Ordinance, 1981 (27 of 1981). s. 3 and IInd Sch., for “Act No. XVII of 1864 to constitute an Office of Official Trustee, section 10”. Nothing herein contained shall operate to destroy or impede the right of any creditor to be paid out of the proceeds of any policy of assurance which may have been effected with intent to defraud creditors. 1[(2) Notwithstanding anything contained in section 2, the provisions of sub-section (1) shall apply in the case of any policy of insurance such as is referred to therein which is effected by any Hindu, 2[Muslim], Sikh or Jain, 3[in any Province] after the first day of April, 1923: Provided that nothing herein contained shall affect any right or liability which has accrued or been incurred under any decree of a competent Court passed before the first day of April, 1923.] IV.___LEGAL PROCEEDINGS BY AND AGAINST MARRIED WOMEN 47. Married woman may take legal proceedings. A married woman may maintain a suit in her own name for the recovery of property of any description which by force of the said 5[Succession Act, 1925 (XXXIX of 1925)] or of this Act, is her separate property; and she shall have, in her own name, the same remedies, both civil and criminal, against all persons, for the protection and security of such property, as if she were unmarried, and she shall be liable to such suits, processes and orders in respect of such property as she would be liable to if she were unmarried. 8. Wife’s liability for postnuptial debts. If a married woman (whether married before or after the first day of January, 1866) possesses separate property, and if any person enters into a contract with her with reference to such property, or on the faith that her obligation arising out of such contract will be satisfied out of her separate property, such person shall be entitled to sue her, and, to the extent of her separate property, to recover against her whatever he might have recovered in such suit had she been unmarried at the date of the contract and continued unmarried at the execution of the decree: 6[Provided that nothing herein contained shall__ (a) entitle such person to recover anything by attachment and sale or otherwise out of any property which has been transferred to a woman or for her benefit on condition that she shall have no power during her marriage to transfer or charge the same or her beneficial interest therein, or (b) affect the liability of a husband for debts contracted by his wife’s agency expressed or implied.] V.___HUSBAND’S LIABILITY FOR WIFE’S DEBTS 79. Husband not liable for wife’s antenuptial debts. A husband married after the thirty-first day of December, 1865, shall not by reason only of such marriage be liable to the debts of his wife contracted before marriage, but the wife shall be liable to be sued for, and shall, to the extent of her separate property, be liable to satisfy such debts as if she had continued unmarried: 1Sub-section (2) ins. by Act, 13 of 1923, s.2. 2Subs. by F. A. O., 1975. Art. 2 and Table, for “Muhammadan”, 3Subs. by A. O., 1949. Sch., for “in Madras after the thirty-first day of December, 1913, or in any other part of British India”. 4Cf. the Married Women’s Property Act, 1870 (33 and 34 Vict., c. 93), s. 11, rep. by the Married Women’s Property Act, 1882 (45 and 46 Vict., c. 75). 5Subs. by the Federal Laws (Revision and Declaration) Ordinance, 1981 (27 of 1981), s. 3 and IInd Sch., for “Indian Succession Act, 1865”. 6Subs. by the Transfer of Property (Amdt.) Supplementary Act, 1929 (21 of 1929), s. 2, for the original proviso as amended by the Debtors Act, 1888 (6 of 1888), s. 9. 7Cf. the Married Women’s Property Act, 1870 (33 and 34 Vict., c. 93), s.12. Proviso. Provided that nothing contained in this section shall 1* * * invalidate any contract into which a husband may, before the passing of this Act, have entered in consideration of his wife’s antenuptial debts. VI. ___2HUSBAND’S LIABILTY FOR WIFE’S BREACH OF TRUST OR DEVASTATION 10. Extent of husband's liability for wife's breach of trust or devastation. Where a woman is a trustee, executrix or administratrix’ either before or after marriage, her husband shall not, unless he acts or intermeddles in the trust or administration, be liable for any breach of trust committed by her, or for any misapplication, loss or damage to the estate of the deceased caused or made by her, or for any loss to such estate arising from her neglect to get in any part of the property of the deceased.] _______________ Date: 16-09-2024 1The words “affect any suit instituted before the passing of this Act, nor” rep. by the Amending Act, 1891 (12 of 1891). 2This heading and s. 10 ins. by the Indian Succession (Amendment) Act, 1927 (18 of 1927), s. 3."
}