{
  "file": "administrator59fb5c5c675235e7378c29e39141d57e.pdf",
  "law_name": "The Pakistan Nuclear Regulatory Authority Ordinance, 2001",
  "text": "THE PAKISTAN NUCLEAR REGULATORY AUTHORITY ORDINANCE, 2001 CONTENTS 1. Short title, extent and commencement 2. Definitions 3. Establishment of the Authority 4. Composition of the Authority 5. Chairman 6. Term of office of the Chairman 7. Term of office of a member 8. Resignation by the Chairman or a member 9. Removal of the Chairman or a member 10. Filling of a casual vacancy 11. Terms and conditions of service 12. Meetings of the Authority 13. Directorates of the Authority 14. Advisory Committees 15. Appointment of advisers and consultants 16. Functions and powers of the Authority 17. Directives, orders and instructions from the Federal Government 18. Delegation of powers 19. Power to issue license 20. Power to grant authorization 21. Authorization prior to licensing 22. Authorization prior to radioactive waste discharge and disposal 23. Authorization for nuclear powered vehicle, vessel or aircraft, and any vehicle, vessel or aircraft carrying nuclear material 24. Cancellation or suspension of an authorization or a license 25. Actions to be taken subsequent to cancellation or suspension of licence 26. Transitional 27. Control of contaminated foodstuff 28. Power to obtain information 29. Power of entry, inspection, etc 30. Fixation of extent of civil liability 31. Absolute and exclusive liability of an operator 32. Insurance or other financial guarantee 33. Indemnity by the Federal Government 34. Saving as to governmental and certain other installations 35. Claim against foreign operators 36. Limitation 37. Re-adjustment 38. Co-operation with International Organization, etc 39. Environmental surveillance and radiation emergency plans 40. Appointment of officers, employees and consultants 41. Funds of the Authority 42. Budget 43. Audit and accounts 44. Offences 45. Cognizance of offences 46. Tribunals 47. Mode of recovery 48. Power to exempt 49. Submission of periodical reports, etc 50. Discoveries and inventions to vest in the Authority 51. Declaration of fidelity and secrecy 52. Chairman, members, etc., to be public servants 53. Indemnity 54. Dissolution of PNRB and DNSRP and transfer of rights and liabilities of the Commission regarding DNSRP to the Authority 55. Power to make rules 56. Power to make regulations 57. Expenses for safety measures or medical examination 58. Ordinance to override other laws 59. Removal of difficulties 60. Repeal and savings THE PAKISTAN NUCLEAR REGULATORY AUTHORITY ORDINANCE, 2001 ORDINANCE No. III OF 2001 [22nd January, 2001] An Ordinance to provide for the establishment of the Pakistan Nuclear Regulatory Authority for regulation of nuclear safety and radiation protection in Pakistan and the extent of civil liability for nuclear damage resulting from any nuclear incident; WHEREAS it is expedient to provide for the establishment of the Pakistan Nuclear Regulatory Authority to be the competent national authority for regulation of safety of nuclear installations, the protection against risks arising from ionizing radiation, the extent of civil liability for nuclear damage resulting from any nuclear incident and for matters ancillary thereto or connected therewith; AND WHEREAS the National Assembly and the Senate stand suspended in pursuance of the Proclamation of Emergency of the fourteenth day of October 1999, and the Provisional Constitution Order No. 1 of 1999; AND WHEREAS the President is satisfied that circumstances exist which render it necessary to take immediate action; NOW, THEREFORE, in pursuance of the Proclamation of Emergency of the fourteenth day of October 1999, and the Provisional Constitution Order No. 1 of 1999, as well as Order No.9 of 1999; and in exercise of all powers enabling him in that behalf, the President of the Islamic Republic of Pakistan is pleased to make and promulgate the following Ordinance:— 1. Short title, extent and commencement.___ (1) This Ordinance may be called the Pakistan Nuclear Regulatory Authority Ordinance, 2001. 2. It extends to the whole of Pakistan. 3. It shall come into force at once. 2. Definitions.____ In this Ordinance, unless there is anything repugnant in the subject or context, (a) “Authority” means the Pakistan Nuclear Regulatory Authority established under section 3; (b) “authorization” means an authorization granted under section 20 or, as the case may be, sections 21, 22 or 23; (c) “Chairman” means the Chairman of the Authority; (d) “Commission” means the Pakistan Atomic Energy Commission established under the Pakistan Atomic Energy Commission Ordinance, 1965(XVII of 1965); (e) “ionizing radiation” means any electromagnetic or particular radiation capable of producing ions, directly or indirectly in its passage through matter; (f) “license” means a license issued under section 19; (g) “member” means a member of the Authority; (h) “nuclear damage” means loss of life, any personal injury or any loss of, or damage to, property which arises out of or results from the radioactive properties or a combination of radioactive properties with toxic, explosive or other hazardous properties of nuclear substance, radioactive materials or radioactive products or waste in, or of nuclear material coming from, originating in, or sent to, a nuclear installation, or from the ionizing radiation emitted by any other source of radiation inside a nuclear installation; (i) “nuclear fuel” means any material which is capable of producing energy by self sustaining chain process of nuclear fission, nuclear fusion or other nuclear transmutation; (j) “nuclear incident” means any occurrence, or series of occurrences having the same origin which causes nuclear damage or but only with respect to preventive measures, creates a grave and imminent threat of causing such damage; (k) “nuclear installation” means: (i) any nuclear reactor used as a source of power or for any other purpose; (ii) any factory using nuclear fuel for the production of nuclear material, or any factory for the processing of nuclear material including any factory for the reprocessing of irradiated nuclear fuel; and (iii) any facility where nuclear material is stored, other than storage incidental to the carriage of such material: Provided that several nuclear installations of one operator, which are located at the same site, may be considered as a single nuclear installation; (l) “nuclear material” means:— (i) nuclear fuel, including natural uranium and depleted uranium, capable of producing energy by a self-sustaining chain process of nuclear fission outside a nuclear reactor, either alone or in combination with some other material; and (ii) radioactive products or waste; (m) “nuclear substance” means any substance or nuclear material which the Authority determines as being a substance or material which may be used for production of or use in atomic energy or for research into matters connected therewith and includes all substances obtained or obtainable from the soil or water by under-ground or surface working or from the atmosphere; (n) “operator”, in relation to a nuclear installation, means the person licensed under section 19; (o) “person” means any individual, corporation, partnership, firm, association, trust, estate, public or private institution, group, Government agency, any state or any political sub-division or any political entity within a state, any foreign Government or nation, or other entity and includes any legal successor, representative, agent or agency of any of the aforesaid; (p) “radiation generator” means a device or an apparatus capable of generating radiation, such as X-rays, neutrons, electrons, or other charged particles, which may be used for scientific, industrial or medical purposes; (q) “radioactive material” means any substance which contains or consists of radioactive nuclide, naturally occurring or 'artificially produced, provided that the specific activity of the substance is in accordance with the levels as may be prescribed by regulations; (r) “regulations” means regulations made under this Ordinance; and (s) “rules” means rules made under this Ordinance. 3. Establishment of the Authority.___ (1) As soon as may be, but not later than thirty days after the commencement of this Ordinance, the Federal Government shall, by notification in the official Gazette, establish, in accordance with provisions of this Ordinance, an Authority to be called the, Pakistan Nuclear Regulatory Authority; Provided that till such time as the Authority is fully constituted, the Chairman shall exercise the powers, perform the functions and discharge the duties of the Authority. (2) The Authority shall be a body corporate having perpetual succession, and a common seal, and may sue and be sued in its own name and, subject to and for the purposes of this Ordinance, may enter into contracts and may acquire, purchase, take, hold and enjoy moveable and immovable property of every description and may convey, assign, surrender, yield up, charge, mortgage, demise, reassign, transfer or otherwise dispose of or deal with, any moveable or immovable property or any interest vested in it. (3) The head office of the Authority shall be at Islamabad and it may set up offices, at such places as it may deem appropriate; (4) The common seal of the Authority shall be kept in the custody of the Chairman or such other person as may be prescribed by regulations and documents required or permitted to be executed under the common seal shall be specified and authenticated in such manner as may be prescribed by regulations. 4. Composition of the Authority.___(1) The Authority shall consist of a Chairman not more than two full-time members and seven part-time members to be appointed by the Federal Government. (2) The Chairman and every member of the Authority shall be a person of ability, integrity and standing having such knowledge and experience as hereinafter specified. (3) The Chairman shall be a person holding a postgraduate degree in physical or nuclear sciences or in engineering and technology, preferably a Ph.D. or equivalent from an internationally recognised university and have worked for at least twenty-five years in the field of nuclear sciences or nuclear engineering and technology. (4) Each of the two full-time members shall be a person holding a postgraduate degree in physical or nuclear sciences or be graduate in engineering and technology from an internationally recognised university and have worked for at least twenty years in the relevant field of radiation protection, nuclear safety or reactor safety. (5) Seven part-time members as follows:— (a) three technical members: (i) two of whom shall be reputable scientists or engineers from internationally recognized universities holding a post-graduate professional degree in nuclear physics or nuclear engineering and technology and have worked at least for fifteen years in the relevant field; and (ii) one medical doctor holding a postgraduate professional degree in nuclear medicine, radiotherapy or radiation sciences and have worked at least for fifteen years in the relevant field; (b) two nominees one each from the Ministry of Health and the Pakistan Environmental Protection Agency not below the rank of Joint Secretary; (c) one nominee from the Pakistan Atomic Energy Commission with the rank or grade equivalent to that 'of a full-time member of the Commission; and (d) Director General, Strategic Plans Division, JSHQ. (6) There shall be a Secretary of the Authority who shall be a non-voting member of the Authority. (7) No person shall be appointed as the Chairman or a member unless he is a citizen of Pakistan. 5. Chairman.__ The Chairman shall be the Chief Executive Officer of the Authority and shall, subject to the provisions of this Ordinance, the rules and regulations, be responsible for the day to day administration of the affairs of the Authority 6. Term of office of the Chairman.—(1) Subject to the provisions of this Ordinance, the Chairman shall hold office for a term of four years from the date of his appointment. (2) The Chairman shall be eligible for reappointment for a period of four years but not for more than two consecutive terms. 7. Term of office of a member.___ Subject to the provisions of this Ordinance, a full-time member and a part-time member other than an ex-officio member, shall hold office for a period of four years from the date of his appointment and shall be eligible for reappointment for a period of four years but not for more than two consecutive terms. 8. Resignation by the Chairman or a member.__ The Chairman, a full-time member or a part-time member may, by giving in writing to the Federal Government a notice of not less than three months, resign his office: Provided that the resignation shall not take effect until it has been accepted by the Federal Government. 9. Removal of the Chairman or a member.—(1) Subject to sub-section (2), the Federal Government may by notification in the official Gazette, remove the Chairman or any member from his office. (2) The Chairman or any member may be removed from his office, if he:— (a) in the opinion of the Federal Government, fails to discharge, or becomes incapable of discharging, his duties under this Ordinance; (b) has been declared insolvent; (c) has been declared to be disqualified for employment in, or has been dismissed from the service of Pakistan; (d) has been convicted of an offence involving moral turpitude; or (e) has knowingly acquired or continued to hold without the permission in writing of the Federal Government, directly or indirectly or through a partner, any share or interest in any contract or employment with, or by on behalf of the Authority, in any land or property which in his knowledge, is likely to benefit or has benefitted as a result of the operation of the Authority: 10. Filling of a casual vacancy.___ A casual vacancy in the office of the Chairman or a member shall be filled by the appointment of another Chairman or, as the case may be, member for the remaining term of office of his predecessor. 11. Terms and conditions of service.__ (1) The salary and allowance payable to, and other terms and conditions of service of, the Chairman and a full-time member shall be such as may be prescribed by rules. (2) Remuneration and-allowances of a part-time member shall be such as may be prescribed by regulations. 12. Meetings of the Authority.— (1) The Authority shall meet at such times and place and in such manner, as may be prescribed by regulations: Provided that until regulations are made in this behalf, such meetings shall be convened by the Chairman. (2) As and when required, and for the purpose of advice, the Chairman may, in consultation with full-time members, invite a senior level expert or representative of a relevant organization to participate in the meetings of the Authority. 13. Directorates of the Authority.—The Authority may establish one or more Directorates which shall execute, enforce and supervise all decision of the Authority and all nuclear anal radiation safety measures vested in the Authority under the provisions of this Ordinance or the rules and regulations made thereunder. 14. Advisory Committees.__ (1) The Authority may, from time to time, constitute such Advisory Committees, from amongst its members or other suitably qualified persons, for assisting the Authority in the performance of its functions generally, or for advising on or evaluating any particular nuclear or radiation safety aspect. (2) An Advisory Committee constituted under sub-section (1) shall perform such functions as may be prescribed by regulations 15. Appointment of advisers and consultants.__ (1) The Authority may employ suitably qualified advisers and consultants to transact any business or to do any act required to be transacted or done in exercise of its powers or performance of its functions under this Ordinance. (2) The decision to employ and the terms and conditions of employment under sub- section (1) shall be made by the Authority as it may deem fit. 16. Functions and powers of the Authority.__ (1) Subject to the provisions of this Ordinance, the Authority shall have the responsibility for controlling, regulating and supervising all matters related to nuclear safety and radiation protection measures in Pakistan. (2) Without prejudice to the-generality of the foregoing powers, the following shall be the powers and functions of the Authority, namely: (a) to devise, adopt, make and enforce such rules, regulations, orders or codes of practice for nuclear safety and radiation protection as may, in its opinion, be necessary;— (b) to plan, develop and execute comprehensive policies and programmes for the protection of life, health and property against the risk of ionizing radiation; (c) to regulate the radiation safety aspects of:__ (i) Exploitation of any radioactive ore; (ii) Production, import, export, transport, possession, processing, reprocessing; use, sale, transfer, storage or disposal of a nuclear substance, radioactive material or any other substance as the Authority may, by notification in the official Gazette, specify; (iii) equipment used for production, use or application of nuclear energy for :__ (a) the generation of electricity; or (b) any other uses; (d) to approve effective reporting procedures with respect to radiation incidents and to ensure that plans for protective action in emergency situation have been prepared; (e) to ensure that corrective actions are undertaken when unsafe or, potentially unsafe conditions are detected concerning a nuclear installation, radiation generator, nuclear material, nuclear substance or radioactive material; (f) to ensure that appropriate measures for physical protection of nuclear installations and nuclear materials are taken; (g) to establish the extent of insurance to be carried by a licensee against the risks of nuclear damage to the public; (h) to grant authorization, or issue licence for the production, storage, disposal, trade in and use of any nuclear substance, radioactive material or any other substance or equipment used for production or use of nuclear energy as the Authority may, by notification in the official Gazette, specify; (i) to inspect all nuclear installations, radiation generators, nuclear materials, nuclear substances or radioactive materials to ensure that regulations concerning safety measures are properly followed; (j) to advise the Federal Government departments or Provincial Government departments, educational and research institutions, public or private industry and other undertakings on questions related to nuclear safety and radiation protection; and (k) to do all other acts and things, such as initiating and coordinating research and development necessary for carrying into effect the provisions of this Ordinance. 17. Directives, orders and instructions from the Federal Government.__ (1) The Federal Government may, from time to time, issue to the Authority such directives and orders as it may consider necessary for carrying out the purposes of this Ordinance and the Authority shall follow and carry out such directives and orders. (2) In discharging its functions, the Authority shall be bound by such instructions, if any, as may be given to it on any question of policy by the Federal Government which shall be the sole judge as to whether a question is a question of policy. 18. Delegation of powers. The Authority may, by general or special order in writing, direct that any of its powers, shall, in such circumstances and under such conditions, if any, as may be specified in the order, be exercisable also by the Chairman, a member or officer of the Authority. 19. Power to issue license.____(1) No person shall, unless he is exempted as may be prescribed by regulations, or unless he is the holder of a license issued by the Authority: (a) acquire, design, manufacture, construct, install or operate any device to the contains any radioactive material or produce ionizing radiation including consumer products, sealed sources, unsealed sources and radiation generators, including mobile radiography equipment; (b) establish installations and facilities which contain radioactive materials or devices which produce radiation including irradiation facilities, mines and mills processing radioactive ores, installations processing radioactive substances, nuclear installations and radioactive waste management facilities; (c) explore for mines and mill, extract, acquire, handle, use for; medical, industrial, veterinary, or agriculture purposes, or for education, training or research, etc., sell, lease, lend, buy, transfer, import, export, convert, enrich, produce, store, process, reprocess, fabricate, transport, dispose of any radioactive ores, radioactive material, nuclear substance or any other substance as the Authority may, by notification in the official Gazette, specify; and (d) treat food by ionizing radiation. (2) Subject to sub-section (1), the Authority may, on application made to it accompanied by such fee, information and documents, as may be prescribed by regulations, issue a licence for carrying out of such activities as are specified in the licence for such period as may be so specified. (3) The Authority may require an applicant to demonstrate by submitting the required information that the activity for which the license is required would not be hazardous to public or the environment. (4) The Authority may prescribe terms and conditions that may be attached to a licence. (5) The Authority may require the establishment of effective reporting procedure in respect of radiation accidents and ensure that the plans for mitigating the effects of nuclear incidents have been prepared. 20. Power to grant authorization.____(1) The Authority may, on application made to it accompanied by such fee, information and documents, as may be prescribed by regulations, grant an authorization for carrying out of such activities as are specified in the authorization for such period as it tray specify. (2) The Authority may specify terms and conditions that may he attached to an authorization. 21. Authorization prior to licensing.__ No person shall commence construction of any nuclear installation without first obtaining an authorization for the purpose from the Authority as may be prescribed by regulations. Explanation. For the purposes of this section, “construction” includes the sitting, designing and construction of buildings for, and every stage of setting up of, a nuclear installation. 22. Authorization prior to radioactive waste discharge and disposal.___ No person shall discharge, or dispose of; radioactive waste to the environment without first obtaining an authorization for the purpose from the Authority as may be prescribed by regulations. 23. Authorization for nuclear powered vehicle, vessel or aircraft, and any vehicle, vessel or aircraft carrying nuclear material.___ No person shah cause a nuclear powered vehicle, vessel or aircraft, and any vehicle, vessel or aircraft carrying nuclear material to enter in Pakistan without first obtaining an authorization for this purpose from the Authority as may be prescribed by regulations. 24. Cancellation or suspension of an authorization or a licence.___ (1) Where any person has been found to have contravened any of' the provisions of this Ordinance, the rules and regulations, or has consistently failed to comply with the terms and conditions of an authorization or, as the case may be, a licence, the Authority may, subject to sub-section (2), cancel or suspend the authorization or, as the case may be, the license. (2) Before taking any action under sub-section (1) the Authority shall issue a notice to such person to, show cause and give him an opportunity of being heard or an opportunity to rectify the omission subject to such conditions as the Authority may specify. 25. Actions to be taken subsequent to cancellation or suspension of licence.___ In case the Authority cancels or suspends a license under section 24, it may subsequently undertake all or any of the following actions in respect of the installation or facility covered under the licence, namely: (a) ask the licensee to put the installation or facility in safe State and Shut down the installation or facility; (b) permit the licensee to continue operating the installation or facility under such term and conditions as the Authority may specify; or (c) appoint another person to take over the operation of the installation or facility. 26. Transitional.__ (1) Whoever before the commencement of this Ordinance is engaged in activities requiring authorization or license under this Ordinance shall declare to the Authority and shall apply for grant of an authorization or, as the case may be, issue of a licence within six months from such commencement. (2) Pending action, on the application submitted pursuant to sub-section (1), the applicant may continue to pursue such activities referred to in sub-section (1), provided that all necessary measures to comply with the provisions of this Ordinance are taken immediately. 27. Control of contaminated foodstuff.__ No person shall sell, distribute or otherwise dispose of foods that have been contaminated by material producing ionizing radiation except as may be prescribed by regulations. 28. Power to obtain information.___ The Authority, any officer of the Authority or any other person authorized in that behalf by the Authority may, by a notice, in writing, served on any person require such person to make such returns, at such time, and maintain such particulars as may be specified in the notice in respect of all or any of the following matters, namely:__ (a) any such radioactive material, or nuclear substance specified in the notice as is in his possession or under his control; (b) any plant in his possession or under his control designed or adapted for the production or use of atomic energy, ionizing radiation or radioactive material; (c) any contract entered into by him or any right granted by or to him relating to such production or use as aforesaid; and (d) any other information in his possession relating to any work carried out by him, or on his behalf or under his direction in connection with such production or use. 29. Power of entry, inspection, etc.__ Any member of the Authority, any officer of the Authority or any other person authorized in that behalf by the Authority may, at all reasonable hours, enter any premises, vehicle, vessel or aircraft for the purpose of satisfying himself as to whether the provisions of this Ordinance and the rules and regulations made thereunder have been, are being adequately complied with and may— (a) carry out any tests and investigations; (b) obtain and analyse any samples; (c) examine designs, drawings, records, memoranda, reports or documents pertaining to the use, operation, maintenance or storage of any radiation generator or, as the case may be, nuclear substances or radioactive materials; (d) inspect all measures and records pertaining to environmental and personnel monitoring and disposal of radioactive wastes; (e) obtain any other information required for the safety evaluation of any radiation generator or nuclear installation concerned; and (f) lock and seal any nuclear installation or radiation generator, or any part thereof, where any nuclear substance or radiation generator is being used, stored, operated or maintained in contravention of the provisions of this Ordinance or the rules and regulations made thereunder. 30. Fixation of extent of civil liability.___ The Authority shall have the power to fix the extent of civil liability for an operator in case of various nuclear incidents. 31. Absolute and exclusive liability of an operator.__ An operator shall be absolutely and solely liable for nuclear damage upon proof` that such damage has been caused by a nuclear incident___ (a) in his nuclear installation, however, caused such as handling, storage, use, etc.; and (b) involving nuclear material coming from, or originating or originally received in, his nuclear installation. 32. Insurance or other financial guarantee.___ Every opera or of a nuclear installation shall maintain insurance or other financial guarantee adequate to cover his civil liability for nuclear damage, in such amount of such type and on such terms as the Authority may from time to time, determine. 33. Indemnity by the Federal Government.___ The Federal Government shall ensure payment of claims against any operator liable for nuclear damage and for such damage by providing necessary funds to the extent that the yield of insurance or other financial guarantee maintained by the operator under section 32 falls short to satisfy such clams in full: Provided that in no case shall the civil liability of the Federal Government be more than fifteen times the insurance or the financial guarantee required to be carried by an operator of a nuclear installation: 34. Saving as to governmental and certain other installations.__ Nothing in section32 shall apply to a nuclear installation owned and operated by the Federal Government and the Federal Government shall assume limited civil liability up to at least an amount to be determined by the Authority for any nuclear damage in the event of a nuclear incident in any such nuclear installation. 35. Claim against foreign operators.___ In the event of nuclear incident occurring within Pakistan and engaging the civil liability for nuclear damage of an operator in a country other than Pakistan, jurisdiction over claims under this Ordinance shall be that of the Courts of competent jurisdiction in Pakistan unless specifically provided otherwise by the terms of a contract in writing. 36. Limitation.__ (1) The right to compensation under this Ordinance shall be extinguished if any action is not brought within ten years from the date of the nuclear incident and within three years from the date on which the person suffering nuclear damage had knowledge of the nuclear damage provided that the period shall in no case exceed ten years. (2) Where nuclear damage is caused by a nuclear incident involving nuclear material which at the time of the nuclear incident was stolen, lost, jettisoned or abandoned, the period established pursuant to subsection (1) shall be computed from the date of that nuclear incident, but the period shall in no case exceed twenty years from the date of the theft, loss, jettison or abandonment. 37. Re-adjustment.__ Any person suffering nuclear damage, who has brought an action for compensation within the period specified in section 36 may amend his claim to take into account any aggravation of the damage, even after the expiry of that period, provided the final judgement has not been entered. 38. Co-operation with International Organization, etc.__ In order to carry out its functions in a smooth and effective manner, the Authority may, with the prior approval of the Federal Government, enter into co-operation agreements with any other nuclear regulatory authority or international organization in respect of the peaceful uses of atomic energy pursuant to the express terms and conditions of any programme or agreement for co- operation to which such authority or organization is a party or pursuant to any other international arrangement made before or after the commencements of this Ordinance. 39. Environmental surveillance and radiation emergency plans.__ (1) The Authority shall ensure, implement and co-ordinate national programme of environmental surveillance to check any build-up of environmental radioactivity that might affect the public. Such programme shall be carried out in collaboration with various governmental, public or private bodies concerned. (2) The Authority shall ensure, co-ordinate and enforce preparation of emergency plans for action to be taken following foreseeable types of nuclear incidents that might affect the public. Such plans shall include arrangements for reporting and communication, the co- ordination of action between the various public bodies involved, the training of personnel and the provision of necessary facilities and instrumentation. (3) If the radiation from environmental contamination by radioactive material reaches a level of intensity at which public health may be endangered, the Authority shall at once notify the Federal, Provincial, local and other authorities concerned who shall immediately take, in consultation with the Authority, all necessary protective and safety measures. (4) The protective and safety measures referred to in sub-sections (1), (2) and (3) may include restrictions on the movements of persons and objects such as confining people to their homes, isolating people and objects, limiting the transfer of persons and foods, curtailing or prohibiting sales of foodstuffs, farm products and the use of water, evacuating certain zones or forbidding entry thereto, rendering dangerous objects harmless, destroying animals and dispensing of the bodies. (5) If in the opinion of the Authority it is necessary, the Civil Defence Organization, the police or other law enforcing agencies or the Armed Forces may be called upon to assist in the implementation of the measures specified in sub-section (4). 40. Appointment of officers, employees and consultants.__ (1) Subject to the provisions of sub-section (3), the Authority may appoint such officers, employees and consultants as it may consider necessary for the efficient performance of its functions on such terms and conditions as it may deem fit. (2) The Authority may also borrow the services of officers, employees and consultants of other organizations on ouch terms and conditions as may be mutually settled between the lending organization and the Authority. (3) The method and procedure of appointment and the terms and conditions of service of officers and employees shall be regulated by rules to be made with the prior approval of the Federal Government under Section 55: Provided that till such time such Rules are made under Section 55, the PAEC Service Regulations as amended from time to time shall, mutatis mutandis regulate appointments of officers and employees and the terms and conditions of their Service. 41. Funds of the Authority.__ The funds of the Authority shall comprise: (a) funds of the Commission related to the Directorate of Nuclear Safety and Radiation Protection as transferred to the Authority under section 54; (b) grants from the Federal Government; (c) grants from a Provincial Government; (d) income from the grant of authorization and issue of licence; (e) international grants; and (f) receipts from such other sources as may be approved by the Authority. 42. Budget.__ (1) The Authority shall, in respect of each financial year, submit for the approval of the Federal Government, by such date and in such form as may be prescribed by rules, a statement showing the estimated receipts and expenditures. (2) Any surplus of receipts over the actual expenditure in a year, after payment of tax, shall be remitted to the Federal Consolidated Fund and any deficit from the actual expenditure shall be made up by the Federal Government. 43. Audit and accounts.__ (1) The Authority shall maintain complete and accurate books of accounts of its actual expenses and receipts in such form and manner as the Federal Government may, in consultation with the Auditor-General of Pakistan, determine. (2) The accounts of the Authority shall be audited by the Auditor-General of Pakistan. 44. Offences.__ (1) Any person who contravenes any of the provisions of sections 19,20, 21, 22 or 23 shall be punishable with imprisonment for a term which may extend to seven years, or with fine which may extend to one million rupees, or with both. (2) Any person who fails to furnish any return required under this Ordinance or the rules and regulations made thereunder, or willfully furnishes any false return or information, or obstructs any officer or other person duly authorized under this Ordinance in the discharge of his duty thereunder, shall be punishable with imprisonment for a term which may extend to one year, or with fine which may extend to 0.25 million rupees, or with both. (3) Any operator licensed under section 19 or any person authorized under sections20, 21, 22 or 23, who contravenes any of the provisions of any rules or regulations made under this Ordinance, or any term or conditions imposed thereunder, shall be punishable with imprisonment for a term which may extend to three years, or with tine which may extend to 0.5 million rupees or with both. (4) Any person who fails to comply with, or contravenes any provisions, conditions or requirements contained under this Ordinance or the rules and regulations made thereunder or commits an offence where no penalty is elsewhere provided, shall be punishable with imprisonment for a term which may extend to six months, or with fine which may extend to 0.1 million rupees, or with both (5) All Penalties and fines recovered by the Authority shall be credited to the Federal Consolidated Fund 45. Cognizance of offences.__ (1) No Court shall take cognizance of an offence punishable under this Ordinance except upon complaint in writing made by the Authority or an officer of the Authority authorized by it. (2) Notwithstanding anything contained in the Code of Criminal Procedure, 1898 (Act V of 1898) __ (a) no Court inferior to that of a Judicial Magistrate of the first class shall try an offence punishable under this Ordinance; (b) all offences under this Ordinance shall be non-bailable; and (c) it shall be lawful for any Judicial Magistrate of the first class to pass any sentence authorized by this Ordinance. (3) The Authority, before filing a complaint under sub-section (1), shall give show cause notice and opportunity of being heard to the licensee. 46. Tribunals.__ (1) The Authority may, from amongst its professional staff, establish special tribunals for resolving disputes between its Directorates and licensees or such other matters as the Authority may assign. (2) The Authority's determinations on decisions by tribunals set up under sub-section (1) shall be deemed to be decrees of a civil court under the Code of Civil Procedure,1908(Act V of 1908). 47. Mode of recovery.__ All sums payable to the Authority under the provisions of this Ordinance and the rules and regulations made thereunder shall be recoverable as arrears of land revenue. 48. Power to exempt.__ The Authority may, by notification in the official Gazette, exempt any activity, person, class of persons, quantity of a nuclear substance or radiation facility, temporarily or permanently, from the application of all, or any of, the provisions of this Ordinance subject to such conditions, as it may specify in the notification. 49. Submission of periodical reports, etc.__ The Authority shall submit to the Federal Government periodical reports, accounts statements, or any other report at such time and at such intervals as the Federal Government may specify. 50. Discoveries and inventions to vest in the Authority.___ All rights relating to discoveries and inventions and any improvements in materials, methods, processes, apparatus or equipment made by any officer or employee of the Authority in the course of his employment shall vest in the Authority. 51. Declaration of fidelity and secrecy.__ The chairman, every member, adviser, consultant, officer or any other employee of the Authority shall, before entering upon his duties, shall make declaration of fidelity and secrecy as may be prescribed by rules. 52. Chairman, members, etc., to be public servants.__ The Chairman, members, officers and employees of the Authority shall, when acting or purporting to, act in pursuance of any of the provisions of this Ordinance, be deemed to be public servants within the meaning of section 21 of the Pakistan Penal Code 1860(Act XLV of 1860). 53. Indemnity.__ No suit, prosecution or other legal proceedings shall lie against the Authority, the Chairman, members, officers and servants of the Authority in respect of anything which is in good faith done or intended to be done under this Ordinance. 54. Dissolution of PNRB and DNSRP and transfer of rights and liabilities of the Commission regarding DNSRP to the Authority.__ Upon commencement of this Ordinance the Pakistan Nuclear Regulatory Board (PNRB) set up under the Prime Minster's Secretariat Notification, dated the 30th October, 1994, and the Directorate of Nuclear Safety and Radiation Protection (DNSRP) of the Commission set up under the Pakistan Nuclear Safety and Radiation Protection (PNSRP) Ordinance 1984, shall stand dissolved and upon such dissolution:— (a) all assets, rights, powers, authorities and privileges, and all property, movable and immovable, cash and bank balances, reserve funds, investments and all other interests and rights in, or arising out of, such property and all debts, liabilities and obligations of whatever kind of the PNRB and of the Commissions relating to DNSRP subsisting immediately before its dissolution shall stand transferred to and vest in the Authority; (b) all officers, consultants, advisers, auditors and other employees of the PNRB and of the Commission working in the DNSRP shall have option to remain on the strength of the Commission or to join the Authority, those opting for the Authority shall, notwithstanding anything contained in any law or in any agreement, deed, document or other instrument, stand transferred to the Authority and shall be deemed to have been appointed or engaged by the Authority in accordance with the terms and conditions of service prescribed by regulations, and no officer, consultant, adviser, auditor or other employee whose services are so transferred shall be entitled to any compensation because of such transfer; and (c) all debts and obligations, incurred or contracts entered into or rights acquired and all matters and things engaged to be done by, with or for the DNSRP, or with or for the Commission related to DNSRP, before dissolution of DNSRP shall be deemed to have been incurred, entered into, acquired or engaged to be done by, with or for the Authority. 55. Power to make rules.___ The Authority may, with the approval of the Federal Government, by notification in the official Gazette, make rules for carrying out the purposes of this Ordinance. 56. Power to make regulations.__ (1) The Authority may, by notification in the official Gazette, make regulations, not inconsistent with this Ordinance and the rules, for carrying out the purposes of this Ordinance. (2) In particular and without prejudice to the generality of the foregoing power, such regulations may provide for__ (a) charging and collection of fees in connection with its licensing and regulatory functions provided that such fees shall be imposed by regulations on the basis of such published criteria as the Authority deems appropriate, taking into consideration among other criteria the nature of the activity authorized; and (b) charging of consultation fees and expenses, etc., from the applicant for any services provided, including the expenses of any consultation of experts. 57. Expenses for safety measures or medical examination.__ The expenses of any safety measures or medical examination carried out under this Ordinance or any regulations made thereunder shall be borne by the applicant. 58. Ordinance to override other laws.__ This Ordinance shall have effect notwithstanding anything contained in any other law for the time being in force. 59. Removal of difficulties.__ If any difficulty arises in giving effect to the provisions of this Ordinance, the Federal Government may make such orders not inconsistent with the provisions of this Ordinance, as may appear to it to be necessary for the purpose of removing the difficulty: Provided that no such power shall be exercised after the expiry of one year from the commencement of this Ordinance. 60. Repeal and savings.__ (1) The Pakistan Nuclear Safety and Radiation Protection Ordinance, 1984(IV of 1984), is hereby repealed. (2) All regulations, guides, regulatory requirements, procedures etc., made under the provisions of the Pakistan Nuclear Safety and Radiation Protection Ordinance, 1984, and in force immediately before the commencement of this Ordinance, shall, mutatis mutandis and in so far as they are not inconsistent with any of the provisions of this Ordinance, shall continue in force until repealed or altered by rules or regulations made under this Ordinance."
}