{
  "file": "administrator03c531e7f7d81cd4c6261f24b42be93a.pdf",
  "law_name": "Corporate And Industrial Restructuring Corporation Ordinance, 2000",
  "text": "THE NON-PERFORMING ASSETS AND REHABILITATION OF INDUSTRIAL UNDERTAKINGS (LEGAL PROCEEDINGS) ORDINANCE 2000 CONTENTS l. Short Title, extent and commencement 2. Definitions 3. Ordinance to override other laws 4. Jurisdiction of High Court 5. Procedure and Power of High Court 6. Transfer of Pending proceedings and institution of new cases 7. Institution of suits etc, by the Corporation 8. Trial of cases 9. Procedure of Verification Committee to apply to proceedings not transferred or instituted under this Ordinance 10. Execution of decree, and sale of assets of the obligor 11. Sale of Assets in Winding up Proceedings by the High Court 12. Outstanding liability and entitlement of obligor 13. Inter Creditor matters 14. Provisions relating to certain offences 15. Transfer of Non-performing assets 16. Cognizance of offences 17. Non-functioning assets 18. Appeal 19. Progressive application 20. Rules 21. Removal of difficulties THE NON-PERFORMING ASSETS AND REHABILITATION OF INDUSTRIAL UNDERTAKINGS (LEGAL PROCEEDINGS) ORDINANCE, 2000 ORDINANCE No. LVIII of 2000 [17th November, 2000] An Ordinance to provide for expeditious legal remedies for matters relating to non-performing assets and recovery of the outstanding amounts payable to banks and financial institutions to make them attractive for privatization and to promote the revitalization of nation’s economy and rehabilitation and restructuring of industrial undertakings WHEREAS it is expedient in the public interest to provide for expeditious legal remedies in the matters relating to non-performing assets and recovery of the outstanding amounts payable to the banks and the financial institutions to make them attractive for privatization and to promote national economy by making provisions for restructuring, rehabilitation, management, sale, transfer and realization of non-performing assets and loans and for matters connected therewith or ancillary thereto; AND WHEREAS the National Assembly and the Senate stand suspended in pursuance of the Proclamation of Emergency of the fourteenth day of October, 1999 and the Provisional Constitution Order No. 1 of 1999; AND WHEREAS the President is satisfied that circumstances exist which render it necessary to take immediate action; NOW, THEREFORE, in pursuance of the Proclamation of Emergency of the fourteenth day of October, 1999, and the Provisional Constitution Order No. 1 of 1999, as well as the Provisional Constitution (Amendment) Order, 1999 (Order No. 9 of 1999), and in exercise of all powers enabling him in that behalf, the President of the Islamic Republic of Pakistan is pleased to make and promulgate the following Ordinance:___ l. Short Title, extent and commencement:___ (1) This Ordinance may be called the Non- performing Assets and Rehabilitation of Industrial Undertakings (Legal Proceedings) Ordinance, 2000. (2) It extends to the whole of Pakistan. (3) It shall come into force at once. 2. Definitions:___ (1) In this Ordinance, unless there is anything repugnant in the subject or context,— (a) “chief Executive” means the Chief Executive officer of the Corporation appointed under the CIRC Ordinance; (b) “CIRC Ordinance” means the Corporate and Industrial Restructuring Corporation Ordinance, 2000 (L of 2000). (c) “Corporation” means the Corporate Industrial Restructuring Corporation established under the CIRC Ordinance; (d) “industrial undertaking” means any undertaking pertaining or relating to non- performing asset of a financial institution; (e) “financial asset” means any short, medium or long term interest and non-interest bearing loan, finance advance, lease, installment, term finance certificate, participation term certificate, musharaka, modaraba, profit and loss sharing agreement, redeemable capital, guarantee or contractual right to receive payment of money in respect of sums advanced or committed to an obligor by a financial institution including collateral pertaining thereto; 1[(f) “financial institution” means any bank or other financial institution operating in Pakistan wherein the Federal Government hold any equity, as specified in the Schedule;] (g) “non-performing asset” means any financial asset- (a) which is held as an asset on the books of a financial institution; (b) with respect to which the obligor has been in arrears on any payment obligation for a period more than three hundred and sixty-five days, including- (i) collateral with respect to any financial asset; and (ii) a whole or partial right or interest of a financial institution in any financial asset, that otherwise constitutes a non-performing asset including a financial asset with respect to which the financial institution has an ongoing funding obligation; and (c) with respect to which the obligor’s outstanding payment obligation to any financial institution exceeds thirty million rupees: Provided that the Federal Government may, by notification in the official Gazette, alter, reduce or increase the said amount as and when it deems fit; (h) “obligor” means any individual, proprietorship concern, company or other body corporate, trust, partnership or other entity that has, with respect to a non- performing asset, a contractual or legal obligation or duty to make payment, effect performance, provide security, or collateral with respect to any financial asset whether as principal, surety, guarantor or otherwise and whether such obligation is primary, secondary, matured or contingent; and (i) registered interest” means any right or interest in a non-performing asset duly registered under the Companies Ordinance, or its predecessor statue or under 1984 any other law for the time being in force; (j) “rules” means the rules made under this Ordinance; and (k) “Schedule” means the Schedule annexed to the CIRC Ordinance. (2) All other terms and expressions used but not defined in this Ordinance shall have the meanings assigned to them in the CIRC Ordinance. 3. Ordinance to override other laws:___ The provisions of this Ordinance shall have effect notwithstanding anything contained in any other law for the time being in force. 4. Jurisdiction of High Court:___ (1) Notwithstanding anything contained in any other law for the time being in force and subject to provisions of this Ordinance, the High Court of a Province within its territorial jurisdiction shall exercise exclusive civil and criminal jurisdiction: (a) to adjudicate and decide all claims, legal proceedings, cases for recovery of non- performing asset, outstanding amount against obligor and matters related to, arising from or in connection with the CIRC Ordinance, and coming within the purview and operation of the provisions of CIRC Ordinance and whether pending on the commencement of this Ordinance or transferred to the High Court in pursuance of section 6 or which may be filed hereafter under this Ordinance; and (b) to try offences punishable under this Ordinance or the CIRC Ordinance. (2) It is hereby declared for removal of doubt that subject to the provisions of this Ordinance, and save as herein provided, a High Court and any other Court of Tribunal shall continue to exercise jurisdiction as before under the Code of Civil Procedure, 1908, (IV of 1908) the Banking Companies (Recovery of Loans, Advances, Credits and Finances) Act, 1997, (XV of 1997) the Companies Ordinance, 1984, (XLVII of 1984) the Code of Criminal Procedure, 1898, the Offences in Respect of Banks (Special Courts) Ordinance, 1984(IX of 1984) and any other law for the time being in force, in all suits, cases and legal proceedings whether civil or criminal, applications and appeals to which the provisions of CIRC Ordinance and this Ordinance do not apply. Explanation.—The “High Court” within the meaning of subsection (2) shall also include the “High Court” as referred to in section 2 of the Banking Companies (Recovery of Loans, Advances, Credits and Finance) Act 1997. (XV of 1997) (3) For the purposes of this Ordinance there shall be one or more Benches in the High Court consisting of one or more Judges to be constituted by the Chief Justice to adjudicate the cases under this Ordinance. (4) The Chief Justice of a High Court may for the purposes of this Ordinance suo moto or on an application of any party to the proceedings before it or for any other sufficient reason assign one or more cases covered under sub-sections (1) and (2) to any Bench of High Court constituted under sub- section (3) for trial where the subject matter of the claim or controversy is the same or the parties are substantially the same or where common question of law and fact are involved in relation to a non- performing assets or where there is substantially common evidence relating thereto if the ends of justice so require. (5) The cases under this Ordinance shall ordinarily be lead at the principal seat of the concerned High Court: Provided that the Chief Justice may for sufficient cause order a case to be heard at any permanent Branch of a High Court if in his opinion the same is necessary for convenience of the Parties and ends of Justice. 5. Procedure and Power of High Court:___ Subject to the provisions of this Ordinance, the High Hour under this Ordinance shall— (i) in exercise of its civil jurisdiction,— (a) follow the procedure, as nearly as possible, as provided in the Code of Civil Procedure, 1908: (Act V of 1908) Provided that the High Court may, in its discretion, having regard to the facts of the case, follow the summary procedure, as nearly as possible, provided for in Order XXXVII in the First Schedule to the said Code; and (b) have all the powers, including passing of decree and its execution, as vested in the Civil Court under the Code of Civil Procedure, 1908; (Act V of 1908) and (ii) in exercise of its criminal jurisdiction follow the procedure and exercise the powers vested in it by or under the Code of Criminal Procedure, 1898 (Act V of 1998) or the Offences in Respect of Banks (Special Courts) Ordinance, 1984 (Act IX of 1984)or any other law for the time being in force. (iii) in exercise of its banking jurisdiction, shall follow the procedure and have all the powers including passing of decree and its execution as vested in a Banking Court under the Banking Companies (Recovery of Loans, Advances, Credits and Finances) Act, 1997 (Act of 1997) subject to such limitations and defence as provided under the said law, and (iv) in exercise of its company jurisdiction, follow the procedure and have all the powers vested in a High Court under the Companies Ordinance, 1984 (Act XLVII of 1984) subject to such defence as is available under the said law. 6. Transfer of Pending proceedings and institution of new cases:___ (1) All such legal proceedings, suits, applications and cases pertaining to the obligor in relation to the non-performing assets and the collateral related thereto in which the Corporation has acquired all rights, title, interests, benefits and privileges of a financial under the CIRC Ordinance after approval duly granted by the Board of Directors constituted thereunder and after such cases are approved by the Board as coming within the purview and operation of the provisions of CIRC Ordinance and due compliance thereof, including (a) proceedings following the filing of an arbitration award, (b) applications under sub- section (2) of section 12 of Code of Civil Procedure, 1908 (Act V of 1908) or any suits, applications, including execution applications, legal proceedings or appeals thereunder, and (c) proceedings for the execution of a decree within the jurisdiction of any Court including those, pending in any Banking Court constituted under the Banking Companies (Recovery of Loans, Advances, Credits and Finances Act, 1997, (Act XV of 1997) or any other Court, Tribunal or a High Court, and (b) any winding up proceedings irrespective of the appointment of liquidator, shall stand transferred or be deemed to be transferred to the High Court having jurisdiction under this Ordinance in the manner herein provided. (2) On transfer of proceedings under sub-section (1), the High Court shall require the attendance of the parties and the liquidators or the court auctioneer or the receiver, as the case may be. (3) The High Court shall subject to the provisions of this Ordinance, proceed in respect of proceedings transferred to it under sub-section (1) from the stage which the proceedings had reached immediately prior to the transfer and shall not be bound to recall and re-hear any witness and may act on the evidence already recorded before the Court or Tribunal from which the proceedings were transferred. (4) The Corporation shall with the permission of the High Court submit to it the particulars and the details of the cases triable on transfer under this Ordinance and any document and statement of accounts required at the time of transfer or institution of the cases under this Ordinance shall be provided to the Corporation, on its request, by the concerned financial institution. (5) Notwithstanding the provisions of the Companies Ordinance, 1984 (Act XLVII of 1984) or any other law for the time being in force, in cases transferred to the High Court under sub-section (I) in which a liquidator or a court auctioneer or a receiver has already been appointed, the Corporation may apply to the High Court for replacing the existing liquidator or a court auctioneer or a receiver, as the case may be, in respect of the non-performing asset or undertaking thereof and the High Court shall thereupon appoint the Chief Executive of the Corporation or his nominee in place of the liquidator or a court auctioneer or a receiver, as the case may be, to carry out all acts and exercise all powers of the liquidator or a court auctioneer or a receiver as it may deem fit, and accordingly the outgoing liquidator or a court auctioneer or a receiver, as the case may be, shall be under obligation to hand over possession and custody of the entire property and industrial undertaking in his possession and control along with the entire record to the Chief Executive or his nominee: Provided that High Court may allow the existing liquidator to function as co-liquidator having regard to the progress of the work done by him for reasons to be recorded: Provided further that after the commencement of this Ordinance, the High Court may appoint the Chief Executive or his nominee as a liquidator or an auctioneer or a receiver, as the case may be, in all cases instituted under this Ordinance: Provided further that the provisions of this sub-section shall not apply where an Official Assignee has already been appointed to act in any case in respect of the non-performing asset or industrial undertaking by a High Court whose rules provide for the appointment of such Official Assignee: Provided further that where the rules of a High Court provide for the appointment of an Official Assignee, the Corporation may apply to such High Court for the appointment of Chief Executive of the Corporation or his nominee as co-liquidator in appropriate cases and the High Court in such cases may pass such order as it deems fit having regard to the facts and circumstances of the cases. (6) In the cases instituted under this Ordinance, the Chief Executive or his nominee shall be appointed as a liquidator or a court auctioneer or a receiver, as the case may be. On being appointed as such by the High Court under sub-section (5) or under this sub-section, the liquidator or the court auctioneer or the receiver, as the case may be, shall be responsible to render account, perform all functions and attend to all matters in accordance with the provisions of the Companies Ordinance, 1984 (XLVIII of 1984) and the rules and orders of the High Court or in any other manner the High Court deems fit. 7. Institution of suits etc, by the Corporation:___ The Corporation may institute, file, conduct and defend any suit or legal proceeding or appeal under, and in accordance with, the provisions of this Ordinance and the High Court shall conclude such suit or legal proceeding within a period of ninety days. 8. Trial of Cases:___ (1) Subject to the provisions of this Ordinance, all suits, cases, legal proceedings including execution proceedings and all other applications and appeals relating to recovery of outstanding amounts by or against a financial institution in respect of a non-performing asset and an obligor pending in any court or tribunal on the commencement of this Ordinance under any law including the Code of Civil Procedure, 1908, (Act V of 1908) Banking Companies (Recovery of Loans, Advances, Credits and Finances) Act. 1997 (Act XV of 1997) and Companies Ordinance, 1984 (Act XLVII of 1908) and transferred to the High Court in pursuance of section 6 shall be decided and disposed of by the High Court in accordance with the provisions of the respective law under which the same were filed or instituted: Provided that in cases where the obligor has filed any suit, application, legal proceeding or appeal against a financial institution which has also filed a legal proceeding against the obligor, any party to such proceeding may apply to Chief Justice of the High Court with a prayer for consolidation of such proceedings under this Ordinance before the same Bench to avoid conflict of judicial decisions and multiplicity of proceedings. (2) Subject to the provisions of this Ordinance, the Corporation may institute and file any suit, case or legal proceedings, including execution proceedings, before the High Court having jurisdiction hereunder in accordance with the procedure provided under the Banking Companies (Recovery of Loans, Advances, Credits and Finances) Act. 1997 (Act XV of 1997) the Companies Ordinance, 1984 (Act XLVII of 1984) or the Offences in Respect of Banks (Special Courts) Ordinance, 1984 (Act IX of 1984) and the High Court shall have the power to deal with such cases in accordance with the provisions of such legislations. (3) In case any obligor intends to file any suit, application or legal proceedings against the Corporation, he may file such suit, application or legal proceedings in accordance with the. provisions of the Banking Companies (Recovery of Loans, Advances, Credits and Finances) Act. 1997 (Act XV of 1997) or any other relevant law. (4) Subject to sub-section (3), any right available to a banking company or the borrower under the Banking Companies (Recovery of Loans, Advances, Credits and Finances) Act, 1997 (Act XV of 1997) or the Companies Ordinance, 1984 (Act XLVII of 1984) or the Offences in Respect of Banks (Special Courts) Ordinance, 1984 (Act IX of 1984) shall be available to the Corporation or the obligor, as the case may be, under this Ordinance. (5) It is hereby declared for removal of doubt that the cases to be instituted and filed hereunder shall only be in relation to the non-performing assets and the collateral related thereto in which the Corporation has acquired all rights, title, interest, benefits and privileges of a financial institution under the CIRC Ordinance. 9. Procedure of Verification Committee to apply to proceedings not transferred or instituted under this Ordinance:___ (l) In all cases and Legal proceedings, for recovery of non- performing assets and matters relating thereto, or arising therefrom, which are pending in any court or tribunal, or filed hereafter, under the Code of Civil Procedure, 1908, (Act v of 1908) the Banking Companies (Recovery of Loans, Advances. Credits and Finances) Act, 1997 (Act XV of 1908) and the Companies Ordinance, 1984, (Act XLVII of 1984) where there is a bona fide dispute relating to liability of the obligor in respect of the non-performing assets or cases relating thereto,, including cases of fraud, mis-representation, or breach of any provision of law, rules, regulation and the circulars of the State Bank, regarding the calculation, existence and repayment of a financial obligation or outstanding loan, mark up or interest claimed against an obligor and also including cases under section 12(2) Code of Civil Procedure, 1908(Act V of 1908) section 305 of the Companies Ordinance, 1984 (Act XLVII of 1984) for winding up, such court or tribunal, as the case may be may while adjudicating, make correct calculation to determine the existence and repayment of such financial institution as defined in CIRC Ordinance, and follow the provisions of sections 10 and 11 of the said Ordinance which shall mutatis mutandis apply to all such cases and legal proceedings, as nearly as possible, and such court or tribunal is empowered to take all such measures or steps and pass such orders and issue such directions including the constitution of the Verification Committee, as it may deem lit in the ends of justice having regard to facts of the case, keeping in view the provisions of sections 10 and 11 of CIRC Ordinance. (2) For removal of doubt, it is hereby declared that the provisions of sub-section (1). shall not apply to cases of non-performing assets of a financial institution in Which the Corporation has acquired all rights and interests and are transferred or instituted under this Ordinance after compliance with the C.I.R.C. Ordinance. 10. Execution of decree, and sale of assets of the obligor:___ (1) Subject to provisions contained in this Ordinance or any other law for the time being in force, the High Court may on the written application of decree holder, forthwith order execution of the decree in the manner provided herein. (2) On the passing of the order for the execution of the decree under sub-section (1), the decree holder shall give an opportunity to the judgement-debtor to satisfy the decree in cash within a period of thirty days. (3) In the event the judgement-debtor fails to pay in cash as provided in sub-section (2), the title of the collateral together with transfer of valid title shall, after passing of the order of the High Court confirming the transfer of title, vest in the Corporation, and such order of confirmation shall constitute and confer sufficient power and authority for the Corporation to sell or cause or arrange for the sale of the collateral together with transfer of valid title by the Corporation. (4) Where the judgement debtor or any person claiming through the judgement debtor or any person acting on his behalf does not voluntarily hand over vacant physical possession of the mortgaged property or the possession of the collateral once vested in the Corporation, the High Court, on the application of the Corporation, or the purchaser may order that the Corporation or, as the case may be, the purchaser, be put in physical possession of the collateral including the mortgaged property after evicting or taking possession from such person in any manner deemed fit by the High Court. (5) The sale of the collateral or any part thereof by the Corporation pursuant to sub-section (3) shall be either by public auction or inviting sealed tenders subject to the orders of confirmation by the High Court. (6) Where the Corporation wishes to sell a collateral property by inviting sealed tenders, it shall invite offers through advertisements in one English and one Urdu newspaper which are circulated widely in the city in which the property is situated or located giving not less than thirty days time after publication of advertisement for submitting offers. The sealed tenders shall be opened in the presence of the tenderers or their representatives or such of them as attend. (7) Where the collateral property has been sold by the Corporation under sub-section (6), the Corporation shall present a proper account of the proceeds to the Court within fifteen days from the date of the realization of the proceeds. 11. Sale of Assets in Winding up Proceedings by the High Court:___ (1) In respect of cases transferred to the High Court in which new liquidator has been appointed or an Official Assignee is already appointed with or without co-liquidator, and in respect of the new cases instituted hereunder under the Companies Ordinance 1984, (Act XLVII of 1984) the Court shall on the written application of the liquidator or the Official Assignee, or co-liquidator, as the case may be, forthwith order the sale of the collateral. On the passing of the said order by the Court, the liquidator or the co-liquidator or the Official Assignee, as the case may be, shall advertise in one English and one Urdu newspaper which is circulated widely in the city in which the collateral is situated or located for the sale of the collateral within a period of thirty days subject to the order of confirmation by the High Court. (2) In the event the collateral is not sold pursuant to the advertisement, the title of the collateral together with transfer of valid title, shall, after passing of the order of the High Court confirming the transfer of title, vest in the Corporation and such order of confirmation shall constitute and confer sufficient power and authority on the Corporation to sell or cause or arrange for the sale of the collateral together with transfer of valid title. (3) After the sale of the collateral as aforesaid, the obligor shall stand wound up by the Court and the liquidator or liquidators or the Official Assignee, as the case may be, in accordance with the provisions of the Companies Ordinance, 1984 (Act XLVII of 1984) subject to the claims of creditors, shareholders and payment to those entitled under the law. including the Companies Ordinance, 1984 (Act XLVII of 1984). 12. Outstanding liability and entitlement of obligor:___ (1) In case the decretal amount is not satisfied after the sale of the collateral or industrial undertaking, the obligor shall remain liable for the amount remained unsatisfied under the decree. (2) In case the amount received from the sale of the collateral is in excess of the decretal amount, such excess shall be returned to the obligor after deducting necessary expenses and subject to any restriction imposed under any other law for the time being in force. 13. Inter Creditor matters:___ Nothing contained herein shall affect the rights and interests of other creditors. Without prejudice to such rights, with respect to any non-performing asset which represent a partial right or interest, including an interest in a syndicated finance or loan facility in any financial asset, any individual entity irrespective of it being a financial institution or not, having a partial right or interest in the same shall be entitled to apply to the Corporation for appropriate relief and the Corporation shall compensate the non-financial institution having an interest in the syndicated finance or loan facility proportionate to their registered interest in the net proceeds realised from the sale, lease or other disposition of any collateral in respect of the non-performing asset subject to the confirmation of the High Court 14. Provisions relating to certain offences:___ (1) Whoever— (a) dishonestly commits a breach of the terms of a letter of hypothecation, trust receipt or any other documents or instruments executed by him whereby possession of the property offered as scrutiny for the finance or loan pertaining to the non-performing assets or any obligation is not with the Corporation but is retained by or entrusted to him for the purposes of dealing with it in the normal course of business subject to the terms of the letter of hypothecation or trust receipt or other instrument or document or for the purpose of effecting the sale and depositing the sale proceeds with the Corporation; or (b) makes fraudulent misrepresentation or commits a breach of any commitment or representation made to the Corporation with regard to furnishing of security in favour of the Corporation on the basis of which the financial institution was induced into granting a finance or loan pertaining to the non-performing assets, as the case may be; or (c) subsequent to the creation of a mortgage as a collateral, dishonestly parts with the possession of the mortgaged property whether by creation of a lease or otherwise contrary to the terms thereof without the written permission of the Corporation; shall, without prejudice to any other action which may be taken against him under this Ordinance or any other law for the time being in force, be punishable with imprisonment of either description for a term which may extend to one year or fine equal in value to the property or security or cheque, as the case may be, or with both and may be ordered by the High Court trying the offence to also deliver up, refund or pay within a time to be fixed by the High Court, the property or the value of the property or security or cheque so dealt with. (2) Whoever knowingly made a statement which was false in material respects in an application for finance or loan pertaining to the non-performing assets and obtained finance or loan pertaining to the non-performing assets on the basis thereof, or applied the amount of the finance or loan pertaining to the non-performing assets towards a purpose other than that for which the finance or loan pertaining to the non-performing assets was obtained by him, or furnished a false statement of stock in violation of the terms of the agreement with the Corporation, shall be guilty of an offence punishable with imprisonment of either description for a term which may extend to one year, or with fine, or with both. (3) Whoever resists or obstructs, either by himself or on behalf of the judgement debtor, through the use of force, the execution of a decree in respect of non-performing assets, shall be punishable with imprisonment which may extend to one year, or with fine, or with both. (4) Whoever dishonestly issues a cheque in respect of non-performing assets, which is dishonoured, shall be punishable with imprisonment which may extend to one year, or with fine or with both, unless he can establish, for which the burden of proof shall rest on him, that he had made arrangements with his bank to ensure that the cheque would be honoured and that the bank was at fault in not honouring the cheque. (5) Where the person guilty of an offence under this Ordinance is a company or other body corporate, the chief executive by whatever name called, and any director or officer involved shall be deemed to be guilty of the offence and shall be liable to be proceeded against and be punished accordingly. (6) All offences under this Ordinance shall be bailable, non-cognizable and compoundable. 15. Transfer of Non-performing assets:___ Subject to provisions contained in this Ordinance or any other law for the time being in force or in any contract between the financial institution and the obligor, on the issuance of the transfer letter by the Corporation to the concerned financial institution under the CIRC Ordinance or the rules framed thereunder, all rights, title, interest, benefits and privileges of a financial institution in the non-performing assets and the collateral related thereto shall, without the necessity or any further action or instrument, be deemed vested, transferred, assigned, sold and conveyed by the financial institution to the Corporation free of any encumbrance or claim save for any registered interest outstanding as at the date of the transfer letter: Provided that any pre-existing funding commitment or obligation by a financial institution to an obligor being a corporation or other body corporate whose project is functional shall, in addition to the security therefore, continue to subsist in the financial institution including all defences pertaining thereto 16. Cognizance of offences:___ The High Court may, sua moto or on a complaint filed by the Corporation or by a person authorised by it in writing, take cognizance of any offence under this Ordinance or CIRC Ordinance and try the same as provided in this Ordinance. 17. Non-functioning assets:___ Notwithstanding anything contained in this Ordinance or any other law for the time being in force, where a non-performing asset or an industrial undertaking is closed and non-functioning for the last two years or more, the High Court, keeping in view the facts and circumstances of each case and the purposes of this Ordinance, may order on the application of the Corporation, its immediate sale or transfer or lease or for change of management through public bid on such terms and in such manner as the High Court may deem fit. Explanation:___ For the purposes of the above period of closure it would be deemed to be sufficient for the purpose of this Ordinance that the non-periforming asset or the industrial undertaking remained closed for a total period of eighteen months out of twenty-four months. 18. Appeal:___ (1) Any person aggrieved by a decree, or an order including an order refusing to set aside a decree, or an order permitting or preventing the sale of property, or a sentence passed by a High Court may, within thirty days of such order, decree or sentence, prefer an appeal to the larger Bench of the High Court, within whose jurisdiction the order, Judgment, decree or sentence is passed: Provided that the admission of the appeal shall not perse operate as a stay, and nor shall any stay be granted therein unless the appellant deposits in cash with the High Court an amount equivalent to the amount due, or, at the discretion of the High Court, furnishes security equal in value to such amount; and in the event of a stay being granted for a part of the decretal amount only the requirement for a deposit in cash or furnishing of security shall stand reduced accordingly: Provided further that where the claim of the decree-holder is based on the default of the defendant in payment of agreed installments, the deposit shall be made or, as the case may be, the security furnished to the extent of the amount of installments in default. (2) The High Court shall at the stage of admitting an appeal, or at any time thereafter either suo moto, or on the application of the decree holder, decide by means of a reasoned order whether the appeal is to be admitted in part or in whole depending on the facts and circumstances of the case. (3) An appeal under sub-section (1) shall be heard by a bench of not less than two Judges and, in case the appeal is admitted, it shall be decided within ninety days from the date of admission. (4) An appeal may be preferred under this section from a decree passed ex parte. (5) No appeal, review or revision shall lie against any interlocutory order of the High Court. (6) Any person aggrieved by a final order, judgment, decree or sentence passed under the appeal before a bench of not less than two Judges may, within thirty days of such order, judgment, decree or sentence prefer an appeal to the Supreme Court. 19. Progressive application:___ The CIRC Ordinance and this Ordinance shall be progressively applied to financial institutions. 20. Rules:___ The Federal Government may, by notification in the Rules, official Gazette, make rules for carrying out the purposes of this Ordinance. 21. Removal of difficulties:___ if any difficulty arises in giving effect to any provision of this Ordinance the Federal Government may, by order, published in the official Gazette, make such provision not inconsistent with the provisions of this Ordinance as may appear to it to be necessary for the purpose removing such difficulty."
}