{
  "file": "administrator2c29e2a637d806dbaa9c78a34c8642da.pdf",
  "law_name": "Pakistan Navy Ordinance, 1961",
  "text": "THE DEFENCE SERVICES (INQUIRY) (SPECIAL PROVISIONS) ORDINANCE, 1969 CONTENTS 1. Short title and commencement 2. Definitions 3. Inquiry into the conduct of certain persons subject to service law 4. Convening of board of inquiry 5. Composition of a board of inquiry, etc. 6. Power to make rules THE DEFENCE SERVICES (INQUIRY) (SPECIAL PROVISIONS) ORDINANCE, 1969 1ORDINANCE NO. XIX OF 1969 [18th July, 1969] AN ORDINANCE to make provision for a uniform procedure for inquiring into the conduct of a member of a Defence Service serving otherwise than in an organization or unit of his service. WHEREAS it is expedient to make provision for a uniform procedure for inquiring into the conduct of a member of a Defence Service serving otherwise than in an organization or unit of his service and for matters ancillary thereto; NOW, THEREFORE, in pursuance of the Proclamation of the 25th day of March, 1969, read with the Provisional Constitution Order, and in exercise of all powers enabling him in that behalf, the President is pleased to make and promulgate the following Ordinance:___ 1. Short title and commencement.___(1) This Ordinance may be called the Defence Services (Inquiry) (Special Provisions) Ordinance, 1969. (2) It shall come into force on such date as the Central Government may, by notification in the official Gazette, appoint. 2. Definitions.—In this Ordinance, unless there is anything repugnant in the subject or context,___ (a) “board of inquiry” means a board of inquiry convened under this Ordinance; (b) “2[Chief of Staff]”, in relation to a person whose conduct in inquired into under this Ordinance, means the 2[Chief of Staff] of the service to which such person belongs; (c) “commanding officer”, in relation to a person subject to this Ordinance, means the head of the organization or the commanding officer for the purpose of the service law of the unit in or to which such person is for the time being serving or attached; (d) “serving law”, in relation to a person whose conduct is inquired into under this Ordinance, means the Pakistan Army Act, 1952 (XXXIX of 1952), the Pakistan Air Force Act, 1953 (VI of 1953), or the Pakistan Navy Ordinance, 1961 (XXXV of 1961), to which such person is subject; (e) “unit” includes a naval ship, vessel or establishment of which there is a commanding officer for the purposes of the Pakistan Navy Ordinance, 1961 (XXXV of 1961). 1 The Ordinance has been declared to be validly made by the competent authority, through the Validation of Laws Act No. LXIII of 1975, s.2. 2 Subs. by Federal Adaptation of Laws Order, 1975 (P.O. No. 4 of 1975), Art. 2 and Sch. 3. Inquiry into the conduct of certain persons subject to service law.—The conduct of a person subject to a service law shall, notwithstanding anything contained in such law, be inquired into by a board of inquiry in accordance with the provisions of this Ordinance and the rules made thereunder where the conduct to be inquired into___ (a) relates to a period when he was serving or attached, except on secondment, in or to an organization or unit other than that of the service to which he belongs, or (b) is that of such person together with that of another person who was not, during the period to which the conduct relates, subject to the same service law. 4. Convening of board of inquiry.—Where the conduct to be inquired into under section 3 is that of the commanding officer or that of the commanding officer together with the conduct of another person, a board of inquiry shall be convened by the 1[Chief of Staff] of the service to which the commanding officer belongs and, in any other case, by the commanding officer. 5. Composition of a board of inquiry, etc.___(1) A board of inquiry shall consist of a president and such other persons and be convened in such manner, and the inquiry shall be conducted in accordance with such procedure, as may be prescribed by rules. (2) The president of a board of inquiry shall, after the conclusion of the inquiry, submit to the authority convening the board the proceedings of the board alongwith its findings and recommendations. (3) Upon the receipt of the proceedings of a board of inquiry submitted to him under sub- section (2), the commanding officer shall___ (a) if the inquiry relates to any matter which he is himself competent to dispose of, take the necessary action and forward a copy of the proceedings to the 1[Chief of Staff], informing him of the action taken by him; (b) if the inquiry relates to a matter which is not of the nature mentioned in clause (a), forward the proceedings together with his recommendations, to the 1[Chief of Staff]. (4) Upon the receipt of the proceedings of a board of inquiry submitted to him under sub- section (2), or forwarded to him under clause (b) of sub-section (3), the 1[Chief of Staff] shall direct that the person to whom the proceedings relate be dealt with in the manner authorised by the service law. (5) For the purpose of taking any action under the service law, the proceedings of a board of inquiry convened under this Ordinance may be acted upon as if they were proceedings of a board of inquiry or court of inquiry assembled under such law. 1 Subs. by Federal Adaptation of Laws Order, 1975 (P.O. No. 4 of 1975), Art. 2 and Sch. 6. Power to make rules.___(1) The 1[Federal Government] may make rules for carrying out the purposes of this Ordinance. (2) In particular and without prejudice to the generality of the foregoing power, such rules may provide for all or any of the following matter, namely:___ (a) the composition of a board of inquiry; (b) the manner of convening a board of inquiry; (c) the procedure for the conduct of inquiry; and (d) such other matters as may be necessary for carrying out the purposes of this Ordinance. RGN Uploaded Date: 27.03.2024 1 Subs. by Federal Adaptation of Laws Order, 1975 (P.O. No. 4 of 1975), Art. 2 and Sch."
}