{
  "file": "administrator07d9e49158ba80ccd546ad885d7ec6c5.pdf",
  "law_name": "THE DISABLED PERSONS (EMPLOYMENT AND REHABILITATION) ORDINANCE, 1981.",
  "text": "THE DISABLED PERSONS (EMPLOYMENT AND REHABILITATION) ORDINANCE, 1981. CONTENTS 1. Short title, extent and commencement 2. Definitions 3. National council 4. Functions of the National Council 5. Provincial Councils 6. Functions of the Provincial Councils 7. Meetings of the Councils 8. Duties of Secretary 9. Appointment of Committee 10. Establishments to employ disabled persons 11. Establishment to pay the fund 12. Registration of disabled persons 13. Establishment of training centers 14. Establishments to furnish information 15. Power to debar further employment 16. Appeal 17. Fund 18. Power to exempt 19. Delegation of power 20. Penalty 21. Cognizance of offences, etc. 22. Power to make rules THE DISABLED PERSONS (EMPLOYMENT AND REHABILITATION) ORDINANCE, 1981. ORDINANCE No. XL OF 1981 [29th December, 1981] An Ordinance to provide for the employment, rehabilitation and welfare of disabled persons. WHEREAS it is expedient to provide for the employment rehabilitation and welfare of disabled persons and for matters connected therewith. AND WHEREAS the president is satisfied that circumstances exist which render it necessary to make immediate action; NOW, THEREFORE, in pursuance of the Proclamation of the fifth day of July, 1977, read with the Provisional Constitution Order, 1981 (C.M.L.A. Order No.1 of 1981), and in exercise of all powers enabling him in that behalf, the President is pleased to make and promulgate the following Ordinance :— 1. Short title, extent and commencement.—(1) This Ordinance may be called the Disabled Persons (Employment and Rehabilitation) Ordinance, 1981. (2) It extends to the whole of Pakistan. (3) It shall come into force on such 1day as the Federal Government may, by notification in the official Gazette, appoint. 2. Definitions. In this Ordinance unless there is anything repugnant in the subject or context,— (a) “Chairman” means the Chairman of the National Council or, as the case may be, the Provincial Council; (b) “commercial establishment” and “industrial establishment” shall have the same meaning as in the West Pakistan Industrial and Commercial Employment (Standing Orders) Ordinance, (W.P. Ordinance No. VI of 1968) 1968. (c) “disabled person” means a person who, on account of injury, disease or congenital deformity, is handicapped for undertaking gainful profession or employment in order to earn his livelihood, and includes a person who is blind, deaf, physically handicapped or mentally retarded; (d) “disease “includes the physical or mental condition arising from the imperfect development of any organ ; (e) “employee “ means a regular or whole-time employee whether employed on daily, weekly or monthly basis, and includes an apprentice; 1 i.e., on the 28th April 1982, by S.R.O. 749(I)/82, dt. 28-4-1982, see Gaz., of P. 1982, Ext., Part II, p. 1275. (f) “establishment” means a Government establishment, a commercial establishment or an industrial establishment, in which the number of workers employed at any time during a year is not less than one hundred ; (g) “Fund” means the Rehabilitation of Disabled Persons Fund established under section 17 ; (h) “Government establishment “ includes any autonomous or semi-autonomous body, university, college, professional school and any organization controlled or managed by the Federal Government or a Provincial Government ; (i) “National Council” means the National Council established under section 3; (j) “prescribed “ means prescribed by rules made by the Federal Government or, as the case may be, the Provincial Government ; (k) “Provincial Council “means a Provincial Council established under section 5; and (1) “Secretary “means the Secretary of the National Council or, as the case may be, the Provincial Council. 3. National council.—The Federal Government shall, by notification in the official Gazette, establish a Council to be called the National Council for the Rehabilitation of Disabled Persons consisting of the following members, namely :— (a) the Secretary, Ministry of Health and Social Welfare, who shall also be its Chairman; (b) One representative each of the three Armed Forces; (c) One representative of the Manpower Division; (d) One representative of the Labour Division; (e) One representative of the Health Division; (f) One representative of the Education Division; (g) One representative of the Communications Division; (h) One representative of the Ministry of Water and Power; (i) One representative of the Ministry of Petroleum and Natural Resources; (j) One representative of the Industries Division; (k) One representative of the Planning Division; (1) a nominee of the Administrator-General Zakat; (m) four persons to be nominated by the Federal Government from amongst the persons engaged in the welfare of disabled persons; (n) one representative of the National Council of Social Welfare; (o) one representative of the registered trade unions, to be nominated by the Labour Division; and (p) the Deputy Secretary, Health and Social Welfare Division dealing with social welfare, who shall also be the Secretary of the National Council. 4. Functions of the national council.— (1) Subject to any directions given by the Federal Government, the National Council shall— (a) formulate policy for the employment, rehabilitation and welfare of the disabled persons ; (b) evaluate, assess and co-ordinate the execution of its policy by the Provincial Councils ; and (c) have overall responsibility for the achievement of the purposes of this Ordinance. (2) Without prejudice to the generality of the provisions of sub-section (1) the policy may relate to— (a) the survey of the disabled persons in the country who are desirous of being rehabilitated ; (b) the medical examination and treatment of the disabled persons ; (c) the providing of training to the disabled persons ; (d) the taking of such other measures as are necessary for carrying out the purposes of this Ordinance. 5. Provincial Councils. Each Provincial Government shall by notification in the official Gazette, establish a Council to be called the Provincial Council for the Rehabilitation of Disabled Persons consisting of the following members, namely:— (a) the Secretary, Social Welfare Department, who shall also be its Chairman ; (b) the Secretary, Labour Department ; (c) one representative of the Planning and Development Department ; (d) one representative of the Manpower Department ; (e) one representative of the Health Department ; (f) one representative of the Education Department ; (g) one representative of the Communications Department ; (h) one representative of the Water and Power Department ; (i) one representative of the Chamber of Commerce ; (j) Chief Administrator of Zakat ; (k) one representative of the Social Welfare Council ; (1) one representative of the Social Services Board ; (m) one representative of the registered Trade Unions to be nominated by the Labour Department ; (n) four persons nominated by the Provincial Government from amongst the persons engaged in the welfare Work of disabled persons ; and (o) Director, Social Welfare Department, who shall also be the Secretary of the Provincial Council. 6. Functions of the Provincial Councils. Subject to any directions given by the National Council the Provincial Council shall— (a) execute the Policy made by the National Council for the employment, rehabilitation and welfare of the disabled persons; (b) undertake appropriate projects for these purposes; (c) issue directions to the Employment exchanges and other bodies for the implementation of the projects; and (d) from time to time take stock of the extent of functional disabilities of disabled persons. 7. Meetings of the Councils.— (1) The meetings of the National Council or a Provincial Council shall be held at such times and at such places as the Chairman thereof may direct and shall be presided over by such Chairman. (2) The meetings of the National Council or a Provincial Council shall be conducted in accordance with such procedure is may be prescribed, and until such procedure is prescribed, in such manner as the Chairman thereof may direct. (3) The powers and functions of the Chairman shall, in his absence, be exercised and performed by such member of the National Council or the Provincial Council as the Chairman there of may appoint. (4) The quorum to constitute a meeting of the National Council or a Provincial Council shall be four. (5) All orders and decisions of the National Council or a Provincial Council shall be authenticated by the signature of the Chairman thereof or the persons authorised by him. 8. Duties of Secretary. The Secretary shall exercise such powers and perform such functions as may be assigned to him by the Chairman. 9. Appointment of Committee. The National Council or a Provincial Council may appoint such Committee consisting of such of its member as it thinks fit, and may refer to them any matter for consideration and report: Provided that the Council may, if it considers necessary co-opt any person to a Committee. 10. Establishments to employ disabled persons.— (1) Not less than one percent of the total number persons employed by an establishment at any time shall be disabled persons whose names have been registered with the employment Exchange of the area in which such establishment is locate and against whose names in the register maintained under section 12 an endorsement exists to the effect that they are fit to work. (2) The disabled persons employed against any post in pursuance of sub-section (1) shall be entitled to the terms and conditions which are not less favourable than those of the other persons employed by the establishment against similar posts. (3) When calculating the percentage of the posts in an establishment for the purposes of employment of disabled persons, the fraction of 0.5 and above shall count as a whole number. 11. Establishment to pay to the Fund. An establishment which does not employ a disabled person as required by section 10 shall pay in to the Funds each month the sum of money it would have paid as salary or wages to a disabled person had he been employed. 12. Registration of disabled persons.—(1) Any disabled person desirous of being employed or otherwise rehabilitated may have his name registered in the register maintained by an Employment Exchange in such form and in such manner as may be prescribed by the Federal Government; and the Employment Exchange shall refer all names so registered to the Provincial Council. (2) The Provincial Council shall, if it thinks necessary, cause each disabled person registered under sub-section (1) to be assessed as to the nature of his functional disability and also as to his aptitude and the nature of work he is fit to do by a medical officer authorised by it in his behalf or by such assessing board consisting of not less than one medical officer as it may appoint, and the medical officer or, as the case may be, the assessing board shall submit its report to the Provincial Council in such form as may be prescribed by the Provincial Government. (3) If the disabled person is considered by the Provincial Council fit to work, it shall so inform the Employment Exchange, indicating the nature of work for which he may be employed or the trade or vocation in which he may be trained, and an endorsement to that effect shall be made against his name in the register. (4) If the disabled person is not considered by the Provincial Council fit to work, the Provincial Council shall inform the Employment Exchange accordingly for an endorsement to that effect being made against his name in the register, and the Provincial Council shall take such measures for his rehabilitation as it thinks fit. (5) If a person is declared by the Provincial Council not to be a disabled person, his name shall be struck off the register. 13. Establishment of training centers. The Provincial Council shall arrange for the training of disabled persons in such trades or vocations as it thinks fit, and shall establish training centres in such trades or vocations and in such manner as may be prescribed by the Provincial Government. 14. Establishments to furnish information. Every Establishment shall furnish to such person or authority such information required for the implementation of the provisions of this Ordinance in such form and in such manner as the National Council may, by notification in the official Gazette, specify. 15. Power to debar further employment.— (1) The Provincial Council may debar from further employment or training for such period as may be specified by it any disabled person who, without valid reason, refuses to accept or abandons his employment or training under this Ordinance of otherwise acts in a manner detrimental to the interests of the trade or profession in which he is employed or undergoing training. (2) No disabled person shall be debarred under sub-section (1) unless he has been given an opportunity of being heard. 16. Appeal.— (1) Any person aggrieved by an order under section 15 may prefer an appeal to the National Council within thirty days of the date of the order. (2) The National Council may call for the record of the case and may, after giving the parties an opportunity of being heard or after making such further enquiry as it thinks fit, stay or suspend the operation of the order or may pass such order as it thinks fit. 17. Fund. There shall be established by the Federal Government a Fund to be known as the Disabled Persons Rehabilitation Fund which shall comprise— (a) all sums paid by the establishment under section 11; (b) all grants if any made by the Federal Government, Provincial Governments or local bodies ; and (c) donations, if any, made by private individuals. (2) The Fund shall be administered by the National Council which shall, in consultation with the Federal Government, make such allocations to the Provincial Councils as it thinks necessary. (3) The Fund shall be utilized for— (a) the establishment of training centres for disabled persons ; (b) financial assistance to disabled persons who are not fit to undertake any employment ; (c) disbursement of stipends or scholarships to disabled persons receiving training; (d) the welfare of disabled persons ; and (e) providing artificial limbs, surgical therapy and medical treatment to disabled person. 18. Power to exempt. The Federal Government may, by notification in the official Gazette, exempt any establishment or class of establishments from the operation of all or any of the provisions of this Ordinance. 19. Delegation of power.— (1) The National Council may delegate all or any of its powers under this Ordinance to any of its members or to a Provincial Council, subject to such conditions as it may specify. (2) The Provincial Council may delegate all or any of its powers under this Ordinance, including any of the powers delegated to it under sub-section (1) to any of its members, subject to such conditions as it may specify. 20. Penalty. Any establishment which fails to pay into the Fund any sum it is required to pay under section 11 shall be punishable with fine which may extend to one thousand rupees and. in the case of non-payment of fine, with an additional fine which may extend to ten rupees for every day during which the payment of fine is not made. 21. Cognizance of offences, etc.— (1) No court inferior to that of a Magistrate of the first class shall try an offence punishable under this Ordinance. (2) No court shall take cognizance of an offence punishable under this Ordinance except upon a complaint in writing made by, or under the authority of, the National Council or the Provincial council. 22. Power to make rules.— (1) The Federal Government may, by notification in the official Gazette, make rules for carrying out the purposes of this Ordinance. (2) The Provincial Government may, by notification in the official Gazette, make rules not inconsistent with the rules made under sub-section (1) for carrying out the purposes of this Ordinance. ___________"
}