{
  "file": "administratorc63dfb5eea3af6a1649faa23aa25ee3e.pdf",
  "law_name": "THE DEVELOPMENT OF INDUSTRIES (GOVERNMENT CONTROL) ACT, 1949",
  "text": "THE DEVELOPMENT OF INDUSTRIES (GOVERNMENT CONTROL) ACT, 1949 CONTENTS 1. Short title, extent and commencement 2. Definitions 3. Declaration 3A. Power to regulate industry 4. Power to make rules 5. Rules to be subject to previous publication SCHEDULE THE DEVELOPMENT OF INDUSTRIES (GOVERNMENT CONTROL) ACT, 1949 ACT NO. XIII OF 1949 [21st March, 1949] An Act to make provision for certain matters connected with the development of industries under 1[Government Control]. WHEREAS it is expedient to make provision for certain matters connected with the development of industries under 1[Government Control]; AND WHEREAS it appears to the 2[Federal Government] to be expedient in the public interest to make such provision to the extent hereinafter appearing; It is hereby enacted as follows:___ 1. Short title, extent and commencement.___(1) This Act may be called the Development of Industries 1[Government Control] Act, 1949. 3[(2) It extends to the whole of Pakistan.] (3) It shall come into force at once. 2. Definitions. In this Act unless there is anything repugnant in the subject or context,___ (a) “industry” means any industry engaged in the manufacture or processing of specified goods or commodities and includes any industry ancillary to such an industry, and “industries” shall be construed accordingly; (b) “specified” means specified in the Schedule to this Act. 2[(c) “appropriate Government” means, in relation to industries relating to or connected with any matter enumerated in the Federal Legislative List in the Fourth Schedule to the Constitution, including industries the development whereof under Federal Control is declared by Federal Law to be expedient in the public interest, the Federal Government and, in relation to other industries, the Provisional Government]. 1Subs. by A.O., 1964, Art. 2 and Sch., for “Federal Control”. 2Subs. by F.A.O. 1975, Art. 2 and Table, for “Central Government”. 3Subs. by the Central Laws (Statute Reform) Ordinance, 1960 (21 of 1960), s. 3 and 2nd Sch. 3. Declaration. It is hereby declared that the development under 1[Government Control] of industries to which this Act applies is expedient in the public interest. 2[3A. Power to regulate industry. [In pursuance of the declaration made in the last preceding section the 3[appropriate Government] may in respect of any industry to which this Act applies, plan and regulate the setting up of any new undertaking or the development of any new or existing undertaking.] 4. Power to make rules. The 3[appropriate Government] may, by notification in the official Gazette, make rules to carry the provisions of this Act into effect. 5. Rules to be subject to previous publication.___(1) All rules made under this Act shall be subject to the condition of previous publication and the date to be specified under clause (3) of section 23 of the General Clauses Act, 1897 (X of 1897), shall not be less than one month from the date on which the draft of the proposed rules was published. (2) All such rules shall be published in the official Gazette and shall, unless some later date is appointed in such rules, come into force on the date of such publication. SCHEDULE 1. Arms and Munitions of War. 2. Cement and Cement Products. 3. Edible Oil, Hydrogenated or otherwise. 4. Electrical communications and Broadcasting equipment. 5. Electricity, including hydro-electric power. 6. Electrical equipment, appliances and goods. 7. Glass and Ceramics. 8. Heavy Chemicals. 9. Iron and Steel. 10. Machine-tools, Precision-tools, Gauges and Workshop equipment. 11. Manufactures of Heavy Engineering Industry. 12. Minerals including salt and coal. 13. Non-ferrous metals and alloy manufactures. 14. Paper, Cardboard and Pulp. 1Subs. by A.O., 1964 Art. 2 and Sch., for “Federal Control”. 2Ins. by Act No. (XLIV of 1950), s.2. 3Subs. by A. O., 1964, Art. 2 and Sch, for “Central Government”. 15. Petroleum and mineral oils. 16. Pharmaceuticals, drugs and light chemicals. 17. Power and industrial alcohol. 18. Preserved and prepared foods. 19. Products of carbonisation Industry. 20. Rubber manufactures. 21. Scientific and Mathematical instruments. 22. Sea fish and its products. 23. Ships, barges, river-boats and lighters. 24. Sugar. 25. Tanned leather and Leather goods. 26. Textiles___Cotton, Wollen, Jute, Silk and Rayon. 27. Tobacco. ______________ RGN Date: 13-06-2024"
}