{
  "file": "administrator3e1ccd4a4970f66c4da5a06c1f7bb98f.pdf",
  "law_name": "THE TRIBAL AREAS (RESTORATION OF JURISDICTION) ACT, 1964",
  "text": "THE TRIBAL AREAS (RESTORATION OF JURISDICTION) ACT, 1964 CONTENTS 1. Short title and commencement 2. Restoration of jurisdiction of the Supreme Court and the High Court 3. Extension of limitation THE TRIBAL AREAS (RESTORATION OF JURISDICTION) ACT, 1964 ACT No. II OF 1964 [7th April, 1964] An Act to restore the jurisdiction of the Supreme Court and the High Court in relation to the Tribal Areas of the Quetta Division WHEREAS clause (5) of Article 223 of the Constitution provides that neither the Supreme Court nor a High Court shall, unless the Central Legislature by law otherwise provides, exercise any jurisdiction under the Constitution in relation to a Tribal Area; AND WHEREAS before the commencement of the aforesaid clause the Supreme Court and the High Court of West Pakistan exercised certain jurisdiction in relation to the Tribal Areas of the Quetta Division; AND WHEREAS it is expedient to restore that jurisdiction to the Supreme Court and the High Court; It is hereby enacted as follows:— 1. Short title and commencement.—(1) This Act may be called the Tribal Areas (Restora- tion of Jurisdiction) Act, 1964. (2) It shall come into force at once and shall be deemed to have taken effect on the tenth day of January, 1964. 2. Restoration of jurisdiction of the Supreme Court and the High Court.— The Supreme Court and the 1[High Court of Baluchistan] shall exercise in relation to the Tribal Areas of the Quetta Division the same jurisdiction as was exercisable by 2[Supreme Court or, as the case may be, the High Court of West Pakistan] in relation to those areas before the commencement of the Constitution (First Amendment) Act, 1963 (I of 1964). 3. Extension of limitation.—Notwithstanding anything contained in any other law for the time being in force, if a period of limitation had begun to run from before the commencement of the Constitution (First Amendment) Act), 1963(I of 1964), in respect of any matter concerning which the jurisdiction of the Supreme Court and the 1[High Court of Baluchistan] is created or restored by this Act then in computing such period of limitation the period between the tenth day of January, 1964, and the date of the coming into force of this Act shall be excluded: Provided that no period of such limitation shall expire on a day earlier than the thirtieth day from such date. _______________ Date: - 21.03.2024 1Subs. by the Federal Laws (Revision and Declaration) Ordinance, 1981 (XXVII of 1981), s. 3 and Sch. 2Subs. by F.A.O., 1975 (P.O. No. 4 of 1975), Art. 2 and Sch."
}