{
  "file": "administrator35664480c3a596849090e1db1a70d36d.pdf",
  "law_name": "THE TREASURE-TROVE ACT, 1878 CONTENTS 1. Short title",
  "text": "THE TREASURE-TROVE ACT, 1878 CONTENTS 1. Short title Extent 2. [Repealed.] 3. Interpretation-clause “Treasure” “Collector” “Owner” 4. Notice by finder of treasure 5. Notification requiring claimants to appear 6. Forfeiture of right on failure to appear 7. Matters to be enquired into and determined by the Collector 8. Time to be allowed for suit by person claiming the treasure 9. When treasure may be declared ownerless 10. Proceedings subsequent to declaration 11. When no other person claims as owner of place, treasure, to be given to finder 12. When only one such person claims and his claim is not disputed, treasure to be divided 13. In case of dispute as to ownership of place, proceedings to be stayed 14. Settlement of such dispute 15. and division thereupon 16. Power to acquire the treasure on behalf of Government 17. Decision of Collector final, and no suit to lie against him for acts done bona fide 18. Collector to exercise powers of Civil Court 19. Power to make rules 20. Penalty on finder failing to give notice, etc. 21. Penality on owner abetting offence under section 20 THE TREASURE-TROVE ACT, 1878 1ACT No. VI Of 1878 [13th February, 1878] An Act to amend the law relating to Treasure-trove Preamble. WHEREAS it is expedient to amend the law relating to treasure-trove; It is hereby enacted as follows:- PRELIMINARY Short title. This Act may be called the 2* Treasure-trove Act, 1878. Extent. It extends to 3[the whole of Pakistan.] 4* * * * * * * 2. [Repeal of enactments.] Rep. by the Amending Act, 1891 (XII of 1891). 3. Interpretation-clause. In this Act- “Treasure.” “treasure” means anything of any value hidden in the soil, or in anything affixed thereto: “Col1ector.” “Col1ector” means (1) any Revenue-officer in independent charge of a district, and (2) any officer appointed by the 3[Provincial Government] to perform the functions of a Collector under this Act. “Owner.” When any person is entitled, under any reservation in an instrument of transfer of any land or thing affixed thereto, to3 treasure in such land or thing, he shall, for the purposes of this Act, be deemed to be the owner of such land or thing. PROCEDURE ON FINDING TREASURE 4. Notice by finder of treasure. Whenever any treasure exceeding in amount or value ten rupees is found, the finder shall, as soon as practicable, give to the Collector notice in writing___ (a) of the nature and amount or approximate value of such treasure; (b) of the place in which it was found; 1For the Statement of Objects and Reasons, see Gazette of India, 1876, Pt. V., p. 1463; for discussions in Council, see ibid., Supplement, pp. 1288 and 1326 ; ibid., 1878 pp. 207 and 287. This Act has been declared to be in force in Balochistan by the British Balochistan Laws Regulation, 1913 (2 of 1913), s. 3 ; It has also been extended to the Leased Areas of Balochistan, see the Leased Areas (Laws) Order, 1950 (G.G. O. 3 of 1950); and also applied in the Federated Areas of Balochistan, see Gazette of India,1937, Pt. I, p.1499. It has been applied to Phulera in the Excluded Area of Upper Tanawal to the extent the Act is applicable in the N.W.F.P., subject to certain modifications; and extended to the Excluded Area of Upper Tanawal (N.W.F.P.) other than Phulera with effect from such date and subject to such modifications as may be notified; See N.W.F.P. (Upper Tanawal) (Excluded Area) Laws Regulation, 1950. 2The word “Indian” rep. by the Federal Laws (Revision and Declaration) Act, 1951 (26 of 1951), s. 3 and II Sch. 3Subs. by the Central Laws (Statute Reform) Ordinance, 1960 (21 of 1960), s.3 and 2nd Sch. (with effect from the 14th October, 1955), for “all the Provinces and the Capital of the Federation” which had been subs. by A. O., 1949, Arts. 3(2) and 4, for “the whole of British India”. 4The words “And it shall come into force at once” rep. by the Repealing and Amending Act, 1914 (10 of 1914). (c) of the date of the finding; and either deposit the treasure in the nearest Government treasury, or give the Collector such security as the Collector thinks fit, to produce the treasure at such time and place as he may from time to time require. 5. Notification requiring claimants to appear. On receiving a notice under section 4, the collector shall after making such enquiry (if any) as he thinks fit, take the following steps (namely):- (a) he shall publish a notification in such manner as the 1[Provincial Government] from time to time prescribes in this behalf, to the effect that on a certain date (mentioning it) certain treasure (mentioning its nature, amount and approximate value) was found in a certain place (mentioning it); and requiring all persons claiming the treasure, or any part thereof, to appear personally or by agent before the Collector on a day and at a place therein mentioned, such day not being earlier than four months, or later than six months, after the date of the publication of such notification; (b) when the place in which the treasure appears to the Collector to have been found was at the date of the finding in the possession of some person other than the finder, the Collector shall also serve on such person a special notice in writing to the same effect. 6. Forfeiture of right on failure to appear. Any person having any right to such treasure or any part thereof, as owner of the place in which it was found or otherwise, and not appearing as required by the notification issued under section 5, shall forfeit such right. 7. Matters to be enquired into and determined by the Collector. On the day notified under section 5, the Collector shall cause the treasure to be produced before him, and shall enquire as to and determine___ (a) the person by whom, the place in which, and the circumstances under which, such treasure was found; and (b) as far as is possible, the person by whom, and the circumstances under which, such treasure was hidden. 8. Time to be allowed for suit by person claiming the treasure. If, upon an enquiry made under section 7, the Collector sees reason to believe that the treasure was hidden within one hundred years before the date of the finding, by a person appearing as required by the said notification and claiming such treasure, or by some other person under whom such person claims, the Collector shall make an order adjourning the hearing of the case for such period as he deems sufficient, to allow of a suit being instituted in the Civil Court by the claimant, to establish his right. 9. When treasure may be declared ownerless. If upon such enquiry the Collector sees no reason to believe that the treasure was so hidden; or if, where a period is fixed under section 8, no suit is instituted as aforesaid within such period to the knowledge of the Collector; or if such suit is instituted within such period, and the plaintiff’s claim is finally rejected; the Collector may declare the treasure to be ownerless. 1Subs. by A. O., 1937, for “L. G.”. Appeal against such declaration. Any person aggrieved by a declaration made under this section may appeal against the same within two months from the date thereof to the Chief Controlling Revenue-authority1. Subject to such appeal, every such declaration shall be final and conclusive. 10. Proceedings subsequent to declaration. When a declaration bas been made in respect of any treasure under section 9, such treasure shall, in accordance with the provisions hereinafter contained, either be delivered to the finder thereof, or be divided between him and the owner of the place in which it has been found in manner hereinafter provided. 11. When no other person claims as owner of place, treasure, to be given to finder. When a declaration has been made in respect of any treasure as aforesaid, and no person other than the finder of such treasure has appeared as required by the notification published under section 5 and claimed a share of the treasure as owner of the place in which it has been found, the Collector shall deliver such treasure to the finder thereof. 12. When only one such person claims and his claim is not disputed, treasure to be divided. When a declaration has been made as aforesaid in respect of any treasure, and only one person other than the finder so of such treasure has so appeared and claimed, and the claim of such person is not disputed by the finder, the Collector shall proceed to divide the treasure between the finder and the person so claiming according to the following rule (namely):- If the finder and the person so claiming have not entered into any agreement then in force as to the disposal of the treasure, three-fourths of the treasure shall be allotted to such finder and the residue to such person. If such finder and such person have entered into any such agreement, the treasure shall be disposed of in accordance therewith: Provided that the Collector may, in any case, if he think fit, instead of dividing any treasure as directed by this section,- (a) allot to either party the whole or more than his share of such treasure, on such party paying to the Collector for the other party such sum of money as the Collector may fix as the equivalent of the share of such other party, or of the excess so allotted, as the case may be ; or (b) sell such treasure or any portion thereof by public auction, and divide the sale- proceeds between the parties according to the rule hereinbefore prescribed: Provided also that, when the Collector has by his declaration under section 9 rejected any claim made under this Act by any person other than the said finder or person claiming as owner of the place in which the treasure was found, such division shall not be made until after the expiration of two months without an appeal having been presented under section 9 by the person whose claim has been so rejected, or when an appeal has been so presented, after such appeal has been dismissed. and shares to be delivered to parties. When the Collector has made a division under this section, at he shall deliver to the parties the portions of such treasure or the two money in lieu thereof, to which they are respectively entitled under such division. lFor definition of Chief Controlling Revenue-authority, see the General Clauses Act, 1897 (10 of 1897), s. 3 (9a). 13. In case of dispute as to ownership of place, proceedings to be stayed. When a declaration has been made as aforesaid in respect of any treasure, and two or more persons have appeared as aforesaid and each of them claimed as owner of the place where such treasure was found, or the right of any person who has so appeared and claimed is disputed by the finder of such treasure, the Collector shall retain such treasure and shall make an order staying his proceedings with a view to the matter being enquired into and determined by a Civil Court. 14. Settlement of such dispute. Any person who has so appeared and claimed may, within one month from the date of such order, institute a suit in the Civil Court to obtain a decree declaring his right; and in every such suit the finder of the treasure and all persons disputing such claim before the Collector shall be made defendants. 15. and division thereupon. If any such suit is instituted and the plaintiff’s claim is finally established therein, the Collector shall, subject to the provisions of section 12 divide the treasure between him and the finder. If no such suit is instituted as aforesaid or if the claims of the plaintiff’s in all such suits are finally rejected, the Collector shall deliver the treasure to the finder. 16. Power to acquire the treasure on behalf of Government. The Collector may, at any time after making a declaration under section 9, and before delivering or dividing the treasure as hereinbefore provided, declare by writing under his hand his intention to acquire on behalf of the Government the treasure, or any specified portion thereof, by payment to the persons entitled thereto of a sum equal to the value of the materials of such treasure or portion, together with one-fifth of such value, and may place such sum in deposit in his treasury to the credit of such persons; and thereupon such treasure or portion shall be deemed to be the property of Government, and the money so deposited shall be dealt with, as far as may be, as if it were such treasure or portion. 17. Decision of Collector final, and no suit to lie against him for acts done bona fide. No decision passed or act done by the Collector under this Act shall be called in question by any Civil Court, and no suit or other proceeding shall lie against him for anything done in faith in exercise of the powers hereby conferred. 18. Collector to exercise powers of Civil Court. A Collector making any enquiry under this Act may exercise any power conferred by the Code of Civil Procedure1 on a Civil Court for the trial of suits. 19. Power to make rules. The 2[Provincial Government] may, from time to time, make rules3 consistent with this Act to regulate proceedings hereunder. Such rules shall, on being published in the 4[official Gazette] have the force of law. PENALTIES 1See now the Code of Civil Procedure, 1908 (Act 5 of 1908). 2Subs. by A.O., 1937, for “L. G.” 3For rules made under this section, see different local Rules and Orders. 4Subs. by A.O., 1937, for “local Gazette”. 20. Penalty on finder failing to give notice, etc. If the finder of any treasure fails to give the notice, or does not either make the deposit or give the security, required by section 4, or alters or attempts to alter such treasure so as to conceal its identity, the share of such treasure, or the money in lieu thereof to which he would otherwise be entitled, shall vest in 1[Government], and he shall, on conviction before a Magistrate, be punished with imprisonment for a term which may extend to one year, or with fine, or with both. 21. Penality on owner abetting offence under section 20. If the owner of the place in which any treasure is found abets, within the meaning of the Pakistan Penal Code (XLV of 1860), any offence under section 20, the share of such treasure, or the money in lieu thereof to which he would otherwise be entitled, shall vest in 1[Government], and he shall, on conviction before a Magistrate, be punished with imprisonment which may extend to six months, or with Fine, or with both. SCHEDULE.-[Rep. by the Amending Act, 1891 (XII of 1891).] ___________ Date: 16-09-2024 lSubs. by A.O., 1961, Art. 2, for “Her Majesty” (with effect from the 23rd March, 1956)."
}