{
  "file": "administrator25f8872773a009ddfefb71c90ada01dc.pdf",
  "law_name": "The Port Qasim Authority Act, 1973",
  "text": "THE PORT QASIM AUTHORITY ACT, 1973 CONTENTS __________ CHAPTER I PRELIMINARY 1. Short title, extent and commencement. 2. Definitions. 3. Declaration of Port area. CHAPTER II ESTABLISHMENT OF THE AUTHORITY 4. Establishment of the Authority. 5. Management. 6. Constitution of the Board. 7. Remuneration and conditions of service. 8. Duties and functions of Chairman and members. 9. Headquarters of the Authority and meetings of the Board. CHAPTER III POWERS AND DUTIES OF THE AUTHORITY 10. Master-plan and master-programme. 11. Preparation of schemes by local bodies or agencies. 12. Manner and form, etc. of scheme. 13. Powers [and functions] of the Authority. 14. Tolls and charges may be remitted in special cases. 15. Board’s lien for tolls and charges. 16. Owner’s lien for freight. 17. Discharge of shipowner’s lien for freight. 18. Goods may be removed to warehouse. 19. Recovery of tolls and charges by sale of goods. 20. Removal of unclaimed goods. 21. Power to distrain vessels for non-payment of rates, etc. 22. Port-clearance not to be granted till rates, etc., paid. 23. Alternative remedy by suit. 24. Surplus of port dues to be paid to Board. 25. Right of Board to maintain pilots. 26. Approval and publication of bye-laws. 27. Removal, etc, of building. 28. Private wharves, etc., prohibited. 29. Power to permit erection of private wharves, etc. 30. Power to amend schemes. 31. Execution of schemes, etc., through local bodies and agencies. 32. Borrowing powers. 33. Utilization of building material. CHAPTER IV ACQUISITION OF LAND 34. Liability to acquisition. 35. Entry upon land, preliminary surveys, etc. 36. Compensation for damage. 37. Power to acquire land. 38. Land to be marked out, measured and planned. 39. Notice to persons interested. 40. Enquiry and award by Deputy Commissioner. 41. Compensation. 42. Matters to be considered in determining compensation. 43. Factors to be ignored in determining compensation. 44. Vesting of land in the Authority. 45. Acquisition in cases of urgency. 46. Power of Deputy Commissioner to call for information. 47. Power of Authority to give directions to Deputy Commissioner. 48. Appeals. 49. Deputy Commissioner and authorised officer to have powers of civil court etc. CHAPTER V ESTABLISHMENT 50. Appointment of officers, servants, etc. 51. Recruitment, conditions of service, etc. 52. Members and officers to be public servants. 53. Indemnity. 54. Delegation of powers to Chairman, etc. CHAPTER VI FINANCE 55. Port Qasim Authority Fund. 56. Budget. 56A. Surplus to be remitted to Federal Consolidated Fund 57. Audit and accounts. CHAPTER VII PENALTY AND PROCEDURE 58. Penalty. 59. Penalty for evading rates, etc. 60. Compensation for damage to property of Board. 60A. Fines and penalties to be credited to the Federal Consolidated Fund 61. Cognizance of offences. 62. Recovery of dues as arrears of land revenue. CHAPTER VIII MISCELLANEOUS 63. Submission of yearly reports and returns. 64. Members not personally liable. 65. Limitation of suits, etc. 66. Board not responsible for certain acts of its officers and servants. 67. Power to dispose of land. 68. Power of Government to make rules. 69. Power of Authority to make regulations. 70. Control of Federal Government over acts and proceedings of Board. 71. Transfer of Phitti Creek Project Cell to the Authority. 71A. Responsibilities of Master, regarding damages and declaration, etc. 71B. Port to be pollution free, etc. 71C. Environmental Pollution etc. 72. Dissolution of Authority and transfer of its assets and liabilities. THE PORT QASIM AUTHORITY ACT, 1973 1Act NO. XLIII OF 1973 [27th June, 1973] An Act to provide for the establishment of the Port Qasim Authority WHEREAS it is expedient to provide for the establishment of an Authority for making all arrangements for the planning, development and management of Muhammad Bin Qasim Port at Phitti Creek, hereinafter referred to as Port Qasim, and associated facilities and industries and for matters incidental thereto; It is hereby enacted as follows:— CHAPTER I PRELIMINARY 1. Short title, extent and commencement.—(1) This Act may be called the Port Qasim Authority Act, 1973. (2) It extends to the whole of the Port area. (3) It shall come into force at once. 2. Definitions. In this Act unless there is anything repugnant in the subject or context,— (a) “agency” means any department or organization of the Federal Government or a Provincial Government and includes a corporation or other body set up or controlled by such Government; (b) “Authority” means the Port Qasim Authority established under section 4; (c) “building” includes any factory, industrial or business establishment, shop, godown, warehouse, house, outhouse, hut, hutment, shed, garage, stable, well or platform and any other structure, whether meant for residential or business purposes or not, made of masonry, bricks, wood, mud, thatch, metal or any other material, but does not include a temporary structure made for purposes connected with agriculture; (d) “Board” means the Board constituted under section 6; (e) “Chairman” means the Chairman of the Board; (f) “Deputy Commissioner” means the Deputy Commissioner having jurisdiction in the Port area, and includes any other officer appointed by the Authority to exercise or perform all or any of the powers of functions of Deputy Commissioner under this Act; _________________________________________________________________________________ 1For Statement of Objects and Reasons, see Gaz. of P., 1973 Ext., Pt. III, p. 999. 1[(fa) “division concerned” means the Minister for the division to which the business of the Authority stands allocated;] (g) “goods” includes wares and merchandise of every description; (h) “high-water mark” means a line drawn through the highest points reached by ordinary spring­tides at any season of the year; (i) “land” includes buildings and benefits arising out of land and things attached to the earth or permanently fastened to anything attached to the earth and the foreshore and the bed of the sea; 2[(j) “local body” means a local council, a municipal corporation, a municipal committee, a body of commissioners, a Cantonment Board or any other body constituted under any law relating to local Government and includes an Improvement Trust;] 3[(k) “market value” means the average market value prevailing during the preceding three years.] (l) “master” when used in relation to any vessel, means any person having for the time being the charge or control of such vessel; (m) “member” means a member of the Board; (n) “owner” when used in relation to goods, includes any consignor, consignee, shipper, agent for shipping, clearing or removing such goods, or agent for the sale or custody of such goods; and, when used in relation to any vessel, includes any part owner, charterer, consignee or mortgagee in possession thereof; (o) “port area” means the areas falling within the limits of Port Qasim as may be defined for the purposes of this Act; (p) “regulations” means regulations made under this Act; (q) “rules” means rules made under this Act; (r) “scheme” means a planning scheme or a development scheme made under this Act. 3. Declaration of Port area.⸺(1) The Federal Government may, by notification in the official Gazette, define the limits of Port Qasim for the purposes of this Act; and may, from time to time, by a like notification, alter such limits. (2) The limits defined under sub-section (1) may extend to any part of the navigable approaches to the Port area, and may include any wharves, tramways, warehouses, sheds and other works made on _________________________________________________________________________________ 1Ins. by the Port Qasim Authority (Amendment) Act, 2021 (XL of 2021), s. 2. 2Subs. by the Federal Laws (Revision and Declaration) Ordinance, 1981 (27 of 1981 s. 3 and Sch., II. 3Subs. by Ord. 43 of 2002, s. 2. behalf of the public for convenience of traffic, for safety of vessels, or for the improvement, maintenance and good government of the port, whether within or without high-water mark, and, subject to any rights of private property therein, any portion of the shore within fifty yards of high-water mark. CHAPTER II ESTABLISHMENT OF THE AUTHORITY 4. Establishment of the Authority.⸺(1) There shall be established an Authority to be known as the Port Qasim Authority for carrying out the purposes of this Act. (2) The Authority shall be a body corporate, having perpetual succession and a common seal with power, subject to the provisions of this Act, to acquire and hold property, both movable, and immovable, and shall by its name sue and be sued. 5. Management.⸺(1) The general direction and administration of the Authority and its affairs shall vest in the Board which may exercise all powers and do all acts and things which may be exercised or done by the Authority. (2) The Board in discharging its functions shall act on sound principles of port planning and development and port management and shall be guided on questions of policy by such direction as the Federal Government may, from time to time, give. (3) If any question arises as to whether any matter is a matter of policy or not, the decision of the Federal Government shall be final. 6. Constitution of the Board.⸺(1) The Board shall consist of not less than three and not more than seven members, including the Chairman, to be appointed by the 1[Prime Minister]. (2) The Chairman and other members shall, unless the 1[Prime Minister] otherwise 2[determines], hold office for a period of 2[three] years. (3) Any person ceasing to be Chairman or a member of the Board by reason of the expiry of the term of his office shall be eligible for reappointment for another term of five years or for such shorter term as the 1[Prime Minister] may decide. (4) No act or proceeding of the Board shall be invalid merely on the ground of the existence of any vacancy in, or any defect in the constitution of, the Board. (5) The Chairman and any member may, by writing under his hand addressed to the 1[Prime Minister], resign his office: Provided that his resignation shall not take effect until accepted by the 1[Prime Minister]. 7. Remuneration and conditions of service. The Chairman and each member shall receive such salary and allowances and shall be subject to such condition of service as may be determined by the 1[Prime Minister]. _________________________________________________________________________________ 1Subs. by the Port Qasim Authority (Amendment) Act, 2021 (XL of 2021), ss. 3-4. 2Subs. by Ord. 43 of 2002, s. 3. 8. Duties and functions of Chairman and members.⸺(1) The Chairman and members shall discharge such duties and perform such functions as are assigned to them by or under this Act. (2) Until the Board is duly constituted, the Chairman shall, subject to such directions as the 1[division concerned] may from time to time give, exercise the powers, discharge the duties and perform the functions of the Board. 9. Headquarters of the Authority and meetings of the Board.⸺2[(1) Authority shall have its headquarters within the port area. The Board may establish branch or liaison offices in the vicinity of headquarters or elsewhere.] (2) The meetings of the Board shall be held at such times and places and in such manner as the regulations may provide: Provided that, until regulations are made in this behalf, the meetings of the Board shall be held as and when convened by the Chairman. CHAPTER III POWERS AND DUTIES OF THE AUTHORTIY 10. Master-plan and master-programme.⸺The Authority shall prepare a master-plan and a phased master-programme for the development of the Port area and the plan and programme shall be submitted to the 1[division concerned] for approval. 11. Preparation of schemes by local bodies or agencies.⸺(1) The Authority may, pursuant to the master-plan and the master-programme, call upon any local body or agency operating in the Port area to prepare, in consultation with the Authority, a scheme or schemes in respect of matters ordinarily dealt with by such local body or agency, and thereupon the local body or agency shall be responsible for the preparation of the scheme or schemes within a reasonable time. (2) Such schemes may relate to⸺ (a) land use, zoning and land reservation; (b) public buildings; (c) industry; (d) transportation and communications: highways, roads, streets, railways, aerodromes, jetties, wharves, moorings, navigational aids, sheds, ware-houses, godowns, navigation channels and workshops; (e) telecommunications, including wireless, television, radio, telephone; (f) utilization of water, power and other natural resources; _________________________________________________________________________________ 1Subs. by the Port Qasim Authority (Amendment) Act, 2021 (XL of 2021), ss. 5-6. 2Subs. by Ord. 43 of 2002, s. 4. (g) community planning, housing, slum clearance, amelioration; (h) community facilities, including water supply, sewerage disposal, electricity supply, gas supply, and other public utilities; (i) residential accommodation and welfare facilities for employees of the Authority; (j) environmental control and prevention of pollution. (3) The 1[division concerned] may, by notification in the official Gazette, add to, alter or amend the list of subjects given in sub-section (2), and any such addition, alteration or amendment shall take effect as if it had been enacted in this Act. (4) The expenditure incurred on the preparation of any such schemes as aforesaid shall be borne as agreed to between the Authority and the local body or agency, and, in the event of disagreement between them, as may be determined by the 1[division concerned]. (5) No planning or development scheme shall be prepared by any person or by any local body or agency operating in the Port area without the prior approval of the Authority. (6) The Authority may, pursuant to the master-plan and master-programme, prepare such other schemes for the Port area as the need for port development and port management may require. 12. Manner and form, etc., of scheme.⸺All schemes under section 11 shall be prepared in such manner and form as the 1[division concerned] may specify, and shall contain among other things the following information, namely:— (a) description of the scheme and the manner of its execution; (b) estimate of costs and benefits; (c) allocation of costs to the various purposes to be served by the scheme. 13. Powers 2[and Functions] of the Authority.⸺(1) Subject to the other provision of this Act, the Authority may take such measures and exercise such powers as may be necessary for the carrying out of the purposes of this Act. (2) Without prejudice to the generality of the powers conferred by sub-section (1), the Authority may⸺ (a) incur any expenditure necessary for carrying out the purposes of this Act; (b) acquire any land in the Port area in accordance with the procedure laid down in Chapter IV; (c) undertake any works in the Port area in pursuance of any scheme prepared under sub-section (6) of section 11; _________________________________________________________________________________ 1Subs. by the Port Qasim Authority (Amendment) Act, 2021 (XL of 2021), s. 6. 2Ins. by Ord. 43 of 2002, s. 5. (d) procure plant, machinery, instruments and materials required for its use; (e) enter into and perform all such contracts as it may be considered necessary; (f) cause studies, surveys, experiments and technical researches to be made or contribute towards the cost of any such studies, surveys, experiments or technical research made by any other agency at the request of the Authority; (g) issue interim development orders for areas for which a master-plan is under preparation and restrict or prohibit by general or special order any change in the use of land and alteration in buildings, structures and installations; (h) cause removal of any works obstructing the execution of any of its schemes; (i) seek and obtain advice and assistance for the preparation of any planning scheme or for the execution of any schemes from any local body or agency and such local body or agency shall give the advice and assistance sought by the Authority to the best of its ability, knowledge and judgment, and additional expenditure, if any, involved in giving such advice or assistance shall be borne by the Authority 1[;] 1[(j) entrust, transfer, assign or give on contract works connected with the development and operations of the Port to any other person, agency, department, company or contractor on such terms and conditions as the Authority may determine subject to rules, regulations and instructions made or issued under this Act: Provided that the Authority shall not entrust, transfer, assign or give on contract any of its operations without approval of the 2[division concerned]; (k) to contract out any or all the services or works required to be executed by the Authority under the provisions of this Act; and (l) to form subsidiary company or companies under the Companies Ordinance, 1984 (XLVII of 1984) either wholly owned or with participation of private sector with prior approval of the Federal Government.] (3) The Authority shall frame⸺ (a) a scale of tolls, dues, rates and charges, annual or other, to be paid by the owners of vessels playing whether for hire or not and whether regularly or occasionally, within or partly within and partly without the limits of the Port area, in respect of such vessels and of persons whether in charge of, or on board, such vessels, and also in respect of the licensing, registration and regulation of such vessels and persons: Provided that no such tolls, dues, rates and charges shall be chargeable in respect of vessels which are liable to port dues under the provisions of _________________________________________________________________________________ 1Subs. and added by Ord. 43 of 2002, s. 5. 2Subs. by the Port Qasim Authority (Amendment) Act, 2021 (XL of 2021), s. 7. Schedule I to the Ports Act, 1908 (XV of 1908); (b) a scale of tolls, dues, rates and charges⸺ (i) for the landing and shipment of goods from and in sea-going vessels, and not being sea-going vessels, respectively, at such docks, wharves, quays, stages, moorings, jetties, piers and anchorages as belong to the Authority, or any other agency authorised by the Authority to construct such facilities; (ii) for the use of such docks, wharves, quays, stages, moorings, jetties, piers and anchorages by such vessels; (iii) for the storing and keeping of any goods stored in any premises belonging to the Authority; (iv) for the removal of goods; and (v) for the use of any moorings; (c) a scale of tools for the use of the said docks, wharves, quays, moorings, stages, jetties, piers and anchorages by any such vessels, in case the Authority permits the goods to be landed or shipped by persons other than its own officers and servants; and (d) a scale of charges for⸺ (i) any service to be performed by the Authority or its servants in respect of any vessels or goods; (ii) the use of any works or appliances to be provided by the Authority; (iii) for the carrying of passengers and their personal effects on vessels belonging to, or hired by, the Authority; and (iv) for the towing of and rendering assistance to any vessels, tugs, or other boats, or their equipment, within the limits of the Port area or outside those limits, for the purpose of saving or protecting life or property. (4) Every scale framed under sub-section (3) shall be submitted to the 1[division concerned] and, after approval or modification by the 1[division concerned], shall be published in the official Gazette. 14. Tolls and charges may be remitted in special cases. The Board may, in special cases, with the previous sanction of the 1[division concerned], remit the whole or any portion of a toll, due, rate or charge leviable according to any scale for the time being in force under section 13: _________________________________________________________________________________ 1Subs. by the Port Qasim Authority (Amendment) Act, 2021 (XL of 2021), ss. 7-8. Provided that the sanction of the 1[division concerned] shall not be necessary if the remission in any one case does not exceed five thousand rupees or such larger sum as the 1[division concerned] may from time to time specify: Provided further that, in a case where the remission does not exceed two thousand rupees, the remission may be granted by the Chairman or an officer authorized by him in his behalf. 15. Board’s lien for tolls and charges.—(1) For the amount of all tolls, dues, rates and charges leviable under this Act in respect of any goods, the Board shall have a lien on such goods, and shall be entitled to seize and detain the same until such tolls, dues, rates and charges are fully paid and for the amount of rent lawfully due on buildings, plinths, stacking areas and other premises which are the property of the Board, and not paid after bills therefor have been duly preferred, the Board shall have a lien on all goods therein or thereon, and shall be entitled to seize and detain the same. (2) Tolls, dues, rates and charges in respect of goods to be landed shall become payable immediately on the landing of goods and, in respect of goods to be removed from the premises of the Board or to be shipped for export, shall be payable before the goods are removed or shipped. (3) The lien of such tools, dues, rates and charges shall have priority over all other liens and claims, except a lien for freight, primage and general average, where such lien has been preserved in the manner hereinafter provided, and a lien for money payable to the Federal Government under any law for the time being in force. 16. Owner’s lien for freight.—(1) If the master or owner of any vessel, at or before the time of landing from such vessel of any goods at any wharf, dock, quay, stage, jetty or pier, gives to the Board notice in writing that such goods are to remain subject to a lien for freight, primage or general average of any amount to be mentioned in such notice, such goods shall continue to be liable, after the landing thereof, to such lien. (2) Such goods shall be retained either in the warehouses and sheds of the Board or, with the consent of the Collector of Customs, in a public warehouse, at the risk and expense of the owner of the said goods, until the lien is discharged as hereinafter mentioned. 17. Discharge of Shipowner’s lien for freight. Upon the production to any officer appointed by the Board in that behalf of a document purporting to be a receipt for, or a release from, the amount of such lien, executed by the person by or on whose behalf such notice has been given, the Board may permit such goods to be removed without regard to such lien. 18. Goods may be removed to warehouse.—(1) Whenever goods which have been landed have, without any default on the part of the Board, been left for five clear days on or in any wharf of shed belonging to the Board, the Board may cause such goods to be removed either to any warehouse belonging to it, or, with the consent of the Collector of Customs, to a public warehouse; and the removal to and detention in any such warehouse shall be at the risk and expense of the owner of the said goods. (2) Whenever any goods are so removed, the Board shall give notice of such removal to the consignee or other person concerned by notification in the official Gazette specifying therein the name 1Subs. by the Port Qasim Authority (Amendment) Act, 2021 (XL of 2021), s. 8. of the ship which brought the goods, the date of her arrival, and the numbers, marks and descriptions of the goods so far as the same appear and the consignee of such goods or other person to whom notice has been given as aforesaid, in addition to the expenses of the removal of the same, shall be liable, in case the goods are removed to any warehouse of the Board, to a charge for warehousing for the time during which the goods shall remain in the said warehouse. (3) If the goods are removed to a public warehouse, the said consignee shall be liable to the charges for warehousing goods in such public warehouse and the said goods shall remain subject to all liens to which they would have been liable if they had remained in the possession of the Board, and shall be subject to the power of sale hereinafter given. 19. Recovery of tolls and charges by sale of goods.—(1) If the tolls, dues, rates and charges payable to the Board under this Act in respect of any goods which have been landed or if rents due under section 15 are not paid, or if the lien for freight, primage or general average, where such notice as aforesaid has been given, is not discharged, the Board may, and in the latter event, if required by or on behalf of the person claiming such lien for freight, primage or general average, shall at the expiration of two months from the time when the goods were placed in its custody, or seized and detained for rents due sell by public auction the said goods, or so much thereof as may be necessary to satisfy the amounts hereinafter directed to be paid out of the produce of such sale. (2) Before making such sale, at least ten days’ notice of the same shall be given by publication thereof in the official Gazette and in two local newspapers. (3) If the address of the consignee of the goods or of his agent has been stated on the manifest of the cargo, or in any of the documents which have come into the hands of the Board, or is otherwise known, notice shall also be given to the consignee of the goods or to his agent by letter delivered at such address or sent by post; but the title of a bona-fide purchaser of such goods shall not be invalidated by reason of the omission to send such notice, nor shall any such purchaser be bound to inquire whether such notice has been sent: Provided that, if such goods are of so perishable a nature as, in the opinion of the officer appointed by the Board in that behalf, to render early or immediate sale necessary or advisable, the Board may within such period being not less than twenty four hours after the landing of the goods, as it thinks fit, sell by public auction the said goods or such portion of them as aforesaid in which event such notice, if any, shall be given to the consignee of the goods or his agent as the urgency of the case admits of. 20. Removal of unclaimed goods.—(1) When delivery of goods is not claimed by the owner at the expiry of one month from the date on which they are placed in the custody of the Board, the Board shall cause a notice to be served upon the owner requiring him to remove the goods: Provided that, where all rates and charges in respect of such goods have been duly paid, such notice shall not be served till the expiration of two months from the said date. (2) Such notice shall be published and served in the manner prescribed in sub-sections (2) and (3) of section 19, but where the owner is not known, or the notice cannot be served upon him or he does not comply with the notice, the Board may sell the goods by public auction after the expiration of ten weeks from the date on which such goods were placed in the custody of the Board. (3) The Federal Government may, by notification in the official Gazette, exempt any goods or class of goods from the operation of this section. 21. Power to distrain vessels for non-payment of rates, etc.— (1) If the master of any vessel in respect of which any tolls, dues, rates, charges or penalties shall be payable under this Act, or any bye-laws made thereunder, refuses or neglects to pay the same or any part thereof on demand, it shall be lawful for the Board to distrain or arrest of its own authority such vessel, and the tackle, apparel or furniture belonging thereto, or any part thereof and detain the same until the amount so due shall be paid. (2) In case any part of the said rates or penalties, or of the cost of the distress or arrest or of the keeping of the same, shall remain unpaid for a period of fifteen days next after any such distress or arrest shall have been so made the Board may cause the vessel, or other thing so distrained or arrested, to be sold, and with the proceeds of such sale may satisfy such tolls, dues, rates, charges or penalties and costs of sale remaining unpaid, rendering the surplus, if any, to the master of such vessel on demand. 22. Port-clearance not to be granted till rates, etc., paid. If the Board shall give to the officer of Government, whose duty is to grant the port-clearance of any vessel, a notice stating that an amount therein specified is due in respect of tolls, dues, rates, charges or penalties chargeable under this Act, or any bye-laws or orders made hereunder against such vessel or the owner or master of such vessel, in respect thereof, such officer shall not grant such port-clearance until the amount so chargeable shall have been paid. 23. Alternative remedy by suit. Notwithstanding anything contained in sections 15, 16, 17, 18, 19, 20, 21 and 22, the Board may recover by suit any tolls, dues, rates, charges, damages, expenses, costs, or in case of sale the balance there of when the proceeds of sale are insufficient or any penalties or fines payable to or recoverable by the Board under this Act or under any bye-laws made thereunder. 24. Surplus of port dues to be paid to Board. The surplus, if any, of the moneys credited under section 36 of the Ports Act, 1908 (XV of 1908), to the account of the port fund of the port, after defraying therefrom all expenses legally chargeable to the said account, shall be paid to the Board. 25. Right of Board to maintain pilots.-(1) The Board shall have the right of maintaining pilots for the navigation of vessels at the port, and shall be bound to provide a sufficient number of pilots for that purpose, and all fees for pilotage shall be paid to the Board : Provided that no person shall be appointed to be a pilot by the Board who is not for the time being authorized under the provisions of the Ports Act, 1908 (XV of 1908), to pilot vessels. (2) The Board may also, from time to time, make such bye-laws and regulations as it shall think fit— (a) for fixing and regulating the wages and allowances for pilotage to be received by pilots ; and (b) for regulating the behavior and conduct of pilots whether maintained by the Board or not, and shall enforce the observance of such bye-laws and regulations _________________________________________________________________________________ 1Subs. by ord 43 of 2002, s.6 by the imposition of pecuniary penalties not exceeding 1[the amount as may be notified in official Gazette by the Board] for each offence, or by suspension, or deprivation of appointment, or otherwise as may appear to it to be expedient : Provided that such bye-laws shall first have been approved by the 1[division concerned], and published in the manner laid down in section 26. 26. Approval and publication of bye-laws. No bye-law, or alteration or revocation of a bye-law, shall have effect until the same shall have been approved by the 1[division concerned] and such approval shall have been published in the official Gazette and no bye-law or alteration or revocation of a bye-laws shall be approved by the 1[division concerned] until a draft of the same and a notice specifying a date at or after which the draft will be submitted to the 1[division concerned] shall have been published in the official Gazette and in such other manner as the 1[division concerned] may from time to time prescribe, nor unless the said draft shall have been submitted for its approval. 27. Removal, etc., of building. The Board 2[or any officer authorized by the Board] shall not order or cause any building in the Port area to be removed or demolished unless an opportunity of being heard has been given to the owner or occupier thereof and his objections, if any, has been duly considered, and the Board 2[or any officer authorized by the Board] is satisfied that the removal or demolition of the building is essential to the execution of its schemes. 28. Private wharves, etc., prohibited.— (1) Save as hereinafter provided, no person except the Board shall make, erect or fix below high-water mark within the Port area any wharf, dock, quay, stage, jetty, pier, erection or mooring. (2) Any matter or thing so made, erected or fixed may be removed by the Board and the person who has so made, erected or fixed any such matter or thing shall be punished with fine, 2[as fixed by the Board from time to time, an initial fine and recurring fine] for every day during which such mater or thing has been permitted to remain so made, erected or fixed after notice to remove the same has been given to him, and shall also be liable to pay all expenses which may have been incurred by the Board in removing such matter or thing. 29. Power to permit erection of private wharves, etc. The Board may, by an order in writing and subject to such conditions as it may specify in the order, permit any person to make, erect or fix below high-water mark within the Port area any wharf, dock, quay, stage, jetty, pier, erection or mooring. 30. Power to amend schemes. Any scheme prepared under section 11 may at any time be amended or modified by the Authority and where the amended or modified scheme exceeds the financial power of the Authority, it shall obtain the previous approval in writing of the 1[division concerned]. 31. Execution of schemes, etc., through local bodies and agencies.—(1) The Authority may require a local body or agency within whose jurisdiction any particular area covered by a scheme lies- (a) to execute a scheme in consultation with the Authority; (b) to take over and maintain any of the works and services in that area; and (c) to enforce regulations on behalf of the Authority. 1Subs. by the Port Qasim Authority (Amendment) Act, 2021 (XL of 2021), ss. 9-11. 2Subs. by the ord. 43 of 2002, s.7. (2) The expenditure incurred on the execution of any scheme or on the taking over or maintenance of any work, or the enforcement of regulations, under this section, shall be borne as may be agreed to between the Authority and the local body or agency, and, in the event of disagreement, as may be determined by the 1[division concerned]. 32. Borrowing powers. — (1) The Authority may, with the previous approval in writing of the 1[finance division], raise funds for the purpose of raising its working capital by issuing bonds and debentures carrying interest at such rates as may be approved by the 1[finance division]. (2) The repayment of the principal and the payment of interest due on the bonds and debentures issued by the Authority shall be guaranteed by the Federal Government. 33. Utilization of building material. Notwithstanding anything contained in any other law for the time being in force or in any contract or agreement, no person shall, without the prior concurrence of the Authority, allocate, exploit or in any manner utilize, except for the purpose of his own personal use, such natural resources used as building materials as the Authority may, by notification in the officials Gazette, specify in this behalf. CHAPTER IV ACQUISITION OF LAND 34. Liability to acquisition. All land in private ownership within the Port area shall be liable to acquisition at any time in accordance with the provisions of this Chapter. 35. Entry upon land, preliminary surveys, etc. — (1) It shall be lawful for the Authority, and any member thereof, and for the Deputy Commissioner, and any such person as may, either generally or specially, be authorized by the Authority in this behalf, — (a) to enter upon and survey and take levels of any land; (b) to dig or bore into the sub­soil; (c) to do all other acts necessary to ascertain whether land is adapted for the purposes of this Act; (d) to set out the boundaries of the land purposed to be acquired and the intended line of the work, if any, proposed to be made thereon; (e) to make such levels, boundaries and line by placing marks and cutting trenches; and (f) where it is necessary for the purposes of the survey, taking of levels or marking of line, to cut down and clear away any part of any standing crop, fence or jungle. (2) No person shall enter into any building or upon any enclosed court or garden attached to a dwelling house (unless with the consent of the occupier thereof) without previously giving such occupier at least twenty-four hours, notice in writing of his intention to do so. 1Subs. by the Port Qasim Authority (Amendment) Act, 2021 (XL of 2021), ss. 11-13. 36. Compensation for damage. Where any damage is caused to any land in consequence of anything done in pursuance of section 35, there shall be paid compensation, the amount of which shall be determined in the manner and in accordance with the provisions hereinafter set out, that is to say, (a) where the amount of compensation can be fixed by agreement, it shall be fixed in accordance with such agreement; and (b) where no such agreement can be reached, it shall be fixed by the Deputy Commissioner. 37. Power to acquire land.— (1) Subject to the other provisions of the Act, the rules made thereunder and the directions of the Authority, the Deputy Commissioner may, by order in writing, acquire any land for the purposes of this Act. (2) No order under sub-section (1) shall be issued except on the receipt by the Deputy Commissioner of specific directions from the Authority. 38. Land to be marked out, measured and planned. Where any land is proposed to be acquired under section 37, the Deputy Commissioner shall cause the land (unless it has been already marked out) to be marked out and measured, and if no plan has been made thereof, a plan to be made of the same. 39. Notice to persons interested.— (1) The Deputy Commissioner shall then cause public notice to be given at convenient places on or near the land to be taken, stating that the Authority intends to take possession of the land, and that claims to compensation for all interests in such land may be made to him. (2) Such notice shall state the particulars of the land so needed and shall require all persons interested in the land to appear personally or by agent before the Deputy Commissioner at a time and place therein mentioned, such time not being earlier than ten days after the date of publication of the notice, and to state the nature of their respective interests in the land and the amount and particulars of their claims to compensation for such interests and their objections, if any, to the measurements made under section 35, and the Deputy Commissioner may require any such statement to be made in writing and signed by the party or his agent. 40. Enquiry and award by Deputy Commissioner. On the day so fixed, or on any other day to which the enquiry has been adjourned, the Deputy Commissioner shall proceed to enquire into the objections, if any, which any person interested has stated pursuant to the notice given under section 39, and into the market value of the land and into the respective interests of the persons claiming the compensation, and shall make an award of— (i) the true area of the land; (ii) the compensation which in his opinion should be allowed for the land; and (iii) the apportionment of such compensation among all the persons known or believed to be interested in the land of whom, or of whose claims, he has information, whether or not they have appeared before him. 41. Compensation. Where any land is acquired under this Act, there shall be paid compensation the amount of which shall be determined by the Deputy Commissioner who shall be guided by the provision of sections 42 and 43. 42. Matters to be considered in determining. In determining the amount of compensation to be awarded for land acquired under this Act, the Deputy Commissioner shall take into consideration- (i) the market value of the land; (ii) the damage sustained by the person interested by reason of dispossession of any standing crops or trees which may be on the land; (iii) the damage, if any, sustained by the person interested at the time of taking possession of the land by reason of serving such land from his other land; (iv) the damage, if any, sustained by the person interested at the time of taking possession of the land by reason of the acquisition injuriously affecting his other property, movable or immovable, in any manner, or his earnings; and (v) if, in consequence of the acquisition of the land, the person interested is compelled to change his residence or place of business, the reasonable expenses, if any, incidental to such change. 43. Factors to be ignored in determining compensation. In determining compensation as aforesaid, the Deputy Commissioner shall not take in to consideration— (i) the degree of urgency which has led to the acquisition; (ii) any disinclination of the person interested to part with the land acquired; (iii) any damage sustained by him which, if caused by a private person, would not render such person liable to a suit; (iv) any increase likely to accrue to the value of the land acquired from the use to which such land will be put on acquisition; or (v) any increase likely to accrue to the value of other land of the person interested from the use to which the land acquired will be put on acquisition. 44. Vesting of land in the Authority. Immediately on the making of the award under section 40, the land shall vest in the Authority free from all encumbrances and thereupon the Deputy Commissioner may, after giving reasonable notice to the occupier, enter upon and take possession of the same. 45. Acquisition. In cases of urgency, the Deputy Commissioner may immediately after the publication of the notice mentioned in sub-section (1) of section 39 enter upon and take possession of the land which shall thereupon vest absolutely in the Authority free from all encumbrances: Provided that the Deputy Commissioner shall not take possession of any building or part of building under this section without giving to the occupier thereof at least twenty-four hours’ notice of his intention to do so, or such longer notice as may be reasonably sufficient to enable such occupier to remove his movable property from such building without unnecessary inconvenience. 46. Power of Deputy Commissioner to call for information. With a view to acquiring any land or determining any compensation thereof or to carrying out any other purpose of this Act, the Deputy Commissioner may— (a) require any person, by order in writing, to furnish such information in his possession relating to any land as may be specified in the order; and (b) enter or authorize any person to enter upon any land and take such action as may be necessary. 47. Authority to give direction. The Authority may give directions to the Deputy Commissioner in respect of the exercise of his powers and the discharge of his functions under this Chapter and the Deputy Commissioner shall be guided, and act in accordance with, such directions. 48. Appeals.— (1)The Authority or any person aggrieved by an award or final order of the Deputy Commissioner may, within fifteen days of the award or order, appeal to the Provincial Government. (2) An officer authorized by the Provincial Government in this behalf may, after giving the Authority and the persons affected by the award or order appealed against an opportunity of submitting any objection to the appeal and of being heard, pass such orders thereon as he may think fit. (3) The order passed on any appeal under sub-section (2) shall be final and shall not be called in question by or before any Court or other authority. 49. Deputy Commissioner and authorised officer to have powers of civil court, etc.—(1) The Deputy Commissioner making any inquiry or conducting any proceedings for an award under this Act, or the officer hearing an appeal under section 48, shall have the same powers in respect of the following matters as are vested in the civil court, when trying a suit under the Code of Civil Procedure 1908 (Act V of 1908), namely: — (a) summoning and enforcing attendance of any person and examining him on oath or affirmation; (b) requiring the discovery or production of any document; (c) requisitioning any record from any court or office; (d) issuing commissions for examination of witnesses, inspection of property or making any local investigation; (e) appointing guardian ad litem or next friends; (f) adding or substituting representatives of deceased parties or proceedings; (g) adding or dropping parties from pending proceedings; (h) restoration of cases dismissed for default; (i) consolidation and splitting up cases; and (j) any other matter connected with the holding of any inquiry or hearing of an appeal. (2) The Deputy Commissioner or the officer hearing an appeal under section 48 shall be deemed to be a court for the purposes of sections 480 and 482 of the Code of Criminal Procedure, 1898 (Act V of 1898), and a proceeding before him shall be deemed to be a judicial proceeding within the meaning of sections 193 and 228 of the Pakistan Penal Code (Act XLV of 1860). CHAPTER V ESTABLISHMENT 50. Appointment of officers, servants, etc. The Authority may, from time to time, appoint such officers and servants as it may consider necessary for the performance of its functions, on such terms and conditions as it may deem fit. 51. Recruitment, conditions of service, etc. The Authority shall, by regulations made with the prior approval of the 1[division concerned], lay down the procedure for the appointment of its officers and servants, and the terms and Conditions of their service including the constitution and management of provident fund for them, and shall be competent to take disciplinary action against them. 52. Members and officers to be public servants. The Chairman, members, officers and servants of the Authority shall, when acting or purporting to act in pursuance of any of the provisions of this Act, be deemed to be public servants within the meaning of section 21 of the Pakistan Penal Code (Act XLV of 1860). 53. Indemnity. No suit, prosecution or other legal proceedings shall lie against the Authority, the Board, the Chairman, any member, officer or servant of the Authority in respect of anything in good faith done or intended to be done under this Act. 54. Delegation of powers to Chairman, etc. The Authority may, by general or special orders, delegate to the Chairman, or a member or an officer of the Authority, any of its powers, duties or functions under this Act, subject to such conditions as it may think fit to impose. CHAPTER VI FINANCE 55. Port Qasim Authority Fund. — (1) There shall be formed a fund to be known as the “Port Qasim Authority Fund” which shall vest in the Authority and shall be utilized by the Authority to meet the charges in connection with its functions under this Act, including the payment of salaries and other remuneration to the Chairman, members, officers, servants, experts and consultant of the Authority. 1Subs. by the Port Qasim Authority (Amendment) Act, 2021 (XL of 2021), s. 14. (2) To the credit of the Port Qasim Authority Fund shall be placed— (a) grants made by the Federal Government; (b) loans obtained from the Federal Government; (c) grants made by local bodies; (d) sale proceeds of movable and immovable property and receipts for services rendered; (e) loans obtained by the Authority with the special or general sanction of the Federal Government; (f) foreign aid and loans obtained from any source outside Pakistan with the sanction of, and on such terms as may be approved by, the Federal Government; (g) proceeds of all charges and recoveries made under the Ports Act, 1908 (XV of 1908), and the provisions of this Act; and (h) all other sums receivable by the Authority. 56. Budget.—(1) In the month of November each year, the Authority shall submit to the 1[division concerned] for approval a statement of the estimated receipts and expenditure in rupees in respect of the next financial year. (2) In the manner prescribed by the 1[division concerned], the Authority shall also submit to the 1[division concerned] for approval a statement of the estimated receipts and expenditure in foreign exchange in respect of the next financial year. (3) The Authority shall obtain specific sanction of the 1[division concerned] in respect of each individual scheme costing rupees twenty-five lakhs non-recurring or rupees five lakhs recurring or more to be financed out of the Port Qasim Authority Fund. 2[56A. Surplus to be remitted to Federal Consolidated Fund.—Any surplus of receipts over the actual expenditure in a year, after payment of tax, shall be remitted to the Federal Consolidated Fund (FCF) and any deficit from the actual expenditure shall be made up by the Federal Government to the extent of funds deposited in FCF.] 57. Audit and Accounts. 1[division concerned] (1) The accounts of the Authority shall be maintained by the Authority in such form as may be prescribed by the Auditor-General of Pakistan consistent with the requirements of the Act. (2) The accounts of the Authority shall be audited by not less than two auditors who are chartered accountants within the meaning of the Chartered Accountants ordinance 1961 (X of 1961), appointed by the 1[division concerned] in consultation with the Auditor-General of Pakistan, on such remuneration, to be paid by the Authority, as the 1[division concerned] may fix. (3) Notwithstanding the provisions of sub-section (2), the Auditor-General may, either of his own motion or upon a request received in this behalf from the 1[division concerned], undertake such audit of the accounts of the authority at such time as may be considered necessary, and the Authority shall, at the time of such audit, produce the account books and connected documents at such place or places as the Auditor-General may fix, and furnish such explanations and information as the Auditor- General or an officer authorized by him in this behalf may ask for. 1Subs. by the Port Qasim Authority (Amendment) Act, 2021 (XL of 2021), ss. 15-16. 2Ins. by the Finance Act No. V of 2019, s.7. (4) Every auditor appointed under sub-section (2) shall be given a copy of the annual balance- sheet of the Authority, and shall examine it together with the accounts and vouchers relating thereto and shall have a list delivered to him of all books kept by the Authority; and shall at all reasonable times have access to the books, accounts and other documents of the Authority, and may in relation to such accounts examine any officer of the Authority. (5) The auditors shall report to the 1[division concerned] upon the annual balance-sheet and accounts and in their report state whether in their opinion the balance-sheet is a full and fair balance-sheet containing all necessary particulars and property drawn up so as to exhibit a true and correct view of the state of the Authority’s affairs, and in case they have called for any explanation or information from the Board, whether it has been given and whether it is satisfactory. (6) The 1[division concerned] may at any time issue directions to the auditors requiring them to report to it upon the adequacy of measures taken by the Authority for the protection of the interests of the 1[division concerned] and of the creditors of the Authority or upon the sufficiency of their procedure in auditing the accounts of the Authority, and may at any time enlarge or extend the scope of the audit or direct that a different procedure in audit be adopted or that any other examination be made by the auditors if in its opinion the public interest so requires. (7) The Authority shall comply with every direction issued by the 1[division concerned] for the rectification of matters objected to in audit. CHAPTER VII PENALTY AND PROCEDURE 2[58. Penalty.— Whoever contravenes any provision of this Act or any rule, regulation or bye- law, made or scheme sanctioned thereunder, or commits a default by omission or commission, or makes a mis-declaration bearing upon the safety and security in port, on-shore or off-shore shall, if no other penalty is provided for such contravention, default, omission or commission or mis-declaration be punishable with imprisonment for a term which may extend to one year, or with fine which may extend to rupees one million, or with both.] 59. Penalty for evading rates, etc. Any person who removes or attempts to remove, or abets within the meaning of the Pakistan Penal Code (XLV of 1860), the removal of any goods, vessel, animal or vehicle with the intention of evading payment of the tolls, dues, rates or charges lawfully payable in respect thereof shall be punishable with fine which may extend to two thousand rupees. 60. Compensation for damage to property of Board.—(1) In case damage or mischief is done to any wharf, dock, quay, jetty, pier or work constructed or acquired by the Board under this Act by any vessel, through the negligence of the master thereof or of any of the mariners or persons employed therein, not being in the service of the Board, any Magistrate of the first class having jurisdiction in the Port area, may on the application of the Board and on declaration by it that payment for such damage or mischief has been refused or has not been made on demand, issue a summons to the master or owner of such vessel, requiring him to attend on a day and at an hour named in the summons to answer touching such damage or mischief. 1Subs. by the Port Qasim Authority (Amdt.) Act, 2021 (XL of 2021), s.16. 2Subs. by Ord. 43 of 02, s. 9. (2) If, at the time appointed in the summons, and whether the person summoned appears or not, it is proved that the alleged damage was done through such negligence as aforesaid, and that the pecuniary amount of the same does not exceed two thousand rupees, the Magistrate may issue his warrant of distress, under which a sufficient portion of the boats, masts, spars, ropes, cables, anchors or stores of the vessel may be seized and sold to cover the expenses of and attending the execution of the distress, and the pecuniary amount of damage as aforesaid, and such amount shall be paid to the Board out of the proceeds of the distress: Provided that if, at the time of the damage or mischief, the vessel was under the orders of a duly authorized officer belonging to the pilot service maintained by the Board under section 25 or to the Harbour Masters of Port Officer’s department, and if such damage or mischief is in any way attributable to the order, act or improper omission of such officer, the case shall not be cognizable by the Magistrate under this section. 1[60A. Fines and penalties to be credited to the Federal Consolidated Fund.—All fines and penalties recovered by the Authority shall be credited to the Federal Consolidated Fund.] 61. Cognizance of offences.— No Court shall take cognizance of any offence punishable under this Act except on a complaint in writing made by the Authority or by an officer authorised for the purpose by the Authority. 62. Recovery of dues as arrears of land revenue. All fees and sums due on account of property for the time being vested in the Board and all arrears of tolls, charges, rates and dues imposed under this Act may be recovered as arrears of land revenue, in addition to the other modes provided by this Act. CHAPTER VIII MISCELLANEOUS 63. Submission of yearly reports and returns. (1) The Authority shall submit to the 2[division concerned], as soon as possible after the end of every financial year but before the last day of December next following, a report on the conduct of its affairs for that year. (2) The 2[division concerned] may, after giving sufficient notice to the Authority, require it to furnish the 2[division concerned] with— (i) any return, statement, estimates, statistics, or other information regarding any matter under the control of the Authority; or (ii) a report on any subject with which the Authority is concerned; or (iii) a copy of any documents in the charge of the Authority; and the Authority shall comply with every such requisition. 64. Members not personally liable. No member shall be liable for any contract made or expense incurred by or on behalf of the Board; but the funds from time to time in the hands of the Board shall be liable for and chargeable with all contracts made in the manner provided in this Act. 65. Limitation of suits, etc. — (1) No suit shall be commenced against any person for anything done or purporting to have been done in pursuance of this Act, without giving to such person one month’s previous notice in writing of the intended suit and of the cause thereof, nor after six months from the accrual of the cause of such suit. _________________________________________________________________________________ 1Ins. by the Finance Act No. V of 2019, s.7. 2Subs. by the Port Qasim Authority (Amdt.) Act, 2021 (XL of 2021), s. 17. (2) In the case of a suit for damages, if tender of sufficient amends shall have been made before the suit was brought, the plaintiff shall not recover more than the amount so tendered and shall pay all costs incurred by the defendant after such tender. 66. Board not responsible for certain acts of its officers and servants. The Board shall not be responsible for any misfeasance, malfeasance or non-feasance of any officer or servant appointed under this Act or of any Conservator, any Port Officer or Harbour Master, or of any assistant or deputy of any such officer or of any person acting under the authority or direction of or in subordination to any such officer, assistant or deputy, nor for any damage sustained by any vessel in consequence of any defect in any of the moorings, hawsers or other things belonging to the Board which may be used by such vessel: Provided that nothing in this section shall protect the Board from a suit in respect of damages to or loss of, goods landed or shipped by them or retained in their custody. 67. Power to dispose of land. The Authority may retain, or may lease, sell, exchange, rent or otherwise dispose of any land vested in it. 68. Power of Government to make rules. The Federal Government may, by notification in the official Gazette, make rules to carry out the purposes of this Act. 69. Power of Authority to make regulations.—(1) The Authority may, with the prior sanction of the 1[division concerned], make regulations for carrying out the purposes of this Act. (2) In particular, and without prejudice to the generality of the foregoing power, such relations may provide for— (a) regulating, declaring and defining the wharves, quays, stages, jetties and piers, on and from which goods shall be landed from and shipped in vessels within the Port area; (b) the safe and convenient use of such wharves, quays, stages, jetties, piers and of Landing places, tramway, warehouses, sheds and other works in and adjoining the same; (c) regulating the reception and removal of goods within and from the premises of the Board, and for declaring the procedure to be followed in taking charge of goods which may have been damaged before landing or may be alleged to be so damaged; (d) settling the mode of payment of tolls, charges, dues and rates levied under this Act; 1Subs. by the Port Qasim Authority (Amendment) Act, 2021 (XL of 2021), s. 18. (e) providing water for ships and for licensing and regulating water-boats within the Port area; (f) The removal of wrecks from the port and keeping clean the Port area, the foreshore and the works of the Board and for preventing filth or rubbish being thrown therein or thereon; and (g) the guidance of persons employed by the Authority under this Act, and generally for carrying out the purposes of this Act. 70. Control of 1[division concerned] over acts and proceedings of Board. All acts and proceedings of the Board shall be subject to the control of the 1[division concerned] and the 1[division concerned] may suspend or modify any such acts or proceedings. 71. Transfer of Phitti Creek Project Cell to the Authority.— (1) Notwithstanding anything to the contrary in any contract or agreement or in the conditions of service, the 1[division concerned] may, subject to the provisions of sub-section (2), transfer persons in the service of Pakistan serving in the Phitti Creek Project Cell, hereinafter referred to as the Cell, under the department of the Government headed by the Director-General, Ports and Shipping, immediately before the commencement of this Act to the Authority on the same terms and conditions to which they were entitled immediately before such commencement. (2) Notwithstanding anything in sub-section (1), only such persons serving in the Cell shall be transferred to the Authority as opt for service in the Authority. (3) No person in the service of Pakistan who is transferred to the Authority under sub-section (1), shall, notwithstanding anything contained in any law for the time being in force, be entitled to any compensation because of such transfer. 1[71A. Responsibilities of Master, regarding damages and declaration, etc. The Master, agent, and owner of a vessel, shall, severally, and jointly, be responsible for: (a) any damage caused to the property and servants of the Port, whether within Ports’s limits or in the approaches, by their vessel or servants. Such vessel shall be detained by the Authority till such time the cost of the damage as determined by the Authority is paid; (b) any mis-declaraton of particulars of a vessel and for disobeying the parameters specified for handling of vessels in Port Qasim Harbour, and shall be liable to a penalty as determined and notified by the Authority from time to time; and (c) the sinking or grounding of any vessel or causing damage to any other vessel in the port limits or approaches, caused by their vessel of their servants, and for removal of the sunk, ground or damaged vessel at their own risk and cost, failing which, the Authority may salvage or remove such vessel out of the port’s limits and the cost of such removal shall be recoverable from the sale proceeds of such vessel. 1Ins. new sections ss. 71A-71C by Ord. 43 of 2002, s. 10. 1Subs. by the Port Qasim Authority (Amendment) Act, 2021 (XL of 2021), s. 19. 71B. Port to be pollution free, etc.— (1) The Authority shall be responsible for maintaining the marine environments of the port’s limits in order to ensure that the sea, land, an air is free from pollution. (2) No Owner, Agent or Master of a vessel, or any industry, manufacturing establishment, mill, factory or any kind, cargo handling company, terminal operator, etc., shall discharge any solid or liquid waste, oily, noxious radioactive and hazardous substances, bilge discharges, residues and mixtures containing noxious solid and liquid wastes, de-blasting of un-washed cargo tanks and line washing, garbage, emission of any effluent or waste or air pollution or noise in any amount concentration or level in excess of the National Environmental Quality Standards, or standards, which may be specified, from time to time, by the Authority for Port limits. (3) Any person contravening the provisions of sub-section (2) shall be liable to penalty as determined and notified by the authority from time to time for each contravention in addition to the charges for cleaning of the Port and removal of pollution therefrom. 71C. Environmental Pollution etc.—(1) No proponent of a project shall commence construction or operation unless he has filed with this Authority as initial environmental examination or, where the project is likely to cause an adverse environmental effect, an environment impact assessment, and has obtained from the Authority approval in respect thereof. (2) The Authority shall: — (a) review the initial environmental examination and accord its approval, or require submission of an Environmental Impact Assessment by the proponent; or (b) review the Environmental Impact Assessment and accord its approval subject to such condition as it may deem fit to impose, or require that the Environment Impact Assessment be re-submitted after such modification as may be stipulated.] 72. Dissolution of Authority and transfer of its assets and liabilities.—(1) The Federal Government may, by notification in the official Gazette, declare that the Authority shall be dissolved on such date as may be specified in such notification, and the Authority shall stand dissolved accordingly. (2) On and from the said date— (a) (i) all properties, funds and dues placed at the disposal of the Authority by the Federal Government; and (ii) all properties, funds and dues exchanged for, derived from, or otherwise attributable to, the properties, funds and dues referred to in the clause (i), which immediately before the said date, were held by or were realisable by the Authority shall vest, in, and be realisable by, the Federal Government; (b) all properties, funds and dues, other than those referred to in sub-clause (a), which, immediately before the said date, were vested in or were realisable by the Authority shall vest in and be realizable by the Federal Government or such agency as the Federal Government may determine, and its decision thereon shall be final; (c) all liabilities which, immediately before the said date, were enforceable against the Authority shall be assumed by and be enforceable against the Federal Government or such agency as the Federal Government determines under clause (b) as the case may be; (d) for the purpose of completing the execution of any scheme which has not been fully executed by the Authority and of realizing properties funds and dues referred to in clauses (a) and (b), the functions of the Authority under this Act shall be discharged by the Federal Government or by the agency determined by the Federal Government under clause (b), as the case may be; (e) the agency referred to in clauses (b), (c) and (d) shall keep such accounts of all moneys respectively received and expended by it under this Act as a Federal Government may prescribe. _______________"
}