{
  "file": "administrator47ec7e7d3843370d9621a07ae60ed9a4.pdf",
  "law_name": "Designs Of Integrated Circuits Ordinance, 2000",
  "text": "THE REGISTERED LAYOUT-DESIGNS OF INTEGRATED CIRCUITS ORDINANCE, 2000 CONTENTS 1. Short title, extent and commencement 2. Definitions 3. Originality 4. Right to protections 5. Effect of protection 6. Commencement and duration of protection 7. Application for registration 8. Registration 9. Register of Layout-Designs 10. Right to transfer and subsequent rectification of Register of Layout-Designs 11. Change in the ownership of a protected layout-design 12. Contractual licences 13. Cancellation 14. Representation 15. Infringement and enforcement of right 16. Offences and penalties 17. Exploitation by a Government agency or third person 18. Exercise of discretionary power and extension of time 19. Appeal 20. Surrender of right 21. Power to make rules 22. Power to make regulations THE REGISTERED LAYOUT-DESIGNS OF INTEGRATED CIRCUITS ORDINANCE, 2000 ORDINANCE No. XLIX of 2000 [12th September, 2000] An Ordinance to provide for the registration of layout-designs of integrated circuits WHEREAS Pakistan is a signatory to the Agreement for the Establishment of the World Trade Organization and the Agreement on Trade Related Aspects of Intellectual Property Rights for the purpose of reduction of distortions and impediments to international trade and for effective and adequate protection of intellectual property rights, and with a view to meet obligations of Pakistan under the aforesaid Agreements and to promote technological developments in the country, it is expedient to provide for promotion of the development of semiconductor integrated circuits by establishing a system for legal protection of registered layout-designs of integrated circuits, and for matters ancillary thereto or connected therewith; AND WHEREAS, the National Assembly and the Senate stand suspended in pursuance of the Proclamation of the fourteenth day of October, 1999, and the Provisional Constitution Order No. 1 of 1999; AND WHEREAS, the President is satisfied that circumstances exist which render it necessary to take immediate action; NOW, THEREFORE, in pursuance of the Proclamation of Emergency of the fourteenth day of October, 1999, and Provisional Constitution Order No. 1 of 1999, as well as Order No. 9 of 1999, and in exercise of all powers enabling him in that behalf, the President of the Islamic Republic of Pakistan is pleased to make and promulgate the following Ordinance :— 1. Short title, extent and commencement:___ (1) This Ordinance may be called the Registered Layout-Designs of integrated Circuits Ordinance, 2000. (2) It extends to the whole of Pakistan. (3) It shall come into force at once. 2. Definitions :___In this Ordinance, unless there is anything repugnant in the subject or context,— (a) “Controller” means the Controller of Patents appointed under the Patents Ordinance, 2000; (b) “District Court” has the meanings assigned to that expression by the Code of Civil Procedure, 1908 (Act V of 1908). (c) “integrated circuit” means a product, in its final form or an intermediate form, in which the elements, at least one of which is an active element, and some or all of the interconnections are integrally formed in or on a piece of material which is intended to perform an electronic function; (d) “layout-design” means a three dimensional disposition, howsoever expressed, of the elements, at least one of which is an active element and of some or all of the interconnection of an integrated circuit or such a three dimensional disposition prepared for an integrated circuit intended for manufacture; (e) “Patent Office” means the Patent Office established under the Patents Ordinance, 2000; (f) “prescribed” means prescribed by rules made under this Ordinance; (g) “protection” means the right to layout-design protection as provided under section 4; (h) “registration” means registration under section 8; (i) “right-holder” means the natural person who, or legal entity which, shall be the beneficiary of the protection referred to in section 4; and (j) “regulations” means regulations made under this Ordinance. 3. Originality :___ (1) A layout-design shall be considered to be original if it is the result of its creator's own intellectual effort and is not commonplace among creators and manufacturers of layout- designs of integrated circuits at the time of its creation. (2) A layout-design consisting of a combination of elements and inter-connections that are commonplace shall be considered to be original if the combination taken as a whole fulfils the conditions specified in sub-section (1). 4. Right to protection:___ (1) The right to layout design protection shall be available under this Ordinance if and to the extent, the layout-design is original within the meaning of section 3 and has been subject of application for registration. (2) The right to layout-design protection shall belong to the creator of the layout-design. Where several persons have jointly created a layout-design, then such right shall belong to them jointly. (3) Where the layout-design has been created in execution of commission or an employment contract, the right to layout design protection shall belong, in the absence of contractual provisions to the contrary, to the person who commissioned the work or to the employee. (4) The right to layout-design protection shall be assignable or transferable by succession. (5) The right to layout-design protection shall not depend upon whether or not the integrated circuit which incorporates the registered layout-design is itself incorporated in an article. 5. Effect of protection:___(1) Subject to section 17, the protection shall have the effect that the following acts shall be unlawful if performed without the authorization of the right-holder, namely:— (i) reproducing, whether by incorporation in an integrated circuit or otherwise, the registered layout-design in its entirety or any part thereof, except the act of reproducing any part that does not comply with the requirement of originality referred to in section 3; and (ii) importing, selling or otherwise distributing for commercial purpose the registered layout-design, or an integrated circuit in which the registered layout- design is incorporated or an article incorporating such an integrated circuit in so far as it continues to contain an unlawfully reproduced layout-design. (2) The following acts shall not require the authorization of the right holder, namely:— (i) reproduction of the registered layout-designs for private purposes or for the sole purpose of evaluation, analysis, research or teaching (ii) the incorporation in an integrated circuit of a layout-design created on the basis of such analysis or evaluation and which is itself original under section 3 or the performance of any of the acts referred to in sub-section (1) in respect of that layout-design; (iii) the performance of any of the acts referred to in clause (ii) of sub-section (1) where the act is performed in respect of a registered layout-design, or in respect of an integrated circuit in which such a layout design is incorporated, that has been put on the market by or with the consent of, the right holder; (iv) the performance of any of the acts referred to in clause (ii) of sub-section (1) in respect of an integrated circuit incorporating an unlawfully reproduced layout- design or any article incorporating such an integrated circuit where the person performing or ordering such an act did not know, when acquiring the integrated circuit or the article incorporating such an integrated circuit, that it incorporated an unlawfully reproduced layout-design. However, after the time that such person has received sufficient notice that the layout-design was unlawfully reproduced that person may perform any of the said acts only with respect to the stock on hand, or ordered before such time, and shall be liable to pay to the right holder a sum equivalent to a reasonable royalty such as would be payable under a freely negotiated licence in respect of such a layout-design; or (v) the performance of any of the acts referred to in clause (ii) of sub-section (1) where the act is performed in respect of an identical layout-design which is original and has been created independently by a third party. 6. Commencement and duration of protection:___The protection of a layout-design registered under this Ordinance shall commence on the date of the first commercial exploitation anywhere in the world and shall terminate at the end of the tenth calendar year from the date of such first commercial exploitation. 7. Application for registration:___ (1) An application for the registration of a layout design shall be in writing and shall be filed with the Patent Office. A separate application shall be filed for each layout-design. (2) An application for the registration of a layout-design may either be filed only if a layout- design has not been commercially exploited or has been commercially exploited for not more than two years. (3) An application submitted under sub-section (1) shall— (i) contain a request for registration of the layout-design in the Register of Layout-Designs and a brief an precise designation thereof; (ii) indicate the name, address, nationality and, if different from the address, the habitual residence of the applicant; (iii) be accompanied by— (a) the power of attorney, appointing the representative of the applicant, if any; (b) a copy or drawing of the layout-design and a sample of the integrated circuit alongwith information defining the electronic function which the integrated circuit is intended to perform, however, the applicant may omit such parts of the copy or drawing related to the manner of manufacture of the integrated circuit, provided that the parts submitted are sufficient to allow the identification of the layout-design; and (c) payment of the prescribed fee to the Patent Office; (iv) specify the date of first commercial exploitation of the layout-design somewhere in the world; and (v) provide particulars establishing the right to layout-design protection under section 4. (4) Where the application does not duly comply with the requirements of sub-section (3), the Controller shall inform the applicant about the defects and ask him to make necessary corrections within the prescribed time-limit. (5) The Controller shall accord as the filing date to be the date of receipt of the complete application in accordance with the requirements of sub-section (3). (6) The Controller shall confirm the filing date and communicate it to the applicant. (7) If the defects are not corrected within the time-limit referred to in sub-section (4), the application shall be deemed not to have been filed. 8. Registration:___ (1) The Controller shall, where the application complies with the requirement of section 7, after such enquiry as he thinks fit, register the layout-design in the Register of Layout-Designs. (2) The registration of a layout-design shall be published in the official Gazette. 9. Register of Layout-Designs:___ (1) The Patent Office shall maintain a register to be called the “Register of Layout-Designs” in which it shall, for each registered layout-design, effect all the recordings provided for in this Ordinance. (2) The Register of Layout-Designs shall contain the number, title, filing date and the date of first commercial exploitation of the layout-design as well as the name and address of the right holder and other particulars as may be prescribed. (3) Any person may consult the Register of Layout Designs and obtain extracts therefrom, on payment of the prescribed fee. 10. Right to transfer and subsequent rectification of Register of Layout-Designs:___ (1) Where the essential contents of an application have been taken from the layout-design of another person without his consent, such person may, in writing, request the Controller to transfer the application to him. (2) Where the application has already resulted in a registration, that person may, within three years from the publication of the registration, in writing, request the Controller to transfer the registration to him and to rectify the entry in the Register of Layout-designs accordingly. (3) The Controller shall send forthwith a copy of such a request to the right-holder, and, within the prescribed period and in the prescribed manner, such right-holder may send to the Controller a counter-statement of the grounds on which he relies. (4) If the right-holder sends a counter-statement, the Controller shall furnish a copy thereof to the person requesting the transfer and, after hearing the parties, if either or both wish to be heard, and considering the merits of the case, shall decide whether the application or registration should be transferred and, where applicable, whether the Register of Layout-Designs should be rectified 11. Change in the ownership of a protected layout-design:___(1) Any change in the ownership of a protected layout-design shall be in writing. (2) Once the layout-design has been registered the change in ownership at the request of any interested party, made to the Patent Office, shall be recorded and published by the Controller. Such change shall have no effect against third parties until such recording is effected. (3) An application for change in ownership shall be accompanied by such fee as may be prescribed. 12. Contractual licences:___ (1) Any licence contract concerning a registered layout-design shall be submitted to the Patent Office which shall keep its contents confidential but shall publish a reference thereto. (2) The licence contract shall have no effect against third parties until such submission as referred to in sub-section (1) has been made. 13. Cancellation.—(1) Any interested person may apply for cancellation of registration of a layout-design on the grounds that:— (i) the layout-design is not protectable under sections 3 and 4; (ii) the right holder is not entitled to protection under section 4; or (iii) the layout-design has not been commercially exploited anywhere in the world before the filing of the application for registration. (2) Where the grounds for cancellation are established with respect only to a part of the layout- design, only the corresponding part of the registration shall be cancelled. (3) An application for cancellation of the registration of the layout-design under sub-sections (1) and (2) shall be filed with the District Court in writing. The request shall state the grounds on which it is based. (4) Any cancelled layout-design registration, or part thereof, shall be regarded as null and void from the date of the commencement of protection. (5) The final decision of the District Court shall be communicated to the Controller who shall record it and publish a reference thereto as soon as possible. 14. Representation:___Where an applicant's ordinary residence or principal place of business is outside Pakistan he shall be represented by a legal practitioner resident and practicing in Pakistan. 15. Infringement and enforcement of right:___ (1) Infringement shall consist of the performance of any act which is unlawful under section 5. (2) On the request of the right holder, or of his licensee if the latter has requested the right holder to institute court proceedings for a specific relief and the right holder has refused or failed to do so within a reasonable period, the District Court may grant an injunction to prevent infringement or an imminent infringement and award damages and grant any other remedy provided for in the relevant law in force. (3) An action under sub-section (2) may be initiated only after a layout-design has been registered under section 8. 16. Offences and penalties:___ (1) Any person who, without authorization knowingly performs any act which is unlawful under section 5 shall be guilty of an offence punishable with imprisonment for a term which may extend to two years, or with fine which shall not be less than two hundred thousand rupees, or with both. (2) The Court may also order the seizure, forfeiture and destruction of the layout-designs of integrated circuits or article; and of any materials or implements having been predominantly used in the commission of the offence. 17. Exploitation by a Government agency or third person:___ (1) Subject to sub-section (2), where— (i) the public interest, in particular, national security, nutrition, health or the development of other vital sectors of the national economy requires the exploitation of a registered layout-design for public non-commercial use; or (ii) a judicial or administrative body has determined that the manner of exploitation of a registered layout-design, by the right-holder, or his licensee, is anticompetitive, and the Federal Government is satisfied that exploitation of the layout-design in accordance with the provisions of this section would remedy such practice, the Federal Government may, even without the consent of the right holder, decide that a Government agency or a third person designated by the Federal Government may exploit the layout-design. (2) The Federal Government shall, before taking any decision under sub-section (1), give the right-holder and any interested person an opportunity of being heard if he wishes to be heard. (3) The exploitation of a layout-design shall be limited to the purpose for which it was authorized under sub-section (1), and shall be subject to the payment to the right-holder of an adequate remuneration therefore taking into account the economic value of the said authorization as the Federal Government may determine. (4) Upon request of the right-holder, or of the beneficiary of the authorization under sub- section (1), the Federal Government may after hearing the parties, if either or both wish to be heard, vary the terms of the decision authorizing the exploitation of the layout-design to the extent that changed circumstances justify such variation. (5) Upon the request of the right-holder, the Federal Government shall terminate the authorization if it is satisfied that the circumstances which led to the decision have ceased to exist and are unlikely to recur or that the beneficiary of the authorization under sub-section (1) has failed to comply with the terms of such authorization. (6) Notwithstanding the provisions of sub-section (5), the Federal Government shall not terminate an authorization if it is satisfied that the adequate protection of the legitimate interests of the beneficiary of the authorization justifies the maintenance of such authorization. (7) Where a third person has been designated by the Federal Government, the authorization may only be transferred with the enterprise or business of the beneficiary of authorization or with the part of the enterprise or business within which the layout-design is being exploited. (8) A request for grant of authorization under sub-section (1) shall be accompanied by evidence that the right-holder has received, from the person seeking the authorization, a request for a contractual licence but that person has been unable to obtain such licence on reasonable commercial terms and conditions and within a reasonable time: Provided that this sub-section shall not apply in cases of— (i) national emergency or other circumstantial urgency provided that in such cases the owner of the patent shall be informed of decision of the Federal Government as soon as reasonably practicable; (ii) public non-commercial use; and (iii) anti-competitive practices determined as such by a judicial or administrative body in accordance with clause (ii) of sub-section (1). 18. Exercise of discretionary power and extension of time:___ (1) The Controller shall give any party to any proceeding before him an opportunity of being heard before exercising any discretionary power under the provisions of this Ordinance which may adversely affect such party. (2) The Controller may, if he is satisfied that the circumstances justify it, upon receiving a written request therefor, extend the time for doing any act or taking any proceeding under this Ordinance, upon notice to the parties concerned and upon such terms as he may direct. 19. Appeal:___ (1) An appeal shall lie to the High Court in cases of dispute relating to the application of this Ordinance and in matters which under this Ordinance are required to be referred to a District Court. (2) An appeal shall lie to the High Court against the decision of the Federal Government under section 17. (3) An appeal shall lie to the High Court against any decision taken by the Controller under this Ordinance in particular the registration of a layout-design, by any interested party and such appeal shall be referred within two months of the date of such decision. 20. Surrender of right:___ (1) The right-holder may surrender his right to protection only with the approval of the sole use grantee, or ordinary use grantee and pledgee, if any. (2) A sole use grantee may surrender his sole use right to protection only with the approval of the ordinary use grantee and pledgee, if any. (3) An ordinary use grantee may surrender his ordinary use right to protection only with the approval of the pledgee, if any. 21. Power to make rules:___ (1) The Federal Government may, by notification in the official Gazette, make rules for carrying out the purposes of this Ordinance. (2) In particular and without prejudice to the generality of the foregoing power, such regulations may provide for— (a) payment of fee in connection with an application for registration of layout- design of' integrated circuit and matters related thereto; and (b) fee to be paid to the Patent Office for obtaining copies of the relevant record of the registered layout-design of integrated circuit from the Patent Office. 22. Power to make regulations:___The Controller may, with the approval of Federal Government, make regulations, not inconsistent with the rules, for carrying out the purposes of this Ordinance."
}