{
  "file": "administrator9dbf323a5be197b865503ff4b065b406.pdf",
  "law_name": "THE PAKISTAN MILITARY ACADEMY (DEGREES AND CERTIFICATES) ORDINANCE,",
  "text": "THE PAKISTAN MILITARY ACADEMY (DEGREES AND CERTIFICATES) ORDINANCE, 1959 CONTENTS 1. Short title and commencement 2. Definition 3. Conferment of degrees, etc., on cadets and officers 4. Power to make regulations THE SCHEDULE THE PAKISTAN MILITARY ACADEMY (DEGREES AND CERTIFICATES) ORDINANCE, 1959 ORDINANCE No. LI of 1959 [16th September, 1959] An Ordinance to authorise the Pakistan Military Academy at Kakul to confer degrees and grant certificates. WHEREAS it is expedient to authorise the Pakistan Military Academy at Kakul to confer degrees and grant certificates; NOW, THEREFORE, in pursuance of the Proclamation of the seventh day of October, 1958, and in exercise of all powers enabling him in that behalf, the President is pleased to make and promulgate the following Ordinance:___ 1. Short title and commencement.___(1) This Ordinance may be called the Pakistan Military Academy (Degrees and Certificates) Ordinance, 1959. (2) It shall come into force at once. 2. Definition. In this Ordinance, unless there is anything repugnant in the subject or context,___ (a) “Academy” means the Pakistan Military Academy at Kakul; (b) “certificate” means a certificate mentioned in Part II of the Schedule; and (c) “degree” means a degree mentioned in Part I of the Schedule. 3. Conferment of degrees, etc., on cadets and officers.___1[(1)] The Academy shall have the power to confer a degree on, or grant a certificate to, any gentleman cadet of the Academy on his successful completion of the appropriate course at the Academy, and such power shall include the power to confer a degree on, or grant a certificate to, any officer who at any time before the commencement of this Ordinance was commissioned from the Academy. 1[(2) The provisions of sub-section (1) shall apply to those gentlemen cadets of the Academy who, before the commencement of the Pakistan Military Academy (Degrees and Certificates) (Amendment) Ordinance, 1962, had successfully completed their training at the Royal Military Academy, Sandhurst, or who, after such commencement, successfully complete their training at that Academy.] 4. Power to make regulations.___The Academy may, with the previous approval in writing of the 2[Federal Government], make Regulations for carrying out the purposes of this Ordinance. 1Re-numbered and added by ordinance No. XIX of 1962, s.2. 2Subs. by F.A.O., 1975. THE SCHEDULE PART I Academic Courses Name Degree to be awarded 1. Arts Course____1 B.A. (KAKUL ACADEMY). 2. Science Course—1 B.Sc. (KAKUL ACADEMY). PART II Academic Courses Name Certificate to be awarded 1. Arts Course—2 Intermediate in Arts (KAKUL ACADEMY). 2. Science Course___2. Intermediate in Science (KAKUL ACADEMY). __________________ RGN Date: 20-05-2024"
}