{
  "file": "administratore33a61bdf0659ec30aa77435f93ce2a7.pdf",
  "law_name": "The International Finance Corporation Act, 1956",
  "text": "THE INTERNATIONAL FINANCE CORPORATION ACT, 1956 CONTENTS 1. Short title, extent and commencement 2. Definitions 3. Financial provisions 4. State Bank to be depository for the Corporation. 5. Certain provisions of Agreements to have force of Law. THE SCHEDULE THE INTERNATIONAL FINANCE CORPORATION ACT, 1956 ACT NO. XXVIII OF 1956 [18th April, 1956] An Act to give effect to an international agreement for the establishment and operation of an International Finance Corporation and for purposes connected therewith. WHEREAS Articles of Agreement of the International Finance Corporation have, on the eleventh day of April 1955, been approved by the Executive Directors of the International Bank for Reconstruction and Development, hereinafter referred to as the Bank, and deposited in the archives of the Bank for signature and acceptance on behalf of Governments ; AND WHEREAS it is expedient to provide for the participation of Pakistan in the said Corporation in pursuance of the aforesaid agreement; It is hereby enacted as follows :___ 1. Short title, extent and commencement.___(1) This Act may be called the International Finance Corporation Act, 1956. (2) It extends to the whole of Pakistan. (3) It shall come into force on such date1 as the 2[Federal Government] may, by notification in the official Gazette, appoint. 2. Definitions.___ In this Act, unless there is anything repugnant in the subject or context,___ (a) “agreement” means any Agreement which may be signed and accepted on behalf of the Government of Pakistan in pursuance of the Articles of Agreement approved by the Executive Directors of the Bank on the eleventh day of April 1955 providing for the establishment and operation of an international body to be called the International Finance Corporation ; (b) “Corporation” means the International Finance Corporation ; (c) “member” means a member of the Corporation. 1i.e., the 8th May, 1956, see Gaz. of P., 1956, Ext., P. 1033. 2Subs. by The Federal Adaptation of Laws Order 1975 (President’s Order No. 4 of 1975, Art. 2 and Table. 3. Financial provisions.___(1) There shall be paid out of the 1[Federal Consolidated Fund] and until the 1[Federal Consolidated Fund] is constituted, out of the Revenues of the 2[Federal Government], all such sums as may be required for the purpose of making payments on behalf of the Government of Pakistan under paragraph (a) of section 3 of Article II of the Agreement. (2) Any sums received by the Government of Pakistan from the Corporation in pursuance of the Agreement shall be paid into the 1[Federal Consolidated Fund] and until the 1[Federal Consoli- dated Fund] is constituted into the Revenues of the 2[Federal Government]. 4. State Bank to be depository for the Corporation.___ The State Bank of Pakistan shall be the depository of the Pakistan currency holdings or other assets of the Corporation. 5. Certain provisions of Agreements to have force of Law.___ Notwithstanding anything to the contrary contained in any other law, the provisions of Article VI of the Agreement set out in the Schedule shall have the force of law in Pakistan : Provided that nothing in section 9 thereof shall be construed as___ (a) entitling the Corporation to import into Pakistan goods free of any duty of customs without any restriction on their subsequent sale therein, or (b) conferring on the Corporation any exemption from duties or taxes which form part of the price of goods sold or which are in fact no more than charges for services rendered. THE SCHEDULE (See section 5) Provisions of Agreement which shall have force of Law THE AGREEMENT Article VI STATUS, IMMUNITIES AND PRIVILEGES SECTION 1.___ Purpose Article of To enable the Corporation to fulfil the functions with which it is entrusted, the status, immunities and privileges set forth in this Article shall be accorded to the Corporation in the territories of each member. 1Subs. by The Federal Adaptation of Laws Order 1975 (President’s Order No. 4 of 1975, Art. 2 and Table. 2Subs., ibid. SECTION 2. ___Status of the Corporation. The Corporation shall possess full juridical personality and in particular, the capacity: (i) to contract ; (ii) to acquire and dispose of immovable and movable property ; (iii) to institute legal proceedings. SECTION 3.___Position of the Corporation with regard to Judicial Process. Actions may be brought against the Corporation only in a court of competent jurisdiction in the territories of a member in which the Corporation has an office, has appointed an agent for the purpose of accepting service or notice of process, or has issued or guaranteed securities. No action shall, however, be brought by members or persons acting for or deriving claims from members. The property and assets of the Corporation shall, wheresoever located and by whomsoever held, be immune from all forms of seizure, attachment or execution before the delivery of final judgment against the Corporation. SECTION 4.___ Immunity of Assets from Seizure. Property and assets of the Corporation, wherever located and by whomsoever held, shall be immune from search, requisition, confiscation, expropriation or any other form of seizure by execu- tive or legislative action. SECTION 5. ___Immunity of Archives. The archives of the Corporation shall be inviolable. SECTION 6.___ Freedom for Assets from Restrictions To the extent necessary to carry out the operations provided for in this Agreement and subject to the provisions of Article III, section 5, and the other provisions of this Agreement, all property and assets of the Corporation shall be free from restrictions, regulations, controls and moratoria of any nature. SECTION 7.___Privilege for Communications The official communications of the Corporation shall be accorded by each member the same treatment that it accords to the official communications of other members. SECTION 8. ___ Immunities and Privileges of Officers and Employees. All Governors, Directors, Alternates, officers and employees of the Corporation: (i) shall be immune from legal process with respect to acts performed by them in their official capacity ; (ii) not being local nationals, shall be accorded the same immunities from immigration restrictions, alien registration requirements and national service obligations and the same facilities as regards exchange restrictions as are accorded by members to the representatives, officials, and employees of comparable rank of other members ; (iii) shall be granted the same treatment in respect of travelling facilities as is accorded by members to representatives, officials and employees of comp- arable rank of other members. SECTION 9.___ Immunities from Taxation (a) The Corporation, its assets, property, income and its operations and transactions authorized by this Agreement, shall be immune from all taxation and from all customs duties. The Corporation shall also be immune from liability for the collection or payment of any tax or duty. (b) No tax shall be levied on or in respect of salaries and emoluments paid by the Corporation to Directors, Alternates, officials or employees of the Corporation who are not local citizens, local subjects, or other local nationals. (c) No taxation of any kind shall be levied on any obligation or security issued by the Corporation (including any dividend or interest thereon) by whomsoever held: (i) which discriminates against such obligation or security solely because it is issued by the Corporation ; or (ii) if the sole jurisdictional basis for such taxation is the place or currency in which it is issued, made payable or paid, or the location of any office or place of business maintained by the Corporation. (d) No taxation of any kind shall be levied on any obligation or security guaranteed by the Corporation (including any dividend or interest thereon) by whomsoever held: (i) which discriminates against such obligation or security solely because it is guaranteed by the Corporation ; or (ii) if the sole jurisdictional basis for such taxation is the location of any office or place of business maintained by the Corporation. SECTION 10.___ Application of Article Each member shall take such action as is necessary in its own territories for the purpose of making effective in terms of its own law the principles set forth in this Article and shall inform the Corporation of the detailed action which it has taken. _______ Date: 18-12-2024"
}