{
  "file": "administratord2876c0ca2780e889724d4a8bebddc74.pdf",
  "law_name": "THE EMPLOYMENT (RECORD OF SERVICES) ACT, 1951 CONTENTS",
  "text": "THE EMPLOYMENT (RECORD OF SERVICES) ACT, 1951 CONTENTS 1. Short title, extent, application and commencement 2. Definitions 3. Exemptions 4. Service book to be produced by employee 5. Form of the service book 6. Entries in the service book 7. Power of Inspection 8. Penalty 9. Cognizance of offences 10. Prosecution 11. Protection of action taken under the Act 12. Power to make rules THE EMPLOYMENT (RECORD OF SERVICES) ACT, 1951 1ACT NO. XIX of 1951 [18th April, 1952] An Act to make provision for compulsory maintenance of the record of service of persons in certain classes of employment in certain areas. WHEREAS it is expedient to make provision for the compulsory maintenance of the record of service of persons in certain classes of employment in certain areas; It is hereby enacted as follows: ___ 1. Short title, extent, application and commencement.___(1) This Act may be called the Employment (Record of Services) Act, 1951. 2[(2) It extends to the whole of Pakistan.] (3) It applies to all persons concerned as employers or employees in such classes of employment and in such areas as the 3[Provincial Government] may specify by notification in this behalf. (4) It shall come into force on such date as the 3[Provincial Government] may, by notification in the official Gazette, appoints. 2. Definitions. In this Act, unless there is anything repugnant in the subject or context,___ 3[* * * * * * *] (b) “employee” means a person to whom this Act applies engaged for hire or for any other pecuniary consideration by an employer, or an apprentice; (c) “employer” means any person to whom this Act applies engaging the services___ manual or clerical, skilled or unskilled___of another for hire or for any other pecuniary consideration or an apprentice for the purpose of carrying on his calling, trade, business, undertaking or manufacture or for personal or domestic service and includes any body of persons whether incorporated or not and any managing agent of any employer; 1The Act has been extended to__ (i) the Baluchistan States Union, by the Baluchistan States Union (Federal Laws) (Extension) Order, 1953 (G.G.O. 4 of 1953). (ii) the State of Bahawalpur by the Bahawalpur (Extension of Federal Laws) Order, 1953 (G.G.O. 11 of 1953) ; and (iii) Khairpur State, by the Khairpur (Federal Laws) (Extension) Order, 1953 (G.G.O. of 5 of 1953). The Act has been and shall be deemed to have been brought into force in Gwadur (with effect from the 8th September, 1958), by the Gwadur (Application of Central Laws) Ordinance, 1960 (37 of 1960), s. 2. The Act has been brought into force throughout the Province of West of Pakistan (with effect from the 15th August, 1961), see Gazette of West Pakistan, 1961, Ext., p. 1855. This Act has been applied to certain classes of employment throughout the Province of West Pakistan see Gazette of West Pakistan, 1961, Ext, p. 1855. The Act has been applied to the Provincially Administered Tribal Areas or to the parts or those areas to which it does not already apply, see Regulation No. 1 of 1972, s. 2 and Sch. 2Subs. by the Central Laws (Statute Reform) Ordinance No XXI of 1960, s. 3 and 2nd Sch. 3Subs. and omitted by A.O., 1964, Art. 2 and Sch. (d) “Labour Commissioner” means the officer so designated and appointed by the 1[Provincial Government]; (e) “prescribed” means prescribed by rules made under this Act; and (f) “wages” has the same meaning as in the Payment of Wages Act, 1936 (IV of 1936). 3. Exemptions. The 1[Provincial Government] may exempt from the provisions of this Act any establishment or undertaking where records of service are maintained to the satisfaction of the Government. 4. Service book to be produced by employee.___(1) Before engaging an employee the employer shall require from him his service book, if he asserts that he has been previously in employment under any other employer and the employee shall produce the service book if he has one. 2[(2) If the employee has no service book, the employer shall, at his own cost, provide one and keep it with himself.] (3) The service book 2[if any, produced by the employee under subsection (1)] shall be kept by the employer, who shall give the employee a receipt therefor in the prescribed form. (4) Nothing in this section shall prevent an agreement between the employee and the employer whereby it is provided that the employee shall keep and maintain a duplicate of his service book. (5) The employer shall hand over service book to the employee on the termination of the employee’s service with the employer, except where the 2[employee] has kept and maintained a duplicate of his service book. 2[(6) If the service book handed over to the employee under sub-section (5), or the duplicate thereof maintained by him, is lost by him, the employer shall provide him with a duplicate service book and may charge him the prescribed price.] 5. Form of the service book. The service book shall be of the size and in the form as may be prescribed and a passport size photo of the employee if a male shall be affixed to it. The service book shall contain particulars of identification of the employee, the name and other particulars of the persons under whom employed from time to time, period of employment, occupation, rate of wages including allowances, if any, leave taken and records of conduct and efficiency by employers. 6. Entries in the service book. The employer shall at the commencement of the employment and during the continuance of the same make such entries therein from time to time as are required by this Act and the rules made thereunder and he and the employee shall sign the entries as they are made. 7. Power of Inspection. The Labour Commissioner or an officer authorised by him in writing may by written notice require an employer or an employee to produce the service book or the duplicate service book or any other paper or document which he may have reason to believe contains the particulars noted in the service book and thereupon the employer or the employee, as the case may be, shall comply if he is in possession of the said book, paper or document. 1Subs. by A.O., 1964, Art. 2 and Sch. 2Subs., ins and added by Ordinance No. XVIII of 1960, s. 2. 8. Penalty. Any breach of the provisions of this Act or the rules made thereunder shall be punishable in the case of an employer with fine which may extend to fifty rupees, and in the case of an employee with a fine which may extend to five rupees, and for the purposes of this section any failure or refusal to comply with a requirement duly made by a person empowered under this Act or under the rules made thereunder to make it shall be deemed to be a breach of the said provisions. 9. Cognizance of offences. No court shall take cognizance of an offence punishable under this Act unless previous sanction for prosecution has been accorded on the prescribed form by the Labour Commissioner and except upon complaint by any public servant or by a person authorised in this behalf by the Labour Commissioner in writing on the said form. 10. Prosecution. Any infringement of or refusal or omission to carry out the provisions of this Act or the rules made thereunder by any person may be reported to the Labour Commissioner or to any other officer appointed in this behalf by him by an order in writing for such local limits as may be assigned in the order, for sanction of prosecution or for such other action as he may deem proper to take. 11. Protection of action taken under the Act. No suit, prosecution or legal proceeding shall lie against any person in respect of anything in good faith done or intended to be done under this Act or the rules made thereunder. 12. Power to make rules.___ (i) The 1[Provincial Government] may after previous publication, make rules for carrying into effect the purposes of this Act. (ii) In particular and without prejudice to the generality of the foregoing power such rules may provide for___ (a) the form of the service book and the particulars to be entered therein ; (b) the quality of paper and covering page of the service book; (c) the number of pages of the book; (d) the time within which any entry in the service book shall be made and the occasions on which a fresh entry shall be made; (e) the authorisation of persons to manufacture and sell service books and prescribed forms; (f) the procedure at any investigation and for proceeding before the grant of sanction for prosecution by the Labour Commissioner; (g) the persons and class of public servants who may be authorised by the Labour Commissioner to make complaints under this Act, and (h) the manner of calculation of monthly wages. ______________ RGN Date: 22-05-2024 1Subs. by A.O., 1964, Art. 2 and Sch."
}