{
  "file": "administratorb6470b8aab4926f2943e7870919a09bc.pdf",
  "law_name": "The Chartered Accountants Ordinance, 1961",
  "text": "THE CHARTERED ACCOUNTANTS ORDINANCE, 1961 PREAMBLE. CHAPTER I. PRELIMINARY 1. Short title, extend and commencement. 2. Definitions. CHAPTER II. THE INSTITUTE OF CHARTERED ACCOUNTANTS OFPAKISTAN 3. Incorporation of the institute. 4. Entry of names in register. 5. Associates and fellows. 6. Certificate of practice. 7. Members to be known as Chartered Accountants. 8. Disabilities. CHAPTER III. COUNCIL OF THE INSTITUTE 9. Constitution of the Council of the Institute. 10. Mode of election to the Council. 11. Nomination in default of election. 12. President and Vice President or Vice-Presidents. 13. Resignation of membership and casual vacancies. 14. Duration and dissolution of Council. 15. Functions of the council. 16. Staff, remuneration and allowances. 17. Finances of the Institute. CHAPTER IV. REGISTER OF MEMBERS 18. Register 19. Removal from the Register. CHAPTER V. REGIONAL COMMITTEES 20. Constitution and functions of Regional Committees. CHAPTER VA. MISCONDUCT 20 A. Facts, etc, to be laid before the Investigation Committee. 20 B. Enquiry by the Investigation Committee. 20 C. Member or student not found guilty. 20 D. Orders by the Council if member found guilty. 20 E. Orders by the Council if student found guilty. 20 F. Hearing of case by the High Court. 20 G. Effect of inquiry 20 H. Council and Investigation Committee to have powers of civil court. 20 I. Publication of findings and decisions. 20 J. Return of certificate. 20 K. Appeal and revision. CHAPTER VI. PENALTIES 21. Penalty for falsely claiming to be a member etc. 22. Penalty for using name of the Council awarding degree of chartered accountancy,etc. 23. Companies not to engage in accountancy. 24. Unqualified persons not to sign documents. 25. Sanction to prosecute. CHAPTER VII. MISCELLANEOUS 26. Maintenance of branch offices. 27. Power to make byelaws. 28. Powers of Federal Government to direct byelaws to be made or to make or amend byelaws 29. References to registered accountants, etc to be construed as references to chartered accountants 30. Amendment of section 144 of the Companies Act, 1913 (VII of 1913), 31. [Saving.] SCHEDULE I. [See section 20A] SCHEDULE II. [See section 20A and 20D] SCHEDULE III. [See section 20A and 20E] THE CHARTERED ACCOUNTANTS ORDINANCE, 1961 ORDINANCE No. X OF 1961 [10th March, 1961] An Ordinance to make provision for the regulation of the profession of Accountants. WHEREAS it is expedient to make provision for the regulation of the profession of accountants and for that purpose to establish and Institute of Chartered Accountants; NOW, THEREFORE, in pursuance of the Proclamation of the seventh day of October, 1958 and in exercise of all powers enabling him in that behalf the President in pleased to make and promulgate the following Ordinance:— CHAPTER I. PRELIMINARY 1. Short title, extend and commencement.—(1) This Ordinance my be called the Chartered Accountants Ordinance, 1961. (2) It extends to the whole of Pakistan 1[and shall apply to all members, wherever they may be]. (3) It shall come into force on such date2 [3[Federal Government] may, by notification in the official Gazette, appoint in this behalf. 2. Definitions.__(1) In this Ordinance, unless there is anything repugnant in the subject or context,— (a) “associate” means an associate member of the Institute; (b) “chartered accountant” means a person who is a member of the Institute; (c) “Council” means the Council of the Institute; 4[(cc) “fellow” means a fellow member of the Institute]; (d) “Institute” means the Institute of Chartered Accountants of Pakistan on stituted under this Ordinance; (e) “prescribed” means prescribed by the bye-laws of the Institute; (f) “Register” means the Register of the Members of the Institute maintained under thisOrdinance; (g) “registered accountant” means any person who has been enrolled on the Registerof Accountants maintained by the 3[Federal Government] under the Auditors'Certificates Rules, 1950; 4[(gg) “student” means a person who is or has been a trainee under a training contract with a member of the Institute entitled to train students under this Ordinance and the bye-laws made thereunder and has not successfully completed the examinations of the Institute ; and] (h) “year” means the period commencing on the first day of July of any year and ending on the thirtieth day of June of the succeeding year. 1Added by the Chartered Accountant (Amdt.) Ordinance, 1983 (15 of 1983), s. 2. 2The 1st July, 1961, see Gaz. of P., 1961, Ext., p. 1025. 3Subs. by F.A.O., 1975, Art. 2 and Table, for “Central Government”. 4Ins. by Ord. 15 of 1983, s. 3. (2) A member of the Institute shall be deemed “to be in practice” when individually or in partnership with chartered accountants in practice, he, in consideration of remuneration received or to be received— (i) engages himself in the practice of accountancy, or (ii) offers to perform or performs services involving the auditing, or verification of financial transactions, books, accounts, or records or the preparation, verification or certification of financial accounting and related statements or holds himself out to the public as an accountant; or (iii) renders professional services or assistance in or about matters of principle or detail relating to accounting procedure or the recording, presentation or certification of financial facts or data ; or (iv) renders such other services as, in the opinion of the Council, are or may be rendered by a chartered accountant in practice; and the words “to be in practice” with their grammatical variations and cognate expressions shall be construed accordingly. Explanation.—An associate or a fellow the Institute who is salaried employee of a chartered accountant in practice or a firm of such chartered accountants shall, notwithstanding such employment, be deemed to be in practice for the limited purpose of the training of 1[students]. __________ CHAPTER II. THE INSTITUTE OF CHARTERED ACCOUNTANTS OF PAKISTAN. 3. Incorporation of the Institute.—(1) All persons whose names are entered in the Register at the commencement of this Ordinance and all persons who may hereafter have their names entered in the Register under the provisions of this Ordinance, so long as they continue to have their names borne on the said Register, are hereby constituted a body corporate by the name of the Institute of Chartered Accountants of Pakistan, and all such persons shall be known as members of the Institute. (2) The Institute shall have perpetual succession and a common seal and shall have power to acquire, hold and dispose of property, both movable and immovable, and shall by its name sue and be sued. 4. Entry of names in Register.—(1) Any of the following persons shall be entitled to have his name entered in the Register, namely,— (i) any person who is registered accountant at the commencement of this Ordinance; (ii) any person who has passed such examination and completed such training as may be prescribed; 1 Subs. by the Chartered Accountants (Amdt.) Ordinance, 1983 (15 of 1983), s. 3, for “articled clerks”. (iii) any person who has passed such other examination and completed such other training outside Pakistan as is recognized by the 1[Federal Government] or the Council with the approval of the 1[Federal Government] as being equivalent to the examination and training prescribed for members of the Institute: 2[Provided that, in the case of any such person, the Council may, with the approval of the Federal Government, impose such conditions as it may deem fit.] (iv) any person domiciled in Pakistan, who at the commencement of this Ordinance is studying for any foreign examination and is at the same time undergoing training, whether within or without Pakistan or, who, having passed such foreign examination, is at the commencement of this Ordinance undergoing training whether within or without Pakistan. Provided that any such examination or training was recognized before the commencement of this Ordinance for the purpose of conferring the right to be registered as an accountant under the Auditors Certificates Rules, 1950, and provided further that such person passes the examination or completes training 3[.] 4* * * * * * * (2) The name of every person belonging to the class mentioned in clause (i) of sub-section (1) shall be entered in the Register without the payment of any entrance fee or any application being made in that behalf and shall, for the purpose of sub-section (1) of section 3, be deemed to have been so entered at the commencement of this Ordinance. (3) Every person belonging to any of the classes mentioned in clauses (ii), 4[(iii), 5[and (iv)]] of sub- section (1) shall have his name entered in the Register on application being made and granted in the prescribed manner and on payment of the prescribed fee, which shall not exceed rupees five hundred in any case. (4)The 1[Federal Government] shall take such steps as may be necessary for the purpose of having the names of all persons belonging to the class mentioned in clause (i) of sub- section (1) entered in the Register. 5. Associates and Fellows.—(1) The members of the Institute shall be of two classes designated respectively as associates and fellows. (2) Every person shall, on his name being entered in the Register, become an associate member of the Institute and be entitled to use the letters A.C.A after his name to indicate that he is an associate member of the Institute of Chartered Accountants. 1 Subs. by F.A.O., 1975, Art. 2 and Table, for “Central Government”. 2 Subs. by the Chartered Accountants (Amdt.) Ordinance, 1983 (15 of 1983) s. 4, for the Proviso. 3 Subs. by the Chartered Accountants (Amdt.) Ordinance, 1968 (4 of 1968) s. 2, for the semi-colon, which was previously amended by Ord. 24 of 1962, s. 2, for full-stop. 4Cl.(v) omitted ibid. 4 Subs. by the Chartered Accountants (Amdt.) Ordinance, 1962 (24 of 1962), s. 2, for clauses (iii) and (iv). 5 Subs. by the Chartered Accountants (Amdt.) Act 1968, (4 of 1968), s. 2, for “clauses (iv) and (v)”. 1[(3) An associate member who has been in practice for at least five years or an associate member of the Institute for a period of not less than ten years shall, on payment of the prescribed fee, have his name transferred to the Register of Fellows of the Institute and on having his name transferred to the Register of Fellows, he shall be entitled to use the letters F.C.A after his name to indicate that he is a fellow member of the Institute. Explanation.—For the purpose of this sub-section, two years as a non-practicing associate shall be counted as one year of practice of such associate.] 6. Certificate of practice.—(1) No member of the Institute shall be entitled to practice as an auditor of a public company as defined in the Companies Act, 1913 (VII of 1913) , unless he has obtained from the Council a certificate of practice 2[ . ] 3* * * * * * * (2) Every such member shall pay such annual fee for his certificate as may be prescribed, and such fee shall be due on the first day of July in each year. 7. Members to be known as Chartered Accountants.—Every member of the Institute in practice shall and any other member may, use the designation of a Chartered Accountants and no member using such designation shall use any other designation whether in addition thereto or in substitution therefore: Provided that nothing contained in this section shall be deemed to prohibit any such person from adding any other description or designatory letters to his name, if entitled thereto, to indicate membership of such other institute of accountancy, whether in Pakistan or elsewhere as may be recognized in this behalf by the Council, or any other qualification that he may possess, or to behalf by the Council, or any other qualification that he may possess, or to prohibit a firm, all the partners of which are members of the Institute and in practice, from being known by its firm name as Chartered Accountants. 8. Disabilities.—Notwithstanding anything contained in section 4, a person shall not be entitled to have his name entered in or borne on the Register if he— (i) has not attained the age of twenty-one years at the time of his application for the entry of his name in the Register; or (ii) is of unsound mind and stands so adjudged by a competent Court; or (iii) is an undercharged insolvent; or (iv) having been discharged of insolvency, has not obtained from the Court a certificate stating that his insolvency was caused by misfortune without any misconduct on his part ; or (v) has been convicted by a competent Court, whether within or without Pakistan of an offence involving moral turpitude and punishable with transportation or imprisonment or of an offence, not of a technical nature, committed by him in his professional capacity unless in respect of the offence committed he has either been granted a pardon or, on an application made by him in this behalf, the 1[Federal Government] has, by an order in writing, removed the disability; or 1 Subs. by the Chartered Accountants (Amdt.) Ordinance, 1983 (15 of 1983), s. 5, for sub-section (3). 2Subs. ibid., s.6, for the colon. 3 Proviso omitted ibid. (vi) has been removed from the membership of the Institute on being found on inquiry to have been guilty of such professional or other misconduct, as may be prescribed: Provided that a person who has been removed from the membership of the Institute for a specified period, shall be entitled to have his name entered in the Register after the expiry of such period. ___________ CHAPTER III. COUNCIL OF THE INSTITUTE 9. Constitution of the Council of the Institute.—(1) There shall be a Council of the Institute for the management of the affairs of the Institute and for discharging the functions assigned to it under this Ordinance. 1[(2) The Council shall be composed of the following persons, namely :— (a) the prescribed number of persons, not being less than twelve, elected from the two prescribed regional constituencies by the members of the Institute belonging to such constituencies from among such members of at least five years’ standing, the number of members to be elected from each such constituency being such as may be prescribed: Provided that each such regional constituency shall consist of two zones, to be known as Zone “A” and Zone “B”, having the prescribed limits : Provided further that at least one member shall be elected from each of the aforesaid Zones; and (b) not more than four persons nominated by the Federal Government.] 2* * * * * * * 10. Mode of election to the Council.—(1) Elections under clause (a) of sub-section (2) of section 9 shall be conducted in the prescribed manner. 3[(2) Where any dispute arises regarding any such election, the matter shall be referred by the Council to a tribunal appointed by the President of the Council in this behalf and the decision of such Tribunal shall be final: Provided that in case the President of the Council in office is himself a party to such dispute or is unwilling to make such appointment, the immediate past President of the Council shall appoint the Tribunal : 1 Subs. by the Chartered Accountants (Amdt.) Ordinance, 1983 (15 of 1983), s. 7, for sub-section (2). 2 Sub-section (3) omitted ibid. 3 Subs. ibid., s. 8. for sub-section (2). Provided further that no such reference shall be made except on an application made to the Council by an aggrieved party, within thirty days from the date of the declaration of the result of the Election.] (3) The expenses of the Tribunal shall be borne by the Institute. 1[11. Nomination in default of election.—(1) If the members of the Institute referred to in clause (a) of sub-section (2) of section 9 fail to elect the required number of members which they are empowered under that section to elect from a zone of a constituency, the members declared elected from that zone shall nominate the number of members not elected who shall be deemed to be members of the Council as if they had been duly elected. (2)Where the members of the Institute referred to in clause (a) of sub-section (2) of section 9 do not at all elect any member, the Council shall nominate the required number of members from the respective regional constituencies and such members shall be deemed to be the members of the Council as if they had been duly elected.] 12. President and Vice President or Vice-Presidents.—(1) The Council shall elect from members a President and one or, if the Council so decides, 2[more than one] Vice-Presidents of the Institute, who shall also be the President and Vice-President or Vice Presidents of the Council) respectively and so often as the office or offices of the President or the Vice-President or Vice- Presidents become vacant, the Council shall choose from among its members a President or a Vice- President or vice-Presidents, as the case may be 3[.] 4* * * * * * * (2) The President shall be the chief executive authority of the Council. (3) The President and the Vice-President or Vice-Presidents shall hold office for a period of one year from the date on which they are chosen but so as not to extend beyond their term of office as members of the Council, and, subject to their being members of the Council at the relevant time, they shall be eligible for re-election for a total period not exceeding three consecutive years 5[:] 6[Provided that, notwithstanding the expiry of the term of their office, the President and the Vice- President or Vice-Presidents of the Council, shall continue to hold office till such time as their successors are elected.] (4) On the dissolution of the Council, the President of the Council at the time of such dissolution shall continue to hold office and discharge such administrative and other duties as may be prescribed until such time as a new President shall have been elected and shall have taken over charge of his duties. 13. Resignation of membership and casual vacancies.—(1) Any member of the Council may at time resign his membership by writing under his hand addressed to the President and the seat of such member shall become vacant when such resignation is notified in the official Gazette. 1Subs. by the Chartered Accountants (Amdt.) Ordinance 1983 (15 of 1983) s. 9, for section 11. 2Subs. by the Chartered Accountants (Amdt.) Ordinance, 1970 ( 9 of 1970), s. 2, for “two”. 3Subs. by Ord. 15 of 1983 . s. 10, for colon. 4Proviso omitted ibid. 5Subs. ibid., for full-stop. 6Proviso added ibid. (2) A member of the Council shall be deemed to have vacated his seat if he is declared by the Council to have been absent without sufficient excuse from three consecutive meetings of the Council, or if his name is, for any cause, removed from the Register under the provisions of section19. (3) A casual vacancy in the Council shall be filled by fresh election from the constituency concerned or by nomination by the 1[Federal Government] as the case may be, and the person elected or nominated to fill the vacancy shall hold office until the dissolution of the Council: Provided that no election shall be held to fill a casual vacancy occurring within six months prior to the date of the expiry of the duration of the Council but such a vacancy may be filled by nomination by the 2[Council]. (4) No act done by the Council shall be called in question on the ground merely of the existence of any vacancy in, or defect in the constitution of, the Council. 14. Duration and dissolution of Council.__ (1) The duration of the Council constituted under this Ordinance shall be 3[four] years from the date of the first meeting of the Council on the expiry of which it shall stand dissolved and a new Council constituted in accordance with the provisions of this Ordinance [:]4 5[Provided that the duration of the Council existing immediately before the commencement of the Chartered Accountants (Amendment) Ordinance, 1983, shall be three years.] (2) Notwithstanding the expiry of the duration of the Council it shall continue to function until a new Council is constituted in accordance with the provisions of this Ordinance and upon such constitution, the Council so functioning shall stand dissolved. 15. Functions of the Council.—(1) The duty of carrying out the provisions of this Ordinance shall be vested in the Council. (2) In particular, and without prejudice to the generality of the foregoing provisions, the 6[functions] of the Council shall include— (a) the examination of candidates for enrolment and the prescribing of fees therefore; (b) the regulation of the engagement and training of 7[students]; (c) the prescribing of qualifications for entry in the Register; (d) the recognition of the foreign qualifications and training for purposes of enrolment; (e) the granting or refusal of certificates of practice under this Ordinance; 1 Subs. by F.A.O., 1975, Art. 2 and Table for “Central Government”. 2 Subs. by the Chartered Accountants (Amdt.) Ordinance, 1983 (15 of 1983), s. 11, for certain words. 3 Subs. ibid., s. 12, for “three”. 4 Subs. ibid., for full-stop. 5 Proviso added ibid. 6 Subs. by the Chartered Accountants (Amdt.) Ordinance, 1983 (15 of 1983), s. 13, for “duties”. 7 Subs. ibid., for “articled and audit clerks”. (f) the maintenance and publication of a Register of persons qualified to practice as chartered accountants; (g) the levy and collection of fees from members, examines and other person; (h) the removal of names from the Register and the restoration to the Register of names which have been removed; (i) the regulation and maintenance of the status and standard of professional qualifications of the members of the Institute; (j) the carrying out, by financial assistance to persons other than members of the Council or in any other manner, of research in accountancy; (k) the maintenance of a library and publication of books and periodicals relating to accountancy; (l) the exercise of such disciplinary power over the members and servants of the Institute as may be prescribed; (m) the formation of such Standing Committees as may be prescribed; and 1[(mm) the constitution of an Investigation Committee consisting of such members as may be prescribed;]. (n) such other powers as may be conferred on the Council by the 2[Federal Government]. 16. Staff, remuneration and allowances.—For the efficient performance of its duties, the Council may— (a) appoint a full-time Secretary who may also, if so decided by the Council, act as Treasurer; (b) appoint such other officers and servants as it deems necessary; (c) require and take from the Secretary or from any other officer or servant of the Council such security for the due performance of his duties, as the Council considers necessary; (d) fix salaries, fees, allowances and other conditions of service of the officers and servants of the Council. (e) with the previous sanction of the 2[Federal Government] fix the allowances of the President, Vice President or Vice-Presidents and other members of the Council and members of its Committees. 1 Cl (mm) ins. by the Chartered Accountants (Amdt.) Ordinance, 1983 (15 of 1983), s. 13. 2 Subs. by F.A.O., 1975, Art. 2 and Table, for “Central Government”. 17. Finances of the 1[Institute.] There shall be established a fund under the management and control of the Council into which shall be paid all monies received by the 1[Institute] and out of which shall be met all expenses and liabilities properly incurred by the 1[Institute]. _____________ CHAPTER IV. REGISTER OF MEMBERS 18. Register.—(1) The Council shall maintain in the prescribed manner a Register of the Members of the Institute. (2) The Register shall include the following particulars about every member of the Institute, namely,— (a) his full name date of birth, domicile, residential and professional addresses; (b) the date on which his name is entered in the Register; (c) his qualifications; (d) whether he holds a certificate of practice; and (e) any other particulars which may be prescribed. (3) The Council shall cause to be published, in such manner as may be prescribed, a list of members of the Institute as on the first day of July of each year, and shall, if requested to do so by any such members, send to him a copy of such list. (4) Every member of the Institute shall, on his name being entered in the Register pay such annual membership fee, as may be prescribed and different fees may be prescribed for associates and for fellows. 19. Removal from the Register.—2[(1)] The Council may remove from the Register the name of any member of the Institute— (a) who is dead; or (b) from whom a request has been received to that effect; or (c) who has not paid any prescribed fee required to be paid by him; or (d) who is found to have been subject at the time when his name was entered in the Register, or who at anytime thereafter has become subject, to any of the disabilities mentioned in section 8, or who for any other reason has ceased to be entitled to have his name borne on the Register 3[; or] 1 Subs. by F.A.O., 1975, Art. 2 and Table for “Central Government”. 2 Re-numbered by the Chartered Accountants (Amdt.). Ordinance, 1983 (15 of 1983), s. 15 3 Subs. ibid., s. 15, for full-stop. 1[(e) against whom an order has been passed under this Ordinance removing him from the membership of the Institute.]; 2[(2) The Council may, on an application made to it by a person whose name has been removed from the Register for a specified period, restore his name if he is otherwise eligible to such membership : Provided that he shall have paid before such restoration the admission fee for the year during which his name is restored, and, if his name has been removed under clause (b) or clause (c) of sub- section (1), all arrears on account of annual membership fee subject to maximum of five years of annual membership fee according to the scale applicable to him. (3) The restoration of the name of a member shall be notified in the official Gazette and in such journal or journals as the Council thinks desirable and shall also be communicated in writing to the person concerned.] CHAPTER V. REGIONAL COMMITTEES 20. Constitution and functions of Regional Committees.—(1) For the purpose of advising and assisting it on matters concerning its functions, the Council may constitute such Regional Committees as and when it deems fit for one or more of the regional constituencies that may be 3[prescribed] under clause (a) of sub-section (2) of section 9. (2) The Regional Committees shall be constituted in such manner and exercise functions as may be prescribed. ______________ 4[CHAPTER VA. MISCONDUCT 20A. Facts, etc., to be laid before the Investigation Committee.__ (1) The Secretary of the Institute shall, and any member or any aggrieved person may, lay before the Investigation Committee any fact indicating that — (a) a member of the Institute has prima facie been guilty of any professional misconduct specified in Schedule I or Schedule II; or (b) a student has prima facie been guilty of any professional misconduct specified in Schedule III. (2) Where a complaint is received by the Institute that any member of the Institute or student is guilty of professional misconduct referred to in sub-section (1), the complaint shall, with relevant and necessary facts, be laid before the Investigation Committee. 20B. Enquiry by the Investigation Committee.—(1) If on considering the facts or complaint laid before it under section 20A, the Investigation Committee is of opinion that such facts or complaint require investigation, it shall, after giving a notice to the member of the Institute or student whose conduct is in question, hold an inquiry. 1 Cl. (e) added ibid., 2 New sub-section (2) added ibid., 3 Subs. by the Chartered Accountants (Amdt.) Ordinance 1983 (15 of 1983), ibid., s. 16, for “specified by the Federal Government”. 4 Chapter VA ins. ibid., s. 17. (2) A member of the Institute or a student whose conduct is in question shall be given an opportunity of being heard and, such member or student so desires, the Investigation Committee shall permit such member or student to be represented before it by a counsel or by a member of the Institute. (3) After the conclusion of inquiry, the Investigation Committee shall report the result of the inquiry to the Council. 20C. Member or student not found guilty.—If, on receipt of the report under section 20B, the Council finds that the member of the Institute or student, as the case may be, is not guilty of any professional misconduct, it shall record its finding accordingly and direct that the proceedings or, as the case may be the complaint be filed. 20D. Orders by the Council if member found guilty.—(1) If, on receipt of the report under section 20B, the Council is of opinion that the member of the Institute has been guilty of any professional misconduct specified in Schedule I, it may, after affording such member an opportunity of being heard, either personally or through counsel or another member of the Institute, make any of the following orders, namely:— (a) reprimand or warn such member; (b) impose such penalty as it may deem necessary not exceeding one thousand rupees; and (c) remove the name of such member from the Register for a period not exceeding five years: Provided that, where it appears to the Council that the case is one in which the name of such member ought to be removed from the Register for a period exceeding five years or permanently, shall not make any order but shall refer the case to the High Court with its recommendations thereon. (2) If the Council is of opinion that the member of the Institute is guilty of a professional misconduct specified in Schedule II, it shall refer the case to the High Court with its recommendations thereon. 20E. Orders by the Council if student found guilty.—If, on receipt of report under section 20B, the Council is of opinion that the student is guilty of any professional misconduct specified in Schedule III, it shall, after affording such student an opportunity of being heard, either personally or through a counsel or a member of the Institute, make any of the following orders, namely:— (a) reprimand or warn the student; or (b) suspend the student from training, or extend the period of training of the student, for such period as it may deem fit; or (c) debar the student from training. 20F. Hearing of case by the High Court.—On receipt of a reference under section 20D, the High Court shall fix a date for the hearing of the reference and cause notice of the date so fixed to be given to the member of the Institute and the Council, and shall, after affording such member and the Council, either personally or through counsel or a member of the Institute, an opportunity of being heard, make any of the following orders, namely:— (a) direct that the proceedings be filed, or dismiss the complaint, as the case may be; (b) reprimand such member; (c) remove him from membership of the Institute either permanently or for such period as it may deem fit; or (d) refer the case to the Council for further inquiry and report. 20G. Effect of inquiry.—For the purposes of this Chapter, “member of the Institute” includes a person who was a member of the Institute on the date of the alleged misconduct but has ceased to be a member of the Institute at the time of inquiry for any reason. 20H. Council and Investigation Committee to have powers of civil court.—The council and the Investigation Committee shall, for the purpose of an inquiry under this Chapter, be deemed to be a civil court and shall have the same powers as are vested in a civil court under the Code of Civil Procedure, 1908 (V of 1908) in respect of the following mattes, namely:— (a) summoning and enforcing the attendance of any person and examining him on oath; (b) the discovery and production of any document; and (c) receiving evidence on affidavits. 20I. Publication of findings and decisions.— Where a member of the Institute or a student is found guilty, the Council shall cause the findings and decisions given against such member or student, as the case may be, to be published in the official Gazette and in such journal or journals as the Council may deem fit: Provided that, where the Council deems necessary, it may omit the name of such member or student from publication. 20J. Return of certificate.—(1) Where the name of member of the Institute is removed from the Register, whether for a specified period or permanently, every certificate of membership or practice held by such member shall be deemed to be cancelled from the date of the order removing his name from the Register and shall stand so cancelled for the said period or, as the case may be, permanently. (2) The certificate referred to in sub-section (1) shall be returned by the member of the Institute to the Secretary of the Council who shall, in the case of a member whose name is removed from the Register for a specified period, return the certificate to the member on the expiration of the said period. 20K. Appeal and revision.—(1) Any member of the Institute aggrieved by an order of the council imposing on him any of the penalties referred to in section 20D may, within sixty days of the date of communication of such order to him, prefer an appeal to the High Court. (2) The High court may, on its own motion or on an application made to it, call for the record of any case in which the Council has made an order under section 20D and may— (a) confirm, modify or set aside the order; (b) impose any penalty or set aside, reduce, confirm or enhance the penalty imposed by the order; (c) remit the case to the Council for such further inquiry as the High Court may consider proper in the circumstances of the case; or (d) pass such other order as it may deem fit: Provided that no order of the Council shall be modified or set aside unless the Council has been given an opportunity of being heard and no order imposing or enhancing a penalty shall be passed unless the person concerned has also been given an opportunity of being heard.] ___________ CHAPTER VI. PENALTIES 21. Penalty for falsely claiming to be a member, etc.— Any person who— (i) not being a member of the Institute,__ (a) represents that he is a member of the Institute; or (b) uses the designation Chartered Accountant, 1* * *; or (ii) being a member of the Institute, but not having a certificate of practice, represents that he is in practice or practices as a chartered accountant, shall be punishable on first conviction with fine which may extend to one thousand rupees, and on any subsequent conviction with imprisonment which may extend to six months or with fine which may extend to five thousand rupees, or with both. 22. Penalty for using name of the Council awarding degree of chartered accountancy, etc.— (1) No person shall— (i) use a name or a common seal which is identical with the name or the common seal of the Institute or so nearly resembles it as to deceive or as is likely to deceive the public; (ii) award any degree, diploma or certificate or bestow any designation which indicates or purports to indicate the possession or attainment of any qualification or competence possessed by a person by virtue of his being a member of the Institute; or (iii) seek to regulate in any manner whatsoever the profession of chartered accountants. 1 The certain words omitted by the Chartered Accountants (Amdt.) Ordinance, 1983 (15 of 1983) s. 18. (2) Any person contravening the provisions of sub-section (1) shall, without prejudice to any other proceedings which may be taken against him, be punishable with fine which may extend on first conviction to one thousand rupees, and on any subsequent conviction with imprisonment which may extend to six months, or with fine which may extend to five thousand rupees, or with both. 23. Companies not to engage in accountancy.—(1) No company, limiting the liability of its members, whether incorporated in Pakistan or elsewhere shall practice as chartered accountants [:]1 2[Provided that the members of the Institute shall be permitted to form into a limited company solely for practicing as “Management Consultants”.] (2) If any company contravenes the provisions of sub-section (1) then, without prejudice to any other proceedings which may be taken against the company, every director, manager, secretary and any other officer thereof, who is knowingly a party to such contravention, shall be punishable with fine which may extend on first conviction to one thousand rupees and on any subsequent conviction to five thousand rupees. 24. Unqualified persons not to sign documents.— (1) No person other than a member of the Institute shall sign any document on behalf of a chartered accountant in practice or a firm of such chartered accountants in his or its professional capacity. (2) Any person contravening the provisions of sub-section (1) shall, without prejudice to any other proceedings which may be taken against him, be punishable with fine which may extend on first conviction to one thousand rupees, and on any subsequent conviction with imprisonment which may extend to six moths, or with fine which may extend to five thousand rupees, or with both. 5. Sanction to prosecute.—No person shall be prosecuted under this Ordinance except on a complaint made by or under the order of the Council or of the 3[Federal Government]. _________ 1 Subs. by the Chartered Accountants (Amdt.) Ordinance, 1983 (15 of 1983), s. 19, for full-stop. 2 Proviso added ibid. 3 Subs. by F.A.O., 1975, Art. 2 and Table for “Central Government”. CHAPTER VII. MISCELLANEOUS 26. Maintenance of branch offices.—(1) Where a chartered accountant in practice or a firm of such chartered accountants has more than one office 1** each one of such offices shall be in the separate charge of a member of the Institute 2[who ordinarily resides in the area served by such office]. Provided that the Council may in suitable cases exempt any chartered accountant in practice or a firm of such chartered accountants from the operation of this sub-section. (2) Every chartered accountant in practice or a firm of such chartered accountants maintaining more than one office shall send to the Council a list of offices and the persons in charge thereof and shall keep the Council informed of any change in relation thereto. 27. Power to make bye-laws.—(1) The Council may, by notification3 in the official Gazette, make bye-laws for the purpose of carrying out the object of this Ordinance and a copy of such bye- laws shall be sent to each member of the Institute. (2) In particular, and without prejudice to the generality of the foregoing power, such bye-laws may provide for all or any of the following matters:— (a) the standard and conduct of examinations under this Ordinance; (b) the qualifications for the entry of the name of any person in the Register; (c) the conditions under which any examination or training may be treated as equivalent to the examination and training prescribed for the membership of the Institute; (d) the conditions under which any foreign qualifications may be recognized; (e) the manner in which and the conditions subject to which applications for entry in the Register may be made; (f) the fees payable for membership of the Institute and the annual fees payable by associates and fellows of the Institute in respect of their certificates; (g) the manner in which elections to the Council and the Regional Committees may be held; (h) the particulars to be entered in the Register; (i) the functions of Regional Committees; 4[(j) the training of the students and suspension of the training of students for misconduct or for any other cause;] 1The words in Pak istan omitted by the Chartered Accountant (Amdt.) Ordinance, 1983, (15 of 1983) s. 20. 2Added ibid. 3For the Chartered Accountants bye-laws, 1961, see Gaz of P., 1961 Ext., pp10 26-1060. 4 Subs. by the Chartered Accountants (Amdt.) Ordinance 1983 (15 of 1983) s. 21 for (j) (k) the regulation and maintenance of the status and standard of professional qualifications of members of the Institute; 1[(kk) the issue of directives to the members of the Institute on professional matter;] (l) carrying out of research in accountancy; (m) the maintenance of a library and publication of books and periodicals on accountancy; (n) the management of the property of the Council and the maintenance and audit of its accounts; (o) the summoning and holding of meetings of the Council, the times and places of such meetings, the conduct of business thereat and the number of members necessary to form a quorum; (p) the powers, duties and functions of the President and the Vice-President or Vice-Presidents of the Council; (q) the functions of the Standing and other Committees and the conditions subject to which such functions shall be discharged; (r) the terms of office, and the powers, duties and functions of the Secretary and other officers and servants of the Council; (s) the rules of professional and other misconduct, and the exercises of disciplinary powers; and (t) any other matter which is required to be or may be prescribed under this Ordinance. (3) All bye-laws made by the Council under this Ordinance shall be subject to the condition of previous publication and to the approval of the 2[Federal Government]. (4) Notwithstanding anything contained in sub-section (1) and (2), the 2[Federal Government] may frame the first bye-laws for the purposes mentioned in this section, and such 3bye-laws shall be deemed to have been made by the Council, and shall remain in force from the date of the coming into force of this Ordinance, until they are amended, altered or revoked by the Council. 28. Powers of 2[Federal Government] to direct bye -laws to be made or to make or amend bye - laws.__ (1) Where the 2[Federal Government] considers it expedient so to do, it may, by order in writing, direct the Council to make any bye-law or to amend or revoke any bye-law already made within such period as it may specify in this behalf. (2) If the Council fails or neglects to comply with such order within the specified period, the 2[Federal Government] may make or amend, with or without modifications, or revoke, any bye- laws, directed to be made, amended or revoked by that order. 1 Cl. (kk) added ibid. 2 Subs. by F.A.O., 1975, Art. 2 and Table for “Central Government”. 3 For such bye-laws see Gaz. of p 1961 Ext, P.1026. 29. Reference to registered accountants, etc. to be construed as references to chartered accountants.—Any reference to a chartered accountant or a registered accountant or a certified or qualified auditor in any other law or in any document whatsoever shall be construed as a reference to a chartered accountant in practice within the meaning of this Ordinance. 30. [Amendment of section 144 of the Companies Act, 1913 (VII of 1913),] Omitted by the Federal Laws (Revision and Declaration) Ordinance, 1981, (XXVII of 1981), s. 3, and Sch., II. 31. [Savings.] Omitted by the Federal Law (Revision and Declaration) Ordinance, 1981 (XXVII of 1981), s. 3, and Sch., II. 1[SCHEDULE-I [See Section 20A] PART I Professional misconduct in relation to chartered accountants in practice. A Chartered Accountant in practice shall be deemed to be guilty of professional misconduct, if he— (1) allows any person to practice in his name as a chartered accountant, unless such person is also a chartered accountant in practice and is in partnership with, or employed by, him; (2) pays or allows or agrees to pay or allow, directly or indirectly, any share, commission or brokerage in the fees or profits of his professional business to any person other than a member of the Institute or a partner or a retired partner or the legal representative of a deceased partner; Explanation.—In this clause, “partner” includes a person residing outside Pakistan with whom a chartered accountant in practice has entered into partnership which is not in contravention of clause (4) of this part; (3) accepts or agrees to accept any part of the profits of the professional work of a lawyer, auctioneer, broker, or other agent who is not a member of the institute; (4) places his professional service at the disposal of, or enters into partnership with, an unqualified person or person in a position to obtain business of the nature in which chartered accountants engage by means which are not open to a member of the Institute: Provided that this paragraph shall not be construed as prohibiting a member from practicing in a country outside Pakistan in association with a person who is entitled under the laws in force in that country to perform functions similar to those a member of the Institute is entitled to perform in Pakistan; (5) solicits clients for professional work either directly or indirectly by circular, advertisement, personal communication or interview or by any other means; (6) advertises his professional attainments or services, or uses any designation or expression other than chartered accountant on professional documents, visiting cards, letter head or sign boards unless it be a degree of a University established by law in Pakistan or recognized by the Federal Government or the Council; 1Subs. by F.A.O. 1975, Art. 2 and Table, for “Central Government”. 2Added by Chartered Accountant (Amdt.). Ordinance, 1983 (15 of 1983) s. 22. (7) accepts a position as auditor previously held by another member of the Institute without first communicating with him in writing; (8) accepts an appointments as auditor of a company without first ascertaining from it whether the requirements of sub-section (6) of section 144 of the Companies Act, 1913 (VII of 1913), in respect of such appointment have been duly complied with; (9) charges or offers to charge, accepts or offers to accept in respect of any professional employment fees which are based on a percentage of profits or which are contingent upon the findings or results of such employment, except in cases which are permitted under any law for the time being in force or by an order of the Government; (10) Engages in any business or occupation other than the profession of chartered accountants unless permitted by the Council so to engage: Provided that nothing contained herein shall disentitle a chartered accountant from being a director of a company, unless he or any of his partners is interested in such company as an auditor; (11) accepts a position as auditor previously held by some other chartered accountant in such conditions as to constitute undercutting; (12) allows a person not being a member of the Institute or a member not being his partner to sign on his behalf or on behalf of his firm, any balance sheet, profit and loss account, report or financial statement; or (13) gives estimates of future profits for publication in a prospectus or otherwise or certifies for publication the statements of average profits over a period of two years or more without, at the same time, stating the profits or losses for each year separately. PART 2 Professional misconduct in relation to members engaged in management consultancy. A member of Institute engaged in management consultancy shall be deemed to be guilty of professional misconduct, if he— (1) advertises or solicits for work or issues any circular, calendar or publicity material; (2) issues brochures, except to existing clients or in response to an unsolicited request; (3) uses designatory letters indicating qualifications of the directors and members of the company on letter head, note-papers, or professional cards excepts as provided in clause (6) of Part 1 of this Schedule; (4) refers to associate firms of Chartered Accountants on his letter head or professional cards or announcements; (5) adopts a name or associates himself as a partner or director of a firm or a company whose name is indicative of its activities; (6) uses the term chartered accountants for his management consultancy firm or company; (7) shares profits of remuneration in a manner contrary to clauses (2) and (3) of Part 1 of this Schedule, except when he associates with non-members as stated in clause (10) of this part; (8) or his partner in any firm accepts auditing, taxation, or other conventional accounting work from any client introduced to him for management consultancy services by the client’s own professional accountant; (9) uses the term “Management Consultant (s)\" except in respect of a company engaged in management consultancy field; (10) associates with non-members for the rendering of various management services except as long as such non-member observes the bye-laws and code of professional ethics of the Institute; (11) does not communicate with the existing professional accountant or consultant, if a member of the Institute, informing him of the special work he has been asked to undertake in the event of an introduction for management consultancy work other than through the existing professional accountant; or (12) under the guise or through the medium of a company or firm does anything which he is not allowed to do as an individual. PART 3 Professional misconduct in relation to members of the Institute in service. A member of the Institute (other than a member in practice) shall be deemed to be guilty of professional misconduct, if he, being an employee of any company, firm or person,— (1) pays or allows or agrees to pay directly or indirectly to any person any share in the emoluments of the employment undertaken by the member; (2) accepts or agrees to accept any part of fees, profits or gains from a lawyer, chartered accountant or broker engaged by such company, firm or person or agent or customer of such company, firm or person by way of commission or gratification; or (3) discloses confidential information acquired in the course of his employment except as and when required by law or except as permitted by the employer. PART 4 Professional misconduct in relation to members of the Institute generally. A member of the Institute, whether in practice or not, shall be deemed to be guilty of professional misconduct, if he— (1) includes in any statement, return or form to be submitted to the Institute any particulars knowing them to be false; (2) not being a fellow styles himself as a fellow; (3) does not supply the information called for by the Institute or does not comply with the requirements asked to be complied with or does not comply with any of the directives issued or pronouncements made by the Council or any of its Standing Committees; (4) generally, willfully maligns the Institute, the Council or its Committee to lower their prestige, or to interfere with performance of their duties in relation to himself or others; (5) has been guilty of any act or default discreditable to a member of the Institute; or (6) contravenes any of the provisions of the Ordinance or the bye-laws made thereunder. SCHEDULE II (See section 20A and 20D) PART 1 Professional misconduct in relation to chartered accountants in practice requiring action by a High Court. A chartered accountant in practice shall be deemed to be guilty of Professional misconduct, if he__ (1) discloses information acquired in the course of his professional engagement to any person other than his client, without the consent of his client or otherwise than as required by any law for the time being in force; (2) certifies or submits in his name or in the name of his firm a report of an examination of financial statement unless the examination of such statements and the related records has been made by him or by a partner or an employee in his firm or by another chartered accountant in practice; (3) permits his name or the name of his firm to be used in connection with any estimates of earnings contingent upon future transactions in a manner which may lead to the belief that he vouches for the accuracy of the forecast; (4) expresses his opinion on financial statements of any Business or any enterprise in which he, his firm or a partner in his firm has a substantial interest, unless he discloses his interest in his report; (5) fails to disclose a material fact known to him which is not disclosed in a financial statement, but disclosure of which is necessary to ensure that the financial statement is not misleading; (6) fails to report a material mis-statement known to him to appear in a financial statement with which he is concerned in a professional capacity; (7) is grossly negligent in the conduct of his professional duties; (8) fails to obtain sufficient information to warrant the expression of an opinion or his exceptions are sufficiently material to negate the expression of an opinion; or 9) fails to keep moneys of his client in a separate banking account or fails to use such moneys for purposes for which they are intended. PART 2 Professional misconduct in relation to members engaged in management consultancy requiring action by a High Court. A member engaged in management consultancy shall be deemed to be guilty of professional misconduct, if he— (1) discloses information acquired in the course of his professional engagements to any person other than his client, without the consent of his client or otherwise than as required by any law for the time being in force; (2) is grossly negligent in the conduct of his professional duties; or (3) fails to keep moneys of his client in a separate banking account or fails to use such moneys for purposes for which they are intended. ____________ SCHEDULE III (See Section 20A and 20E) Professional misconduct in relation to the students of the Institute. A student of the Institute shall be deemed to be guilty of professional misconduct, if he— (1) contravenes any of the provisions of the Ordinance or the bye-laws made thereunder; (2) does not supply the information called for by the Institute; (3) does not comply with any requirements which he is asked by the Institute to comply with; (4) does not comply with any of the directives issued by the Council or any of its committees; (5) discloses confidential information acquired in the course of his training except as and when required by law or except as permitted by his principal; (6) includes in any statement or form to be submitted to the Institute, any particulars knowing them to be false; or (7) has been guilty of any act or omission discreditable to a student of the Institute. __________"
}