{
  "file": "administrator2d28ef7cb8af946302cb2077f97b3aaa.pdf",
  "law_name": "Medical And Dental Council Ordinance, 1962",
  "text": "THE ALLOPATHIC SYSTEM (PREVENTION OF MISUSE) ORDINANCE, 1962 CONTENTS 1. Short title, extent and commencement 2. Definition 3. Prohibition of the use of the word “doctor” and its variations, etc. 4. Prohibition of the use of medical degrees or diplomas 5. Prohibition of performing surgical operations by unqualified persons 6. Prohibition for prescribing certain drugs 7. Restriction on the sale of patent and proprietory medicines 8. Rule-making powers of the Provincial Government 9. Penalty 10. Jurisdiction 11. Protection THE ALLOPATHIC SYSTEM (PREVENTION OF MISUSE) ORDINANCE, 1962 ORDINANCE NO. LXV OF 1962 [7th June, 1962] An Ordinance to prevent the misuse of the allopathic system of medicine and to provide for matters connected therewith. WHEREAS it is expedient to prevent the misuse of the allopathic system of medicine and to provide for matters connected therewith; Now, THEREFORE, in pursuance of the Proclamation of the seventh day of October, 1958, and in exercise of all powers enabling him in that behalf, the President is pleased to make and promulgate the following Ordinance: ___ 1. Short title, extent and commencement.___(1) This Ordinance may be called the Allopathic System (Prevention of Misuse) Ordinance, 1962. (2) It extends to the whole of Pakistan. (3) It shall come into force at once. 2. Definition.___In this Ordinance, unless there is anything repugnant in the subject or context, “registered medical practitioner” means a person registered under the 1[Medical and Dental Council Ordinance, 1962 (XXXII of 1962). 3. Prohibition of the use of the word “doctor” and its variations, etc.___No person practising the allopathic, homoeopathic, ayurvedic, unani or any other system of medicine shall use with his name or address or with the name or address of his business the word “doctor” or any of its grammatical variations, cognate expressions or abbreviations so as to give out that he is entitled to practise medicine unless he is a registered medical practitioner: Provided that nothing in this section shall apply to a person on whom a Doctor’s degree other than medical degree has been conferred by any university in or outside Pakistan. 4. Prohibition of the use of medical degrees or diplomas.___No person shall use a medical degree or a medical diploma to give out that he is a qualified medical practitioner or for any purpose connected with medical practice, unless such degree or diploma has been conferred or awarded by a university or institution in or outside Pakistan recognized under the 1[Medical and Dental Council Ordinance, 1962] (XXXII of 1962). 5. Prohibition of performing surgical operations by unqualified persons.___No person other than a registered medical practitioner shall perform any surgical operation other than circumcision, incision of boils and administration of injections. 1Subs. by the Federal Laws (Revision and Declaration) Ordinance, 1981 (27 of 1981), s. 3 and Sch. II. 6. Prohibition for prescribing certain drugs.___No person other than a registered medical practitioner or a person authorized in this behalf by the 1[Provincial Government] shall prescribe any antibiotic or dangerous drug specified in the rules made under this Ordinance. 7. Restriction on the sale of patent and proprietory medicines.___No person shall sell in the market any patent or proprietory medicine of the unani, ayurvedic, homoeopathic or biochemic system of medicine unless there is displayed, in a conspicuous and readily intelligible manner, on the label or container thereof and also on the outer cover of the container (other than ordinary wrapper) the true formula of the medicine contained in it. 8. Rule-making powers of the Provincial Government.___The 1[Provincial Government] may make rules for carrying out the purposes of this Ordinance. 9. Penalty.___Whoever contravenes the provisions of section 3 or section 4 or section 5 or section 6 or section 7 shall be punishable with imprisonment which may extend to one year or with fine not exceeding two thousand rupees, or with both. 10. Jurisdiction.___(1) No prosecution shall be instituted under this Ordinance except by an Inspector appointed under the 2[Drugs Act, 1976 (XXXI of 1976)] or by a person specially empowered by the 1[Provincial Government] in this behalf. (2) No court inferior to that of a Magistrate of the first class shall try an offence punishable under this Ordinance and notwithstanding anything contained in section 32 of the Code of Criminal Procedure, 1898 (Act V of 1898), it shall be lawful for such Magistrate to pass any sentence of fine to the extent provided for by this Ordinance in excess of his powers under the said section 32. 11. Protection.___No suit or proceeding shall lie against any Inspector or person acting in good faith under section 10 of this Ordinance. _______________ RGN Date: 29-05-2024 1Subs. and ins. by A.O., 1964, Art. 2 and Sch. 2Subs. by the Federal laws (Revision and Declaration) Ordinance, 1981 (27 of 1981), s. 3 and Sch., II."
}