{
  "file": "administratorfcc1fd50653c4388af24644221c951d1.pdf",
  "law_name": "The Prevention Of Seditious Meetings Act, 1911",
  "text": "THE PREVENTION OF SEDITIOUS MEETINGS ACT, 1911 CONTENTS 1. Short title and extent 2. Power of provincial Government to notify proclaimed areas 3. Definition 4. Notice to be given of public meetings 5. Power to prohibit public meetings. 6. Penalties 7. Penalty for delivery of speeches in public places 8. Cognizance of offences THE PREVENTION OF SEDITIOUS MEETINGS ACT, 1911 1Act No. X of 1911 [22nd March, 1911] An Act to consolidate and amend the law relating to the prevention of public meetings likely to promote sedition or to cause a disturbance of public tranquility. WHEREAS it is expedient to consolidate and amend the law relating to the prevention of public meetings likely to promote sedition or to cause a disturbance of public tranquility; It is hereby enacted as follows :- 1. Short title and extent.___ (1) This Act may be called the Prevention of Seditious Meetings Act, 1911. (2) It extends to 2[the whole of Pakistan], but shall have operation only in such 3[Province or parts of a Province] as the 4[Provincial Government] may from time to time notify in the 5[official Gazette]. 2. Power of provincial Government to notify proclaimed areas.___ (1) The 6[Provincial Government] may 7* * * by notification in the 7[official Gazette], declare the whole or any part of a Province, in which this Act is for the time being in operation, to be a proclaimed area. (2) A notification made under sub-section (1) shall not remain in force for more than six months, but nothing in this sub-section shall be deemed to prevent the 5[Provincial Government] 6* * * from making any further notifications in respect of the same area from time to time as it may think fit. 3. Definition.___ (1) In this Act, the expression “public meeting” means a meeting which is open to the public or any class or portion of the public. (2) A meeting may be a public meeting notwithstanding that it is held in a private place and notwithstanding that admission thereto may have been restricted by ticket or otherwise. 4. Notice to be given of public meetings.___(1) No public meeting for the furtherance or discussion of any subject likely to cause disturbance or public excitement, or for the exhibition or distribution of any writing or printed matter relating to any such subject, shall be held in any proclaimed area – 1For Statement of Objects and Reasons, see Gazette of India, 1911, Pt. V. p 100 ; and for Report of Select Committee, see ibid., 1911, Pt. V, p. 100 ; and for Proceedings in Council, see ibid., 1911, Pt. VI, pp. 362 and 452. This Act has been amended to the extent of Islamabad Capital Territory see, Ordinance No. XXVII of 1981, s. 5 and 4th Sch. 2Subs. by the Central Laws (Statute Reform) Ordinance, 1960 (21 of 1960), s. 3 and 2nd Sch. (with effect from the 14th October, 1955), for “all the Provinces and the Capital of the Federation” which had been subs. by A. O., 1949, Arts. 3(2) and 4, for “the whole of British India”. 3Subs. by the Repealing and Amending Ordinance, 1961 (1 of 1961), s. 3 and 2nd Sch., for “Provinces or parts of Provinces”. 4Subs. by A.O., 1937 for “G. G. in C.”. 5Subs ibid., for “Gazette of India”. 6 Subs. ibid., for “L. G.”. 7The words “with the previous sanction of the G. G. in C.” rep., ibid (a) unless written notice of the intention to hold such meeting and of the time and place of such meeting has been given to the District Magistrate 1* * *at least three days previously ; or (b) unless permission to hold such meeting has been obtained in writing from the District Magistrate 1* * * Power of Magistrate to cause report to be taken. (2) The District Magistrate or any Magistrate of the first class authorized by the District Magistrate in this behalf may, by order in writing, depute one or more Police-Officers, not being below the rank of head constable, or other persons, to attend any such meeting for the purpose of causing a report to be taken of the proceedings. Exception- (3) Nothing in this section shall apply to any public meeting held under any statutory or other express legal authority 2* * *, or to any public meetings or class of public meetings exempted for that purpose by the 3[Provincial Government] by general or special order. 5. Power to prohibit public meetings. The District Magistrate 4 * * *, may at any time, by order in writing, of which public notice shall forthwith be given, prohibit any public meeting in a proclaimed area, if, in his opinion, such meeting is likely to promote sedition or disaffection or to cause a disturbance of the public tranquility. 6. Penalties. (1) Any person concerned in the promotion or conduct of a public meeting held in a proclaimed area contrary to the provisions of section 4 shall be punished with imprisonment for a term which may extend to six Months, or With fine, or with both. (2) Any public meeting which has been prohibited, under section 5 shall be deemed to be an unlawful assembly within the meaning of Chapter VIII of the Pakistan Penal Code (XLV of 1860) and of Chapter IX of the Code of Criminal Procedure, 1898 (V of 1898). 7. Penalty for delivery of speeches in public places. Whoever, in a proclaimed area, in a public place or a place of public resort, otherwise than at a public meeting held in accordance with, or exempted from, the provisions of section 4, without the permission in writing of the Magistrate of the District 5* * *, previously obtained, delivers any lecture, address or speech on any subject likely to cause disturbance or public excitement to persons then present, may be arrested without warrant, and shall be punished with imprisonment for a term which may extend to six months, or with fine, or with both. 8. Cognizance of offences: No Court inferior to that 6* * * of a Magistrate of the first class or Sub-divisional Magistrate shall try any offence against this Act. 9. [Repeals.] Rep. by the Repealing Act, 1927 (XII of 1927), s. 2 and Schedule. Date: 11-09-2024 1The words and comma “or the Commissioner of Police, as the case may be” omitted by A. O., 1949, Sch. 2The words “or to public meetings convened by a sheriff” omitted by A. O., 1949, Sch. 3Subs. by A. O 1937, for “L. G.” 4The words and comma “or the Commissioner of Police, “the case may be” omitted by A. O., 1949, Sch 5The words and comma “or of the Commissioner of Police, as the case may be” omitted, ibid. 6The words “of a Presidency Magistrate or” omitted, ibid."
}