{
  "file": "administrator1c965c4e8c39cb3fb88c8d52c7a1a313.pdf",
  "law_name": "Pakistan Insurance Corporation Into A Public Limited Company For Incorporation Under The Companies Ordinance, 1984",
  "text": "THE PAKISTAN INSURANCE CORPORATION (RE-ORGANIZATION) ORDINANCE, 2000 CONTENTS 1. Short title, extent and commencement 2. Definitions 3. Vesting of the rights, property and liabilities of the Corporation in the Company 4. Terms and conditions of service of employees 5. Registration Fees 6. Removal of difficulties 7. Repeal THE PAKISTAN INSURANCE CORPORATION (RE-ORGANIZATION) ORDINANCE, 2000 ORDINANCE No. XXXVI of 2000 [11th August, 2000] An Ordinance to provide for conversion of the Pakistan Insurance Corporation into Pakistan Reinsurance Company Limited WHEREAS, it is expedient to provide for conversion of the Pakistan Insurance Corporation into a public limited company for incorporation under the Companies Ordinance, 1984. (XLVII of 1984). AND WHEREAS the National Assembly and the Senate stand suspended in pursuance of the Proclamation of emergency of the fourteenth day of October, 1999, and the Provisional Constitution Order No. 1 of 1999; AND WHEREAS the President is satisfied that circumstances exist which render it necessary to take immediate action; NOW, THEREFORE, in pursuance of the Proclamation of Emergency of the fourteenth day of October, 1999, and Provisional Constitution Order No. 1 of 1999, as well as Order No. 9 of 1999, and in exercise of all powers enabling him in that behalf, the President of the Islamic Republic of Pakistan is pleased to make and promulgate the following Ordinance:— 1. Short title, extent and commencement.___ (1) This Ordinance may be called the Pakistan Insurance Corporation (Re-Organization) Ordinance, 2000. (2) It extends to the whole of Pakistan. (3) It shall come into force at once. 2. Definitions.___ (1) In this Ordinance, unless there is anything repugnant in the subject or context,— (a) “Company” means the Pakistan Reinsurance Company Limited incorporated under the Companies Ordinance, 1984; (XLVII of 1984) (b) “Corporation” means the Pakistan Insurance Corporation established under the Pakistan Insurance Corporation Act, 1952; (XXXVIII of 1952) (c) “effective date” means the date on which property, rights and liabilities of the Corporation are vested in the Company under section 3; and (d) “shareholder” means a person holding shares in the Corporation immediately before the effective date. 3. Vesting of the rights, property and liabilities of the Corporation in the Company.___ (1) As soon as may be after the commencement of this Ordinance the Federal Government may, by order, published in the official Gazette, direct that as and from such date, as may be specified in the order by the Federal Government, all or any property, rights and liabilities to which the Corporation was entitled or subject, immediately before such orders, and identified therein, shall, on such terms and conditions as the Federal Government may determine, vest in the Company and become the property, rights and liabilities of the Company. (2) An order issued under sub-section (1) shall— (a) provide for all such matters consequential and incidental to the matters provided for in sub-section (1) as the Federal Government may consider necessary or expedient; and (b) specify the employees of the Corporation who shall, as from the effective date, be transferred to, and become employees of, the Company referred to in the order: Provided that such order shall not vary the terms and conditions of service of such employees to their disadvantage. (3) An order issued under sub-section (1) in favor of the Company shall also provide for— (a) the continuation by the Company of the operations and undertaking of the Corporation on the same basis as were carried on immediately prior to the date of the order; (b) the dissolution of the Corporation from the effective date; (c) the applicability and extent of the regulations made under the Pakistan Insurance Corporation Act, 1952 (XXXVIII of 1952) to the Company from the effective date; and (d) the requirement or otherwise of registration of the Company under the Insurance Ordinance, 2000, or any other law for the time being in force relating to registration of insurance companies in Pakistan. (4) In Consideration of the vesting in the Company of the Property of the Corporation, the Company Shall issue fully Paid result in each shareholder having the same Proportionate voting rights in the Company as he enjoyed in the Corporation immediately before the effective date: Provided that at the option of a shareholder exercised in writing to the Federal Government not later than thirty days from the effective date, the Federal Government shall pay the shareholder an amount equal to the principal of the shares in the Corporation held by that shareholder, and in such a case the shares in the Corporation shall be surrendered to the Federal Government and the shares in the Company which would, but for the operation of this proviso, have been issued to that shareholder shall instead be issued in the name of the President of Islamic Republic of Pakistan. (5) Notwithstanding anything contained in any other law in force, or the listing rules of any stock exchange upon which the shares in the Corporation are listed or traded, shares in the Corporation shall, as from a date one hundred and twenty days after the effective date, cease to be listed on any stock exchange in Pakistan and immediately after the close of trading on that day, shares in the company shall, without any further action, be listed on any stock exchange in Pakistan on which the shares of the Corporation were listed immediately before that date. (6) If any property of the Corporation vests in the Company subject to any charge, burden, hypothecation or encumbrance, the same shall be deemed to be on the assets of the Company and the provisions of section 121 of the Companies Ordinance, 1984, (XLVII of 1984) shall apply to such charge, burden, hypothecation or encumbrance as if it had been created on the assets of the Company on the effective date and so that the publication of the order in the official gazette shall take effect in the same manner in all respect as a certificate of registration under section 130 of the said Ordinance. (7) No stamp duty shall be payable under any law for the time being in force on or in relation to the transfer or vesting of property of the Corporation under any order issued under subsection (1), or on any shares or securities or the certificates or scrips evidencing title thereto issued to the President of the Islamic Republic of Pakistan or any shareholder. (8) All contracts, bonds, agreements, powers of attorney, grants of legal representation and all other instruments of whatever kind in each case subsisting or having effect immediately before the effective date and owed or incurred by the Corporation or to, which the Corporation may have been a party all of which being exclusively in relation to, connected with, the Corporation as to be reasonably construed and considered as obligations or liabilities of the Corporation so that the same shall remain in full force and effect against the Company as they were before the effective date against the Corporation and may be acted upon as fully and effectively as if instead of the Corporation, the Company had been a party thereto. (9) All suits, appeals or other legal proceedings of whatever nature by, against or relating to the Corporation which shall be pending on the effective date in any court, tribunal or other authority shall be continued, prosecuted and enforced in the same manner and to the same extent as they would have been continued, prosecuted and enforced by, or against, the Corporation, if this Ordinance would not have been promulgated, by or against the Company, and the same shall not abate, be discontinued or be in any way prejudiced or affected by the provisions of this Ordinance. Explanation.—For the purpose of this section— (a) the expression “property” includes assets, rights and entitlements of every description and nature wherever situated; and (b) the expression “liabilities” includes duties, obligations, loans, encumbrances, claims and charges of every description and nature, actual or contingent, and all matters pertaining to continuation or run-off in respect of reinsurance contracts and arrangements, whether or not they are capable under any law of Pakistan or of any other State or under any arrangement or otherwise, of being vested, transferred or assigned by the Corporation. 4. Terms and conditions of service of employees.___ (1) No person transferred to the Company pursuant to sub-section (2) hereinafter referred to as a “Transferred Employee”, shall be entitled to any compensation as a consequence of transfer to the Company: Provided that the Federal Government shall guarantee the existing terms and conditions of service and rights including pensioner benefits of the Transferred Employees to which they were entitled on the date of their transfer to the Company. (2) The terms and conditions of service of any Transferred Employee shall not be altered adversely by the Company except in accordance with the laws of Pakistan or with the consent of the Transferred Employees and the award of appropriate compensation. (3) Under the order vesting property of the Corporation in the Company, the Federal Government shall require the Company to assume the responsibility of pension benefits of relevant employees and the Company shall not alter such pension benefits without the consent of the employees concerned and the award of appropriate compensation. 5. Registration Fees.___ The Pakistan Reinsurance Company Limited being a successor company to a continuing Corporation shall be exempted from any registration fees of any Registration Authority or Commission by whatever name. 6. Removal of difficulties.___ If any difficulty arises in giving effect to the provisions of this Ordinance, the Federal Government may make such order, not inconsistent with the provisions of this Ordinance, as may appear to it to be necessary for the purposes of removing the difficulty. 7. Repeal.___ Immediately after incorporation and registration of Pakistan Reinsurance Company as public limited company, the Pakistan Insurance Corporation Act, 1952, (XXXVIII of 1952) shall stand repealed."
}