{
  "file": "administrator97cb430458c3149a54b33a28ae8143cd.pdf",
  "law_name": "Industrial Relations Ordinance, 1969",
  "text": "THE COAL MINES (FIXATION OF RATES OF WAGES) ORDINANCE, 1960 CONTENTS 1. Short title, extent and commencement 2. Definitions 3. Minimum rates of wages 4. Coal mine workers entitled to minimum wages 5. Ordinance not to affect certain agreements, etc. 6. Provisions of this Ordinance to be in addition to and not in derogation of certain laws THE COAL MINES (FIXATION OF RATES OF WAGES) ORDINANCE, 1960 1ORDINANCE NO. XXXIX OF 1960 [30th September, 1960] An Ordinance to provide for the fixation of rates of wages in respect of labour employed in coal mines and for matters connected therewith. WHEREAS it is expedient to provide for the fixation of rates of wages in respect of labour employed in coal mines and for matters connected therewith. Now THEREFORE, in pursuance of the Proclamation of the seventh day of October, 1958, and in exercise of all powers enabling him in that behalf, the President is pleased to make and promulgate the following Ordinance :__ 1. Short title, extent and commencement.—(1) This Ordinance may be called the Coal Mines (Fixation of Rates of Wages) Ordinance, 1960. (2) It extends to the whole of 2[Pakistan]. (3) It shall come into force at once. 2. Definitions.—In this Ordinance, unless there is anything repugnant in the subject or context, — (a) “coal mine” means any excavation where any operation for the purpose of searching for, or obtaining, coal or coke has been or is being carried on, and includes all works, machinery, tramways and sidings, whether above or below ground, in, or adjacent to, or belonging to, a coal mine : Provided that it shall not include any part of such premises on which a manufacturing process is being carried on unless such process is for the making of coke or the dressing of coal ; (b) “owner” means owner of a coal mine and includes a lessee or mortgagee in possession of such coal mine and any partner, managing director, director, agent, manager or any other person authorized to represent the coal mine in its transactions ; (c) “wages” shall have the same meaning as are assigned to it in clause (vi) of section 2 of the Payment of Wages Act, 1936 (IV of 1936). 3. Minimum rates of wages.—(1) The 3[Provincial Government] may, from time to time, by notification in the official Gazette, fix minimum rates of wages payable to persons employed in a coal mine. 1The Ordinance has been applied to the Provincially Administered Tribal Areas or to the parts of those areas to which it does not already apply, see Regulation No.I of 1972,s.2 and Sch. 2Subs. by the Federal Adaptation of Laws Order, 1975 (President’s Order No. 4 of 1975) Art. 2 and Sch. 3Subs. by A.O., 1964, Art.2 and Sch. (2) In fixing or revising the minimum rates of wages fixed under this Ordinance, the 1[Provincial Government] may, if it so considers necessary, consult the 2[Miners Welfare Board] constituted under the 2[Excise Duty on Minerals (Labour Welfare) Act, 1967 (VIII of 1967)]. 4. Coal mine workers entitled to minimum wages.—On the issue of a notification under section 3, every person employed in a coal mine shall be entitled to be paid by the owner wages at a rate which shall in no case be less than the rate of wages specified in the notification. 5. Ordinance not to affect certain agreements, etc.—The provisions of this Ordinance shall have effect notwithstanding anything inconsistent therewith in any award, agreement or contract of service, whether made before or after the commencement of this Ordinance : Provided that where under any such award, agreement, or contract of service a person employed in a coal mine is entitled to higher rates of wages, he shall continue to be entitled to such higher rates. 6. Provisions of this Ordinance to be in addition to and not in derogation of certain laws.—The provisions of this Ordinance shall be in addition to, and not in derogation of, the provisions of the Payment of Wages Act, 1936 (VI of 1936), 2[West Pakistan Industrial and Commercial Employment (Standing Orders) Ordinance, 1968 (W.P. Ordinance No. VI of 1968) and the Industrial Relations Ordinance, 1969 (XXIII of 1969)]. ________________________ RGN Date: 03-07-2024 1Subs. by A.O., 1964, Art.2 and Sch. 2Subs. by the Federal Laws (Revision and Declaration) Ordinance, 1981 (Ordinance No. XXVII of 1981), s.3 and Sch.II."
}