{
  "file": "administratorff619921471a94db5b97268e94c651e2.pdf",
  "law_name": "THE DISTURBED AREAS (SPECIAL POWERS) ORDINANCE, 1962 CONTENTS",
  "text": "THE DISTURBED AREAS (SPECIAL POWERS) ORDINANCE, 1962 CONTENTS _______________ 1. Short title, extent and commencement 2. Definitions 3. Special powers of Magistrates and Police officers 4. Special powers of officers of the Armed Forces, etc. 5. Bar to suits, etc. 6. Omitted THE DISTURBED AREAS (SPECIAL POWERS) ORDINANCE, 1962 ORDINANCE NO. LIV OF 1962 [5th June, 1962] An Ordinance to confer certain special powers upon officers in respect of disturbed areas. WHEREAS it is expedient to confer certain special powers upon officers in respect of disturbed areas; NOW; THEREFORE, in pursuance of the Proclamation of the seventh day of October, 1958, and in exercise of all powers enabling him in that behalf, the President is pleased to make and promulgate the following Ordinance: ___ 1. Short title, extent and commencement.___(1) This Ordinance may be called the . (2) It extends to the whole of Pakistan. (3) It shall come into force at once. 2. Definitions.___In this Ordinance, unless there is anything repugnant in the subject or context, ___ (a) “disturbed area” means an area declared by the Provincial Government, by notification in the official Gazette, to be a disturbed area for the purposes of this Ordinance; (b) “officer of the Armed Forces” means an officer of the Pakistan Army, the Pakistan Navy or the Pakistan Air Force, and includes___ (i) in the case of Pakistan Army, a junior commissioned officer and a non- commissioned officer; (ii) in the case of Pakistan Navy, a superior officer; and (iii) in the case of Pakistan Air Force, a junior commissioned officer, a warrant officer, a petty officer and a non-commissioned officer; and (c) “officer of the Civil Armed Forces” means an officer of the Civil Armed Forces not below the rank corresponding to that of an Assistant Sub-Inspector of Police. 3. Special powers of Magistrates and Police officers.___(1) If in the opinion of any Magistrate, or any police officer in charge of a police party, it is necessary for the maintenance of public order so to do, he may, after giving such warning as may be appropriate in the circumstances of the case, fire upon, or otherwise use force against, any person who is acting in contravention of any law or order for the time being in force in a disturbed area prohibiting the assembly of five or more persons, or the carrying of weapons, or of things capable of being used as weapons. (2) It shall be lawful for any Magistrate or police officer exercising powers under sub-section (1) so to fire or use force as to cause death, and for any person employed in the use of such force to cause death of the person against whom he is authorized to use force. 4. Special powers of officers of the Armed Forces, etc. ___Any officer of the Armed Forces, or any officer of the Civil Armed Forces may, in a disturbed area, ___ (a) exercise the powers of a Magistrate or police officer conferred by section 3; (b) arrest without warrant any person who has committed a cognizable offence, or against whom a reasonable suspicion exists that he has committed or is about to commit a cognizable offence; and (c) enter and search, without warrant, any premises to make any such arrest as is referred to in clause (b), or to recover any person believed to be wrongfully restrained or confined, or any property reasonably suspected to be stolen property, or any arms believed to be unlawfully kept in such premises. 5. Bar to suits, etc.___No prosecution, suit or other legal proceedings shall be instituted against any person in respect of anything done or purporting to be done in exercise of the powers conferred by sections 3 and 4, except with the previous sanction in writing, ___ (a) in the case of a Magistrate or police officer, of the Provincial Government; and (b) in the case of an officer of the Armed Forces or an officer of the Civil Armed Forces, of the 1[Federal Government]. 6. 2[Omitted] 3[ * ] _______________ RGN Date: 29-05-2024 1Subs. by Federal Adaptation of Laws Order, 1975. (P.O. No. 4 of 1975), Art. 2 and Table. 2Omitted by the Federal Laws (Revision and Declaration) Ordinance No. XXVII of 1981, s. 3 and Sch. II. 3Schedule omitted by the Federal Laws (Revision and Declaration) Ordinance No. XXVII of 1981, s. 3 and Sch. II."
}