{
  "file": "administrator0a85362fe08703aa3dd56b1d6bc349f1.pdf",
  "law_name": "The Epidemic Diseases Act, 1897",
  "text": "THE EPIDEMIC DISEASES ACT, 1897 CONTENTS SECTIONS: 1. Short title. 2. Power to take special measures and prescribe regulations as to dangerous epidemic disease. 2 A. Powers of Federal Government. 3. Penalty. 4. Protection to persons acting under Act. THE EPIDEMIC DISEASES ACT, 1897 lAct No. III OF 1897 [4th February, 1897] An Act to provide for the better prevention of the spread of Dan gerous Epidemic Disease. WHEREAS it is expedient to provide for the better prevention of the spread of dangerous epidemic disease; It is hereby enacted as follows : ­ 1. Short title and extent.__(1) This Act may be called the Epidemic Diseases Act, 1897. 2[(2) It extends to the whole of Pakistan]. 3* * * * * * * 42. Power to take special measures and prescribe regulations as to dangerous epidemic disease.__(1) When at any time the 5[Provincial Government] is satisfied that 6[the Province] or any part thereof is visited by, or threatened with, an outbreak of any dangerous epidemic disease, the 5[Provincial Government], if 7[it] thinks that the ordinary provisions of the law for the time being in force are insufficient for the purpose, may take, or require or empower any person to take, such measures and, by public notice, prescribe such tempo rary regulations to be observed by the public or by any person or class of persons as 7[it] shall deem necessary to prevent the outbreak of such disea­ 1For Statement of Objects and Reasons, see Gazette of India, 1897, Pt. V, p. 21; for Report of the Select Committee, see ibid., p. 23 ; and for Proceed ings in Council, see ibid., Pt. VI, pp. 18 and 24. . This Act has been applied to Phulera in the Excluded Area of Upper Tanawal to the extent the Act is applicable in the N.W.F.P., subject to certain modifications, see N.W.F.P. (Upper Tanawal) (Excluded Area) Laws Re gulation, 1950. It has also been extended to the Leased Areas of Baluchistan, see the Leased Areas (Laws) Order, 1950 (G.G.O. 3 of 1950); and applied in the Federated Areas of Baluchistan, see Gazette of India, 1937, Pt. I, 'P. 1499. It has been extended to the Excluded Area of Upper Tanawal other than Phulera by the N.W.F.P. (Upper Tanawal) (Excluded Area) Laws Regu lation, 1950 and declared to be in force in that area with effect from the 1st June, 1951, see N.W.F.P. Gazette, Ext. dated the 1st June, 1951. It has also been amended in the Punjab by the Epidemic Diseases (Punjab Amdt.) Act, 1944 (pun. Act 3 of 1944). This Act has been repealed in its application to the Province of West Pakistan by West Pakistan Act 36 of 1958. 2Subs. by the Central Laws (Statute Reform) Ordinance, 1960 (21 of 1960), s. 3 and 2nd Sch. (with effect from the 14th October, 1955), for the original sub­section (2), as amended by the Burma Laws Act, 1898 (13 of 1898), the Repealing and Amending Act, 1914 (10 of 1914), A.O., 1949 and the Federal Laws (Revision and Declaration) Act, 1951 (26 of 1951), s. 8. 3Sub­section (3), rep. by Act 10 of 1914, s. 3 and Sch.II. 4For notifications issued under this section, see different local Rules and Orders. 5Subs. by A.O., 1937, for “G. G. in C.”. 6Subs. ibid., for “India.”. 7Subs. ibid., for “he”. se or the spread thereof, and may deter mine in what manner and by whom any expenses incurred (in ­ cluding compensation if any) shall be defrayed. (2) In particular and without prejudice to the generality of the foregoing provisions, the 1[provincial Government] may take measures and prescribe regulations for ­ 2* * * * * * * (b) the inspection of persons travelling by railway or other wise, and the segregation, in hospital, temporary accommodation or otherwise, of persons suspected by the inspecting officer of being infected with any such disease. 3* * * * * * * 4[2A. Powers of Federal Government. When the 5[Federal Government] is satisfied that 6[Pakistan] or any part thereof is visited by, or threatened with, any out­break of any dangerous epidemic disease and that the ordinary provisions of the law for the time being in force are insufficient to prevent the outbreak of such disease or the spread thereof, the 5[Federal Government] may take measures and prescribe 7regula tions for the inspection of any ship or vessel leaving or arriving at any port in 8[Pakistan] and for such detention thereof, or of any person intending to sail therein, or arriving thereby, as may be necessary.] 3. Penalty. Any person disobeying any regulation or order made under this Act shall be deemed to have committed an offence punishable under section 188 of the Pakistan Penal Code (XLV of 1860). 4. Protection to persons acting under Act. No suit or other legal proceeding shall lie against any person for anything done or in good faith intended to be done under this Act. lSubs. by A. O.,1937, for “G. G. in C.”. 2Clause (a) rep. ibid. 3Sub­section (3) rep. by the Devolution Act, 1920 (38 of 1920) s.2 and Sch. I. 4Subs. by A. O., 1937, for s. 2A as ins. by Act, 38 of 1920, s. 2 and Sch. I. 5Subs. by F. A. O., 1975, Art. 2 and Table, for “Central Government”. 6Subs. by the Federal Laws (Revision and Declaration) Act, 1951 (26 of 1951), s. 4 and 3rd Sch., for “India”. 7For such Regulations, see Gaz. of P., 1958, Pt. I, p. 167. 8Subs. by the Central Laws (Statute Reform) Ordinance, 1960 (21 of 1960), s. 3 and 2nd Sch. (with effect from the 14th October, 1955), for “the Provinces and the Capital of the Federation” which had been subs. by A. O., 1949, Arts, 3 (2) and 4, for “British India”."
}