{
  "file": "administratora4476d3c8e79dc2fa0574620496ba8bf.pdf",
  "law_name": "The Protection Of Economic Reforms Act, 1992",
  "text": "THE PROTECTION OF ECONOMIC REFORMS ACT, 1992 CONTENTS 1. Short title, extent and commencement 2. Definitions 3. Act to override other laws 4. Freedom to bring, hold, sell and take out foreign currency 5. Immunities to foreign currency accounts 6. Protection of fiscal incentives for setting up of industries 7. Protection of transfer of ownership to private sector 8. Protection of foreign and Pakistani investment 9. Secrecy of Banking transaction 10. Protection of financial obligation 11. Rules THE PROTECTION OF ECONOMIC REFORMS ACT, 1992. ACT No. XII OF 1992 [23rd July, 1992] An Act to provide for furtherance and protection of economic reforms WHEREAS it is necessary to create a liberal environment for savings and investments; and other matters relating thereto; AND WHEREAS a number of economic reforms have been introduced and are in the process of being introduced to achieve the aforesaid objectives; AND WHEREAS it is necessary to provide legal protection to these reforms in order to create confidence in the establishment and continuity of the liberal economic environment created thereby; It is hereby enacted as follows:— 1. Short title extent and commencement.— (1)This Act, may be called the Protection of Economic Reforms Act, 1992. (2) It extends to the whole of Pakistan. (3) It shall come into force at once. 2. Definitions.— In this Act, unless there is anything repugnant in the subject or context,— (a) “Government” includes both the Federal Government and any Provincial Government; (b) “economic reforms” means economic policies and programmes, laws and regulations announced, promulgated or implemented by the Government on and after the seventh day of November, 1990, relating to privatization of public sector enterprises, and nationalized banks, promotion of savings and investments, introduction of, fiscal incentives for industrialization and deregulation of investment, banking, finance, exchange and payments systems, holding and transfer of currencies; and (c) all other expressions used in this Ordinance shall have the meaning respectively assigned to them under the relevant laws. 3. Act to Override other laws. The provisions of this Act shall have effect notwithstanding anything contained in the Foreign Exchange Regulation Act, 1947 (VII of 1947), the Customs Act, 1969 (IV of 1969), the Income Tax Ordinance, 1979 (XXXI of 1979), or any other law for the time being in force. 4. Freedom to bring, hold, sell and take out foreign currency.— (1) All citizens of Pakistan resident in Pakistan or outside Pakistan and all other persons shall be entitled and free to bring, hold, sell, transfer and take out foreign exchange within or out of Pakistan in any form and shall not be required to make a foreign currency declaration at any stage nor shall anyone be questioned in regard to the same. 1[(2) Nothing in sub-section (1) shall apply to (a) any foreign exchange borrowed under any general permission given by the State Bank of Pakistan under sub-section (1) of section 4 of the Foreign Exchange Regulations Act, 1947 (VII of 1947); (b) any payment from abroad for good exported from Pakistan; (c) proceeds of securities issued or sold to non-residents; (d) any payment received from abroad for services rendered in, or from Pakistan; (e) earnings or profits of the overseas offices or branches of Pakistani firm and companies including banks; and (f) any foreign exchange purchased from an authorized dealer in Pakistan for any purpose.] 5. Immunities to foreign currency accounts.—(1) All citizens of Pakistan resident in Pakistan or outside Pakistan who hold foreign currency accounts in Pakistan, and all other persons who hold such accounts, shall continue to enjoy immunity against any inquiry from the Income Tax Department or any other taxation authority as to the source of financing of the foreign currency accounts 1[:] 1[Provided that such immunity shall not be available to citizens of Pakistan residing in Pakistan and to firms, companies and other bodies registered or incorporated in Pakistan in respect of any new foreign currency account opened or deposits created on or after the 16th day of December, 1999 or to any incremental deposits thereafter in an existing foreign currency account]; and (2) The balances in the foreign currency accounts and income there from shall continue to remain exempted from the levy of wealth-tax and income tax and compulsory deduction of Zakat at source. 1[:] 1[Provided that such exemption shall not be available to citizens of Pakistan residing in Pakistan and to firms, companies and other bodies registered or incorporated in Pakistan in respect of any balance n a new foreign currency account opened or deposits created on or after the 16th day of December, 1999 or to incremental deposits created on or after the 16th day of December, 1999 in an existing foreign currency account and income therefrom.] (3) The banks shall maintain complete secrecy in respect of transactions in the foreign currency accounts. 1 Numbered, added and subs. by Ordinance 21 of 1999, ss.2 & 3. (4) The State Bank of Pakistan or other banks shall not impose any restrictions on deposits in and withdrawals from the foreign currency accounts and restrictions if any shall stand withdrawn forthwith. 6. Protection of fiscal incentives for setting-up of industries. The fiscal incentives for investment provided by the Government through the statutory orders listed in the Schedule or otherwise notified shall continue in force for the term specified therein and shall not be altered to the disadvantage of the investors. 7. Protection of transfer of ownership to private sector. The ownership, management and control of any banking, commercial, manufacturing or other company, establishment or enterprise transferred by the Government to any person under any law shall not again be compulsorily acquired or taken over by the Government for any reason whatsoever. 8. Protection of foreign and Pakistani Investment. No foreign, industrial or commercial enterprise established or owned in any form by a foreign or Pakistani investor for private gain in accordance with law, and no investment in share or equity of any company, firm, or enterprise, and no commercial bank or financial institution established, owned or acquired by any foreign or Pakistani investor, shall be compulsorily acquired or taken over by the Government. 9. Secrecy of Banking Transaction. Secrecy of bonafide banking transactions shall be strictly observed by all banks and financial institutions, by whosoever owned, controlled or managed. 10. Protection of financial obligation. All financial obligations incurred including those under any instrument, or any financial and contractual commitment made by or on behalf of the Government shall continue to remain in force, and shall not be altered to the disadvantage of the beneficiaries. 11. Rules. The Federal Government may make rules for carrying out the purposes of this Act. ___________ THE SCHEDULE (See section 6) 1. Notification No. SRO 1283 (1)/90, dated the 13th December, 1990, issued under sub- section (2) of section 14 of the Income Tax Ordinance, 1979 (XXXI of 1979). 2. Notification No. SRO 1284 (1)/90, dated the 13th December, 1990, issued under section 19 of the Customs Act, 1969 (IV of 1969)."
}