{
  "file": "administrator1b5b9becb8d92cfaf75bd5000a05964c.pdf",
  "law_name": "The Civil Pioneer Force Ordinance, 1965",
  "text": "UNDER PROOF READING THE CIVIL PIONEER FORCE ORDINANCE, 1965 CONTENTS 1. Short title, extent and commencement 2. Definitions 3. Constitution of the Civil Pioneer Force 4. Duties of the Force 5. Officers of the Force 6. Appointment of officers 7. Enrolment and appointment to units 8. Transfers. 9. Liability for service 10. Discharge and dismissal 11. Major offences 12. Minor offences 13. Attempts to commit offences and abetment of offences 14. Summary disposal of minor offences of Civil Pioneers 15. Summary disposal of minor ofences of non-gazetted officers 16. Summary disposal of minor offences of gazetted officers 17. Reduction in rank for inefficiency or lack of zeal 18. Trial of minor offences 19. Power of Controller to make deduction from pay 20. Power of Provincial Government to award punishment UNDER PROOF READING 21. Custody during investigation 22. Arrest of deserters 23. Place of trial 24. Proof of appointment or enrolment 25. Power of Federal Government to exercise powers of Provincial Government 26. Power to make rules UNDER PROOF READING THE CIVIL PIONEER FORCE ORDINANCE, 1965 1ORDINANCE NO. XXVII OF 1965 [9th September, 1965] An Ordinance to constitute a Civil Pioneer Force for service in Pakistan and to provide for the organization, control and discipline thereof. WHEREAS it is expedient to constitute a Civil Pioneer Force for service in Pakistan and to provide for the organization, control and discipline thereof; AND WHEREAS a Proclamation of Emergency issued under clause (1) of Article 30 of the Constitution is in force; AND WHEREAS the President is satisfied that immediate legislation is necessary to meet the emergency ; NOW, THEREFORE, in exercise of the powers conferred by clause (4) of Article 30 of the Constitution, read with clause (2) of Article 131 thereof, and of all other powers enabling him in that behalf, the President is pleased to make and promulgate the following Ordinance:— 1. Short title, extent and commencement.—(1) This Ordinance may be called the Civil Pioneer Force Ordinance, 1965. (2) It extends to the whole of Pakistan. (3) It shall come into force at once. 2. Definitions. In this Ordinance, unless there is anything repugnant in the subject or context,— (a) “Chief Controller” means the gazetted officer appointed to command all the units of the Civil Pioneer Force constituted in, a Province; (b) “ Civil Pioneer” means an enrolled person other than a gazetted or non-gazetted officer; (c) “Controller” means the gazetted officer appointed to command a unit of the Civil Pioneer Force, and includes, in his absence from duty, the senior gazetted officer of the unit present with the unit; (d) “Detachment” means any portion of a unit of the Civil Pioneer Force serving away from the headquarters of the unit; (e) “enrolled person” means a person for the time being subject to the provisions of this Ordinance; 1Approved by the National Assembly of Pakistan on 26th November, 1965, see Gaz. of P., 1965, Ext., pp. 1416-1423. For notifn. Entrusting to the Provincial Government the functions of the Central Government under this Ordinance, see Gaz., of P., 1965, Ext., p. 1152. UNDER PROOF READING (f ) “party” means any portion of a unit or detachment ordered to perform any particular job or duty at the headquarters or elsewhere ; (g) “prescribed” means prescribed by rules made under this Ordinance ; (h) “service in a war area” means service in an area in Pakistan in which for the time being enemy action is taking place, or in an area in Pakistan declared by the 1[Federal Government], by notification in the official Gazette, to be a war area for the purposes of this Ordinance; (i) “Superior Officer” means, in relation to a person subject to this Ordinance, a gazetted afficer or a non-gazetted officer who is of a class higher than that person or is senior to that person in the same class; (j) “unit” means a unit of the Civil Pioneer Force constituted under section 3. 3. Constitution of the Civil Pioneer Force.—(1) There shall be raised and maintained in the manner hereinafter provided a force to be designated the Civil Pioneer Force (hereinafter called the “Force “) to perform in Pakistan the duties hereinafter specified. (2) The 1[Federal Government] may constitute for service in any part of Pakistan one or more units and may disband or reconstitute any unit so constituted. (3) The strength and composition of a unit shall be such as may be prescribed. 4. Duties of the Force.— (1) It shall be the duty of the Force and of the persons enrolled therein as and when required by the 2[Federal]or a Provincial Government or by an authority authorised in this behalf by the 2[Federal] or Provincial Government, for the purpose of securing the defence of Pakistan or any part thereof, the public safety, the maintenance of public order or the efficient prosecution of war, or for maintaining supplies and services essential to the life of the community— (a) to repair and maintain important lines of communications, to clear roads after an enemy raid, to construct diversions in case of floods, bridges and air landing grounds; (b) to load, unload or stack large quantity of warlike and other important items which of necessity may, have to be moved from one place to another; (c) to construct defence works and air raid shelters; (d) to man vital or other installations in case of emergencies; (e) to clear debris from important headquarters and offices after enemy bombardment; (f) to perform work in factories, workshops and shipyards; _________________________________________________________________________________________________________________________ 1 Subs,. by F.A.O., 1975, Art. 2 and Table, for “Central Government”. 2 Subs. ibid., for “Central”. UNDER PROOF READING (g) to render such other services as, in the opinion of the 1[Federal]or a Provincial Government, are necessary or expedient for the purposes aforesaid: Provided that the 2[Federal Government] may, subject to such conditions as may be prescribed, levy a charge for any work or carried out by the Force for or on behalf of a Provincial Government, a local authority or industrial commercial undertaking. (2) A unit shall be liable for service in the part of Pakistan for which it has been constituted under section 3, and shall be liable, if the 2[Federal Government] so orders, for service in any other part of Pakistan. 5. Officers of the Force. There shall be the following classes of officers in the Force, namely: (i) gazetted officers Class I— (a) Chief Controllers, (b) Controllers, (c) Deputy Controllers, (d) Assistant Controllers, (e) Group Officers; (ii) gazetted officers Class II— (a) Administrative Officers, (b) Store Officers; (iii) non-gazetted officers— (a) Chief Supervisors, (b) Group Supervisors, (c) Assistant Group Supervisors; and such grades in the classes of non-gazetted officers as the 2 [Federal Government] may direct 6. Appointment of officers.— (1) Gazetted officers, Class I and Class II shall respectively be selected by the 3[Federal Government] and the Provincial Government and the 3[Federal Government] shall issue to each such officer on order of appointment. 1 Subs. by F.A.O., 1975, Art. 2 and Table, for Central Government. 2Subs. ibid., for “Central “Government”. 3 Subs. by F.A.O., 1975, Art. 2 and Table, for Central Government. UNDER PROOF READING (2) Non-gazetted officers shall be appointed from amongst Civil Pioneers in the unit by the Controller of the unit or by such other authority and in such manner as may be prescribed. 7. Enrolment and appointment to units.—(1) Any person who is or is deemed to be a citizen of Pakistan may, if he has attained the age of eighteen and is not employed in the Army, Navy or Air Force of Pakistan or in the Civil Armed Forces including their Reserves, the Pakistan National Guard, village defence or such functionary bodies as are planned to be co-opted by the Armed Forces in time of war, including Ansars, unless any of them is specifically allowed by the competent authority, or in any employment to which the Pakistan Essential Services (Maintenance) Act, 1952 (LIII of 1952), for the time being applies, offer himself for appointment to or enrolment in the Force, and, if he satisfies the prescribed conditions, may be enrolled therein in such manner and for such period as may be prescribed, and shall thereupon become subject to the provisions of this Ordinance. (2) Subject to the prescribed conditions, if any, an applicant for enrolment may apply to be enrolled for service in a particular unit. (3) Any person enrolled shall without unnecessary delay be appointed in the prescribed manner to a unit constituted for the part in which he for the time being resides, or if he applies for enrolment in a particular unit to that unit. 8. Transfers. Any person appointed to a unit under section 7 may be transferred, whether on disbandment of the unit or otherwise, to another unit in such manner as may be prescribed : Provided that a person who is not a gazetted officer shall not, without his own consent, be transferred to a unit constituted for a part other than that in which he was enrolled. 9. Liability for service. Every person subject to this Ordinance shall be bound to serve in the unit of the Force to which he has been appointed or transferred or is for the time being attached until he is discharged from the Force. 10. Discharge and dismissal. __ (1) Every person subject to this Ordinance shall be entitled to receive his discharge from the Force on the expiration of the period for which he was enrolled or on his attaining the age of fifty; but any such person may, before he becomes so entitled, be discharged by such authority and subject to such conditions as may be prescribed. (2) The prescribed authority may, subject to such conditions as may be prescribed, dismiss any person from the Force. 11. Major offences. Any person subject to this Ordinance who— (a) begins, incites, causes or conspires with any other person to cause, or joins in any mutiny, or (b) being present at any mutiny, does not use his utmost endeavour to supress it, or (c) knowing or having reason to believe in the existence of any mutiny or of any intention to mutiny, does not, without delay, give information thereof to his superior officer, or UNDER PROOF READING (d) uses or attempts to use criminal force to, or commits an assault on, his superior officer, whether on or off duty, knowing or having reason to believe him to be such, or (e) while on service in a war area,— (i) disobeys the lawful command of his superior officer, or (ii) deserts or attempts to desert the service, or (iii) quits his post or party without being relieved or without leave, or (iv) fails to perform his duty, or (v) intentionally causes or spreads a false alarm, or (vi) plunders, destroys or damages property of any kind, shall be punishable with imprisonment for a term which may extend to seven years and with fine which may extend to five hundred rupees. 12. Minor offences. Any person subject to this Ordinance who— (a) is in a state of intoxication when on or detailed for duty, or (b) is grossly insubordinate or insolent to his superior officer in the execution of his office, or (c) refuses or wilfully neglects to perform or assist in any work or duty ordered to be done either in quarters or elsewhere, or (d) while incharge of a party, permits behaviour prejudicial to good order and discipline, or (e) uses criminal force to, or commits an assault on, or otherwise ill-treats, any member of the Force subordinate to him in rank or position, or (f ) designedly or through neglect injures or loses, or fraudulently or without due authority disposes of, his clothes, tools or equipment or any such articles entrusted to him or belonging to any other member of the Force, or (g) malingers, feigns or produces disease or infirmity in himself, or intentionally delays his cure or aggravates his disease or infirmity, or (h) with intent to render himself or any other member of the Force unfit for service, voluntarily causes hurt to himself or that other member, or (i) while not on service in a war area,— (i) disobeys the lawful command of his superior officer, or UNDER PROOF READING (ii) deserts or attempts to desert the service or his party or his post or his duty, or (j) is guilty of any act or omission not otherwise punishable which is prejudicial to good order and discipline, shall be punishable with imprisonment for a term which may extend to one year, or with fine which may extend to five hundred rupees, or with both 1[:] 2[Provided that offences under clause (a) shall be tried under the Prohibition (Enforcement of Hadd) Order, 1979 (P.O. No. 4 of 1979)]. 13. Attempts to commit offences and abetment of offences. Any enrolled person who attempts to commit or abets the commission of an offence under this Ordinance shall be punishable with the punishment provided for such offence. 14. Summary disposal of minor offences of Civil Pioneers. When a Civil Pioneer is charged with an offence punishable under section 12 3[except clause (a) thereof,] the Controller or the gazetted officer commanding the detachment in which such person is serving if so authorized in writing by the Chief Controller, may dispose of the charge without formal trial and may award one or more of the following punishments, namely :— (a) confinement in such place as may be considered suitable for a period not exceeding seven days ; (b) punishment drill, extra work, fatigue or other duty, for a period not exceeding thirty days, with or without confinement to quarters or lines ; (c) forfeiture of pay and allowances for a period not exceeding one month. 15. Summary disposal of minor offences of non-gazetted officers. When a non-gazetted officer is charged with an offence punishable under section 12 4[except clause (a) thereof,], the Controller or the gazetted officer commanding the detachment in which the non-gazetted officer is serving, if so authorised in writing by the Chief Controller, may dispose of the charge without formal trial and award to such non-gazetted officer any one or more of the following punishments, namely:— (a) reduction to a lower class or to the ranks ; (b) forfeiture of pay and allowances for a period not exceeding one month ; (c) reprimand or severe reprimand; Provided that no such non-gazetted officer shall be reduced in grade, class or rank except by an order of the Controller. 1 Subs. by the Civil Pioneer Force (Amdt.) Ordinance, 1983 (30 of 1983), s.2 for full-stop. 2 Provis. added ibid. 3 Ins. ibid. 4 Ins. by the Civil Pioneer Force (Amdt.) Ordinance, 1983 (30 of 1983), ss. 3 and 4. UNDER PROOF READING 16. Summary disposal of minor offences of gazetted officers. When a gazetted officer is charged with an offence punishable under section 12 1[except clause (a) thereof,], the Chief Controller or Controller may, subject to any rules in this behalf, without formal trial, reprimand or severely reprimand such officer or may refer the matter to the Provincial Government for disposal. 17. Reduction in rank for inefficiency or lack of zeal. Subject to any rules made in this behalf, the Controller may reduce to a lower grade or a lower class or to the ranks any non-gazetted officer in his unit on the grounds of ineffciency or lack of zeal. 18. Trial of minor offences. __ (1) An offence punishable under section 12 1[except clause (a) thereof,] and not disposed of under section 14, 15 or 16 may be tried by the Summary Court, constituted as provided in sub-section (2). (2) A Summary Court shall consist of a Magistrate of the first class appointed by the District Magistrate, sitting with the Controller or a gazetted officer of the Force nominated by him and a third person to be selected by the Provincial Government. The Magistrate so appointed shall be president of the Court and, in the event of any difference of opinion, the opinion of the majority shall prevail. (3) A Summary Court may take cognizance of an offence upon a report in writing made by a gazetted officer of the Force authorized in this behalf by the Chief Controller, and such officer shall in making complaint be deemed to be a public servant acting in the discharge of his official duties. (4) A Summary Court shall in the trial of an offence follow as far as possible the procedure for the trial of summary cases in which an appeal lies as laid down in Chapter XXII of the Code of Criminal Procedure, 1898 (Act V of 1898). (5) A Summary Court may pass any sentence authorized by section 12 for the offence. (6) An appeal from a sentence passed by a Summary Court may be made within thirty days of the sentence to the authority appointed by the Provincial Government and such authority shall in disposing of such appeals follow the same procedure and have the same powers as an appellate Court follows and has under the Code of Criminal Procedure, 1898 (Act V of 1898). (7) The provisions of the Code of Criminal Procedure, 1898 (Act V of 1898), and of any other law for the time being in force, in so far as they may be applicable and in so far as they are not inconsistent with the provisions of this Ordinance, shall apply to all matters connected with, arising from or consequent upon a trial by a Summary Court. 19. Power of Controller to make deduction from pay.—The following deductions may, subject to the rules made in this behalf, be made by the Controller from the pay and allowances of any person subject to this Ordinance, namely:- (a) all pay and allowances for every day on which such person is absent either on desertion or without leave or because of imprisonment awarded by a Criminal Court or a Court constituted under this Ordinance ; 1 Ins. by the Civil Pioneer Force (Amdt.) Ordinance, 1983 (30 of 1983), ss. 3 and 4. UNDER PROOF READING (b) all pay and allowances for every day on which such person is in custody on a charge for an offence of which he is afterwards convicted by a Criminal Court or a Court constituted under this Ordinance, or on a charge of absence without leave for which he is afterwards awarded punishment under section 14, 15 or 16; (c) all pay and allowances for every day on which such person is in hospital on account of sickness certified by the medical officer attending him to have been caused by an offence punishable under this Ordinance committed by him, or, subject to any rules made in this behalf, on account of a venereal disease ; (d) all pay and allowances which may be forfeited under section 14 or 15 ; (e) any deduction from pay which may be ordered under clause (b) of section 20 ; (f) any sum required to defray any expenditure incurred as a consequence of misconduct by him or to make good any loss of, or of damage or destruction done by him to, any clothes, tools or equipment or to any building or property : Provided that the total deductions from the pay and allowances of any person under clauses (d) to (f) shall not in any one month exceed one-half of his pay and allowances for that month. 20. Power of Provincial Government to award punishment. The following punishments may, subject to the rules made in this behalf, be awarded to a gazetted officer by the Provincial Government, namely:— (a) reprimand or severe reprimand ; (b) deductions from pay to defray expenditure or recoup loss incurred as a consequence of misconduct by him ; and (c) forfeitue of service for purposes of seniority, promotion and annual increments. 21. Custody during investigation. Any person charged with an offence punishable under this Ordinance may be taken into and kept in custody in the prescribed manner by the unit to which he belongs pending investigation of the offence. 22. Arrest of deserters.—(1) Whenever any enrolled person deserts his unit, the Controller or the gazetted officer commanding the detachment to which he belongs may give written information of the desertion to the officer in charge of the nearest police station, and such police officer shall thereupon take steps for the apprehension of the deserter in like manner as if he were a person for whose apprehension a warrant had been issued by a Magistrate, and shall deliver the deserter when apprehended to the custody of his unit. (2) Any police officer may arrest without warrant any person reasonably believed by him to be enrolled person who has deserted his unit and shall on making an arrest bring or send the arrested person without delay to the nearest unit. UNDER PROOF READING 23. Place of trial. An enrolled person charged with an offence punishable under this Ordinance may be tried and punished for such offence in any place in Pakistan. 24. Proof of appointment or enrolment. In any proceedings before a Court the fact that a person is a person subject to this Ordinance may be provided by the production of a certificate purporting to be signed by the Controller of the unit in which he is so serving. 25. Power of 1Federal Government to exercise powers of Provincial Government. The 1[Federal Government] may exercise any power vested by this Ordinance in the Provincial Government. 26. Power to make rules. The 1[Federal Government] may, by notification in the official Gazette, make rules2 to carry out the purposes of this Ordinance. (2) In particular and without prejudice to the generality of the foregoing power, rules may be made to provide for any of the following matters, namely :— (a) appointment of officers ; (b) delegation of powers ; (c) enrolment and appointment to units ; (d) transfers ; (e) reduction in rank for inefficiency or lack of zeal; (f) power of Controllers to make deductions from pay ; (g) power of Provincial Governments ; (h) custody during investigation ; (i) the duties, training, clothing, equipment and conditions of service of enrolled persons, the payment of compensation to or in respect of such persons for injuries received or death suffered by them ; (j) the organisation of the Force and of the units thereof ; (k) medical examination of persons offering themselves for appointment or enrolment ; (l) any matter which is to be or may be prescribed under this Ordinance. 1 Subs. by F.A.O., 1975, Art. 2 and Table, for “Central Government”. 2 For such rules, see Gaz. of P., 1965, Ext., pp. 1132-1143."
}