{
  "file": "administrator9eb9167a64e55d690c7b0334cf1a9502.pdf",
  "law_name": "The Pakistan Coast Guards Act, 1973",
  "text": "THE PAKISTAN COAST GUARDS ACT, 1973 CONTENTS CHAPTER I PRELIMINARY 1. Short title, application and commencement 2. Interpretation 3. Powers to constitute and maintain the force and its functions 4. Appointment of officers of Force 5. Appointment of subordinate and ministerial staff 6. Superintendence, command, control and administration of the Force 7. Pay, pension, etc., of officers and members 8. Members to be subject to Pakistan Army Act, 1952 9. Consequence of sentence of imprisonment 10. Suspension 11. Place of imprisonment 12. Capture of deserters 13. Appeal and revision CHAPTER II 14. Powers of the officers of the Force 15. Disposal of goods seized by members of the Force CHAPTER III 16. Placing of Force under command of Chief of Staff, Pakistan Army 17. Indemnity 18. Power to make rules and regulations 19. [Omitted] FIRST SCHEDULE SECOND SCHEDULE THIRD SCHEDULE THE PAKISTAN COAST GUARDS ACT, 1973 ACT NO. XVIII OF 1973 [4th February, 1973] An Act to provide for the constitution and regulation of the Pakistan Coast Guards. WHEREAS it is expedient to provide for the constitution and regulation of the Pakistan Coast Guards and for special measures to effectively check smuggling of any kind across the frontiers of Pakistan in the coastal area of the Arabian Sea and also to deal with persons acting in a manner prejudicial to the defence and security of Pakistan in that area ; It is hereby enacted as follows :— CHAPTER I PRELIMINARY 1. Short title, application and commencement.—(1) This Act may be called the Pakistan Coast Guards Act, 1973. (2) It shall apply to all members of the Pakistan Coast Guards wherever they may be serving. (3) It shall come into force at once. 2. Interpretation.—In this Act, unless there is anything repugnant in the subject or context,— (i) “ Coastal area ” means the area specified in the First Schedule; (ii) “ Commandant ” means a person appointed under section 4 to be a Commandant of a Unit of the Force ; (iii) “ Custody ” means the arrest and confinement of a person as prescribed ; (iv) “ Deputy Director General ” means the Deputy Director General, Pakistan Coast Guards, appointed under section 4 ; (V) “ Director General ” means the Director General, Pakistan Coast Guards, appointed under section 4 ; (vi) “ Force ” means the Pakistan Coast Guards constituted under section 3 or any of the individual forces comprising it, as the context may require ; (vii) “ Junior Commissioned Officer ” means a person commissioned, gazetted or in pay as a Junior Commissioned Officer in the Force ; (viii) “ Member of the Force ” means a person, other than a person appointed under section 4, who is appointed to the Force and has signed a recruiting roll set out in the Second Schedule and the affirmation in the form set out in the Third Schedule ; (ix) “ Officer ” means a person, other than a junior commissioned officer, who is commissioned, gazetted or in pay as an officer of any of the Defence Services of Pakistan or of the Force ; (x) “ Prescribed ” means prescribed by rules made under this Act; and (xi) “ Superior Officer ”, in relation to any member of the force, means a higher appointment, or any non-commissioned officer, junior commissioned officer and an officer of a higher class, a higher grade in the same class, or holding a higher appointment which may place him in a superior position in relation to others according to usage of the Force. 3. Powers to constitute and maintain the force and its functions.—The Federal Government may constitute and maintain a Force to be called the Pakistan Coast Guards for performing the following functions, namely :— (a) prevention of smuggling ; (b) prevention of illegal immigration to and migration from the country ; (c) stopping enemy agents or saboteurs from infiltrating into the country along the coastal areas ; and (d) supplementing defence in war. 4. Appointment of officers of Force.—The Federal Government may, by notification in the official Gazette, appoint any member of any of the Defence Services of Pakistan to be— (a) Director General ; (b) Deputy Director General ; (c) Commandant ; and (d) any other Commissioned Officer of any of the Defence Services of Pakistan with any other designation. 5. Appointment of subordinate and ministerial staff.—(1) The Director General or a person authorised by the Federal Government in this behalf may appoint junior commissioned officers, subordinate and ministerial staff and other members of the Force and determine the duties to be performed by such officers, staff and other members. (2) Appointments under sub-section (1) shall be made by direct recruitment or promotion or from personnel on deputation from any of the Defence Services of Pakistan, the Civil Armed Forces, or any other Department of Government in such manner as may be prescribed. Explanation.—In this sub-section, “ Civil Armed Forces ” means such forces as the Federal Government may, by notification in the official Gazette, specify. (3) Before a person is appointed under sub-section (1), the statement contained in the recruiting roll and affirmation set out respectively in the second and third Schedule shall, in the presence of a Commandant, or other officer appointed under section 4, at any convenient place be read out and, if necessary, explained to him who shall, in acknowledgement of the statement having been so read tut to him, put his signature to it. (4) When the affirmation set out in the Third Schedule is read out, it shall be repeated by the person making affirmation before he signs it. 6. Superintendence, command, control and administration of the Force.—Subject to the superintendence and control of the Federal Government, the Force shall be commanded and administered by the Director General in accordance with the provisions of this Act and the rules made thereunder and such orders and instructions as may be made or issued by the Federal Government from time to time. 7. Pay, pension, etc., of officers and members.—The officer and members of the Force shall receive such pay, pension and other remuneration, and shall enjoy such leave and other privileges as may be prescribed from time to time. 8. Members to be subject to Pakistan Army Act, 1952.—(1) Every officer and member of the Force shall, unless he is already so subject, be subject to the Pakistan Army Act, 1952 (XXXIX of 1952), hereinafter referred to as the Act, as officers, junior commissioned officers and persons enrolled under the Act according as they are respectively officers, junior commissioned officers and other members of the Force. (2) The Director General shall, in respect of all officers and members of the Force, have all the powers conferred by or under the Act on an officer empowered to convene a general court martial. (3) Subject to sub-section (2), the Federal Government may, by general or special order, direct by what authority any jurisdiction, powers or duties incidental to the operation of the provisions of the Act shall be exercised or performed in respect of the Force. 9. Consequence of sentence of imprisonment.—A member of the Force who is sentenced to a term of imprisonment for a term which is not less than ninety days shall be deemed to have been dismissed from the Force. 10. Suspension.—Any officer or junior commissioned officer shall be competent to suspend in the prescribed manner a member of the Force working under him for any mis-conduct, remissness or negligence in the discharge of his duties. 11. Place of imprisonment.—If a member of the Force sentenced under the Act to imprisonment for a term not exceeding one month is also dismissed from service, he shall be imprisoned in the nearest prison or such other prison as the Federal Government may, by general or special order, direct, but if he is not so dismissed, he may be confined in a quarterguard or such other place as the Director General may consider suitable. 12. Capture of deserters.—(1) Whenever any person subject to this Act deserts, his Commandant shall give written information of the desertion to such civil authorities as in his opinion may be able to afford assistance towards the capture of the deserter and such authorities shall thereupon take steps for the apprehension of the said deserter in like manner as if he were a person for whose apprehension a warrant had been issued by a Magistrate, and shall deliver the deserter, when apprehended, into the custody of the Force. (2) Any police officer may arrest without warrant any person whom he reasonably believes to be subject to this Act and a deserter or absentee without leave and bring him without delay before the nearest Magistrate, to be dealt with according to law. 13. Appeal and revision.—(1) In all cases decided by the Deputy Director General, of the Commandant or any other officer, a person aggrieved may, within thirty days of the order, appeal to the officer higher than the one awarding the punishment. (2) A person aggrieved by an order of the Director General awarding any punishment may, within thirty days of the order, apply to the Federal Government for a revision. CHAPTER II 14. Powers of the officers of the Force.—(1) The officers and members of the Force shall perform such functions of officers of customs as may be entrusted to them and exercise such powers under the Customs Act, 1969 (IV of 1969), as may be delegated to them under section 6 of that Act for the purposes of prevention of smuggling along the coastal areas of the Provinces of Sind and Baluchistan, excepting the limits of the various ports in those areas. (2) In addition to the powers conferred under sub-section (1), the officers and junior commissioned officers of the Force shall exercise all the powers conferred on the officer in charge of a police station under the Police Act, 1861 (V of 1861), and under the Code of Criminal Procedure, 1898 (Act V of 1898). 15. Disposal of goods seized by members of the Force.—All goods seized by any officer or member of the Force shall be dealt with in accordance with the provisions of section 169 of the Customs Act, 1969 (IV of 1969), and an officer nominated by the Director General, shall be associated at the time of their final disposal by an appropriate Customs authority under that Act. CHAPTER III 16. Placing of Force under command of Chief of Staff, Pakistan Army.—(1) The Federal Government may at any time, by order in writing, place the entire Force or any part of it under the command of the Chief of Staff of the Pakistan Army for employment within the overall operational plan of the Pakistan Army. (2) Notwithstanding an order under sub-section (1), the Force shall continue to be subject to the provisions of this Act. 17. Indemnity.—No suit, prosecution or other legal proceeding shall lie against any person for anything which is in good faith done or intended to be done under this Act or any rules or regulations made thereunder. 18. Power to make rules and regulations.—(1) The Federal Government may, by notification in the official Gazette, make rules— (a) regulating the functions and powers of persons appointed under section 4; (b) regulating the classes and grades of, and the remuneration to be paid to, officers and members of the Force and their conditions of service; and (c) generally for the purpose of carrying into effect the provisions of this Act. (2) The Director General may, by notification in the official Gazette published with the prior approval in writing of the Federal Government, make regulations consistent with this Act and the rules for carrying out the purposes of this Act. 19. 1[Omitted] FIRST SCHEDULE [See section 2 (i)] Southern strip of the Province of Baluchistan along and astride the existing road emanating from the Pak-Iran border connecting the towns of MAN-TURBAT—HOSHAB—BAZDAR— BELA—UTHAL to HUB RIVER (BUNDMURAD) and also the southern area of the Province of Sind along and astride the line and road from HUB RIVER (BUNDMURAD)—GADAP—SARI SING—THANO BULAKHAN—BANO—MIRPUR BATARO—JATTI to the Arabian Sea but excluding the limits of any port in those areas. SECOND SCHEDULE [See section 2 (viii)] (RECRUITING ROLL) After you have served in the Pakistan Coast Guards for such period as has been fixed under the Pakistan Coast Guards Act, 1973, you may at any time when not on active duty, apply for your discharge through the officer to whom you may be subordinate, to the Commandant, and you will be granted your discharge after three months from the date of your application, unless your discharge would cause the vacancies in that unit of the Coast Guards to exceed one tenth of the sanctioned strength, in which case you shall be bound to remain until this objection is waived or removed. But when on active duty, you shall have no claim to a discharge, and you shall be bound to remain to do your duty until the necessity for retaining you in the Coast Guards ceases, when you may make your application in the manner mentioned above. SIGNED in acknowledgement of the above having been read out to me. I have understood the purport of what has been read out. Person Enrolled. Date…………..... SIGNED in my presence after I had ascertained that the recruit understood the purport of what he signed. Commandant or other Enrolling Officer. 1Omitted by the Federal Laws (Revision and Declaration) Ordinance, 1981 (Ordinance No. XXVII of 1981), s. 3 and Sch., II. THIRD SCHEDULE [See section 2 (viii)] (FORM OF AFFIRMATION) I,....................................................................., solemnly affirm in the presence of Almighty God that I will be faithful and bear true allegiance to the Government of Pakistan and that I will, as in duty bound, honestly and faithfully serve in the Pakistan Coast Guards and go wherever I may be ordered by air, land or sea, and that I will observe and obey all commands of any officer set over me even to the peril of my life. SIGNED in acknowledgement of the above having been read. SIGNED in my presence after I had ascertained that the person understood the purport of what he signed. Commandant or other Enrolling Officer. Roman Urdu Translation of Affirmation “Main........................Khuda-i-Taala ko hazir-o-nazir jankar Khulus ke sath iqrar karta hun kih Pakistan ki Hukumat ka sidq-i-dil se wafadar aur itaatguzar rahunga aur apna farz samjhunga kih Pakistan Coast Guards men imandari aur wafadari ke sath khidmat baja laun. Bharti hone ki sharait ke mutabiq khushki, hava ya samundar ke raste jahan bhi jane ka hukam milega jaunga aur jise mera afsar muqarrar kia jaega uske tamam ahkam ki tamil aur itaat karunga, khuwah us men mujhe jan ka khatra kiun na ho”. ______________ RGN Date: 08-10-2024"
}