{
  "file": "administrator2206851d997920a2e40dfb7fb73292aa.pdf",
  "law_name": "National Bank Of Pakistan Ordinance, 1949",
  "text": "0 THE BANKS (TRANSFER OF ASSETS AND LIABILITIES) ACT, 1974 CONTENTS 1. Short title, extent and commencement 2. Definitions 3. Act to over-ride other laws 4. Vesting of specified offices and branches 5. Contracts and proceedings 6. Excepted liabilities 7. Delivery of undertaking 8. Police assistance 9. Evaluation 10. Validity of action of officers of specified offices and branches 11. Extension of limitation 12. References in other laws 13. Penalties 14. Bar of Jurisdiction 15. Indemnity 16. Power to make rules 17. Removal of difficulties 18. [Omitted] THE SCHEDULE THE BANKS (TRANSFER OF ASSETS AND LIABILITIES) ACT, 1974 ACT NO. XI OF 1974 [1st March, 1974] An Act to provide for the transfer to the National Bank of Pakistan of certain assets and liabilities of the Eastern Mercantile Bank Limited and the Eastern Banking Corporation Limited. WHEREAS it is expedient to provide for the transfer to the National Bank of Pakistan of certain assets and liabilities of the Eastern Mercantile Bank Limited and the Eastern Banking Corporation Limited; It is hereby enacted as follows:— 1. Short title, extent and commencement.___ (1) This Act may be called the Banks (Transfer of Assets and Liabilities) Act, 1974. (2) It extends to the whole of Pakistan. (3) It shall come into force at once. 2. Definitions.—In this Act, unless there is anything repugnant in the subject or context,— (i) “National Bank of Pakistan” means the Bank established under section 3 of the National Bank of Pakistan Ordinance, 1949 (XIX of 1949); (ii) “specified offices and branches” means the offices and branches of the Eastern Mercantile Bank Limited and the Eastern Banking Corporation Limited specified in the Schedule; and (iii) “undertaking of a specified office or branch” includes subject to an order under section 6, all assets, rights, powers, authorities and privileges and all property, movable and immovable, cash balances, reserve funds, investments and all other rights and interests in, or arising out of, such property as were immediately before the commencement of this Act in the possession, ownership, power or control of the specified office or branch in relation to the undertaking within Pakistan, or in relation to the business of such undertaking outside Pakistan, and all books of accounts, registers, records, and all other documents of whatever nature relating thereto, and also includes, except as hereinafter provided, all borrowings, liabilities and obligations of whatever kind then subsisting of the specified office or branch in relation to the undertaking within the Federal Capital and the Provinces of the Punjab and Sind. 3. Act to over-ride other laws.—The Provisions of this Act and any rule or order made thereunder shall have effect notwithstanding anything contained in any other law for the time being in force, or in any contract, agreement, award, memorandum, article or other instrument whatsoever. 4. Vesting of specified offices and branches.—On the commencement of this Act, the undertakings of each of the specified offices and branches shall stand transferred to, and vest in, the National Bank of Pakistan. 5. Contracts and proceedings.___ (1) Unless otherwise expressly provided in this Act, all contracts, deeds, bonds, agreements, powers of attorney, grants of legal representation and other instruments of whatever nature subsisting or having effect immediately before the commencement of this Act to which any of the specified offices and branches is a party or which are in favour of any specified office or branch shall be of as full force and effect against or in favour of the National Bank of Pakistan, and may be enforced or acted upon as fully and effectually, as if in the place of the specified office or branch the National Bank of Pakistan had been a party thereto or as if the same had been in favour of the National Bank of Pakistan. (2) If any suit, appeal or other proceeding of whatever nature in relation to any business of the undertaking which is transferred by virtue of section 4 is pending by or against any specified office or branch, the same shall not abate, be discontinued or be in any way prejudicially affected by reason of the transfer or of anything contained in this Act, but the suit, appeal or other proceeding may be continued, prosecuted and enforced by or against the National Bank of Pakistan. 6. Excepted liabilities.—Notwithstanding anything contained in this Act, the Federal Government may by order direct that any borrowings, liabilities or obligations specified in such order shall not form part of the undertaking of a specified office or branch transferred by virtue of section 4. 7. Delivery of undertaking.—Where any part of the undertaking of a specified office or branch is in the possession or under the control of any person, such person shall, within seven days of the commencement of this Act, deliver the same to a representative of the National Bank of Pakistan duly authorised in that behalf. 8. Police assistance.___ (1) A magistrate may, by warrant, authorise a police officer not below the rank of Inspector to enter upon and search for any property of the undertaking of a specified office or branch in any premises where it may reasonably be expected to be found and to seize such property. (2) Any property seized under sub-section (1) shall be delivered to the National Bank of Pakistan. 9. Evaluation.___ (1) The National Bank of Pakistan shall cause the assets and liabilities of the specified offices and branches to be evaluated and such evaluation to be duly audited by any auditor who is a chartered accountant within the meaning of the Chartered Accountants Ordinance, 1961 (X of 1961). (2) The report of an evaluation under sub-section (1), duly audited as required by that sub- section, shall disclose the financial status of each of the specified offices and branches as at the date of transfer under section 4, and shall be submitted to the Federal Government within three months of such date. (3) The Federal Government may, by order, issue directions as to the manner in which any excess of assets over liabilities or any shortfall therein of the specified offices and branches as at the date of the transfer by virtue of section 4 is to be disposed of or recovered, as the case may be. 10. Validity of action of officers of specified offices and branches.—Notwithstanding any cancellation of powers delegated by the managements of the Eastern Bank Limited and the Eastern Banking Corporation Limited to the officers of the specified offices and branches, all actions taken by such officers in good faith between the 16th day of December, 1971, and the date of transfer of the undertakings of such offices and branches by virtue of section 4 shall be deemed to have been validly taken and shall have effect as if there had been no such cancellation of powers. 11. Extension of limitation.—For the purpose of computing the period of limitation for the recovery of any money due to or from any of the specified offices and branches the period between the 16th December, 1971, and the date of transfer of the undertakings of the specified offices and branches by virtue of section 4 shall be excluded. 12. References in other laws.— Any reference to any of the specified offices and branches in any law, other than this Act, or in any contract or other instrument shall, in so far as it relates to any of the undertakings transferred by virtue of section 4 and if not inconsistent with any provision of this Act, be construed as a reference to the National Bank of Pakistan. 13. Penalties.— Any person who contravenes any of the provisions of this Act or of any rule or order made thereunder or wilfully obstructs any person in carrying out the purposes of this Act shall be punishable with imprisonment for a term which may extend to three years, or with fine, or with both. 14. Bar of Jurisdiction.___ (1) No court shall call in question, or permit to be called in question, anything done or action taken or purporting to be done or taken under this Act. (2) No court shall grant any injunction or make any order, nor shall any court entertain any proceedings, in relation to anything done or intended or purporting to be done under this Act. 15. Indemnity.—No suit, prosecution or other legal proceeding shall lie against the Federal Government or the National Bank of Pakistan or any other person for anything in good faith done or intended or purporting to be done under this Act. 16. Power to make rules.— The Federal Government may, by notification in the official Gazette, make such rules as appear to it necessary or expedient for carrying out the purposes of this Act. 17. Removal of difficulties.— If any difficulty arises in giving effect to any provision of this Act, the Federal Government may make such order, not inconsistent with the provisions of this Act, as may appear to it to be necessary or expedient for the purpose of removing the difficulty. 18. 1[Omitted] 1Omitted by the Federal Laws (Revision and Declaration) Ordinance, 1981 (XXVII of 1981), s. 3 and Sch., II. THE SCHEDULE [See section 2 (ii)] 1. All offices, and branches of the Eastern Mercantile Bank Limited located at Karachi, Lahore, Gujranwala, Islamabad, Hyderabad, Sialkot and 1[Faisalabad]. 2. All offices and branches of the Eastern Banking Corporation Limited located at Karachi, Lahore, Islamabad and 1[Faisalabad]. RGN Uploaded on 26.1.2024 1Subs. by the Federal Laws (Revision and Declaration) Ordinance, 1981 (27 of 1981), s. 3 and Sch. II."
}