{
  "file": "administrator91bdc873bfd52f0aec1bfb8546216359.pdf",
  "law_name": "THE NATIONAL PRESS TRUST (APPOINTMENT OF CHAIRMAN) ACT,",
  "text": "THE NATIONAL PRESS TRUST (APPOINTMENT OF CHAIRMAN) ACT, 1972 CONTENTS 1. Short title and commencement 2. Definitions 3. Act to override other laws 4. Appointment, resignation, etc., of Chairman of the National Press Trust 5. [Omitted] THE NATIONAL PRESS TRUST (APPOINTMENT OF CHAIRMAN) ACT, 1972 ACT NO. XIV OF 1972 [20th September, 1972] An Act to provide for appointment of the Chairman of the National Press Trust. WHEREAS it is expedient to provide for appointment of the Chairman of the National Press Trust and for matters ancillary thereto; It is hereby enacted as follows :— 1. Short title and commencement.—(1) This Act may be called the National Press Trust (Appointment of Chairman) Act, 1972. (2) It shall come into force at once. 2. Definitions. In this Act, unless there is anything repugnant in the subject or context,— (a) “National Press Trust” means the Trust of that name referred to in the Trust Deed; (b) “Trust Deed” means the Deed made on the 8th day of April, 1964, by which the National Press Trust was declared; (c) “Trust Fund” has the same meaning as in the Trust Deed. 3. Act to override other laws. The provisions of this Act shall have effect notwithstanding anything contained in any other law for the time being in force or in the Trust Deed or in the regulations, bye-laws or rules framed thereunder. 4. Appointment, resignation, etc., of Chairman of the National Press Trust.—(1) The President shall appoint a person of eminence, repute and integrity as the Chairman of the National Press Trust, hereinafter referred to as the Chairman. (2) The Chairman shall hold office during the pleasure of the President and shall receive such remuneration and allowances to be paid from out of the income of the Trust Fund and be subject to such conditions as may be determined by the President. (3) The Chairman may, by writing under his hand addressed to the President, resign his office. (4) The person holding office as Chairman immediately before the commencement of this Act shall be deemed to have been appointed under sub-section (1) and the provisions of this Act shall apply to him accordingly. 5. 1[Omitted] RGN Date:-22.04.2024 1Omitted by the Federal Laws (Revision and Declaration) Ordinance, 1981 (XXVII of 1981), s. 3 and Sch., II."
}