{
  "file": "administratorce5035108131d033cfb7b4ab8569da3c.pdf",
  "law_name": "The Wild Birds And Animals Protection Act, 1912",
  "text": "THE WILD BIRDS AND ANIMALS PROTECTION ACT, 1912 CONTENTS 1. Short title and extent 2. Application of Act 3. Close time 4. Penalties 5. Confiscation 6. Cognizance of offences 7. Power to grant exemption 8. Savings 9. [Repeal.] THE SCHEDULE THE WILD BIRDS AND ANIMALS PROTECTION ACT, 1912 1ACT No. VIII OF 1912 [18th September, 1912] An Act to make better provision for the protection and preservation of certain wild birds and animals. WHEREAS it is expedient to make better provision for the protection and preservation of certain wild birds and animals ; It is hereby enacted as follows:— 1. Short title and extent. (1) This Act may be called the Wild Birds and Animals Protection Act, 1912 ; and 2[(2) It extends to the whole of Pakistan.] 2. Application of Act. (1) This Act applies, in the first instance, to the birds and animals specified in the Schedule, when in their wild state. (2) The 3[Provincial Government] may, by notification in the 4[official Gazette], apply the provisions of this Act to any kind of wild bird or animal, other than those specified in the Schedule, which, in its opinion, it is desirable to protect or preserve. 3. Close time. The 3[Provincial Government] may, by notification in the 4[official Gazette], declare the whole year or any part thereof to be a close time throughout the whole or any part of its territories for any kind of wild bird or animal to which this Act applies, or for female or immature wild birds or animals of such kind ; and, subject to the provisions hereinafter contained, during such close time, and within the areas specified in such notification, it shall be unlawful— (a) to capture any such bird or animal, or to kill any such bird or animal which has not been captured before the commencement of such close time ; (b) to sell or buy, or offer to sell or buy, or to possess, any such bird or animal which has not been captured or killed before the commencement of such close time, or the flesh thereof ; (c) if any plumage has been taken from any such bird captured or killed during such close time, to sell or buy, or to offer to sell or buy, or to possess, such plumage. 1For Statement of Objects and Reasons, see Gazette of India, 1912, Pt. V, p. 2 ; for Report of Select Committee, see ibid., 1912, Pt. V, p. 173 ; and for Proceedings in Council, see ibid., 1912, Pt. VI, pp. 57 and 691. This Act has been extended to the Leased Areas of Baluchistan, see G. G. O. 3 of 1950 ; and applied in the Federated Areas of Baluchistan, see Gazette of India, 1937, Pt. I, p. 1499. The Act has been amended in its application to Baluchistan by Regulation III of 1942. It has been repealed in its application to the N.W.F.P. by the N.W.F.P. Wild Birds and Wild Animals Protection Act, 1950 (N.W.F.P. Act 13 of 1950). The Act has been rep. in its application to the Province of Punjab by Punjab Ordinance XXI of 1972, s. 42 w.e.f. the 25th October, 1972 which was temporarily enacted by the Punjab Act VI of 1973 and on the expiry of the Ordinance as so enacted, by Punjab Act II of 1974, s. 48. This Act has been rep. to the extent of Islamabad Capital Territory, see, Ordinance No. XXVII of 1981, s. 4 and 3rd Sch. 2Subs. by the Central Laws (Statute Reform) Ordinance, 1960 (21 of 1960), s. 3 and 2nd Sch., (with effect from the 14th October, 1955), for the original sub-section (2) as amended by A. O., 1949, and the Federal Laws (Revision and Declaration) Act, 1951 (26 of 1951), s. 8. 3Subs. by A. O., 1937, for \"L. G.\". 4Subs. ibid., for \"local official Gazette\". 4.Penalities. (1) Whoever does or attempts to do, any act in contravention of section 3, shall be punishable with fine which may extend to fifty rupees. (2) Whoever, having already been convicted of an offence under this section, is again convicted thereunder shall, on every subsequent conviction, be punishable with imprisonment for a term which may extend to one month, or with fine which may extend to one hundred rupees, or with both. 5. Confiscation. (1) When any person is convicted of an offence punishable under this Act, the convicting Magistrate may direct that any bird or animal in respect of which such offence has been committed, or the flesh or any other part of such bird or animal, shall be confiscated. (2) Such confiscation may be in addition to the other punishment provided by section 4 for such offence. 6. Cognizance of offences. No Court inferior to that of 1* * * a Magistrate of the second class shall try any offence against this Act. 7. Power to grant exemption. Where the 2[Provincial Government] is of opinion that, in the interests of scientific research, such a course is desirable, it may grant to any person a license, subject to such restrictions and conditions as it may impose, entitling the holder thereof to do any act which is by section 3 declared to be unlawful. 8. Savings. Nothing in this Act shall be deemed to apply to the capture or killing of a wild animal by any person in defence of himself or any other person, or to the capture or killing of any wild bird or animal in bona fide defence of property. 9. [Repeal.] Rep. by the Second Repealing and Amending Act, 1914 (XVII of 1914), s. 3 and Schedule II. ____ THE SCHEDULE (i) Bustards, ducks, floricans, jungle fowl, partridges, peafowl, pheasants, pigeons, quail, sand-grouse, painted snipe, spurfowl, wood-cock, herons, egrets, rollers, and king-fishers. (ii) Antelopes, asses, bison, buffaloes, deer, gazelles, goats, hares, oxen, rhinoceroses and sheep. _________ Date: 11-09-2024 1The original words \"a Presidency Magistrate or\" omitted by A. O., 1961, Art. 2 and Sch. (with effect from the 23rd March, 1956). 2Subs. by A.O., 1937, for \"L. G.\"."
}