{
  "file": "administratord50e1a1544614d7c09baf7d09783b1d2.pdf",
  "law_name": "THE PAKISTAN ANIMAL QUARANTINE (IMPORT AND EXPORT OF",
  "text": "THE PAKISTAN ANIMAL QUARANTINE (IMPORT AND EXPORT OF ANIMALS AND ANIMAL PRODUCTS) ORDINANCE, 1979 CONTENTS 1. Short title, extent and commencement. 2. Definitions. 3. Power to regulate and prohibit import and export of animals and animal products. 4. Operation of notification under section 3. 5. Control of animals and animal products in quarantine. 6. Powers, duties and functions of Quarantine Officer. 7. Cognizance of offence. 8. Penalties. 9. Appointment of officers and members of staff. 10. Revision 11. Indemnity. 12. Exemption. 13. Delegation of powers. 14. Power to make rules. THE PAKISTAN ANIMAL QUARANTINE (IMPORT AND EXPORT OF ANIMALS AND ANIMAL PRODUCTS) ORDINANCE, 1979. ORDINANCE No. XLIX OF 1979 [17th September, 1979] An Ordinance to regulate the import, export and quarantine of animals and animal products WHEREAS it is expedient to regulate the import, export and quarantine of animals and animal products in order to prevent the introduction or spread of diseases and to provide for matters connected therewith or incidental thereto; AND WHEREAS the President is satisfied that circumstances exist which render it necessary to take immediate action; NOW, THEREFORE, in pursuance of the Proclamation of the fifth day of July, 1977, read with the Laws (Continuance in Force) Order, 1977 (C. M. L. A. Order No. 1 of 1977), and in exercise of all powers enabling him in that behalf, the President is pleased to make and promulgate the following Ordinance:— 1. Short title, extent and commencement.—(1) This Ordinance may be called the Pakistan Animal Quarantine (Import and Export of Animals and Animal Products) Ordinance, 1979. (2) It extends to the whole of Pakistan. (3) It shall come into force at once. 2. Definitions. In this Ordinance, unless there is anything repugnant in the subject or context,— (a) “animal” includes all kinds of— (i) birds; (ii) cold-blooded creatures; (iii) creatures by means of which any disease may be carried or transmitted; (iv) crustacean; (v) fish; (vi) four-footed beasts which are not mammals; (vii) mammals, except man; and (viii) reptiles; (b) “animal product” means anything originating or made, whether in whole or in part, from an animal or from a carcass and includes blood, bones, casings, dairy products, eggs, fat, feedstuffs of animal origin, fish products, hair, hides, horns, hooves, hormones and their biological preparations, offals, seed materials for research purposes, semen, skins, tendons, viscera, wool and any other substance of animal origin which may be specified by the Federal Government by notification in the official Gazette; (c) “carcase” means the carcass of an animal and includes any part or portion thereof; (d) “diseased” means suffering from or carrying any infectious or contagious disease or such disease as may be declared by the Federal Government from time to time by notification in the official Gazette; (e) “fodder” means hay, roughage, concentrate or any other substance used for feeding animals; (f) “health certificate” means a certificate issued by a Quarantine Officer in respect of the health status of animals and animal products; (g) “import” and “export” respectively means bringing into or taking out of Pakistan by sea, land or air; (h) “litter” means any substance used as bedding for animals or for holding or containing animals in the process of transportation; (i) “prescribed” means prescribed by rules; (j) “points of entry” and “points of exit” mean the Islamabad Airport, Karachi Airport, Karachi Harbour, Lahore Airport, Peshawar Airport, Quetta Airport, the Chaman, Kuh-i-tuftan, Turkham, Khokhrapar and Lahore land routes and include any other authorised land, sea or air route declared by the Federal Government from time to time by notification in the official Gazette; (k) “quarantine” means a site or premises provided or approved by the Federal Government for the isolation and examination of animals and animal products intended for import or export; (l) “Quarantine Officer” means any veterinarian duly authorised by the Federal Government to exercise and perform the powers and functions of Quarantine Officer under this Ordinance; and (m) “rules” means rules made under this Ordinance. 3. Power to regulate and prohibit import and export of animals and animal products.— (1) The Federal Government may, by notification in the official Gazette, prohibit, restrict or otherwise regulate, subject to such conditions as it may think fit to impose, the import or export of any animal or class of animals or animal products likely to introduce diseases to any other animal, animal product or man. (2) A notification under this section may specify any animal or class of animals or animal products either generally or in any particular manner, whether with reference to the country of origin, or the route by which imported or otherwise. (3) Any condition imposed under this section may require__ (a) the examination, inspection and detention in quarantine by the Quarantine Officer of the animals or animal products brought in or to be taken out ; (b) the obtaining of health certificate ; (c) the treatment or detention, confiscation and destruction of diseased animals or animal products ; and (d) that any animal or class of animals or animal products shall not be imported or exported except by a specified agency of the Federal Government. 4. Operation of notification under section 3. A notification under section 3 shall operate as if it had been issued under section 16 of the Customs Act, 1969 (IV of 1969), and the officers of customs shall have the same powers in respect of any animal or animal product in respect of which such a notification has been issued as they have for the time being in respect of any article the importation or exportation of which is prohibited or restricted under the said Act, and all the provisions of that Act shall have effect accordingly. 5. Control of animals and animal products in quarantine. All animals and animal products detained in quarantine shall be under the control of the Quarantine Officer and shall be dealt with in the prescribed manner. 6. Powers, duties and functions of Quarantine Officer. Subject to the provisions of this Ordinance, the Quarantine Officer shall have the power to— (a) inspect animals and animal products ; (b) detain in and release from quarantine and determine the length of the quarantine period ; (c) order the carrying out of the prescribed tests ; (d) issue health certificate ; (e) order destruction of such animals or animal products as may, after such examination and tests as may be prescribed, be found to be diseased ; (f) order disposal of clothing, dung, fittings, fodder, harness or litter that may have been in contact with, or pertaining to, diseased animals and animal products ; (g) require proper disinfection of any premises or aircraft or railway wagon or carriage or vessel or vehicle of any description used for carrying animals and animal products ; (h) approve conditions to be observed in export quarantine ; (i) prohibit export of animals considered unfit to travel ; (j) prohibit voyages of vessels carrying animals during adverse weather; (k) inspect and issue certificates in respect of animals and animal products in transit ; (l) deport any animal or animal product, at the expenses of the person importing such animal or animal product, the import of which is prohibited by the Federal Government ; and (m) carry out such functions as are necessary for the successful operation and management of quarantine stations. 7. Cognizance of offence. No Court shall take cognizance of any offence under this Ordinance, except upon complaint in writing made by an officer authorised by the Federal Government in this behalf. 8. Penalties.—(1) Whoever contravenes or attempts to contravene any of the provisions of this Ordinance or the rules or any notification issued thereunder, shall, without prejudice to any penalty to which he may be liable under the provisions of the Customs Act, 1969 (IV of 1969), as applied by section 4, be punishable with imprisonment for a term which may extend to three years, or with fine which may extend to five thousand rupees, or with both. (2) Any import of animals or animal products not accompanied by a valid import licence and the prescribed health certificate shall, if found free from infectious or contagious disease, be disposed of by the Federal Government in such manner as may be prescribed. 9. Appointment of officers and members of staff. The Federal Government may appoint such number of officers and members of staff as it may deem fit for carrying out the purposes of this Ordinance. 10. Revision.—(1) Any person aggrieved by an order passed by the Quarantine Officer under this Ordinance may apply for revision to the Federal Government within thirty days from the date of issue of such order, and the decision of the Federal Government shall be final 1[:] 1[Provided that no order on such revision shall be passed unless the applicant has been given an opportunity of being heard]. (2) The Federal Government may, on the receipt of an application under sub-section (1), stay the operation of the order of the Quarantine Officer till the disposal of the application. 11. Indemnity. No suit, prosecution or other legal proceedings shall lie against the Federal Government or the Quarantine Officer or any other person for anything in good faith done or intended to be done under this Ordinance, or the rules. 1Subs. and ins. by the Pakistan Animal Quarantine (Import and Export of Animals and Animal Products) (Amdt.) Act, 1985 (5 of 1985), s. 2. 12. Exemption. The Federal Government may, by notification in the official Gazette, exempt any animal or animal product from the operation of all or any of the provisions of this Ordinance, subject to such conditions, if any, as may be specified in the notification. 13. Delegation of powers. The Federal Government may, by notification in the official Gazette, delegate to a Provincial Government, or to any officer or authority of such Government, any of its powers under this Ordinance. 14. Power to make rules.— (1) The Federal Government may, by notification in the official Gazette, make rules1 for carrying out the purposes of the Ordinance. (2) In particular and without prejudice to the generality of the foregoing power, such rules may provide for all or any of the following matters, namely:— (a) the conditions to be observed before, during and after importation of animals or animal products ; (b) the procedure for the landing, inspection, quarantine, seizure, detention and treatment of animals and animal products ; (c) methods of testing for identification of diseases ; (d) the forms and fees for licences to import or export animals or animal products, health certificates, certificates of freedom from disease and certificates of vaccination, destruction, disinfection, onward movement and approval of export quarantine ; (e) the limits of the points of entry and points of exit ; (f) the quarantine charges and the recovery of costs of keeping animals and animal products therein ; (g) the method of cleaning and disinfection ; (h) the manner of identification of imported animals ; and (i) any other matter which is to be or may be prescribed. 15. [Repeal.] Omitted by the Federal Laws (Revision and Declaration) Ordinance, 1981 (XXVII of 1981), s. 3 and II sch. _________ 1For such rules see S.R.O. 1007(I)/80, dated 20-8-1980, Gaz. of P., 1980, Extra., Pt. II, pp. 1766-79."
}