{
  "file": "administrator34bbdadf07d30e64a884a488c00cbe92.pdf",
  "law_name": "The Municipal Taxation Act, 1881",
  "text": "THE MUNICIPAL TAXATION ACT, 1881 CONTNETS Preamble 1. Short title 2. “Municipal Committee” defined 3. Power to prohibit levy of tax 3A. Power of Provincial Government to prohibit levy of taxes on it 4. Federal Government to pay taxes referred to in section 3 5. Payments to be made in lieu of taxes referred to in section 3A 6. Decision of questions arising under this Act THE MUNICIPAL TAXATION ACT, 1881 1ACT No. XI OF 1881 [25th February. 1881] An Act to give power to prohibit the levy of municipal taxes in certain cases. Preamble. WHEREAS it is expedient to empower the 2[Government] to prohibit, in certain cases, the levy of municipal taxes payable by persons in the military 3[naval] 4[or air-force] service or by the 5[provincial Government]; It is hereby enacted as follows:__ 1. Short title. This Act may be called the Municipal Taxation Act, 1881. Local extent. It extends to 6[the whole of Pakistan]; 7* * * * * * 2. “Municipal Committee” defined. In this Act “Municipal Committee” 8 includes a Municipal Corporation or a body of Municipal Commissioners constituted by or under the provisions of any enactment for the time being in force. 9[3. Power to prohibit Levy of tax.—(1) Notwithstanding anything contained in any enactment for the time being in force, the Federal Government may, be an order in writing, prohibit the levy by a Municipal Committee of any specified tax payable by any person subject to the Pakistan Army Act, 1952 (XXXIX of 1952), the Pakistan Navy Ordinance, 1961 (XXXV of 1961), or the Pakistan Air Force Act, 1953 (VI of 1953), who is compelled by the exigencies of military, naval or airforce duty to reside within the limits of a municipality. (2)The Federal Government may, by a like order, rescind any such prohibition.] 10[3A. Power of Provincial Government to prohibit levy of taxes on it. Notwithstanding anything in any enactment for the time being in force, the Provincial Government may by an order in writing prohibit the levy by a Municipal Committee of any specified tax payable by the Provincial Government and may by a like order rescind any such prohibition.] 1For Statement of Objects and Reasons, see Gazette of India, 1880, Pt. V, p. 193 ; for Proceedings in Council, see ibid. Supplement, pp. 904 and 915 ; and ibid, 1881, Supplement, p. 250. This Act has been amended to the extent of Islamabad Capital Territory, see Ordinance No. 27 of 1981, s. 5 and 4th Sch. 2Subs. by A.O., 1949. Sch., for “Governor-General in Council” 3Ins. by the Amending Act, 1934 (35 of 1934), s. 2 and Sch. 4Ins. by the Repealing and Amending Act, 1927 (10 of 1927), s. 2 and Sch. 1. 5Subs. by A.O., 1949, Sch., for “Secretary of State for India in Council”. 6Subs. by the Central Laws (Statute Reform), Ordinance, 1960 (21 of 1960), s. 3 and 2nd Sch. (with effect from the 14th October, 1955, for “ all the Provinces and the Capital of the Federation” which has been subs. by A.O., 1949, Arts. 3 (2) and 4, for “the whole of British India” . 7The words “and shall come into force at once” rep. by the Repealing and Amending Act, 1914 (10 of 1914). 8For the purposes of this Act, every Cantonment Board as defined in the Cantonments Act, 1924 (2 of 1924) is deemed to be a Municipal Committee., see s. 97 of the latter Act. 9Subs. by Ord. XXVII of 1981, s.5 and Sch. IV (only to the extent of ICT). 10Section 3A ins. by A. O., 1937. 4. Federal Government to pay taxes referred to in section 3. So long as any order made under section 3, prohibiting the levy of a tax on any person mentioned in 1* * * that section remains in force, the 2[Federal Government] shall be liable to pay to the Municipal Committee mentioned in the order the amount which otherwise would have been payable to such Committee by such person: Provided that the 3[Federal Government] shall not be liable to pay any sum in respect of any horse which such person is bound, by the regulations of the service to which he belongs, to keep. 5. Payments to be made in lieu of taxes referred to in section 3A. So long as any order made under 4[section 3A] prohibiting the levy of any tax payable by the 2[Provincial Government], remains in force, the said 5[Provincial Government] shall be liable to pay to the Municipal Committee, in lieu of such tax, such sums(if any) as an officer from time to time appointed in this behalf by the 6[Provincial Government] may, having regard to all the circumstances of the case, from time to time determine to be fair and reasonable. 6. Decision of questions arising under this Act. If any question arises whether any duty is military 7[, naval] 8[or air-force] duty within the meaning of this Act, the decision of the 9[Federal Government] thereon shall be conclusive. If any question arises whether any person is compelled as aforesaid to reside within the limits of a municipality or is bound as aforesaid to keep any horse, the decision thereon of such authority as the 2[Federal Government] may, from time to time, appoint in this behalf shall be conclusive. ___________ Date: 16-09-2024 1The words “clause (a) of” rep., by A.O.,1937. 2Subs. by F. A. O.,1975, Art. 2 and Table, for “Central Government” which was subs. by A. O. ,1937, for “Secretary of State for India in Council”. 3Subs. by F. A. O., 1975, Art. 2 and Table, for “Central. Government” which was subs. by A.O. 1937, for “said Secretary of State in Council”. 4Subs. by A. O., 1937, for “section 3”. 5Subs. ibid., for “Secretary of State in Council”. 6Subs. by A.O., 1937, for “L.G.”. 7Ins. by the Amending Act, 1934 (35 of 1934), s. 2 and Sch. 8Ins. by the Repealing and Amending Act, 1927 (10 of 1927), s. 2 and Sch I. Subs. by F.A.O., 1975, Art.2 and Table for “Central Government” which was subs. by A.O., 1937, for “G.G. in C”."
}