{
  "file": "administratorc4e702ce4c8e77fee0203f809e3833c9.pdf",
  "law_name": "The National Institute Of Electronics Ordinance, 1979",
  "text": "THE NATIONAL INSTITUTE OF ELECTRONICS ORDINANCE, 1979 CONTENTS CHAPTER I PRELIMINARY 1 Short title, extent and commencement 2 Definitions 3 Establishment of the institute CHAPTER II FUNCTIONS OF THE INSTITUTE 4 The functions of the institute shall be to CHAPTER III ADMINISTRATION OF INSTITUTE 5 The Governing Body 6 The Director General and Directors 7 Executive committee of the Governing Body 8 Meeting of the Governing Body 9 Committees and working groups 10 Funds of the institute 11 Budget and accounts 12 Appointments 13 International cooperation CHAPTER IV MISCELLANEOUS 14 Reports and returns 15 Directives of the Federal Government 16 Ordinance XXIII of 1969 not to apply to institute 17 Discoveries and inventions 18 Declaration of fidelity and decrecy 19 Power to make rules and regulations THE NATIONAL INSTITUTE OF ELECTRONICS ORDINANCE, 1979 ORDINANCE No. III OF 1979 [22nd January, 1979] An Ordinance to provide for the establishment of a National Institute of Electronics. WHEREAS it is expedient to provide for the establishment of a National Institute of Electronics and for matters connected therewith or incidental thereto; AND WHEREAS the President is satisfied that circumstances exist which render it necessary to take immediate action; NOW, THEREFORE, in pursuance of the Proclamation of the fifth day of July 1977, read with the Laws (Continuance in Force) Order, 1977 (C. M. L. A. Order No. 1 of 1977), and in exercise of all powers enabling him in that behalf, the President is pleased to make and promulgate the following Ordinance:___ CHAPTER I PRELIMINARY 1. Short title, extent and commencement.―(1) This Ordinance may be called the National Institute of Electronics Ordinance, 1979. (2) It extends to the whole of Pakistan. (3) It shall come into force at once. 2. Definitions. In this Ordinance, unless there is anything repugnant in the subject or context; (a) “Director” means the Director of a Division; (b) “Director General” means the Director General of the Institute; (c) “Division” means a unit of the Institute; (d) “electronic components” means metallic and non-metallic parts possessing definite electrical and mechanical characteristics which are connected together in a specific pattern to produce electronic equipment; (e) “electronic equipment” means an electronic device assembled and finally prepared for use, such as radio and television receivers, radio transmitters, tape recorders, radar sets, tele-communication apparatus, computers, electronic controls, military and space electronic equipment; (f) “electronic industry” means an industry producing electronic materials, components and equipment; (g) “electronics” means the branch of science, engineering and technology which deals with the controlled flow of electrons in networks consisting of metallic conductors, insulators, semi-conductors, electronic valves, resulting in coherent and meaningful signals which find application in communication, data processing, data transmission and display as well as in the automatic and semiautomatic control of machines, missiles and such other devices; (h) “Governing Body” means the Governing Body of the Institute; (i) “Institute” means the National Institute of Electronics Established under section 3; (j) “Laboratory” means a laboratory set up by the Institute; (k) “Member” means member of the Governing Body; (l) “standardization” means uniformity in equipment, components and techniques aiming to achieve efficiency and economy in production and maintenance, and includes uniformity of specifications and nomenclature. 3. Establishment of the Institute.―(1) As soon as may be after the commencement of this Ordinance, the Federal Government shall establish, in accordance with the provisions of this Ordinance, an Institute to be called the National Institute of Electronics. (2) The Institute shall be a body corporate by the name of the National Institute of Electronics, having perpetual succession and a common seal, with power, subject to the provisions of this Ordinance, to acquire, hold and dispose of property, both movable and immovable, and shall by the said name sue and be sued. (3) The headquarters of the Institute shall be at Islamabad. CHAPTER II FUNCTIONS OF THE INSTITUTE 4. The functions of the Institute shall be to:__ (a) carry out design and development work in vital areas in electronics not within the resources of the existing development centres; (b) design and develop items of common utility for the various user organizations and production units and assist in augmenting the local content in production; (c) develop know-how in advanced electronic techniques of value and exchange specialized know-how with other research centres in the country; (d) participate with other development centres in research and development projects of national importance and coordinate the work of various research centres in the country; (e) assist in advanced training in electronics; (f) design, develop and guide fabrication of electronic components, particularly integrated circuits, keeping abreast of the latest technologies; (g) design, develop and guide production of electronic measuring instruments, industrial control equipment, computing devices, medical electronic equipment and opto-electronic devices; (h) design, develop and guide production of radio and television sets, including colour television and other consumer electronic devices; (i) develop expertise in digital electronic techniques to enable its application to control systems, data processing and data transmission equipment of the future; (j) establish and maintain close liaison with other development centres, universities, user organizations and production units for the promotion of electronic research and development activities; (k) undertake design and development projects on contract with user organizations and coordinate the work in the various development centres in case of composite projects; (l) conduct seminars on electronic topics of national interest and exchange specialised knowhow with other research organizations, universities and centres of competence; (m) publish an electronics journal with the objects of disseminating knowledge and expertise and the progress of research and development work; (n) undertake small quantity production of specialised components; integrated circuits and equipment; (o) assist industry to enable increased use of local components circuits and design; and (p) assist in standardization of components, equipment and techniques on the national level. CHAPTER III ADMINISTRATION OF INSTITUTE 5. The Governing Body.―(1) The general administration of the affairs of the Institute and the formulation of its policies shall vest in the Governing Body. (2) The Governing Body shall consist of the following members to be appointed by the Federal Government, namely: (a) Fulltime Members: (i) Director General, who shall also be the Chairman of the Governing Body; and (ii) Directors of Divisions; (b) Ex-officio Members: (i) Five members representing the Ministries and Organizations concerned, including the Ministry of Science and Technology; and (ii) A member representing the Universities. (3) The Governing Body may, for such time as it may deem fit, co-opt as member a representative of any unit or organization relating to electronic industry or an establishment engaged in research in, or development of electronics. (4) A person appointed to be a member of the Governing Body by virtue of his holding an office or appointment shall cease to be such member when he ceases to hold that office or appointment. (5) A person appointed to be member of the Governing Body may at any time resign his office by writing in his hand addressed to the Chairman: Provided that no resignation shall take effect until it has been accepted by the Federal Government. (6) No act or proceeding of the Governing Body shall be invalid by reason only of the existence of vacancy in, or defect in the constitution of, the Government Body. 6. The Director General and Directors.―(1) The Director General shall be the chief executive of the Institute and shall exercise both administrative and financial powers within the framework of policy laid down by the Governing Body. (2) The Director-General shall be appointed by the Federal Government and shall be an eminent technologist of standing by virtue of his contribution to the profession of electronic engineering and technology. (3) The Directors, other than the Director, Finance, shall be appointed by the Federal Government from amongst eminent technologists in the field of activity of the Division concerned and shall perform such functions as may be assigned to them by the Director General, and the Director, Finance, shall be nominated by the Ministry of Finance. (4) The Director-General and a Director shall hold office for such period not exceeding three years as the Federal Government may determine at the time of his appointment and shall be eligible for re-appointment for such further period or periods, not exceeding three years at any one time, as the Federal Government may deem fit. (5) The remuneration and other terms and conditions of service of the Director-General and Directors shall be such as may be determined by the Federal Government. 7. Executive Committee of the Governing Body.―(1) There shall be an Executive Committee of the Governing Body consisting of the Director-General and the Directors. (2) The Executive Committee shall be responsible for the day to day functioning of the Institute within the framework of policy laid down by the Governing Body. 8. Meeting of the Governing Body.― (1) Meetings of the Governing Body shall be convened by the Director-General on such date and at such time and place as may be specified by him: Provided that not less than four meetings shall be held every year and not less than eight days’ notice of a meeting shall be given to the members, specifying the date, time and place of the meeting. (2) To constitute a quorum at a meeting of the Governing Body, not less than five members, including the Director-General, shall be present. (3) The Director General or, in his absence, a member authorised by him in writing shall preside at a meeting of the Governing Body. 9. Committees and working groups. The Governing Body may from time to time appoint such working groups or committees from amongst its members as it may consider necessary to assist it in the performance of its functions and to discharge such of its functions as it may assign to them 10. Funds of the Institute. The funds of the Institute shall consist of___ (a) grants made by the Federal Government and the Provincial Government; (b) donations and endowments; (c) income from investments and royalties; (d) income from development contracts; and (e) foreign aid and loans obtained with the approval of the Federal Government. 11. Budget and accounts.―(1) The Institute shall cause to be prepared and submit for the approval of the Federal Government a statement of its receipts and expenditure for each financial year and the sums which are likely to be required from the Federal Government during that financial year. (2) The funds of the Institute shall be kept in a personal ledger account of the Institute with the State Bank of Pakistan or with any Branch of the National Bank of Pakistan, acting as an agent of the State Bank of Pakistan. (3) The accounts of the Institute shall be maintained in such form and manner as the Auditor- General of Pakistan may determine in consultation with the Federal Government. (4) The accounts of the Institute shall be audited by the Auditor-General of Pakistan or one or more auditors who are chartered accountants within the meaning of he Chartered Accountants Ordinance, 1961 (X of 1961), and are appointed by the Institute in consultation with the Auditor- General of Pakistan. 12. Appointments. The Executive Committee of, the Governing Body may appoint, subject to such general or special orders as the Federal Government may issue to it from time to time, such officers and sub-ordinate staff and engage such consultants or experts as it may consider necessary for the efficient performance of the functions of the Institute on such terms and conditions as it may deem fit. 13. International cooperation. The Institute may with the prior approval of the Federal Government cooperate with any foreign agency or international organization for the development of electronics, pursuant to an international agreement or arrangement made before or after the establishment of the Institute. CHAPTER IV MISCELLANEOUS 14. Reports and returns.―(1) The annual report and accounts of the Institute for every financial year shall be considered and approved at a meeting of the Governing Body to be held within six months of the close of that year and shall be submitted to the Federal Government. (2) The Institute shall submit to the Federal Government such reports, returns, summaries, comments, statements and accounts, at such times and in such form as it may specify. 15. Directives of the Federal Government. The Federal Government may from time to time, issue to the Institute such directives and orders as it may consider necessary to guide the functions of the Institute and the Institute shall be bound to comply with or carry out such directives and orders. 16. Ordinance XXIII of 1969 not to apply to Institute. Nothing contained in the Industrial Relations Ordinance, 1969 (XXIII of 1969), shall apply to or in relation to the Institute or any of the officers, employees, consultants or experts employed by it. 17. Discoveries and inventions. All rights relating to discoveries, inventions, designs and any improvements in materials, techniques, processes, apparatus or equipment made by any officer or employee of the Institute in the course of his employment shall vest in the Institute, but the Institute may grant to any such officer or employee such award or honorarium as it may deem fit. 18. Declaration of fidelity and decrecy. Every member of the Governing Body and every officer, employee, consultant or expert of the Institute shall make such declaration of fidelity and secrecy as may be prescribed by rules made under this Ordinance. 19. Power to make rules and regulations.―(1) The Federal Government may, by notification in the official Gazette, make rules for carrying out the purposes of this Ordinance. (2) The Institute may, with the prior sanction of the Federal Government make such regulations not inconsistent with this Ordinance or the rules made thereunder as may in its opinion be necessary or expedient for the achievement of its aims and objects or for the performance of its functions."
}