{
  "file": "administrator1df90f20cebe025427367ba96a4f1b62.pdf",
  "law_name": "Pakistan Navy Ordinance, 1961",
  "text": "THE NORTH-WEST FRONTIER CONSTABULARY ACT, 1915 CONTENTS 1. Short title, extent, application and commencement 2. Definitions 3. Power to maintain Frontier Constabulary 3A. Power to employ Frontier Constabulary in other parts of Pakistan. 4. Constitution of Constabulary 5. Appointment and powers of superior officers 6. Appointment of subordinate officers and men 7. Superintendence, control and administration of Constabulary 8. More heinous offences 9. Less heinous offences 10. Minor punishments 11. Place of imprisonment and liability to dismissal on imprisonment 12. Deductions from pay and allowances. 13. Collective fines 14. Resignation and withdrawal from the Constabulary 15. General duties of members of the Constabulary 16. Power and duties conferable and imposable on members of the Constabulary 17. Protection for acts of members of the Constabulary 17A. Apprehension of deserters 18. Authority to confer exclusive powers of Sessions Court on Deputy Commissioner 19. Criminal powers conferred with in Pakistan, to be exercisable beyond Pakistan 20. Application of Act to other bodies enrolled for service on Frontier 21. Power to make rules. 22. [Repealed.] THE SCHEDULE.___CONDITIONS OF SERVICE THE NORTH-WEST FRONTIER CONSTABULARY ACT, 1915. 1ACT NO. XIII OF 1915 [1st October 1915] An Act to provide for the regulation of the Frontier Constabulary in the North-West Frontier 2*. WHEREAS it is expedient to provide for the regulation of the Frontier Constabulary in the North-West Frontier 2[*] ; It is hereby enacted as follows :___ 1. Short title, extent, application and commencement.___(1) This Act may be called the North-West Frontier Constabulary Act, 1915 ; (2) It extends to the whole of the North-West Frontier 2*, and applies also to every member of the Constabulary, wherever he may be serving ; and (3) It shall come into force on such day3 as the 4[Federal Government] may, by notification in the official Gazette, appoint in this behalf. 2. Definition. In this Act, unless there is anything repugnant in the subject or context,___ (a) “member of the Constabulary” means a person other than a person appointed by the 4[Federal Government] who, at the commencement of this Act, is serving in the Frontier Constabulary, or who, after the commencement of this Act, has been appointed to the Frontier Constabulary under this Act and has signed a recruiting-roll on which the conditions of service contained in the Schedule are set forth: Provided that every person who has for the space of six months been in the receipt of pay as a member of the Frontier Constabulary and been borne on the rolls of the Frontier Constabulary shall be deemed to be a member of the Constabulary, notwithstanding that he has not signed the said recruiting-roll: (b) “Commandant” means a person appointed by the 4[Federal Government] to be a Commandant of the Frontier Constabulary: (c) “active service” means service against hostile tribes, raiders or other hostile persons, or persons co-operating with or assisting such tribes, raiders or hostile persons: 1For Statement of Objects and Reasons, see Gazette of India, 1915. Pt. V, p. 56 ; for Proceedings in Council, see ibid., Pt. VI, pp. 439 and 502. This Act has been applied to Phulera in the Excluded Area of Upper Tanawal to the extent the Act is applicable in the N.-W.F.P., subject to certain modifications ; and also extended to the Excluded Area of Upper Tanawal (N.W.F.P.) other than Phulera with effect from such date and subject to such modifications as may be notified, see N.W.F.P (Upper Tanawal) (Excluded Area) Laws Regulation, 1950. This Act and the rules, notifications and orders made thereunder, as in force in N -W.F.P. before the 15th July, 1975, have been applied to all the Provincially Administered Tribal Areas of N.- W.F.P. by Regulation III of 1975, s. 2 and Sch. 2The original word “Province” omitted by the Central Laws (Statute Reform) Ordinance, 1960 (21 of 1960), s. 3 and 2nd Sch. (with effect from the 14th October, 1955). 3The 15th October, 1915 ; see N.W.F.P Gazette., dated 29th November, 1915. 4Subs. by F.A.O., 1975, Art. 2 and Table, for “Central Government”, which was previously amended by A. O., 1937, for “L. G.”. (d) the expressions “assault,” “criminal force,” “fraudulently,” “reason to believe” and “voluntarily causing hurt” have the meanings assigned to them, respec- tively, in the Pakistan Penal Code. (XLV of 1860). 1[* * * * * * *] 3. Power to maintain Frontier Constabulary.___ 2[There shall continue to be a force, maintained by the 3[Federal Government], and called] the Frontier Constabulary, for the better protection and administration of the external frontier of 4[Pakistan] within the limits of or adjoining the North-West Frontier 5* or any part thereof. 6[3-A. Power to employ Frontier Constabulary in other parts of Pakistan. Notwithstanding anything contained in section 3 or elsewhere in this Act, it shall be lawful, and shall be deemed always to have been lawful, for the 3[Federal Government] to employ the Frontier Constabulary outside the limits of or adjoining the North-West Frontier 7[in other parts of Pakistan for the better protection and administration of those parts]. 4. Constitution of Constabulary. The Frontier Constabulary shall be constituted in such manner, and the members of the Constabulary shall receive such pay, pension, and other remuneration as shall from time to time 8* * * be ordered by the 3[Federal Government]. 5. Appointment and powers of superior officers.___ (1) The 3[Federal Government] may appoint any person to be Commandant and may appoint other persons to be District Constabulary Officers or Assistant Constabulary Officers of the Frontier Constabulary, or of any part thereof constituted in any one or more districts. (2) The Commandant and every other officer so appointed shall possess, and may exercise, such power and authority over the subordinate officers and members of the Constabulary at any time, under his command as is provided by or under this Act. 6. Appointment of subordinate officers and men. The appointment of all officers and men of the Frontier Constabulary, other than those mentioned in sub-section (1) of section 5, shall rest with the Commandant and the District Constabulary Officer who shall respectively exercise such powers, in such manner as may be prescribed by rules made under this Act. 7. Superintendence, control and administration of Constabulary.___ (1) The superintendence of, and control over, the Frontier Constabulary shall vest in the 3[Federal Government]; and the Frontier Constabulary shall be administered by the Commandant and the District Constabulary Officer in accordance with the provisions of this Act and of any rules made thereunder. 1Paragraph previously amended by A. O., 1937, has been omitted by the Federal Laws (Revision and Declaration) Ordinance, 1981 (27 of 1981), s. 3 and Sch II. 2Subs by A. O., 1937, for “The L. G. may continue to maintain a force, to be called”. 3Subs by F.A.O., 1975, Art. 2 and Table, for “Central Government”, which was previously amended by A. O., 1937, for “L. G.”. 4Subs. by the Central Laws (Statute Reform) Ordinance, 1960 (21 of 1960), s.3 and 2nd Sch. (with effect from the 74th October, 1955), for the Provinces and the Capital of the Federation” which had been subs, by A. O., 1949. Arts. 3(2) and 4, for “British India”. 5See foot-note 2 on preceding page. 6Section 3A ins. by the special Criminal Courts (Second Arndt.) Ordinance, 1942 (42 of 1942), s. 2. 7Subs by Ordinance 21 of 1960, s.3 and 2nd Sch. (with effect from the 14th October 1955), for “Province in a province other than that Province for the better protection and administration of that other province”. 8The words “with the previous sanction of the G. G. in C.” rep. by A. O., 1937. (2) The District Constabulary Officer and the Constabulary of a district shall be under the general control and direction of the Deputy Commissioner of the district 1[or, when the Frontier Constabulary is employed under section 3A in 2[any part of Pakistan other than the North-West Frontier], under the general control and direction of the District Magistrate of the district]. (3) In exercising authority under sub-section (2) the Deputy Commissioner 1[or District Magistrate] shall be governed by such rules and orders as the 3[Federal Government] may make in this behalf. 8. More heinous offences.___ (1) Every member of the Constabulary who commits any of the following offences, that is to say :___ (a) begins, excites, causes or conspires to cause or joins in any mutiny; or being present at any mutiny, does not use his utmost endeavours to suppress it, or knowing, or having reason to believe in, the existence of any mutiny, or of any intention to mutiny, or of any conspiracy against the State does not, without delay give information thereof to his commanding or other superior officer; or, (b) uses, or attempts to use, criminal force to, or commits an assault on, his superior officer whether on or off duty knowing or having reason to believe him to be such ; or, (c) shamefully abandons or delivers up any garrison, fortress, post or guard which is committed to his charge, or which it is his duty to defend ; or, (d) directly or indirectly holds correspondence with, or assists or relieves any person in arms against the State, or omits to discover immediately to his com- manding or other superior officer any such correspondence coming to his knowledge ; or, who, while on active service,___ (e) disobeys the lawful command of his superior officer ; or, (f) deserts the service ; or, (g) being a sentry, sleeps upon his post, or quits it without being regularly relieved or without leave ; or, (h) without authority, leaves his commanding officer, or his post or party, to go in search of plunder ; or, (i) quits his guard, picquet, party, or patrol without being regularly relieved or without leave ; or, (j) uses criminal force to, or commits an assault on, any person bringing provisions or other necessaries to camp or quarters, or forces a safeguard or, without authority, breaks into any house or any other place for plunder, or plunders, destroys, or damages any property of any kind ; or, 1Ins. by the North-West Frontier Constabulary (Amdt.) Ordinance, 1943 (42 of 1943), s. 3. 2Subs. by the Central Laws (Statute Reform) Ordinance, 1960 (21 of 1960), s. 3 and 2nd Sch. (with effect from the 14th October, 1955), for “a Province other than the North-West Frontier Province”. 3Subs by F.A.O., 1975, Art. 2 and Table, for “Central Government”, which was previously amended by A. O., 1937, for “L. G.”. (k) intentionally causes or spreads a false alarm in action or in camp, garrison, or quarters ; or, (l) displays cowardice in the execution of his duty ; shall be punishable with 1[imprisonment] for life or for a term of not less than seven years, or with imprisonment for a term which may extend to fourteen years, or with fine which may extend to three months' pay, or with fine to that extent in addition to such sentence of transportation or imprisonment, as the case may be, as may be passed upon him under this section. (2) If any member of the Constabulary while on active service with a force beyond the limits of 2[Pakistan], is charged with committing any offence described in clause (c), clause (d), or clause (f), of sub-section (1), or the offence of culpable homicide amounting to murder, he may be summarily tired for such offence by the Political Officer accompanying the force, sitting with two other officers appointed by the Political Officer for this purpose. (3) Every officer appointed under sub-section (2) shall be either – 3[(a) an officer of the Pakistan Army, other than a junior commissioned officer, or,] (b) a civil officer, of gazetted rank, or, (c) a person appointed under section 5 Provided that, if circumstances permit, not less than once such officer shall be a Constabulary Officer appointed under section 5. (4) If one or both of the officers sitting with the Political Officer concur with him in finding the accused guilty, and the Political Officer so directs, the accused shall be forthwith shot to death. 9. Less heinous offences. Every member of the Constabulary who commits any of the following offences, that is to say,___ (a) is in state of intoxication when on, or after having been warned for, any duty, or on parade or on the line of march ; or, (b) strikes or attempts to force any sentry ; or, (c) being in command of a guard, picquet or patrol, refuses to receive any prisoner or person duly committed to his charge, or, without proper authority, releases any prisoner or person placed under his charge, or negligently suffers any such prisoner or person to escape ; or, (d) being under arrest or in confinement, leaves his arrest or confinement, before he is set at liberty by proper authority; or, 1Subs. by the Federal Laws (Revision and Declaration) Ordinance, 1981 (27 of 1981) s. 3 and Sch. II. for “transportation”. 2Subs. by the Central Laws (Statute Reform) Ordinance, 1960 (21 of 1960), s. 3 and 2nd Sch. (with effect from the 14th October, 1955), for “the Provinces and the Capital of the Federation” which had been subs. by A. O., 1949, Arts. 3(2) and 4, for “British India”. 3Subs. by the Federal Laws (Revision and Declaration) Act, 1951 (26 of 1951), s.4 and III Sch., for the original clause(a). (e) is grossly insubordinate or insolent to his superior officer in the execution of his office ;or (f) refuses to superintend or assist in the making of any field-work or other work of any description ordered to be made either in quarters or in the field ; or, (g) strikes or otherwise ill-uses any member of the Constabulary subordinate to him in rank or position ; or, (h) being in command at any post or on the march, and receiving a complaint that any one under his command has beaten or otherwise maltreated or oppressed any person, or has committed any riot or trespass, fails, on proof of the truth of the complaint, to have due reparation made, as far as possible, to the injured person or to report the case to the proper authority ; or, (i) designedly or through neglect injures or loses or fraudulently disposes of, his arms, clothes, tools, equipments, ammunition, accoutrements or Frontier Constabulary necessaries, or any such articles entrusted to him or belonging to any other person ; or, (j) malingers or feigns or produces disease or infirmity in himself or intentionally delays his cure, or aggravates his disease or infirmity ; or, (k) with intent to render himself or any other person unfit for service, voluntarily causes hurt to himself or any other person ; or, (l) does not, when called upon by his, superior officer so to do or upon ceasing to be a member of the Constabulary, forthwith deliver up, or duly account for, all or any arms, ammunition, stores, accoutrements, appointments or other property issued or supplied to him or in his custody or possession, as such member of the Constabulary ; or, (m) knowingly furnishes a false return or report of the number or state of any men under his command or charge, or of any money, arms, ammunition, clothing, equipments, stores or other property in his charge, whether belonging to such men or to 1[the Government] or to any member of, or any person attached to, the Constabulary, or who, through design or culpable neglect, omits or refuses to make or send any return or report of the matters aforesaid ; or, (n) absents himself without leave, or without sufficient cause overstays leave granted to him ; or, (o) is guilty of any act or omission which, though not specified in the Act, is prejudicial to good order and discipline ; or, Who, while not on active service,___ 1The original word “Government” was first subs. by A. O., 1937 and then amended by A. O., 1961, Art. 2 (with effect from the 23rd March, 1956), to read as above. (p) disobeys the lawful command of his superior officer; or, (q) deserts the service ; or, (r) being a sentry, sleeps upon his post, or quits it without being regularly relieved or without leave ; or, (s) quits his guard, picquet, party, or patrol without being regularly relieved or without leave ; or, (t) plunders, destroys or damages any property of any kind ; or, (u) displays cowardice in the execution of his duty; shall be punishable with imprisonment for a term which may extend to one year, or with fine which may extend to three months’ pay, or with both. 10. Minor punishment.___(1) The Commandant or the District Constabulary Officer may, subject to any rules made under this Act, award in lieu of, or in addition to, suspension or dismissal, any of the following punishments to any member of the Constabulary who is, in the opinion of the Commandant or the District Constabulary Officer, as the case may be, guilty of disobedience, neglect of duty, or remissness in the discharge of any duty, or of rendering himself unfit to discharge his duty, or of other misconduct in his capacity as such member of the Constabulary, that is to say,___ (a) reduction in rank and emoluments ; (b) fine to any amount not exceeding one month's pay and allowances ; (c) confinement to quarters for a term not exceeding one month ; (d) confinement in the quarter-guard for not more than twenty-eight days with or without punishment-drill or extra guard, fatigue or other duty ; and (e) removal from any office of distinction or special emolument in the Constabulary. (2) The Commandant or the District Constabulary Officer, or an officer not being below the rank of Subedar, commanding a separate detachment or an outpost, or in temporary command at the headquarters of a district during the absence of the Commandant and the District Constabulary Officer may, without a formal trial, award to any member of the Constabulary who is subject to his authority any of the following punishments for the commission of any petty offence against discipline which is not otherwise provided for in this Act, or which is not of a sufficiently serious nature to call for a prosecution before a Criminal Court, that is to say,- (a) confinement for not more than seven days in the quarter-guard or such other place as may be considered suitable, with forfeiture of all pay and allowances during its continuance ; and (b) punishment-drill, or extra guard, fatigue or other duty, for not more than thirty days, with or without confinement to quarters. (3) Any one of the punishments described in sub-section (1) or sub-section (2) may be awarded separately, or in combination with any one or more of the said punishments, respectively. 11. Place of imprisonment and liability to dismissal on imprisonment.___ (1) Every person sentenced under this Act to imprisonment may be dismissed from the Frontier Constabulary, and shall be further liable to forfeiture of pay and allowances due, as well as of medals and decorations received and the public money due to him. (2) Every such person shall, if he is so dismissed, be imprisoned in the nearest prison or such other prison as the 1[Federal Government] may, by general or special order, direct; but, if he is not also dismissed from the Frontier Constabulary, he may, if the Court or the Commandant so directs, be confined in the quarter-guard or such other place as the Court or the Commandant may consider suitable. 12. Deductions from pay and allowances. The following penal deductions may be made from the pay and allowances of a member of the Constabulary, that is to say,- (a) all pay and allowances for every day of absence either on desertion or without leave, and for every day of imprisonment awarded by a Criminal Court or of confinement awarded by an Officer exercising authority under section 10 ; (b) all pay and allowances for every day whilst he is in custody on a charge for an offence of which he is afterwards convicted ; (c) all pay and allowances for every day on which he is in hospital on account of sickness certified by the proper Medical Officer attending on him at the hos- pital to have been caused by an offence under this Act committed by him ; (d) all pay and allowances ordered to be forfeited under section 10 ; and (e) any sum required to make good such compensation for any expenses caused by him, or for any loss of, or damage or destruction done by him to, any arms, ammunition, equipment, clothing, instruments, Frontier Constabulary necessaries or decoration, or to any buildings or property, as may be awarded by the Commandant or the District Constabulary Officer. 13. Collective fines. Whenever any weapon or part of a weapon or ammunition forming part of the equipment of a company or other similar unit is lost or stolen, the Commandant may, after making such inquiry as he thinks fit, impose a collective fine upon the subordinate officers and men of such unit, or upon so many of them as, in his judgment, should be held responsible for such loss or theft. 14. Resignation and with drawal from the Constabulary. No member of the Constabulary shall be at liberty to – (a) resign his appointment during the term of his engagement, except before the expiration of the first three months of his service ; or, 1Subs. by F.A.O., 1975, Art. 2 and Table, for “Central Government,” which was previously amended by A. O., 1937, for “L. G.”. (b) withdraw himself from all or any of the duties of his appointment, without the permission in writing (to be previously obtained) of the Commandant or the District Constabulary Officer or other officer authorised by the Commandant to grant such permission. 15. General duties of members of the Constabulary.___ (1) It shall be the duty of every member of the Constabulary promptly to obey and to execute all orders and warrants lawfully issued to him by any competent authority, to detect and bring offenders to justice, and to apprehend all persons whom he is legally authorised to apprehend, and for whose apprehension sufficient grounds exist. (2) Every member of the Constabulary shall be liable to serve without and beyond, as well as within, the limits of 1[Pakistan]. 16. Power and duties conferrable and imposable on members of the Constabulary. The 2[Federal Government] may, by general or special order, confer or impose upon any member of the Constabulary any of the powers or duties conferred or imposed on a Police officer of any class or grade by any enactment for the time being in force. 17. Protection for acts of members of the Constabulary.___ (1) In any suit or proceeding against any member of the constabulary for any act done by him in pursuance of a warrant or order of a competent authority, it shall be lawful for him to plead that such act was done by him under the authority of such warrant or order. (2) Such plea may be proved by the production of the warrant or order directing the act, and, if it is so proved, such member of the Constabulary shall thereupon be discharged from liability in respect of the act so done by him notwithstanding any defect in the jurisdiction of the authority which issued such warrant or order. (3) All suits and proceedings (whether civil or criminal) against any person which may lawfully be brought for anything done or intended to be done under the powers conferred by, or in pursuance of, any provision of this Act or the rules thereunder, shall be commenced within three months after the act complained of was committed and not otherwise ; and notice in writing of such suit or proceeding and of the cause thereof shall be given to the defendant or his superior officer one month at least before the commencement of the suit or proceeding. 3[17 A. Apprehension of deserters.___ (1) Whenever any member of the Constabulary deserts, his District Constabulary Officer shall give information of the desertion to such civil authorities as in his opinion may be able to afford assistance towards the capture of the deserter and such authorities shall, thereupon, take steps for the apprehension of the said deserter in like manner as if he were a person for whose apprehension a warrant had been issued by a Magistrate, and shall deliver the deserter, when apprehended, to Frontier Constabulary custody. 1Subs. by the .Central Laws (Statute Reform) Ordinance, 1960 (21 of 1960), s. 3 and 2nd Sch. (with effect from the 14th October, 1955), for “ the Provinces and the Capital of the Federation” which had been subs. by A. O., 1949, Arts. 3 (2) and 4, for “British India”. 2Subs. by F.A.O., 1975, Art. 2 and Table, for “Central Government”, which was previously amended by A. O., 1937 , for “L. G.”. 3Section 17-A ins. By the North-West Frontier Constantly (Amdt.) Act, 1965 (23 of 1965), s. 2. (2) A provost marshal appointed under the Pakistan Army Act, 1952 (XXXIX of 1952) , the Pakistan Air Force Act, 1953 (VI of 1953), or the Pakistan Navy Ordinance, 1961(XXXV of 1961) , or any person legally exercising authority under him or on his behalf, may arrest without warrant any person whom he reasonably believes to be a member of the Constabulary and a deserter or absent without leave and bring him without delay before the nearest Magistrate as if he were a deserter from the Pakistan Army, the Pakistan Air Force or the Pakistan Navy.] 18. Authority to confer exclusive powers of Sessions Courts on Deputy Commissioner:- Notwithstanding anything contained in the Code of Criminal Procedure, 1898 (V of 1898), the 1[Federal Government] may declare that the Court of any Deputy Commissioner and no other Court, shall be deemed to be the Court of Session for the disposal of cases, or any class of cases, arising under this Act. 19. Criminal powers conferred with in Pakistan to be exercisable beyond Pakistan. Any person invested with any powers under the Code of Criminal Procedure, 1998 (V of 1898), for the disposal of any case under this Act within the limits of 2[Pakistan] shall, in relation to any case arising under this Act beyond such limits, have the same power and be subject to the same conditions as to appeal or otherwise as if such case had arisen within such limits. 20. Application of Act to other bodies enrolled for service on frontier.___ The 2[Federal Government] 3* * *may, by notification in the official Gazette, apply4 with such modifications (if any) as it may think fit, any of the provisions of this Act and the rules thereunder to the Border Militia or to any persons for the time being enrolled for similar service on the external frontier of 2[Pakistan]. 21. Power to make rules. The 1[Federal Government] may, by notification in the official Gazette, make rules4 - (a) regulating the functions and powers of the Deputy Commissioner 5[District Magistrate] Commandant, the District Constabulary Officer and the Assistant Constabulary Officer, respectively, under this Act ; (b) regulating, 6* * * the classes and grades of, and the remuneration to be paid to the officers and men of, and the conditions of service in the 7Frontier Cons- tabulary ; (c) fixing the period of service for members of the Constabulary in any district or local area ; 1Subs. by F. A. O., 1975 Art. 2 and Table for “ Central Government “, which was previously amended by A.O., 1937, for “ L. G ”. 2Subs. by the .Central Laws (Statute Reform) Ordinance, 1960 (21 of 1960), s. 3 and 2nd Sch. (with effect from the 14th October, 1955), for “ the Provinces and the Capital of the Federation” which had been subs. by A. O., 1949, Arts. 3 (2) and 4, for “British India”. 3The words “subject to the control of the G. G. in C.” rep. by A. O., 1937. 4This Act has been applied with modifications to the Frontier Corps., viz., the Kurrum Militia, the Tochi Scouts and the South Waziristan Scouts see N: W.F.P. Chief Commissioner's Notification No. 1085-M., dated the 27th March, 1925. 5Ins. by the North-West Frontier Constabulary (Amdt.) Ordinance, 1943 (42 of 1943),. s. 4. 6The words “subject to the provisions of s. 4” rep. by A. O., 1937. 7For the Frontier Constabulary Leave Rules, see Gazette of India, 1944, Pt. I, Section I, p. 1050. (d) regulating the award of minor punishments to Constabulary Officers under the powers conferred by section 10, and providing for appeals from, or the revision of orders under, that section, or the remission of fines imposed under that section, and the remission of deductions made under section 12 ; (e) regulating the several or collective liability of members of the Constabulary in the case of the loss or theft of weapons and ammunitions ; and (f) generally, for the purpose of carrying into effect the provisions of this Act. 22. [Repeal.] Rep. by the Repealing Act, 1938 (1 of 1938), s. 2 and Sch. ____________ THE SCHEDULE CONDITIONS OF SERVICE [See section 2, clause (a)] AFTER you have served for such periods as the 1[Federal Government] may have prescribed in this behalf in the Frontier Constabulary maintained under the North-West Frontier Constabulary Act, 1915, you may, at any time, when not on active service, apply for your discharge, through the officer to whom you may be subordinate, to the Commandant, or to the District Constabulary officer of the district in which you may be serving and you will be granted your discharge after three months from the date of your application, unless your discharge would cause the vacancies in the Frontier Constabulary to exceed one-tenth of the sanctioned strength, in which case you shall be bound to remain until this objection is waived by competent authority or removed. But when on active service you shall have no claim to a discharge, and you shall be bound to remain to do your duty until the necessity for retaining you in the Frontier Constabulary ceases, when you may make your application in the manner hereinbefore prescribed: Provided that, if you wish to withdraw from the Frontier Constabulary, you may resign at any time before the expiration of the first three months of your service, but not afterwards until the completion of the period prescribed as aforesaid : Provided, also, that the Commandant or the District Constabulary Officer may, if he thinks fit, allow you to resign at any time on your giving three months' notice of your wish to do so. Signature of the member of the Constabulary in acknowledgement of the above having been read to him. A.B. Signed in my presence after I had ascertained that A.B. understood the purport of what he signed. C.D. Commandant or, District Constabulary Officer. Date: 11-09-2024 1Subs. by F. A. O., 1975 Art. 2 and Table for “ Central Government “, which was previously amended by A.O. 1937, for “ L. G “."
}