{
  "file": "administratorb34362be18405a0754066473ad4b3b23.pdf",
  "law_name": "The Admiralty Jurisdiction Of High Courts Ordinance, 1980",
  "text": "THE ADMIRALTY JURISDICTION OF HIGH COURTS ORDINANCE, 1980 CONTENTS 1. Short title and commencement 2. Definitions 3. Admiralty jurisdiction of the High Court 4. Mode of exercise of Admiralty jurisdiction 5. Jurisdiction in personam of courts in collision and other similar cases. 6. Limitation of maritime lien 7. Appeals 8. Power to make rules 9. Repeal and saving THE ADMIRALTY JURISDICTION OF HIGH COURTS ORDINANCE, 1980 ORDINANCE No. XLII OF 1980 [2nd September, 1980] An Ordinance to consolidate and amend the law relating to Courts of Admiralty WHEREAS it is expedient to consolidate and amend the law relating to Courts of Admiralty; AND WHEREAS the President is satisfied that circumstances exist which render it necessary to take immediate action; NOW, THEREFORE, in pursuance of the Proclamation of the fifth day of July, 1977, read with the Laws (Continuance in Force) Order, 1977 (CMLA. Order No. 1 of 1977), and in exercise of all powers enabling him in that behalf, the President is pleased to make and promulgate the following Ordinance:___ 1. Short title and commencement.___ (1) This Ordinance may be called the Admiralty Jurisdiction of High Courts Ordinance, 1980. (2) It shall come into force at once. 2. Definitions. In this Ordinance, unless there is anything repugnant in the subject or context,___ (a) “aircraft” means any machine which can derive support in the atmosphere from reactions of the air, and includes balloons, whether captive or free, airships, kites, gliders and flying machines; (b) “charges” does not include light dues, local light dues or any other charges in respect of lighthouses, buoys, beacons or pilot age; (c) “cause” includes any cause, suit, action or other proceeding in the High Court in the exercise of its Admiralty jurisdiction; (d) “goods” includes baggage; (e) “internal waters” includes any part of the sea adjacent to the coast of Pakistan as may be notified by the Federal Government; (f) “master” includes every person, except a pilot or harbour master, having command or charge of a ship; (g) “Merchant Shipping Acts” means the Merchant Shipping Act, 1894 ____1932; (h) “party” includes every person served with notice of, or intervening in, or attending, any proceedings, whether named as party to that proceeding or not; (i) “port” means any port, harbour, river, estuary, haven, dock, canal or other place, so long as a person or body of persons is empowered by or under the law to make charges in respect of ships entering it or using the facilities therein; and “limits of a port” means the limits thereof as fixed by or under the law; (j) “proceedings” includes both actions and matters; (k) “ship” includes any description of vessel used in navigation; and (l) “territorial waters” means waters beyond the land territory and internal waters of Pakistan measured from the base line up to such limit as may be declared from time to time by the Federal Government. 3. Admiralty jurisdiction of the High Court.___ (1) The Sind High Court and the High Court of Baluchistan shall have and exercise, within their respective territorial jurisdiction, Admiralty, jurisdiction as is in this Ordinance provided and the Lahore High Court and the Peshawar High Court shall, within their respective territorial jurisdiction, have and exercise the said jurisdiction in cases in which any question or claim relating to aircraft is to be determined. (2) The Admiralty jurisdiction of the High Court shall be as follows, that is to say, jurisdiction to hear and determine any of the following causes, questions or claims____ (a) any claim to the possession or ownership of a ship or to the ownership of any share therein or for recovery of documents of title and ownership of a ship, including registration certificate, log book and such certificates as may be necessary for the operation or navigation of the ship; (b) any question arising between the co-owners of a ship as to possession, employment or earnings of that ship; (c) any claim in respect of a mortgage of or charge on a ship or any share therein; (d) any claim for damage done by a ship; (e) any claim for damage received by a ship; (f) any claim for loss of life or personal injury sustained in consequence of any defect in a ship or in her apparel or equipment, or of the wrongful act, neglect or default of the owners, charters or persons in possession or control of a ship or of the master or crew thereof or of any other person for whose wrongful acts, neglects or defaults, the owners, charterers or persons in possession or control of a ship are responsible, being an act, neglect or default in the navigation or management of the ship, in the loading, carriage or discharge of goods on, in or from the ship or in the embarkation, carriage or disembarkation of persons on, in or from the ship; (g) any claim for loss of or damage to goods carried in a ship; (h) any claim arising out of any agreement relating to the carriage of goods in a ship or to the use or hire of a ship; (i) any action or claim in the nature of salvage of life from a ship or cargo or any property on board a ship or the ship itself or its apparel, whether services rendered on the high sea or within territorial waters or internal waters or in a port, including any claim arising by virtue of the application by or under section 12 of the Civil Aviation Ordinance, 1960, (XXXII of 1960), of the law relating to salvage to aircraft and their apparel and cargo; (j) any claim in the nature of towage in respect of a ship or an aircraft, whether services were rendered on the high sea or within territorial waters or internal waters or in a port; (k) any claim in the nature of pilot age in respect of a ship or an aircraft; (1) any claim in respect of necessaries supplied to a ship; (m) any claim in respect of the construction, repair or equipment of a ship or dock charges or dues; (n) any claim by a master or members of the crew of a ship for wages and any claim by or in respect of a master or member of the crew of a ship for any money or property which, under any of the provisions of the Merchant Shipping Acts or the Merchant Shipping Act, 1973 (XXI of 1923), is recoverable as wages or in the Court and in the manner in which wages may be recovered; (o) any claim by a master, shipper, charterer or agent in respect of disbursements made on account of a ship; (p) any claim arising out of an act which is or is claimed to be a general average act; (q) any claim arising out of bottomry or respondentia; (r) any claim for the forfeiture or condemnation of a ship or of goods which are being or have been carried, or have been attempted to be carried, in a ship as a Naval Prize or in violation of customary law of the sea or otherwise, or for the restoration of a ship or any such goods after seizure, or for droits of Admiralty, together with any other jurisdiction for the grant of such reliefs as are provided under the Merchant Shipping Acts or the Merchant Shipping Act, 1923 (XXI of 1923), any other jurisdiction which was vested in the High Court as a Court of Admiralty immediately before the commencement of this Ordinance or is conferred by or under any other law and any other jurisdiction connected with ships or aircraft in respect of things done at sea which has by tradition of custom of the sea been exercised by a Court of Admiralty apart from this section. (3) The jurisdiction of the High Court under clause (b) of subsection (2) includes power to settle any account outstanding and unsettled between the parties in relation to the ship, and to direct that the ship, or any share thereof, shall be sold, and to make such other order as the Court thinks fit. (4) The reference in clause (i) of subsection (2) to claims in the nature of salvage includes a reference to such claims for services rendered in saving life from a ship or an aircraft or in preserving cargo, apparel of wreck as, under any law for the time being in force, are autborised to be made in connection with a ship or an aircraft. (5) The preceding provisions of this section apply___ (a) in relation to all ships or aircraft, whether Pakistani or not and whether registered or not and wherever the residence or domicile of their owners may be; (b) in relation to all claims, wheresoever arising including in the case of cargo or wreck salvage, claims in respect of cargo or wreck found on land; and (e) so far as they relate to mortgages and charges, to all mortgages or charges, whether registered or not and whether legal or equitable, including mortgages and charges created under foreign law: Provided that nothing in this sub-section shall be construed as extending to cases in which money or property is recoverable under any of the provisions of the Merchant Shipping Acts or the Merchant Shipping Act, 1923 (XXI of 1923). 4. Mode of exercise of Admiralty jurisdiction.___(1) Subject to the provisions of section 5, the Admiralty jurisdiction of the High Court may in all cases be invoked by an action in personam. (2) The Admiralty jurisdiction of the High Court may in the cases mentioned in clauses (a) to (d), (i) and (r) of sub-section (2) of section 3 be invoked by an action in rem against the ship or property in question. (3) In any case in which there is a maritime lien or other charge on arty, ship, aircraft or other property of the amount claimed, the Admiralty jurisdiction of the High Court may be invoked by an action in rem against that ship, aircraft or property. (4) In the case of any such claim as is mentioned in clauses (e) to (h) and (j) to (q) of sub- section (2) of section 3, being a claim arising in connection with a ship, where the person who would be liable on the claim in an action in personam was, when the cause of action arose, the owner or charterer of, or in possession or in control of the ship, the Admiralty jurisdiction of the High Court may, whether the claim gives rise to a maritime lien on the ship or not, be invoked by an action in rem against____ (a) that ship, if at the time when the action is brought it is beneficially owned as respects majority shares therein by that person ; or (b) any other ship which, at the time when the action is brought, is beneficially owned as aforesaid. (5) In the case of a claim in the nature of towage or pilotage in respect of an aircraft, the Admiralty jurisdiction of the High Court may be invoked by an action in rem against that aircraft if at the time when the action is brought it is beneficially owned by the person who would be liable on the claim in an action in personam. (6) In the case of a claim in the nature of a maritime lien, other than at claim on a bottomry or respondentia bond or to the possession of the ship, the Admiralty jurisdiction of the High Court maybe invoked by an action in personam against the owners of the property which would have been arrested if the proceedings had been in rem. (7) Notwithstanding anything in the preceding provision of this section, the Admiralty jurisdiction of the High Court shall not be invoked by an action in rem in the case of any such claim as is mentioned in paragraph (n) of subsection (2) of section 3 unless the claim relates wholly or partly to wages, including any sum allotted out of wages or adjudged by a competent authority under the relevant law to be due by way of wages. (8) Where, in the exercise of its Admiralty jurisdiction, the High Court orders any ship, aircraft or other property to be sold, the Court shall have jurisdiction to hear and determine any question arising as to the title to, or priorities of claims in, the proceeds of sale. (9) In determining for the purposes of sub-section (4) and (5) whether a person would be liable on a claim in an action in personam it shall be assumed that he has his ordinary residence or a place of business within Pakistan. 5. Jurisdiction in personam of Courts in collision and other similar cases.___ (1) No Court shall entertain an action in personam to enforce a claim to which this section applies unless___ (a) the defendant has his ordinary residence or a place of business within Pakistan; or (b) the cause of action arose within the internal or territorial waters of Pakistan ; or (c) an action arising out of the same incident or series of incidents is proceeding in the court or has been heard and determined in the court. (2) No court shall entertain an action in personam to enforce a claim to which this section applies until any proceedings previously brought by the plaintiff in any court outside Pakistan against the same defendant in respect of the same incident or series of incidents have been discontinued or otherwise come to an end. (3) The preceding provisions of this section shall apply to counter-claims, not being counter-claims in proceedings arising out of the same incident or series of incidents, as they apply to actions in personam, but as if the references to the plaintiff and the defendant were respectively references to the plaintiff on the counter-claim and the defendant to the counter-claim. (4) The preceding provisions of, this sections shall not apply to any action or counter-claim if the defendant thereto submits or has agreed to submit to the jurisdiction of the Court. (5) Subject to the provisions of sub-section (2), the High Court shall have jurisdiction to entertain an action in personam to enforce a claim to which this section applies whenever any of the conditions specified in clauses (a) to (c) of sub-section (1) are satisfied. (6) The claims to which this section applies are claims for damage, loss of life or personal injury caused by ships or arising out of collision between ships or out of the carrying out of or omission to carry out a manoeuvre in the case of one or more of two or more ships or out of non-compliance, on the part of one or more of two or more ships, with the regulations made under section 214 of the Merchant Shipping Act, 1923 (XXI of 1923). 6. Limitation of maritime lien. No action shall be brought before the High Court to enforce a maritime lien for the damage sustained in consequence of collision wheresoever occurring or any other maritime lien unless proceedings therein are commenced within two years from the date of the damage occurring or the maritime lien arising, subject to the discretion of the High Court to extend this period. 7. Appeals.___ (1) An appeal shall lie to a Bench of two or more Judges of a High Court from a judgment passed or an order made by a single Judge of that Court in the exercise of its Admiralty jurisdiction. (2) An appeal shall be preferred within thirty days from the date of judgment or order appealed against. (3) An appeal to the Supreme Court from a judgment or final order of a High Court in the exercise of its Admiralty jurisdiction shall lie only if the value of the subject-matter of the dispute in appeal is not less than one lac rupees and the Supreme Court grants leave to appeal. 8. Power to make rules. The Federal Government may, by notification in the official Gazette, make rules for carrying out the purposes of this Ordinance. 9. Repeal and saving.___(1) The Courts of Admiralty (Pakistan) Act, 1891 (XVI of 1891), the Admiralty Court Act, 1840 (3 & 4 Vict. C, 65), and the Admiralty Court Act, 1861 (24 Vict. C. 10), in so far as they apply to, and operate in, Pakistan, are hereby repealed. (2) Nothing in this Ordinance shall be deemed to authorise proceedings in rem in respect of any claim against the Federation or the arrest, detention or sale of any ship or aircraft of the Pakistan Navy or the Pakistan Air Force or of any cargo or other property belonging to the Federation."
}