{
  "file": "administrator4c2a19956bf97c1840d56886347d5385.pdf",
  "law_name": "The Wireless Telegraphy Act, 1933",
  "text": "THE WIRELESS TELEGRAPHY ACT, 1933 CONTENTS 1 Short title, extent and commencement. 2 Definitions. 3 Prohibition of possession of wireless telegraphy apparatus without license. 4 Power of Federal Government to exempt persons from provisions of the Act. 5 Licenses. 6 Offence and penalty. 7 Power of search. 8 Apparatus confiscated or having no owner to be property of Federal Government 9 [Repealed.] 10 Power of Federal Government to make rules 11 Saving of Telegraph Act, 1885 THE WIRELESS TELEGRAPHY ACT, 1933 1ACT No. XVII OF 1933 [11th September, 1933] An Act to regulate the possession of wireless telegraphy apparatus. WHEREAS it is expedient to regulate the possession of wireless telegraphy apparatus in 2[Pakistan]; It is hereby enacted as follows: 1. Short title, extent and commencement.—(1) This Act may be called the 3* Wireless Telegraphy Act, 1933. 4[(2) It extends to the whole of Pakistan.] (3) It shall come into force on such date5 as the 6[Federal Government] may, by notification in the 7[official Gazette], appoint. 2. Definitions. In this Act, unless there is anything repugnant in the subject or context,- (1) “wireless communication” means the making, transmitting or receiving of telegraphic, telephonic or other communications by means of electricity or magnetism without the use of wires or other continuous electrical conductors between the transmitting and the receiving apparatus; (2) “wireless telegraphy apparatus” means any apparatus, appliance, instrument or material used or capable of use in wireless communication, and includes 8[video recording or reproducing apparatus 6[television broadcast receiving satellite antenna] and] any article determined by rule made under section 10 to be wireless telegraphy apparatus, but does not include any such apparatus, appliance, instrument or material commonly used for other electrical purposes, unless it has been specially designed or adapted for wireless communication or forms part of some apparatus, appliance, instrument or material specially so designed or adapted, nor any article determined by rule made under section 10 not to be wireless telegraphy apparatus; and 1For Statement of Objects and Reasons, see Gazette of India, 1933, Pt.V, page 8. The Act has been extended to the Leased Areas of Baluchistan, see the Leased Areas (Laws) Order, 1950 (G.G.O. 3 of 1950); and applied in the Federated Areas of Baluchistan, see Gazette of India, 1937, Pt.I, p.1499. It has also been extended to the ___ (i) Baluchistan States Union by the Baluchistan States Union (Federal Laws) (Extension) Order, 1953 (G.G.O. 4 of 1953),as ameded; (ii) Khairpur State by the Khairpur (Federal Laws) (Extension) Order, 1953 (G.G.O. 5 of 1953), as amended; and (iii) State of Bahawalpur by G.G.O. 11 of 1953 as amended. The Act has been and shall be deemed to has been brought into force in Gwadur with effect from the 8th September, 1958, by the Gwadur (Application of Central Laws) Ordinance, 1960 (37 of 1960),s.2. The Act, rules, notification and orders under it, have been applied, subject to certain modification, to the Tribal Areas or to the parts of those areas to which they have not been already applied, see the Tribal Areas (Application of Acts) Regulation, 1965, see Gazette of P.,1965, Ext., pp.1016-1018. 2Subs. by the Central Laws (Statute Reform) Ordinance, 1960 (21 of 1960), s.3 and 2nd Sch. (with effect from the 14th October, 1955), for “the Provinces and the Capital of the Federation” which had been subs. by A.O., 1949, for “British India”. 3The word “Indian” omitted by A.O., 1949. 4Subs. by Ordinance 21 of 1960, s.3 and 2nd Sch. (with effect from the 14th October, 1955), for the original sub-section (2), as amended by A.O., 1949 and Federal Laws (Revision and Declaration) Act, 1951 (26 of 1951), s. 8. 5The 1st January,1934: see Gazette of India, 1933, Pt.I, p.1131. 6Ins. by Act VII of 1940,s.3. 7Subs.by A.O., 1937, for “Gazette of India”. 8Ins. by the Finance Ordinance, 1984 (28 of 1984), s.2. (3) “prescribed” means prescribed by rules made under section 10. 3. Prohibition of possession of wireless telegraphy apparatus without license. Save as provided by section 4, no person shall possess wireless telegraphy apparatus except under and in accordance with a license issued under this Act. 4. Power of Federal Government to exempt persons from provisions of the Act.—The 1[Federal Government] may by rules made under this Act exempt any person or any class of persons from the provisions of this Act either generally or subject to prescribed conditions, or in respect of specified wireless telegraphy apparatus. 5. Licenses.—2[(1)] 3[The Director-General, Pakistan Post Office, or an officer authorized by him in this behalf,] shall be the authority competent to issue licenses to possess wireless telegraphy apparatus under this Act, and may issue licenses in such manner, on such conditions and subject to such payments as may be prescribed 4[:] 5[Provided that where, by an agreement with the Pakistan Television Corporation Limited, the 6[Federal Government] appoints the Corporation to be its agent in the matter of issuing licenses to possess television receiving apparatus, 6[broadcast receiving satellite antenna] 7[ and video recording or reproducing apparatus] the authority competent to issue licenses to possess such apparatus shall be the Chairman of that Corporation or a person authorized by him in this behalf, who may issue licenses in such manner, on such conditions and subject to such payments as may be prescribed.] 9[(2) Notwithstanding anything contained in section 4 of the Telegraph Act, 1885 (XIII of 1885), no licence under that Act shall be necessary for the possession of a television receiving apparatus 3[or television broadcast receiving satellite antenna] for possessing which a licence issued under this Act is for the time being in force.] 6. Offence and penalty.—(1) Whoever possesses any wireless telegraphy apparatus in contravention of the provisions of section 3 shall be punished, in the case of the first offence, with fine which may extend to one hundred rupees, and, in the case of a second or subsequent offence, with fine which may extend to two hundred and fifty rupees. (2) For the purposes of this section a Court may presume that a person possesses wireless telegraphy apparatus if such apparatus is under his ostensible charge, or is located in any premises or place over which he has effective control. 1Subs. by F.A.O., 1975, Art.2 and Table, for “Central Government” which was previously amended by A.O.,1937, for “G.G. in C.”. 2Re-numbered by the Wireless Telegraphy (Amdt.) Ordinance, 1970 (10 of 1970), s.2 (w.e.f. 1st January, 1970). 3Subs. by the Posts and Telegraphs (Amdt.) Act, 1962 (5 of 1962),s.4, for “The telegraph authority constituted under the Telegraph Act, 1885,” (with effect from the 1st July, 1962). 4Subs. by Ord.10 of 1970, s.2 for full-stop. 5Proviso added by the Wireless Telegraphy (Amdt.) Ordinance, 1970 (10 of 1970),s.2 (w.e.f. 1st Jan,1970). 6Ins. by Act No.VII of 1990,s.3. 7Ins. by the Finance Ordinance, 1984 (28 of 1984), s.2. 9Sub-section (2) added by Ord. 10 of 1970, s.2, (with effect from 1st January, 1970). (3) If in the trial of an offence under this section the accused is convicted the Court shall decide whether any apparatus in respect of which an offence has been committed should be confiscated, and, if it so decides, may order confiscation accordingly. 7. Power of search.—(1) 1* * * A Magistrate of the first class or a Magistrate of the second class specially empowered by the 2[Federal Government] in this behalf, may issue a warrant for the search, at any time between sunrise and sunset, of any building, vessel or place in which he has reason to believe that any wireless telegraphy apparatus, in respect of which an offence punishable under section 6 has been committed, is kept or concealed. (2) The officer to whom the search warrant under sub-section (1) is addressed may enter into any building, vessel or place mentioned in the warrant and seize any wireless telegraphy apparatus in respect of which he had reason to believe an offence under section 6 has been committed. 8. Apparatus confiscated or having no owner to be property of Federal Government. All wireless telegraphy apparatus confiscated under the provisions of sub-section (3) of section 6, and all wireless telegraphy apparatus having no ostensible owner shall be the property of the 2[Federal Government]. 9. [Power of Court to direct payment of fines to prescribed authority.] Rep. by A.O., 1937. 10. Power of Federal Government to make rules.—(1) The 1[Federal Government] may, by notification in the 3[official Gazette], make rules for the purpose of carrying into effect the provisions of this Act. (2) In particular and without prejudice to the generality of the foregoing power, such rules may provide for (i) determining that any article or class of articles shall be or shall not be wireless telegraphy apparatus for the purposes of this Act; (ii) the exemption of persons or classes of persons under section 4 from the provisions of this Act; (iii) the manner of and the conditions governing the issue, renewal, suspension and cancellation of licenses, the form of licenses and the payments to be made for the issue and renewal of licenses; (iv) the maintenance of records containing details of the acquisition and disposal by sale or otherwise of wireless telegraphy apparatus possessed by dealers in wireless telegraphy apparatus; (v) the conditions governing the sale of wireless telegraphy apparatus by dealers in and manufacturers of such apparatus ; 4* 1The words “A Presidency Magistrate, or” omitted by A.O., 1949. 2Subs. by F.A.O., 1975, Art.2 and Table, for “Central Government” which was previously amended by A.O., 1937, for “G.G. in C.”. 3Subs. by A.O., 1937, for “Gazette of India”. 4For the India Wireless Telegraphy (Possession) Rules, 1933, made under this section, see Gazette of India, 1933, Pt. I, p.1131. For the Wireless Telegraphy (Possession) Rules, 1957, see Gazette of P., 1957, Pt.I, pp.167-169. 1* * * * * * * (3) In making a rule under this section the 1[Federal Government] may direct that a breach of it shall be punishable with fine which may extend to one hundred rupees. 11. Saving of Telegraph Act, 1885.—Nothing in this Act contained shall authorise the doing of anything prohibited under the Telegraph Act, 1885, and 2[except as provided in sub-section (2) of section 5,] no license issued under this Act shall authorise any person to do anything for the doing of which a license or permission under the Telegraph Act, 1885, is necessary. 1The word “and” and clause (vi) omitted by the Repealing and Amending Act, 1940 (32 of 1940), s.2 and 1st Sch. 2Subs. by F.A.O., 1975, Art.2 and Table, for “Central Government” which was previously amended by A.O., 1937, for “G.G. in C.”. 3Ins. by the Wireless Telegraphy (Amdt.) Ordinance, 1970 (10 of 1970), s.3 (with effect from 1st January, 1970)."
}