{
  "file": "administrator5d6b74fcde759f340d6d706574476e01.pdf",
  "law_name": "THE HACKNEY-CARRIAGE ACT, 1879 CONTNETS 1. Short title",
  "text": "THE HACKNEY-CARRIAGE ACT, 1879 CONTNETS 1. Short title 2. Interpretation clause 3. Application of Act to municipalities 4. [Repeal] 5. Power to extend operation of rule beyond limits of municipality or cantonment 6. What rules under section 3 may provide for 7. Penalty for breach of rules 8. Disposal of fees and payment of expenses 9. Power of Magistrate to decide disputes regarding fares 10. In case of dispute, hirer may require driver to take him to Court THE HACKNEY-CARRIAGE ACT, 1879 lACT No. XIV OF 1879 [5th September, 1879] An Act for the regulation and control of hackney-carriages in certain Municipalities and Cantonments. Preamble. WHEREAS it is expedient to provide for the regulation and control of hackney- carriages in certain municipalities and cantonments; It is hereby enacted as follows:- 1. Short title. This Act may be called the Hackney-carriage Act, 1879: 2* * * * * * * Nothing herein contained shall affect any power conferred by any law relating to municipalities, or any rule made in exercise of any such power. 2. Interpretation clause. In this Act____ “hackney-carriage” means any wheeled vehicle drawn by animals and used for the conveyance of passengers which is kept, or offered, or plies for hire; and “committee” means a municipal committee, or a body of municipal commissioners, constituted under the provisions of any enactment for the time being in force. 3. Application of Act to municipalities. 3[The Provincial Government concerned may, by notification in the official Gazette, apply this Act to any municipalities in the 4[5[the Punjab] or the District of Sylhet in 6[East Pakistan]]. Power of committees to make rules. When this Act has been so applied to any municipality, the committee of such municipality may, from time to time, make rules for the regulation and control of hackney-carriages within the limits of such municipality, in the manner in which, under the law for the time being in force, it makes rules or bye-laws for the regulation and control of other matters within such limits. Confirmation and publication of rules. Every rule made under this section shall, when confirmed by the 7[Commissioner] and published for such time and in such manner as the 7[Commissioner] may, from time to time, prescribe, have the force of law: Power of Commissioner to rescind rules. Provided that the 7[Commissioner] may, at any time, rescind any such rule. 1For Statement of Objects and Reasons see Gazette of India, 1879, Pt. V, p.52 ; and for Proceedings in Council, see ibid., Supplement, pp.49, 78 and 1141. This Act has been applied to Phulera in the Excluded Area of Upper Tanawal to the extent the Act is applicable in the N.W.F.P., subject to certain modifications ; and extended to the Excluded Area of Upper Tanawal (N.W.F.P.) other than Phulera with effect from such date and subject to such modifications as may be notified- see N.W.F.P. (Upper Tanawal) (Excluded Area) Laws Regulation, 1950. This Act has been repealed to the extent of Islamabad Capital Territory, see Ordinance No. XXVII of 1981, s. 4 and 3rd Sch. 2The words “and it shall come into force at once” rep. by the Second Repealing and Amending Act, 1914 (17 of 1914), s. 3 and Sch. ll. 3Subs. by A. O., 1937, for original paragraph. 4Subs. by A. O., 1949, Sch., for “United Provinces, the Punjab, the Central Provinces, Assam, Ajmer, Merwara, or Coorg”. 5Subs. by the Federal Laws (Revision and Declaration) Act, 1951, (26 of 1951), section 8, for “West Punjab”. 6Subs. by A. O., 1961, Art. 2, for “East Bengal” (with effect from the 23rd March, 1956). 7Subs. by the Decentralization Act, 1914 (4 of l914), for “L. G.” In the N.W.F.P. all references to “Commissioner” are to be construed as referring to the Revenue Commissioner; see the N.W.F.P. Law and Justice Regulation, 1901 (7 of 1901), s. 6 (1) (f). 4. [Power to make rules for cantonments.] Rep. by A O., 1937. 5. Power to extend operation of rule beyond limits of municipality or cantonment. The authority making any rules under this Act may 1[with the sanction of the Commissioner] extend their operation to any railway-station, or specified part of a road, not more than six miles from the local limits of the municipality 2* * concerned: 3* * * * * * * 6. What rules under section 3 may provide for. The rules to be made under section 3 4* * * may, among other matters,– (a) direct that no hackney-carriage, or no hackney-carriage of a particular description, shall be let to hire, or taken to ply, or offered for hire, except under a license granted in that behalf; (b) direct that no person shall act as driver of a hackney-carriage except under a license granted in that behalf; (c) provide for the issue of the licenses referred to in clauses (a) and (b), prescribe the conditions (if any) on which such licenses shall be granted, and fix the fees (if any) to be paid therefor; (d) regulate the description of animals, harness and other things to be used with licensed carriages, and the condition in which such carriages, and the animals, harness and other things used therewith, shall be kept, and the lights (if any) to be carried after sunset and before sunrise; (e) provide for the inspection of the premises on which any such carriages, animals, harness and other things are kept; (f) fix the time for which such licenses shall continue in force, and the events (if any) upon which within such time they shall be subject to revocation or suspension; (g) provide for the numbering of such carriages; (h) determine the times at which and the circumstances under which, any person keeping a hackney-carriage shall be bound to let or refuse to let such carriage to any person requiring the same; (i) appoint places as stands for hackney-carriages, and prohibit such carriages waiting for hire except at such places; (j) limit the rates or fares, as well for time as distance, which may be demanded for the hire of any hackney carriage; and prescribe the minimum speed at which such carriages when hired by time shall be driven; 1Ins. by A.O., 1937. 2The words “or cantonment” rep. ibid. 3Proviso rep. ibid. 4The words and figure “or section 4” rep. ibid. (k) limit the number of persons, and the weight of property, which may be conveyed by any such carriage; (l) require the owner or person in charge of any such carriage to keep a printed list of fares, in English and such other language as may be prescribed, affixed inside such carriage in such place as may be determined by the rules, and prohibit the destruction or defacement of such list; (m) require drivers to wear a numbered badge or ticket, and to produce their licenses when required by a Magistrate or other person authorized by the rules in this behalf, and prohibit the transfer or lending of such licenses and badges; and (n) provide for the deposit of property found in such carriages, and the payment of a fee by the owner of such property on the delivery thereof to him. 7. Penalty for breach of rules. Any person breaking any rule made under this Act shall be punished with fine which may extend to fifty rupees. 8. Disposal of fees and payment of expenses. The amount of any fees received and the amount of any expenses incurred in giving effect to this Act shall 1* * * be credited and debited respectively to the municipal fund 2* * *. 9. Power of Magistrate to decide disputes regarding fares. If any dispute arises between the hirer of any hackney-carriage and the owner or driver of such carriage as to the amount of the fare payable by such hirer under any rule made under this Act, such dispute shall, upon application made in that behalf by either of the disputing parties, be heard and determined by any Magistrate or Bench of Magistrates within the local limits of whose jurisdiction such dispute has arisen; and such Magistrate or Bench may, besides determining the amount so in dispute, direct that either party shall pay to the other such sum as compensation for loss of time as such Magistrate or Bench thinks fit. Any sum determined to be due or directed to be paid under this section shall be recoverable as if it were a fine3. The decision of any Magistrate or Bench in any case under this section shall be final. When any such case is heard by a Bench, any difference of opinion arising between the members of such Bench shall be settled in the same manner as differences of opinion arising between such members in the trial of criminal cases. 10. In case of dispute, hirer may require driver to take him to Court. If, at the time any dispute mentioned in section 9 arises, any Magistrate or Bench of Magistrates having jurisdiction in respect of such dispute is sitting within the local limits to which the rules apply, the hirer of the carriage may require the driver thereof to take him in the same to the Court of such Magistrate or Bench for the purpose of making an application under that section. Any driver neglecting or refusing to comply with such requisition shall be punished with imprisonment for a term which may extend to one month, or with fine not exceeding fifty rupees, or with both. Date; 16-09-2024 1The words “in any municipality” rep. by A.O., 1937. 2The words “add in any cantonment where there is a cantonment fund to such fund” rep., ibid. 3As to recovery of fines, see the General Clauses Act, 1891 (10 of 1897), section 25."
}