{
  "file": "administratord889d8fe337fc6ac0318f2d6f4b54d75.pdf",
  "law_name": "THE STAPLE COTTON (EXCISE DUTY) ORDINANCE, 1978 CONTENTS",
  "text": "THE STAPLE COTTON (EXCISE DUTY) ORDINANCE, 1978 CONTENTS 1. Short title and commencement 2. Definitions 3. Rate of duty 4. Manner of payment of duty 5. Exemptions 6. Power to make rules 7. Application of the provisions of the Central Excises and Salt Act, 1944 THE STAPLE COTTON (EXCISE DUTY) ORDINANCE, 1978 ORDINANCE NO. XXX OF 1978 [25th June, 1978] An Ordinance to provide for the levy of a duty of excise on staple cotton produced by ginning factories and sold to textile mills. WHEREAS it is expedient to provide for the levy of excise duty on staple cotton produced by ginning factories and sold to textile mills; AND WHEREAS the President is satisfied that circumstances exist which render it necessary to take immediate action; NOW, THEREFORE, in pursuance of the Proclamation of the fifth day of July, 1977, read with the Laws (Continuance in Force) Order, 1977, (C.M.L.A. Order No. I of 1977), and in exercise of all powers enabling him in that behalf, the President is pleased to make and promulgate the following Ordinance:— 1. Short title and commencement.—(1) This Ordinance may be called the Staple Cotton (Excise Duty) Ordinance, 1978. (2) It shall come into force at once and shall be deemed to have taken effect on the first day of July, 1976: Provided that, unless the Federal Government, by notification in the official Gazette, otherwise directs, it shall not apply to staple cotton of any crop following the crop of 1976-77 and shall stand repealed on the first day of July, 1978. 2. Definitions. In this Ordinance, unless there is anything repugnant in the subject or context,— (a) “Board” means the Central Board of Revenue constituted under the Central Board of Revenue Act, 1924 (IV of 1924); (b) “Corporation” means the Cotton Trading Corporation of Pakistan; (c) “factory” means a cotton ginning factory producing staple cotton for sale; (d) “sale price” means the price of four hundred and fifteen rupees per maund, inclusive of excise duty, at which staple cotton is sold by the Corporation to a textile mill; (e) “staple cotton” means ginned cotton other than desi-cotton 3. Rate of duty. There shall be levied and collected a duty of exercise on staple cotton produced and sold by a factory, whether directly or through the Corporation, to any buyer, other than the Cotton Export Corporation, at the rates set forth in the Schedule: Provided that, where the staple cotton is sold through the Corporation at the rates prescribed by the Corporation, the duty shall be payable by the Corporation out of the sale price. 4. Manner of payment of duty. The duty shall be paid at the time of sale and before the delivery of staple cotton to a textile mill. 5. Exemptions. The Board may, by special order in each case, exempt from the payment of the whole or any part of the duty leviable under this Ordinance, under circumstances of special nature to be stated in such order, any staple cotton on which such duty is leviable. 6. Power to make rules. The Central Board of Revenue may, by notification in the official Gazette, make rules to carry into effect the purposes of this ordinance. 7. Application of the provisions of the Central Excises and Salt Act, 1944. The provisions of the Central Excises and Salt Act, 1944 (I of 1944), and the rules made thereunder shall, in so far as they are not inconsistent with the provisions of this Ordinance and do not affect the levy and collection of duty under this Ordinance, apply to staple cotton and to the recovery of the duty not paid. SCHEDULE (See section 3) S.No. Description Rate of duty 1 Staple Cotton produced by cotton ginning factories in the public sector which are under the administrative control of the Cotton Trading Corporation of Pakistan. Sixty rupees per maund 2 Staple Cotton produced by cotton ginning factories in the private sector which are not under the administrative control of the Cotton Trading Corporation of Pakistan. Fifty-five rupees per maund."
}