{
  "file": "administratored2b3183cde5884ddf1fdb05f475ab79.pdf",
  "law_name": "THE BIRTHS, DEATHS AND MARRIAGES REGISTRATION ACT, 1886",
  "text": "THE BIRTHS, DEATHS AND MARRIAGES REGISTRATION ACT, 1886 CONTENTS CHAPTER I PRELIMINARY SECTIONS 1. Short title and commencement. 2. Local extent. 3. Definitions. 4. Saving of local laws. 5. Powers exercisable from time to time. CHAPTER II GENERAL REGISTRY OFFICES OF BIRTHS, DEATHS AND MARRIAGES 6. Establishment of general registry offices and appointment of Registrars General. 7. Indexes to be kept at general registry office. 8. Indexes to be open to inspection. 9. Copies of entries to be admissible in evidence. 10. Superintendence of Registrars by Registrar General. CHAPTER III REGISTRATION OF BIRTHS AND DEATHS A.—Application of this Chapter. 11. Persons whose births and deaths are registerable. B.—Registration Establishment 12. Power for Provincial Government to appoint Registrars for its territories. 13. Power for Federal Government to appoint Registrars for Acceding States. 14. Registrar to be deemed a public servant. 15. [Repealed.] 16. Office and attendance of Registrar. 17. Absence of Registrar or vacancy in his office. 18. Registrar books to be supplied and preservation of records to be provided for. C.—Mode of Registration 19. Duty of Registrar to registrar births and deaths of which notice is given. 20. Persons authorised to give notice of birth. 21. Persons authorized to give notice of death. 22. Entry of birth or deaths to be signed by person giving notice. 23. Grant of certificate of registration of birth or death. 24. Duty of Registrars as to sending certified copies of entries in register books to Registrar General. 25. Searches and copies of entries in register books. 26. Exceptional provision for registration of certain births and deaths. D.—Penalty for False Information 27. Penalty for wilfully given false information. E.—Correction of Errors 28. Correction of entry in register of births or deaths. CHAPTER IV AMENDMENT Of MARRIAGE ACTS 29—31. [Repealed.] CHAPTER V SPECIAL PROVISIONS AS TO CERTAIN EXISTING REGISTERS 32. Permission to persons having custody of certain records to send them within one year to Registrar General. 33. Appointment of Commissioners to examine registers. 34. Duties of Commissioners. 35. Searches of lists prepared by Commissioners and grant of certified copies of entries. 35A. Constitution of additional Commissions for purposes of this Chapter. CHAPTER VI RULES 36. Rules. 37. [Repealed.] THE BIRTHS, DEATHS AND MARRIAGES REGISTRATION ACT, 1886 lACT No. VI OF 1886 [8th March, 1886] An Act to provide for the voluntary Registration of certain Births and Deaths, for the establishment of General Registry Offices for keeping Registers of certain Births, Deaths and Marriages, and for certain other purposes WHEREAS it is expedient to provide for the voluntary registration of births and deaths among certain classes of persons, for the more effectual registration of those births and deaths and of the marriages registered under Act III of 1872 (XV of 1872), or the Christian Marriage Act, 1872, (XV of 1872) and of certain marriages registered under the Parsi Marriage and Divorce Act, 18652, (XV of 1865), and for the establishment of general registry offices for keeping registers of those births, deaths and marriages; AND WHEREAS it is also expedient to provide for the authentication and custody of certain existing registers made otherwise than in the performance of a duty specially enjoined by the law of the country in which the registers were kept, and to declare that copies of the entries in those registers shall be admissible in evidence; It is hereby enacted as follows:— CHAPTER I PRELIMINARY 1. Short title and commencement.—(1) This Act may be called the Births, Deaths and Marriages Registration Act, 1886; and (2) It shall come into force on such day 3as the 4[Provincial Government], by notification in the 5[official Gazette], directs. 6[* * * * * * *] 2. Local extent. This Act extends7 to 8[the whole of Pakistan] and applies also 9[to citizens of Pakistan in Acceding States]. 1For Statement of Objects and Reasons, see “Gazette of India, 1885, Pt. V, p.12; for Report of the Select Committee, see ibid., 1886, Pt. IV, p. 103; and for Proceedings in Council, see ibid., 1885, Supplement, pp. 14 and 87, and ibid., 1886, p. 290. This Act has been applied to Phulera in the Excluded Area of Upper Tanawal to the extent the Act is applicable in the N.W.F.P., subject to certain modifications; and also extended to the Excluded Area of Upper Tanawal (N.W.F.P.) other than Phulera with effect from such date and subject to such modifications as may be notified, see N.W.F.P. (Upper Tanawal) (Excluded Area) Laws Regulation, 1950. This Act has been repealed to the extent of Islamabad Capital Territory, see Ord. No. 27 of 1981, s. 4 and 3rd Sch. 2See now the Parsi Marriage and Divorce Act, 1936 (3 of 1936). 3The 1st October, 1888, see Gazette of India, 1888, Pt. I, p. 336. 4Subs. by F.A.O., 1975, Art. 2 and Sch., for “Central Government”, which was subs. by A.O.,1937, for “G. G. in C.”. 5Subs. by A.O., 1937, for “Gazette of India”. 6Sub-section (3) rep. by the Amending Act, 1891 (12 of 1891). 7It has been declared in force in Baluchistan by the British Baluchistan Laws Regulation (2 of 1913), s. 3 and Sch. It has also been extended to the Leased Areas of Baluchistan, see the Leased Areas (Laws) Order, 1950 (G.G.O. 3 of 1950); and applied in the Federated Areas of Baluchistan, see Gaz. of India, 1937, Pt. I, p. 1499. 8Subs. by the Central Laws (Statute Reform) Ordinance, 1960 (21 of 1960), s. 3 and 2nd Sch. (with effect from the 14th October, 1955) for “all the Provinces and the Capital of the Federation” which had been subs. by A.O., 1949, Arts. 3(2) and 4, for “the whole of British India”. 9The original words “within the dominions of Princes and States in India in alliance with Her Majesty, to British subjects in those dominions” have successively been amended by A. O.,1937, the Federal Laws (Revision and Declaration) Act, 1951 (26 of 1951), s. 4 and 3rd Sch., and A.O., 1961, Art. 2 and Sch, (with effect from the 23rd March, 1956), to read as above. 3. Definition. In this Act, unless there is something repugnant in the subject or context,— “sign” includes mark, when the person making the mark is unable to write his name: “prescribed” means prescribed by a rule made 1* * * under this Act: and “Registrar of Births and Deaths” means a Registrar of Births and Deaths appointed under this Act. 4. Saving of local laws. Nothing in this Act, or in any rule made under this Act, shall affect any law heretofore or hereafter passed providing for the registration of births and deaths within particular local areas. 5. Powers exercisable from time to time. All powers conferred by this Act may be exercised from time to time as occasion requires. CHAPTER II GENERAL REGISTRY OFFICES OF BIRTHS, DEATHS AND MARRIAGES 6. Establishment of general registry offices and appointment of Registrars General.— (1) Each 2[Provincial Government]— (a) shall establish3 a general registry office for keeping such certified copies of registers of births and deaths registered under this Act, or marriages registered under Act III of 1872 (XV of 1872) (to provide a form of marriage in certain cases) or of the Christian Marriage Act, 1872, or, 4* * *, under the Parsi Marriage and Divorce Act, 18655, (XV of 1865) as may be sent to it under this Act, or under any of the three last-mentioned Acts, as amended by this Act; and (b) may appoint 6 to the charge of that office an officer, to be called the Registrar General of Births, Deaths and Marriages, for the territories under its administration: 7[* * * * * * *] 7. Indexes to be kept at general registry office. Each Registrar General of Births, Deaths and Marriages shall cause indexes of all the certified copies of registers sent to his office under this Act, or under Act III of 1872 (XV of 1872), the Christian Marriage Act, 1872, (XV of 1872) or the Parsi Marriage and Divorce Act, 18655, (XV of 1865) as amended by this Act, to be made and kept in his office in the prescribed form. 1The words “by the G.G. in C.” rep. by A.O., 1937. 2Subs. by A.O.,1937, for “L. G.”, 3For General Registry Offices established for different provinces, see local R. & O. 4The words “beyond the local limits of the ordinary original civil jurisdiction of the High Court of judicature at Bombay” omitted by A.O., 1949. Sch. 5See now the Parsi Marriage and Divorce Act, 1936 (3 of 1936). 6For Registrars General appointed for different provinces, see local R.&O. 7Sub-section (2) rep. by A.O., 1937. 8. Indexes to be open to inspection. Subject to the payment of the prescribed fees, the indexes so made shall be at all reasonable times open to inspection by any person applying to inspect them, and copies of entries in the certified copies of the registers to which the indexes relate shall be given to all persons applying for them. 9. Copies of entries to be admissible in evidence. A copy of an entry given under the last foregoing section shall be certified by the Registrar General of Births, Deaths and Marriages, or by an officer authorized 1 in this behalf by the 2[Provincial Government], and shall be admissible in evidence for the purpose of proving the birth, death or marriage to which the entry relates. 10. Superintendence of registrars by Registrar General. Each Registrar General of Births, Deaths and Marriages shall exercise a general superintendence over the Registrars of Births and Deaths in the territories for which he is appointed. CHAPTER III REGISTRATION OF BIRTHS AND DEATHS A.—Application of this Chapter 11. Persons whose births and deaths are registerable.—(1) The persons whose births and deaths shall, in the first instance, be registerable under this Chapter are the following namely:— (a) in 3[the Provinces], the members of every race, sect or tribe to which the Indian Succession Act, 18654(X of 1865), applies, and in respect of which an order under section 332 of that Act is not for the time being in force, and all persons professing the Christian religion; (b) in 5[Acceding States], 6[citizens of Pakistan] being members of a like race, sect or tribe or professing the Christian religion: (2) But the 2[Provincial Government], by notification in the official Gazette, may 7* * *extend the operation of this Chapter to any other class of persons either generally or in any local area. B.—Registration Establishment 812. Power for Provincial Government to appoint Registrars for its territories. The 2[Provincial Government] may appoint, either by name or by virtue of their office, so many persons as it thinks necessary to be Registrars of Births and Deaths for such local areas within the territories under its administration as it may define and, if it sees fit, for any class of persons within any part of those territories. 1For such authorizations, see local R.& O. 2Subs. by A.O., 1937, for “L.G.”. 3The original words “British India” have successively been amended by A.O., 1949, Arts. 3 (2) and (4), the Repealing and Amending Ordinance 1961 (1 of 1961), s. 3 and 2nd Sch., and A.O., 1964, Art. 2 and Sch., to read as above. 4See now the Succession Act, 1925 (39 of 1925), s. 3. 5Subs. by the Federal Laws (Revision and Declaration) Act, 1951 (26 of 1951), s. 4 and 3rd Sch., for “Indian States” which had been subs. by A.O., 1937, for “the dominions of Princes and States in India in alliance with Her Majesty” 6Subs. by A.O., 1961, Art. 2 and Sch., for “British subjects” (with effect from the 23rd March, 1956). 7The words “with the previous approval of the G. G. in C.” were omitted by the Devolution Act, 1920 (38 of 1920), s. 2 and Sch. I. 8As to Registrars appointed under this section, see different local Rules and Orders and Gen. R. & O. 13. Power for 1[Federal Government] to appoint Registrars for Acceding States. The l[Federal Government] may, by notification in the 2[official Gazette], appoint, either by name or by virtue of their office, so many persons as 3[it] thinks necessary to be 4Registrars of Births and Deaths for such local areas within 5[any Acceding to State] as 3[it] may define and, if 3[it] sees fit, for any class of persons within any part of 6[those States]. 7[* * * * * * *] 14. Registrar to be deemed a public servant. Every Registrar of Births and Deaths shall be deemed to be a public servant within the meaning of the Pakistan Penal Code (XLV of 1860). 15. [Power to remove Registrars.] Rep. by A.O., 1937. 16. Office and attendance of Registrar.— (1) Every Register of Births and Deaths shall have an office in the local area, or within the part of the territories or dominions, for which he is appointed. (2) Every Registrar of Births and Deaths to whom the 8[Provincial Government] may direct this sub-section to apply shall attend at his office for the purpose of registering births and deaths on such days and at such hours as the Registrar General of Births, Deaths and Marriages may direct, and shall cause to be placed in some conspicuous place on or near the outer door of his office his name, with the addition of Registrar of Births and Deaths for the local area or class for which he is appointed, and the days and hours of his attendance. 17. Absence of Registrar or vacancy in his office.—(1) When any Registrar of Births and Deaths to whom the 8[Provincial Government] may direct this section to apply, 9* * *, is absent, or when his office is temporarily vacant any person whom the Registrar General of Births, Deaths and Marriages appoints in this behalf, or, in default of such appointment, the Judge of the District Court within the local limits of whose jurisdiction the Registrar’s office is situate, or such other officer as the 8[Provincial Government] appoints in this behalf, shall be the Registrar of Births and Deaths during such absence or until the 8[Provincial Government] fills the vacancy. 10[* * * * * * *] (3) The Registrar General of Births, Deaths and Marriages shall report to the 8 [Provincial Government] all appointments made by him under this section. 1Subs. by F.A.O., 1975, Art. 2 and Table, for “Central Government”, which was previously subs. by A.O., 1937, for “G. G. in C.”. 2Subs. by A.O., 1937, for “Gazette of India”. 3Subs. ibid., for “he”. 4For Registrars of Births and Deaths appointed under this section for– (1) Baluchistan Agency Territories, see Gazette of India, 1903, Pt. I, p. 916. (2) Hyderabad State, see Gazette of India, 1889 and 1890, Pt. I, p. 621 and 468, respectively. 5Subs. by Act 26 of 1951, s. 4 and 3rd Sch., for “any Indian State” which had been subs. by A.O., 1937, for “the dominions of any Prince or State in India in alliance with Her Majesty”. 6Subs. by A.O., 1937, for “those dominions”. 7The proviso which was added by the Devolution, Act, 1920 (38 of 1920), s. 2 and Sch. I, rep. by A.O., 1937. 8Subs. by A.O., 1937, for “L. G.”. 9The words “not being a Registrar of Births and Deaths for a local area in the town of Calcutta, Madras or Bombay” omitted by A.O., 1949, Sch. 10Sub-section (2) omitted, ibid. 18. Registrar books to be supplied and preservation of records to be provided for. The 1[Provincial Government] shall supply every Registrar of Births and Deaths with a sufficient number of register books of births and of register books of deaths, and shall make suitable provision for the preservation of the records connected with the registration of births and deaths. C.—Mode of Registration 19. Duty of Registrar to registrar births and deaths of which notice is given. Every Registrar of Births and Deaths, on receipt of notice of a birth or death within the local area or among the class for which he is appointed, shall, if the notice is given within the prescribed time and in the prescribed mode by a person authorized by this Act to give the notice, forthwith make an entry of the birth or death in the proper register book: Provided that— (a) if he has reason to believe the notice to be in any respect false, he may refuse to register the birth or death until he receives an order from the Judge of the District Court directing him to make the entry and prescribing the manner in which the entry is to be made; and (b) he shall not enter in the register the name of any person as father of an illegitimate child, unless at the request of the mother and of the person acknowledging himself to be the father of the child. 20. Persons authorised to give notice of birth. Any of the following persons give notice of a birth, namely:— (a) the father or mother of the child; (b) any person present at the birth; (c) any person occupying, at the time of the birth, any part of the house wherein the child was born and having knowledge of the child having been in the house; (d) any medical practitioner in attendance after the birth and having personal knowledge of the birth having occurred; (e) any person having charge of the child. 21. Persons authorized to give notice of death. Any of the following persons may give notice of a death, namely:— (a) any relative of the deceased having knowledge of any of the particulars required to be registered concerning the death; (b) any person present at the death; 1Subs. by A.O., 1937, for “L. G.” (c) any person occupying, at the time of the death, any part of the house wherein the death occurred and having knowledge of the deceased having died in the house; (d) any person in attendance during the last illness of the deceased; (e) any person who has seen the body of the deceased after death. 22. Entry of birth or deaths to be signed by person giving notice.—(1) When an entry of a birth or death has been made by the Registrar of Births and Deaths under section l9, the person giving notice of the birth or death must sign the entry in the register in the presence of the Registrar: l[Provided that it shall not be necessary for the person giving notice to attend before the Registrar or to sign the entry in the register if he has given such notice in writing and has furnished to the satisfaction of the Registrar such evidence of his identity as may be required by any rules made by the 2[Provincial Government] in this behalf.] (2) Until the entry has been so signed 1[or the conditions specified in the proviso to sub- section (1) have been complied with], the birth or death shall not be deemed to be registered under this Act. (3) When the birth of an illegitimate child is registered, and the mother and the person acknowledging himself to be the father of the child jointly request that that person may be registered as the father, the mother and that person must both sign the entry in the register in the presence of the Registrar. 23. Grant of certificate of registration of birth or death. The Registrar of Births made at the time of registering any birth or death by the person giving notice of the birth or death, and on payment by him of the prescribed fee, give to the applicant a certificate in the prescribed form, signed by the Registrar, of having registered the birth or death. 24. Duty of Registrars as to sending certified copies of entries in register books to Registrar General.—(1) Every Registrar of Births and Deaths in 3[Pakistan] shall send to the Registrar General of Births, Deaths and Marriages for the territories within which the local area or class for which he is appointed is situate or resides, at the prescribed intervals, a true copy certified by him, in the prescribed form, of all the entries of births and deaths in the register book kept by him since the last of those intervals: Provided that in the case of Registrars of Births and Deaths who are clergymen of the Churches of England, Rome and Scotland, the Registrar may, if so directed by his ecclesiastical superior, send the certified copies in the first instance to that superior, who shall send them to the proper Registrar General of Births, Deaths and Marriages. 1Ins. by the Births, Deaths and Marriages Registration (Amdt.) Act, 1911 (9 of 1911), s. 2. 2Subs. by A.O., 1937, for “L. G.”. 3Subs. by the Central Laws (Statute Reform) Ordinance, 1960 (21 of 1960),s. 3 and 2nd Sch. (with effect from the 14th October, 1955) for “the Provinces and the Capital of the Federation” which had been subs. by A.O., 1949, Arts. 3 (2) and 4, for “British India”. In this sub-section “Church of England” and “Church of Scotland” mean the Church of England and the Church of Scotland as by law established respectively; and “Church of Rome” means the Church which regards the Pope of Rome as its spiritual head. (2) The provisions of sub-section (1) shall apply to every Registrar of Births and Deaths in 1[any Acceding State] with this modification that the certified copies referred to in that sub-section shall be sent to such one of the Registrars General of Births, Deaths and Marriages as the 2[Federal Government], by notification3 in the 4[official Gazette], appoints in this behalf. 5[* * * * * * *] 25. Searches and copies of entries in register books.—(1) Every Registrar of Births and Deaths shall, on payment of the prescribed fees, at all reasonable times, al1ow searches to be, made in the register books kept by him and give a copy of any entry in the same. (2) Every copy of an entry in a register book given under this section shall be certified by the Registrar of Births and Deaths and shall be admissible in evidence for the purpose of proving the birth or death to which the entry relates. 26. Exceptional provision for registration of certain births and deaths. Notwithstanding anything in section 19, the 6[Provincial Government] may make rules7 authorizing Registrars of Births and Deaths, on conditions and in circumstances to be specified in the rules, to register births and deaths occurring outside the local areas or classes for which they are appointed. D.—Penalty for False Information 27. Penalty for wilfully given false information. If any person wilfully makes, or causes to be made for the purpose of being inserted in any register of births or deaths, any false statement in connection with any notice of a birth or death under this Act, he shall be punished with imprisonment for a term which may extend to three years, or with fine, or with both. E.—Correction of Errors 28. Correction of entry in register of births or deaths.—(l) If it is proved to the satisfaction of a Registrar of Births and Deaths that any entry of a birth or death in any register kept by him under this Act is erroneous in form or substance, he may, subject to such rules 8as may be made by the 6[Provincial Government] with respect to the conditions and circumstances on and in which errors may be corrected, correct the error by entry in the margin, without any alteration of the original entry, and shall sign the marginal entry and add thereto the date of the correction. 1Subs. by the Federal Laws (Revision and Declaration) Act, 1951 (26 of 1951), for “any Indian State” which had been subs. for “the dominions of any Prince or State in India in alliance with Her Majesty” by A.O., 1937. 2See foot-note 1 on p. 177, supra. 3For an instance of such notification, see Gazette of India, 1923, Pt. I, p. 204. 4Subs. by A.O., 1937, for “Gazette of India”. 5The proviso added by the Devolution Act, 1920 (38 of 1920), s. 2 and Sch. I, rep. by A.O., 1937. 6Subs. by A.O., 1937, for the words “L. G.”, which had been subs. for the words “G. G. in C.” by the Births, Deaths and Marriages Registration (Amdt.) Act, 1911 (9 of 1911), s. 3. 7For rules made under s. 26 conjointly with ss. 28 and 36, see Gen. R. & O., and different local Rules and Orders. All rules made by the “G. G. in C.” under this Act before 1911 shall be deemed to have been made by the Provincial Government, see. s. 6 of Act 9 of 1911. 8For rules made under s. 26 conjointly with ss. 28 and 36, see Gen. R. & O., and different local Rules and Orders. All rules made by the “G.G. in C.” under this Act before 1911 shall be deemed to have been made by the Provincial Government, see s.6 of Act 9 of 1911. (2) If a certified copy of the entry has already been sent to the Registrar General of Births, Deaths and Marriages, the Registrar of Births and Deaths shall make and send a separate certified copy of the original erroneous entry and of the marginal correction therein made. CHAPTER IV AMENDMENT Of' MARRIAGE ACTS [Rep. by the Repealing Act, 1938 (I of 1938), s. 2 and Schedule] CHAPTER V SPECIAL PROVISIONS AS TO CERTAIN EXISTING REGISTERS 32. Permission to persons having custody of certain records to send them within one year to Registrar General. If any person in 1[Pakistan] or in 2[any Acceding State], has for the time being the custody of any register or record of birth, baptism, naming, dedication, death or burial of any persons of the classes referred to in section 11, sub-section (1), or of any register or record of marriage of any persons of the classes to which Act III of 1872 or the Christian Marriage Act, 1872(XV of 1872.), or the Parsi Marriage and Divorce Act, 18653(XV of 1865), applies, and if such register or record has been made otherwise than in performance of a duty specially enjoined by the law of the country in which the Register or record was kept, he may, 4[at any time before the first day of April 1891], send the register or record to the office of the Registrar General of Births, Deaths and Marriages for the territories within which he resides, or, if he resides within 5[ any Acceding State], to such one of the Registrars General as aforesaid as the 6[Federal Government], by notification7 in the 8[official Gazette], directs in this behalf: 9[* * * * * * *] 33. Appointment of Commissioners to examine registers.— 10[(1) Any 11[Provincial Government] in the case of registers or records sent under section 32 to the Registrar General for the territories under its administration, and the 6[Federal Government], in the case of registers or records so sent to any other Registrar General appointed by 12[it] under the said section, may appoint so many persons as it 13* * * thinks fit to be Commissioners for examining such registers or records.] 1Subs. by the Central Laws (Statute Reform) Ordinance, 1960 (21 of 1960), s. 3 and 2nd Sch. (with effect from the 14th October, 1955), for “the Provinces and the Capital of the Federation” which had been subs. by A.O., 1949, Arts. 3 (2) and 4, for “British India.” 2Subs. by the Federal Laws (Revision and Declaration) Act, 1951 (26 of 1951), s. 4 and 3rd Sch. for “any Indian State” which had been subs. by A.O., 1937, for “the dominions of any Prince or State in India in alliance with Her Majesty”. 3See now the Parsi Marriage and Divorce Act, 1936 (3 of 1936). 4Subs. for “within one year from the date on which this Act comes into force” by the Births, Deaths and Marriages Registration Act, (1886) Amendment Act, 1890 (16 of 1890), s. I. 5Subs. by the Federal Laws (Revision and Declaration) Act, 1951 (26 of 1951), s. 4 and 3rd Sch., for “any Indian State” which had been subs. by A.O., 1937, for “the dominions of any Prince or State in India in alliance with Her Majesty”. 6See foot-note 1 on p. 177, supra. 7For an instance of such notification, see Gazette of India, 1899, Pt. I, p.424. 8Subs. by A.O., 1937, for “Gazette of India.”. 9Proviso which was inserted by the Devolution Act, 1920 (38 of 1920), s. 2, and Sch. I, and subsequently amended by A.O., 1937, omitted by A.O., 1949, Sch. 10Subs. by Act 38 of 1920 s. 2 and Sch. I, for the original sub-section (1) 11Subs. by A, O., 1937, for “L. G,”. 12Subs, ibid., for “him”. 13The words “or he, as the case may be,” rep., ibid. (2) The Commissioners so appointed shall hold office for such period as the 1 [authority appointing them], by the order of appointment, or any subsequent order, directs. 34. Duties of Commissioners.—(1) The Commissioners appointed under the last fore- going section shall enquire into the state, custody and authenticity of every such register or record as may be sent to the Registrar General of Births, Deaths and Marriages under section 32; and shall deliver to the Registrar General a descriptive list or descriptive lists of all such registers or records, or portions of registers or records, as they find to be accurate and faithful. (2) The list or lists shall contain the prescribed particulars and refer to the registers or records, or to the portions of the registers or records, in the prescribed manner. (3) The Commissioners shall also certify in writing, upon some part of every separate book or volume containing any such register or record, or portion of a register or record, as is referred to in any list or lists made by the Commissioners, that it is one of the registers or records, or portions of registers or records, referred to in the said list or lists. 35. Searches of lists prepared by Commissioners and grant of certified copies of entries.—(1) Subject to the payment of the prescribed fees, the descriptive list or lists of registers or records, or portions of registers or records, delivered by the Commissioners to the Registrar General of Births, Deaths and Marriages shall be, at all reasonable times, open to inspection by any person applying to inspect it or them, and copies of entries in those registers or records shall be given to all persons applying for them. (2) A copy of an entry given under this section shall be certified by the Registrar General of Births, Deaths and Marriages, or by an officer or person 2authorized in this behalf by the 3[Provincial Government] and shall be admissible in evidence for the purpose of proving the birth, baptism, naming, dedication, death, burial or marriage to which the entry relates. 4[35A. Constitution of additional Commissions for purposes of this Chapter.—(1) The 5[Federal Government] or the 3[Provincial Government] 6[may by notification in the official Gazette] appoint more Commissions7 than one for the purposes of section 33, each such Commission consisting of so many and such members, and having its functions restricted to the disposal, under this Act and the rules thereunder, of such registers and records sent under section 32 to the Registrar General, as may be specified in the notification. (2) If more Commissions than one are appointed in exercise of the power conferred by sub- section (1), then references in this Act to the Commissioners shall be construed as references to the members constituting a, Commission so appointed.] 1Subs. by Act 38 of 1920, s. 2 and Sch., I, for “G. G. in C.”. 2For such authorizations, see different local Rules and Orders. 3Subs. by A.O., 1937, for “L. G.”. 4S. 35A was added by the Births, Deaths and Marriages Registration Act (1886) Amendment Act, 1890 (16 of 1890), s. 2, which was repealed by the Devolution Act, 1920 (38 of 1920), s. 3 and Sch. II. The present sub-section (1) was subs for the original sub-section by Act 38 of 1920, s. 2 and Sch. 1 and sub-section (2), which is the same as the original sub-section (2), was ins. by the Repealing and Amending Act, 1934 (24 of 1934) s. 2 and Sch. I. 5See foot-note 1 on p. 177, supra. 6Subs. by A.O., 1937, for “if he or it thinks fit, may by notification in the Gazette of India or the local official Gazette, as the case may be”. 7For Commissioners appointed under this section, see Gen. R. & O. CHAPTER VI RULES 1[36. Rules.—2[(1) The Provincial Government, for each Province, and the 3[Federal Government], for 4[citizens of Pakistan] in 5[Acceding States], may make rules to carry out the purposes of this Act.] (2) In particular and without prejudice to the generality of the foregoing power, such rules may— (a) fix the fees payable under this Act; (b) prescribe the forms required for the purposes of this Act; (c) prescribe the time within which, and the mode in which, persons authorized under this Act to give notice of a birth or death to a Registrar of Births and Deaths must give the notice; (d) prescribe the evidence of identity to be furnished to a Registrar of Births and Deaths by persons giving notice of a birth or death in cases where personal attendance before such Registrar is dispensed with; (e) prescribe the registers to be kept and the form and manner in which Registrars of Births and Deaths are to register births and deaths under this Act, and the intervals at which they are to send to the Registrar General of Births, Deaths and Marriages true copies of the entries of births and deaths in the registers kept by them; (f) prescribe the conditions and circumstances on and in which Registrars of Births and Deaths may correct entries of births and deaths in registers kept by them; (g) prescribe the particulars which the descriptive list or lists to be prepared by the Commissioners appointed under Chapter V are to contain, and the manner in which they are to refer to the registers or records, or portions of registers or records, to which they relate; and (h) prescribe the custody in which those registers or records are to be kept. (3) Every power to make rules conferred by this Act is subject to the condition of the rules being made after previous publication. (4) All rules made under this Act shall be published in the 6 [official Gazette], and on such publication shall have effect as if enacted in this Act.] 37. [Procedure for making and publication of rules.] Rep by the Births, Deaths and Marriages Registration Amendment Act, 1911 (IX of 1911), s. 5. Date: 05-09-2024 1Subs. by the Births, Deaths and Marriages Registration (Amdt.) Act, 1911 (9 of 1911), s. 4, for the original section. 2Subs. by A.O., 1937, for the original sub-section. 3Subs. by F. A.O., 1975, Art. 2 and Table, for “Central Government”. 4Subs. by A.O., 1961, Art. 2 and Sch., for “British subjects” (with effect from the 23rd March, 1956). 5Subs. by the Federal Laws (Revision and Declaration) Act, 1951 (26 of 1951), s. 4 and 3rd Sch., for “Indian States”. 6Subs. By A.O, 1937, for “local official Gazette.”"
}