{
  "file": "administrator03228293f22331aa4d74568d913399ac.pdf",
  "law_name": "The Punjab Laws Act, 1872",
  "text": "THE PUNJAB LAWS ACT, 1872 CONTENTS PREAMBLE. 1. Short title. 2. Local extent. 3. Enactments in force. 4. [Repealed] CIVIL JUDICATURE 5. Decisions in certain cases to be according to Native law. 6. Decisions in cases not specially provided for. 7. Local customs and mercantile usages when valid. 8. 8A, 8B and 8C. [Repealed] PRE-EMPTION 9 to 20. [Repealed] DECREES CONCERNING LAND 21. [Repealed] INSOLVENCY 22 to 33.. [Repealed] MINORS AND THE COURT OF WARDS 34 to 38. [Repealed]. CRIMINAL JUDICATURE 39. [Omitted] 39A. Power to establish a system of village-watchmen and municipal watchmen, and to make rule. 39B. Obligation to assist watchman and headman. Person obstructing watchman or headman may be arrested without warrant. 39C. Power to direct local taxation for payment of police enrolled under Act V of 1861. 39D. Notice of taxes proposed to be levied. Objections to taxation. Procedure thereon. 39E. Power to fix rates of tax. 39F. Power to make rules for collection of taxes. 39G. [Repealed] HONORARY POLICE-OFPICERS 40. Provincial Government may confer powers of Police-officer. TRACK LAW 41. Trackers may call for assistance in carrying on tracks. 42. Penalty for withholding assistance or conniving at offence or escape. Limit to fine. Appeal to High Court Fine may be awarded to injured parties, and fee to tracker. SLAUGHTER OF KINE 43. Control of slaughter of kine and sale of beef. ARMED MEN AND FOREIGN VAGRANTS 44. [Omitted] 45. [Omitted] 46. [Omitted] MISCELLANEOUS 47. Crossing of streams on buoys or skins. 48. Use of pasturage or natural product of Government land. 49. [Repealed] 50. Power to make rules as to matters mentioned in sections 43 to 48. Existing rules 50A. Conditions of validity of rules hereafter made under this Act 50B. Penalties for beach of rules. 51. [Omitted] 52. [Repealed] SCHEDULE I ENACTMENTS DECLARED TO BE IN FORCE SCHEDULE II ENACTMENTS REPEALED THE PUNJAB LAWS ACT, 1872 Act No IV OF 1872 [28th March, 1872] An Act for declaring which of certain rules, laws and regulations have the force of law in the Punjab and for other purposes. Preamble. WHEREAS certain rules, laws and regulations, made heretofore for the Punjab, acquired the force of law under the provisions of section 25 of the lIndian Councils Act, 1861; and whereas it is expedient to declare which of the said rules, laws and regulations shall henceforth be in force in the Punjab, and to amend, consolidate or repeal others of the said rules, orders and regulations; It is hereby enacted as follows:— 1. Short title. This Act may be called the Punjab Laws Act, 1872. 2. Local extent. It extends to the 2territories 3[comprised in the Punjab], but not so as to alter the effect of any regulations made for any parts of the said territories under the 1Statute 33 Vict., cap. 3, section 1; Commencement, and it shall come into force on the first day of June, 1872. 3. Enactments in force. The Regulations, Acts and Orders specified in the First Schedule hereto annexed are in force in 4[the Punjab] to the extent specified in the third column of the said Schedule. 4. [Enactments repealed.] Rep. by the Second Repealing and Amending Act, 1914 (XVII of 1914), s. 3 and Sch. II. CIVIL JUDICATURE 5[5. Decisions in certain cases to be according to Native law.—In questions regarding succession, special property of females betrothal, marriage, divorce, dower, adoption, guardianship, minority, bastardy, family relations, wills, legacies, gifts, partitions, or any religious usage or institution, the rule of decision shall be— (a) 6[Where the parties are not Muslims, any custom] applicable to the parties concerned, which is not contrary to justice, equity or good conscience, and has not been by this or any other enactment altered or abolished, and has not been declared to be void by any competent authority; (b) 7* * * 1Rep. by the Government of India Act. 2Rep. in the territories now forming the N.W.F.P. by the N.W.F.P. Law and Justice Regulation, 1901 (7 of 1901), s. 5. 3The original words “now under the administration of the Lieutenant Governor of the Punjab” were first subs. by A. O., 1949, Sch. and then amended by the Federal Laws (Revision and Declaration) Act, 1951 (26 of 1951), s. 8, to read as above. 4Subs. by Act 26 of 1951, s. 8, for” West Punjab” which had been subs. by A.O., 1949, for” the Punjab”. 5Subs. by the Punjab Laws (Amdt) Act, 1878 (12 of 1878), s. 1, for the original section 5. The provisions of this section have been rep. in so far as they are inconsistent with those of the Muslim Personal Law (Shariat) Application Act, 1937 (26 of 1937), see ibid., s. 6. 6Subs. by the Federal Laws, (Revision and Declaration) Ordinance, 1981 (27 of 1981), s. 3 and 2nd Sch., for “Any custom”. 7Certain words omitted ibid. the Hindu law, in cases where the parties are Hindus, except in so far as such law has been altered or abolished by legislative enactment, or is opposed to the provisions of this Act, or has been modified by any such custom as is above referred to.] 6. Decisions in cases not specially provided for.—In cases not otherwise specially provided for, the Judges shall decide according to justice, equity and good conscience. 7. Local customs and mercantile usages when valid.—All local customs and mercantile usages shall be regarded as valid, unless they are contrary to justice, equity or good conscience, or have, before the passing of this Act, been declared to be void by any competent authority. 1* * * * * 18, 8A, 8B and 8C. [Regarding descent of Jaghirs] Rep. by the Punjab Jaghirs Act, 1941 (Punjab Act V of 1941), s. 13. PRE-EMPTION 9 to 20. Rep. by the Punjab Pre-emption Act, 1905 (Punjab Act II of 1905), s. 2 (I). DECREES CONCERNING LAND 21. [Copy of decrees affecting land to be forwarded to Deputy Commissioner.] Rep. by the Punjab Land Revenue Act, 1887 (XVII of 1887). INSOLVENCY 22 to 32. Rep. by the Provincial Insolvency Act, 1907 (III of 1907). 33. [Saving of previous insolvency Proceedings.] Rep. by the Amending Act, 1891 (XII of 1891). MINORS AND THE COURT OF WARDS 34 to 38. Rep. by the Punjab Court of Wards Act, 1903 (Punjab Act II of 1903), s. 2 (I). CRIMINAL JUDICATURE 239. [Pakistan Penal Code to apply to offences committed previous to 1st January, 1862. Saving of privileges conferred on certain Chiefs.] Omitted by the Federal Laws (Revision and Declaration) Ordinance, 1981 (XXVII of1981), s. 3 and IInd Sch. 3[39A. Power to establish a system of village-watchmen and municipal watchmen, and to make rules.—4[The Provincial Government] may establish a system of village-watchmen or municipal watchmen in any part of the 5[Punjab], and in furtherance of this object may, from time to time, make rules to provide for the following matters:— 1The heading “Descent of Jaghirs” preceding Ss. 8, 8A, 8B and 8C which were subs. by the Punjab Descent of Jaghirs Act, 1900 (Punjab Act 4 of 1900), s. 2, for the original section 8, was subsequently repealed, together with the said sections, by the Punjab Jaghirs Act, 1941 (Punjab Act 5 of 1941), s. 13. 2This section was previously amended by A.O.,1937. 3Ss. 39A and 39B were subs. by the Punjab Laws (Amdt) Act, 1881 (24 of 1881), s. 2, for the ss. 39A and 39B which had been ins. by the Punjab Laws Amdt Act, 1875 (15 of 1875), s. 2. 4Subs. by A. O. 1937, for “The L.G.”. 5Subs. by the Central Laws (Statute Reform) Ordinance, 1960 (21 of 1960), s. 3 and 2nd Sch. for “territories under its administration” (with effect from the 14th October, 1955). (a) the definition of the limits of watchmen’s beats; (b) the determination of the several grades of watchmen, and the number of each grade to be appointed to each beat; (c) the appointment, suspension, dismissal and resignation of watchmen of each grade; (d) the equipment and discipline of, and the control and supervision over, such watchmen; (e) the conferring upon them, and the exercise by them, of any powers and the enjoyment by them of any protection or privilege, which may be exercised and enjoyed by a police-officer under any law for the time being in force; (f) the performance by them of such duties relating to police, sanitation or statistics, or for the benefit of the village communities or municipalities within their respective beats, as 1[the Provincial Government] thinks fit; (g) the exercise of authority over, and the rendering of aid to, such watchmen by headmen of the villages or members of the Municipal Committees of the towns comprised in their respective beats; (h) the performance, by the headmen of villages comprised in the beat, of any watchman, of any of the duties of a village-watchman in aid of, or substitution for, such watchman; (i) the exercise, by such village-headmen for the purposes referred to in clauses (g) and (h), or by members of Municipal Committees for the purposes referred to in clause (g) of this section, of any of the powers, and the enjoyment by such headmen or members of any privilege or protection, of a village- watchman, or a municipal watchman, as the case may be; (j) the determination of the rate at which, and the mode in which, watchmen shall be paid, and, in the case of village watchmen, of the mode in which their pay, the expenses of their equipment, and other charges connected with the village- watchman-system shall be provided for, whether out of cesses or funds already leviable or available in the vi1lages comprised in the beat, or by a special tax in money or kind to be imposed on any class of persons residing or owning property in, or resorting to, such villages, or partly in one of these ways and partly in the other; (k) the collection with or without the aid of the village-headmen, and by any process available for the realisation of the land-revenue, of any tax imposed under clause (j) of this section, and the application of, and the mode of accounting for, the same; and generally for 1Subs. by A. O. 1937, for “The L.G.”. (l) the efficient working of the system of village-watchmen or municipal watchmen; Provided— first, that the rules to be made regarding the appointment of village-watchmen shall allow to the headmen of the villages comprised in the beat to which such a watchman is to be appointed a power of nomination, to be exercised in such a manner and subject to such reasonable conditions as may be prescribed by such rules: secondly, that the rules to be made under clause (j) of the section with regard to village- watchmen shall include provisions for recording and securing due consideration of the views and opinions on the matters therein referred to of the headmen of the villages comprised in each beat. 39B. Obligation to assist watchman and headman.—Every person is bound to render to a village-watchman, or municipal watchman, or village-headman discharging the duties of a Police- officer under the rules made hereunder, all the assistance which he is bound to render to a Police- officer. Person obstructing watchman or headman may be arrested without warrant.—Any person who obstructs such watchman or headman in the discharge of such duties may be arrested without warrant by a Police-officer or by any watchman or village-headman empowered in this behalf by 1[the Provincial Government].] 2[39C. Power to direct local taxation for payment of police enrolled under Act V of 1861.—Whenever it seems to l[the Provincial Government] expedient that the duties of watch-and- ward and other internal police-service of any town or village not comprised within the limits of a municipality or within the limits of a village-watchman’s beat as defined under the power conferred by section 39A should be performed by Police-officers enrolled under 3Act V of 1861, 1[the Provincial Government] may direct that the said service shall be so performed, and may also, 4* * * direct that the charges for the time being fixed by such Government on account of such service shall be defrayed by taxes to be levied in such town or village. 39D. Notice of taxes proposed to be levied.—When l[the Provincial Government] has, under section 39C, directed that taxes shall be levied in any town or village, the Deputy Commissioner may from time to time issue a public notice in such town or village explaining the nature of the taxes he proposes to levy. Objections to taxation.—Any inhabitant of such town or village objecting to the taxation thus proposed may, within fifteen days from the publication of such notice, send his objection in writing to the Deputy Commissioner. Procedure thereon.—After the expiry of fifteen days from the publication of the notice, the Deputy Commissioner may submit for the information of l[the Provincial Government] a report of the proposal made by him. Such report shall contain specific mention of the objections (if any) urged to his proposal and his opinion on such objections. No such tax shall be levied until it has, upon such report, been approved by 1[the Provincial Government]. 1Subs. by A.O., 1937, for “the L.G.” 2Ss. 39C to 39G were ins. by the Punjab Laws Amdt. Act, 1875 (15 of 1875), s. 2. 3The Police Act. 4The words “subject to the control of the G.G. in C.” rep. by A.O.,1937. 39E. Power to fix rates of tax.—When any such tax has been so approved by l[the Provincial Government], the Deputy Commissioner may from time to time, subject to such rules consistent with this Act as 1[the Provincial Government] may from time to time prescribe, determine the rates at which it is to be levied. 39F. Power to make rules for collection of taxes.—l[The Provincial Government] may from time to time make rules to provide for the collection of such taxes by any process available for the realisation of the land-revenue and to regulate the application and mode of accounting for the same. 39G. [Validation clause.] Rep. by the Amending Act, 1891 (XII of 1891).] HONORARY POLICE-OFPICERS 40. Provincial Government may confer powers of Police-officer. 1[The Provincial Government] may, if it thinks fit, confer on any person any of the powers which may be exercised by a Police-officer under any Act for the time being in force, 2[and may withdraw any powers so conferred]. TRACK LAW 41. Trackers may call for assistance in carrying on tracks. When an offence is, has been, or may reasonably be supposed to have been committed, and the tracks of the persons who may reasonably be supposed to have committed such offence, or of any animal or other property reasonably supposed to be connected with such offence, are followed to a spot within the immediate vicinity of a village, the person following such tracks may call upon any headman or village- watchman in such village to assist in carrying on the tracks. 42. Penalty for withholding assistance or conniving at offence or escape; limit to fine. If such headman or watchman do not forthwith give such assistance, or if the inhabitants of such village do not afford full opportunity for search in their houses for the offenders, or, if from the circumstances of the case, there shall appear good reason to believe that the inhabitants of such village, or any of them were conniving at the offence or at the escape of the offenders, and such offenders cannot be traced beyond the village, the Magistrate of that District may, with the previous sanction of the Commissioner of the Division inflict a fine upon such village not exceeding five hundred rupees, except in the case of stolen property over five hundred rupees in value, in which case the fine shall not exceed the value of such property. Appeal to High Court.—An appeal against all convictions under this section shall lie to the 3[High Court of West Pakistan]. Fine may be awarded to injured parties, and fee to tracker.—The Magistrate may direct that the fine imposed under this section or any part thereof shall be awarded to any persons injured by such offence in compensation for such injury; and, in the case of stolen property recovered through the agency of a tracker, may direct that such property be not restored to its owner until he has paid to such tracker such fee, not exceeding one-fourth part of the value of the stolen property, as the said Magistrate seems fit. SLAUGHTER OF KINE lSubs. by A.O., 1937, for “the L.G.”. 2Ins. by the Punjab Laws (Amdt.) Act, 1878 (12 of 1878), s.5. 3The original words “Chief Court” were first subs. by A.O., 1949, and then amended by the Central Laws (Statute Reform) Ordinance, 1960, (21 of 1960), s. 3 and 2nd Sch. (with effect from the 14th October, 1955), to read as above. 43. Control of slaughter of kine and sale of beef.—The slaughter of kine and the sale of beef shall not take place except 1* * * subject to rules to be from time to time, either generally or in any particular instance, prescribed by 2[the Provincial Government]. ARMED MEN AND FOREIGN VAGRANTS 44. 3[Control of entry into towns of bands of armed men.] Omitted by the Federal Laws (Revision and Declaration) Ordinance, 1981 (XXVII of1981), s. 3 and IInd Sch. 45. 4[Powers of Magistrate of District as to foreign vagrants.] Omitted by the Federal Laws (Revision and Declaration) Ordinance, 1981 (XXVII of 1981) s. 3 and IInd Sch. 46. 4[Surveillance, etc., of band failing to comply with Magistrate’s Order.] Omitted by the Federal Laws (Revision and Declaration) Ordinance, 1981 (XXVII of 1981), s. 3 and IInd Sch. MISCELLANEOUS 47. Crossing of streams on buoys or skins.—No person shall cross any river or stream on a buoy or inflated skin, nor shall have in his possession or custody any buoy or skin for the purpose of being used in crossing any river or stream, except 5* * * subject to rules to be from time to time either generally or in any particular instance, prescribed by 2[the Provincial Government]. 48. Use of pasturage or natural product of Government land.—No person shall make use of the pasturage or other natural product of any land being the property of 6[the Government], except with the consent and subject to rules to be from time to time, either generally or in any particular instance, prescribed by 7[the government concerned]. 49. [Growing, selling or keeping opium.] Rep. by the Opium Act, 1878 (I of 1878), s. 2 and Sch. 8[50. Power to make rules as to matters mentioned in sections 43 to 48.—2[The Provincial Government] may from time to time make rules as to the matters mentioned in 9[sections 43,47 and 48] inclusive. Existing rules.—All existing rules upon-such matters, which-might have-been made under this section had it been in force, shall be deemed to have been made hereunder. 50A. Conditions of validity of rules hereafter made under this Act.—10[Rules made under this Act shall not be valid unless]: 1The words “with the consent and” rep. by the Punjab Laws (Amdt.) Act, 1878 (12 of 1878), s. 6. 2Subs. by A.O., 1937, for “the L.G.”. 3This section was previously amended by Act, 12 of 1878, s. 6 and A.O., 1937. 4This section was amended by A.O., 1937. 5The words “with the consent and” rep. by the Punjab Laws (Amdt.) Act, 1878 (12 of 1878), s. 6. 6The original words “the Government”. were first subs. .by, A.O., 1937 and then amended by A.O.,1961, Art. 2 (with effect from the 23rd March, 1956), to read as above. 7The original words the L,G.” were first subs. by A.O., 1937 and then amended by A.O., 1961, Art.2 and Sch.(with effect from the 23rd March, 1956), to read as above. 8Ss 50, 50A and 50B were subs. by the Punjab Laws Amdt. Act, 1875 (15 of 1875), s. 3, for the original s. 50. 9Subs. by “the Federal Laws (Revision and Declaration) Ordinance, 1981 (27 of 1981), s. 3 and. IInd Sch. for “sections 43 to.48” which had been subs. by the Amending Act, 1891 (12 of 1891), s. 2 and Sch. II, for “sections forty three to forty-nine”. 10Subs. by A.O., 1937, for the words “[All] rules hereafter made by the L.G. under any power conferred by this Act shall be [subject to the control of the G.G. in C. and no such rules shall be valid] unless”. The words in crotchets were subs. by the Decentralization Act, 1914 (4 of 1914), for the words “No” and” valid “, respectively. (a) they are consistent with the laws for the time being in force in 1[the Punjab]; (b) they are published in the official Gazette; 2* * * * * * * 3[50B. Penalties for beach of rules.—Whoever breaks any rule made by the Provincial Government under this Act shall be punished with imprisonment for a term which may extend to six months, or with fine which may extend to fifty rupees, or with both.] 51. [Republication of rules and orders] Omitted by the Federal Laws (Revision and Declaration) Ordinance, 1981 (XXVII of 1981), s.3 and IInd Sch. 52. [Recovery of advances made by Government.] Rep.by the Northern India Takkavi Act, 1879 (X of 1879). 4SCHEDULE I ENACTMENTS DECLARED TO BE IN FORCE Explanation.— This schedule does not refer to any Act which is in its terms applicable to 5[the Punjab], or which has been extended to 5[the Punjab] by competent authority. No. and year Title Extent to which the enactment is in force 6Reg. I of 1798 A Regulation to prevent Fraud and Injustice in Conditional Sales of Land under Deeds of bai-bil-wuffa, or other Deeds of the same nature. The whole, except such parts as relate to interest. 7* * * * * * * Reg. XVII of 1806 A Regulation for extending to the province of Benares the Rates of Interest of future Loans and Provisions relative thereto, contained in Regulation XV, 1793; also for a general extension of the period fixed by Regulations I, 1798 and XXXIV, 1803, for the redemption of Mortgages and Conditional Sales of Land, under Deeds of bai-bil-wuffa Kutcubaleb, or other similar designation. Sections 7 and 8. Reg. III of 1818 A Regulation for the Confinement of State Prisoners. The whole Reg. XI of 1825 A Regulation for declaring the Rules to be observed in determining Claims to Lands gained by alluvion or by dereliction of a river or the sea. The whole 7* * * * * * * * 1Subs. by the Federal Laws (Revision and Declaration) Act, 1951 (26 of 1951), s. 8, for “West Punjab” which had been subs. by A.O., 1949, Sch., for “the Punjab “. 2CI. (c) of s. 5A rep. by Act 4 of 1914. 3Section 50 B as amended by Act 12 of 1878, s. 7, A.O., 1937, has been subs. by Ordinance 27 of 1981, s. 3 and IInd Sch. 4As so much of Act 4 of 1872 as related to Bengal Regulations 5 of 1817 and 20 of 1825 and Acts 40 of 1858 and 17 of 1861 was repealed by Acts 6 of 1878, 10 of 1882, 8 of 1890 and 12 of 1891, respectively, the references to those Regulations and Acts in the Schedule are omitted. 5Subs. by Act 26 of 1951, for “West Punjab” which had been subs. by A.O., 1949, Sch., for “the Punjab”. 6So much of Act 4 of 1872 as relates to Bengal Regulations 1 of 1798 and 17 of 1806 will be repealed when the Transfer of Property Act, 1882 (4 of 1882), is extended to the Punjab, see Act 4 of 1882, ss.1,2 and Sch. 7So much of the first Schedule as relates to Bengal State Offences Regulation, 1804, (10 of 1804), was repealed by Act 4 of 1922. SCHEDULE II [Enactments Repealed] Rep. by the Second Repealing and Amending Act, 1914 (XVII of 1914) ________________________________ Date: 16-09-2024 No. and year Title Extent to which the enactment is in force. . . Rules for the conservancy of Forests and Jungles in the Hill Districts of the Punjab Territories, Sanctioned by the Governor General in Council in letter of the Secretary to the Government of India, No. 1789, 21st May, 1855. The whole"
}