{
  "file": "administratord5b4fb41a79f41fd7f85175910ad4510.pdf",
  "law_name": "The Revenue Recovery Act, 1890",
  "text": "THE REVENUE RECOVERY ACT, 1890 CONTENTS 1. Title and extent. 2. Definitions. 3. Recovery of public demands by enforcement of process in other districts than those in which they become payable. 4. Remedy available to person denying liability to pay amount recovered under last foregoing section. 5. Recovery by Collectors of sums recoverable as arrears of revenue by other public officers or by local authorities. 6. Property liable to sale under this Act. 7. Saving of local laws relating to revenue. 8. Recovery in Pakistan of certain public demands arising beyond Pakistan. 9. Recovery in Pakistan of land-revenues, etc., accruing in Burma, 10. Duty of Collectors to remit moneys collected in certain cases. 11. Recovery in the Provinces of land-revenue, etc., accruing in an Acceding State. THE SCHEDULE CERTIFICATE THE REVENUE RECOVERY ACT, 1890 1 ACT NO. I OF 1890 [14th February, 1890] An Act to make better provision for recovering certain public demands WHEREAS it is expedient to make better provision for recovering certain public demands; It is hereby enacted as follows:— 1. Title and extent.—(1) This Act may be called the Revenue Recovery Act, 1890. 2 [(2) It extends to the whole of Pakistan]. 2. Definitions. In this Act, unless there is something repugnant in the subject or context,— 3 * * * * * * * (2) “Collector” means the chief officer in charge of the land-revenue administration of a district: and (3) “defaulter” means a person from whom an arrear of land-revenue, or a sum recoverable as an arrear of land-revenue, is due, and includes a person who is responsible as surety for the payment of any such arrear or sum. 3. Recovery of public demands by enforcement of process in other districts than those in which they become payable.—(1) Where an arrear of land-revenue, or a sum- recoverable as an arrear of land-revenue, is payable to a Collector by a defaulter being or having property in a district other than that in which the arrear accrued or the sum is payable, the Collector of may send to the collector of that other district a certificate in the form as nearly as may be of the schedule, stating— (a) the name of the defaulter and such other particulars as may be necessary for his identification, and (b) the amount payable by him and the account on which it is due. 1For Statement of Objects and Reasons, see Gazette of India, 1887, Pt. V, p.128; for Report of the Select Committee, see ibid., 1890, Pt. V, p. 11; and for Proceedings in Council, see ibid., 1887, Pt, VI. pp. 66 and 67, and ibid., 1890, Pt. VI. pp. 7 and 12. Extended to the State of Bahawalpur, see G. G. O. 2 of 1952, Art. 2. Extended to Khairpur State, subject to certain modification, see the Khairpur (Federal Laws) (Second Extension) Order, 1953 (G. G. O.14 of 1953). It has also been extended to the Baluchistan States Union by G.G.O. 18 of 1953, in respect of proceedings under certain specified laws. 2The existing sub-section (2) as amended by the Federal Laws (Revision and Declaration) Act, 1951 (26 of 1951), s. 4 and 3rd Sch., the Burma Laws Act, 1898 (13 of 1898), s. 18 and Sch. V, the Repealing and Amending Act, 1914 (10 of 1914),s.3 and 2nd Sch. the G.G.O. 2 of 1947, Sch., has been subs. by the Central Laws (Statute Reform) Ordinance, 1960 (21 of 1960), s. 3 and 2nd Sch. (with effect from the 14th October, 1955). 3The original clause (1) omitted by A.O., 1949. Sch. (2) The certificate shall be signed by the Collector making it 1 [or by any officer to whom such Collector may, by order in writing, delegate this duty,] and, save as otherwise provided by this Act, shall be conclusive proof of the matters therein stated. (3) The Collector of the other district shall, on receiving the certificate, proceed to recover the amount stated therein as if it were an arrear of land-revenue which had accrued in his own district. 4. Remedy available to person denying liability to pay amount recovered under last foregoing section.—(1) When proceedings are taken against a person under the last foregoing section for the recovery of an amount stated in a certificate, that person may, if he denies his liability to pay the amount or any part thereof and pays the same under pro test made in writing at the time of payment and signed by him or his agent, institute a suit for the repayment of the amount or the part thereof so paid. (2) A suit under-sub-section (1) must be instituted in a Civil Court having jurisdiction in the local area in which the office of the Collector who made the certificate is situate, and the suit shall be determined in accordance with the law in force at the place where the arrear accrued or the liability for the payment of the sum arose. (3) In the suit the plaintiff may, notwithstanding anything in the last foregoing section, but subject to the law in force at the place aforesaid, give evidence with respect to any matter stated in the certificate. 2 [(4) This section shall apply if under this Act as in force as part of the law of India, or under any other similar Act forming part of the law of India, proceedings are taken against a person in India for the recovery of an amount stated in a certificate made by a Collector in Pakistan.] 5. Recovery by Collectors of sums recoverable as arrears of revenue by other public officers or by local authorities. Where any sum is recoverable as an arrear of land-revenue by any public officer other than a Collector or by any local authority, the Collector of the district in which the office of that officer or authority is situate shall, on the request of the officer or authority, proceed to recover the sum as if it were an arrear of land-revenue which has accrued in his own district, and may send a certificate of the amount to be recovered to the Collector of another district under the foregoing provisions of this Act, as if the sum were payable to himself. 6. Property liable to sale under this Act.—(1) When the Collector of a district receives a certificate under this Act, he may issue a proclamation prohibiting the transfer or charging of any immoveable property belonging to the defaulter in the district. (2) The Collector may at any time, by order in writing, withdraw the proclamation, and it shall be deemed to be withdrawn when either the amount stated in the certificate has been recovered or the property has been sold for the recovery of that amount. 1Ins. by the Decentralization Act, 1914 (4 of 1914), s. 2 and Sch., Pt. I. 2Sub-section (4) which was previously ins. by, A.O, 1937, has been subs. by Federal Laws (Revision and Declaration) Ordinance, 1981 (27 of 1981), s.3 and 2nd Sch. (3) Any private alienation of the property or of any interest of the defaulter therein, whether by sale, gift, mortgage or otherwise, made after the issue of the proclamation and before the withdrawal thereof, shall be void as l[against the 2[Government]] and any person who may purchase the property at a sale held for the recovery of the amount stated in the certificate. (4) Subject to the foregoing provisions of this section, when proceedings are taken against any immoveable property under this Act for the recovery of an amount stated in a certificate the interests of the defaulter alone therein shall be so proceeded against, and no incumbrances created, grants made or contracts entered into by him in 3good faith shall be rendered invalid by reason only of proceedings being taken against those interests. (5) A proclamation under this section shall be made by beat of drum or other customary method and by the posting of a copy thereof on a conspicuous place in or near the property to which it relates. 7. Saving of local laws relating to revenue. Nothing in the foregoing sections shall be construed— (a) to impair any security provided by, or affect the provisions of, any other enactment for the time being in force for the recovery of land-revenue or of sums recoverable as arrears of land-revenue, or (b) to authorize the arrest of any person for the recovery of any tax, payable to the corporation, commissioner, committee, board, council or person having authority over a municipality under any enactment for the time being in force. 8. Recovery in Pakistan of certain public demands arising beyond Pakistan. When this Act has been applied to any local area which is under the administration of 4[the 5[Federal Government] 6***] but which is not part of 7[8 * * * Pakistan], an arrear of land- revenue accruing in that local area, or a sum recoverable as an arrear of land-revenue and payable to a Collector or other public officer or to a local authority in that local area, may be recovered under this Act in 7[8* * * Pakistan]. 9. [Recovery in Pakistan of land-revenues, etc., accruing in Burma,] Omitted by the Federal Laws (Revision and Declaration) Ordinance, 1981 (XXVII of 1981), s. 3 and Sch. II. 10. Duty of Collectors to remit moneys collected in certain cases. Where a Collector receives a certificate under this Act from a Collector 9[in the other Province] or a Collector in 10[India 11* * he shall remit any sum recovered by him by virtue of that certificate to that Collector, after deducting his expenses in connection with the matter.] 1Subs. by A.O., 1937, for “against the Govt.”. 2Subs. by A. O., 1961, Art. 2, for “Crown” (with effect from the 23rd March, 1956). 3See definition in the General Clauses Act, 1897 (10 of 1897), s. 3(20). 4Subs. by A. O., 1937, for “the G. G. in, C.”. 5Subs. by F.A.O., 1975, Art. 2 and Table, for “Central Government”. 6The words “or the Crown Representative” omitted by G.G.O. 2 of 1947, Sch., Part IV. 7Subs. ibid., for “British India”. 8The words “the Provinces of” have been omitted by the Central Laws (Statute Reform) Ordinance, 1960 (21 of 1960), s. 3 and 2nd Sch. (with effect from the 14th October, 1955). 9Subs. by the Central Laws (Statute Reform) Ordinance, 1960 (21 of 1960), s.3 and 2nd Sch. (with effect from the 14th October, 1955) for “of another Province”. 10 Ins. by G. G. O. 2 of 1947, Sch., Pt. IV (from 15th August, 1947). 11 The words “or Burma” omitted by the Federal Laws (Revision and Declaration) Ordinance, 1981 (27 of 1981), s.3 and 2nd Sch. 4 11. [Recovery in the Provinces of land-revenue, etc., accruing in an Acceding State.] Omitted by the Federal Laws (Revision and Declaration) Ordinance, 1981 (XXVII of 1981), s. 3 and Sch. II. THE SCHEDULE CERTIFICATE [See section 3, sub-section (1)] From The Collector of To The Collector of Dated the of 18 . The sum of Rs. is payable on account of by, son of, resident of, who is believed (to be at) ( to have property consisting of at ) in your district. Subject to the provisions of the Revenue Recovery Act, 1890, the said sum is recoverable by you as if it were an arrear of land revenue which had accrued in your own district, and you are hereby desired so to recover it and to remit it to my office at A. B., Collector of Date: 05-09-2024 4 Sec. 11 added by the Revenue Recovery (Amdt.) Act, 1950 (56 of 1950), s.2."
}