{
  "file": "administrator845215725b052c222802dd5c9b149092.pdf",
  "law_name": "The Kazis Act, 1880",
  "text": "THE KAZIS ACT, 1880 CONTNETS 1. Short title Local extent 2. Power to appoint Kazis for any local area 3. Naib Kazis 4. Nothing in act to confer judicial or administrative powers; or to render the presence of Kazi necessary; or to prevent any one acting as Kazi THE KAZIS ACT, 1880 1ACT No. XII OF 1880 [9th July, 1880] An Act for the appointment of persons to the office of Kazi WHEREAS by the preamble to Act No. XI of 1864 2(An Act to repeal the law relating to the offices of Hindu and Muhammadan Law Officers and to the offices of Kazi-ul-Kuzaat and of Kazi, and to abolish the former offices) it was (among other things) declared that it was inexpedient that the appointment of the Kazi-ul-Kuzaat, or of City, Town of Pargana Kazis, should be made by the Government, and by the same Act the enactments relating to the appointment by the Government of the said officers were repealed; and whereas by the usage of the Muhammadan community in some parts of 3[Pakistan] the presence of Kazis appointed by the Government is required at the celebration of marriages and the performance of certain other rites and ceremonies, and it is therefore expedient that the Government should again be empowered to appoint persons to the office of Kazi; It is hereby enacted as follows:__ 1. Short title. This Act may be called the Kazis Act, 1880; 4* * * * * * * Local Extent. 5* * * 6[The] 7[Provincial Government] may from time to time, by notification in the official Gazette, extend it to the whole or any part of the territories under its adniinistration8. 2. Power to appoint Kazis for any local area. Wherever it appears to the 7[Provincial Government] that any considerable number of the 9[Muslims] resident in any local area desire that one or more Kazis should be appointed for such local area, the 5[Provincial Government] may, if it thinks fit, after consulting the principal 10[Muslim] residents of such local area, select one or more fit persons and appoint him or them to be Kazis for such local area. If any question arises whether any person has been rightly appointed Kazi under this section, the decision thereof by the 7[Provincial Government] shall be conclusive. The 7[Provincial Government] may, if it thinks fit, suspend or remove any Kazi appointed under this section who is guilty of any misconduct in the execution of his office, or who is for a continuous period of six months absent from the local area for which he is appointed, or leaves such local area for the purpose of residing elsewhere, or is declared an insolvent, or desires to be discharged from the office, or who refuses or becomes in the opinion of the 7[Provincial Government] unfit, or personally incapable, to discharge the duties of the office. 1For Statement of Objects and Reasons, see Gazette of India, 1880 Pt. V., p.21 ; for the Report of the Select Committee, see ibid. Pt. V., p. 203 ; for discussions in Council, see ibid., Supplement, pp. 345, 356 and 1203. This Act has been repealed to the extent of Islamabad Capital Territory see Ordinance No. 27 of 1981, s. 4 and 3rd Sch. 2Rep. by the Repealing Act, 1868 (8 of 1868). 3Subs. by the Central Laws (Statute Reform) Ordinance, 1960 (21 of 1960), s. 3 and 2nd Sch (with effect from the 14th October, 1955), for “the Provinces and the Capital of the Federation” which had been subs. by A.O., 1949, Arts. 3 (2) and 4, for “British India”. 4The words “and it shall come into force at once” rep. by the Repealing and Amending Act, 1914 (10 of 1914). 5The words “It extends, in the first instance, only to the territories administered by the Governor of Fort Saint George in Council. But’ omitted by A. O., 1949, Sch. 6Subs. ibid., for “any other”. 7Subs. by A.O., 1937, for “L. G”. 8The Act has been extended to certain places in the Punjab, see local Rules and orders. 9Subs. by F.A.O., 1975, Art. 2 and Table, for “Muhammadans”. 10Subs. ibid., for “Muhammadan”. 3. Naib Kazis. Any Kazi appointed under this Act may appoint one or more persons as his naib or naibs to act in his place in all or any of the matters appertaining to his office throughout the whole or in any portion of the local area for which he is appointed, and may suspend or remove any naib so appointed. When any Kazi is suspended or removed under section 2, his naib or naibs (if any) shall be deemed to be suspended or removed, as the case may be. 4. Nothing in act to confer judicial or administrative powers; or to render the presence of Kazi necessary; or to prevent any one acting as Kazi. Nothing herein contained, and no appointment made hereunder, shall be deemed— (a) to confer any judicial or administrative powers on any Kazi or Naib Kazi appointed hereunder; or (b) to render the presence of a Kazi or Naib Kazi necessary at the celebration of any marriage or the performance of any rite or ceremony; or (c) to prevent any person discharging any of the functions of a Kazi. __________ Date: 16-09-2024"
}