{
  "file": "administrator10b09c34cfd7e31b03898bd6ec49dfe9.pdf",
  "law_name": "The Securities Act, 1920",
  "text": "THE SECURITIES ACT, 1920 CONTENTS 1. Short title, extent and commencement 2. Definitions 3. Notice of trust not receivable save as provided 4. Right of survivors of joint or several payees of Government securities 5. Indorsements to be made on security itself 6. Holding of Government securities by holders of public offices. 7. Issue of securities to rulers of Acceding States or non Acceding States 8. Indorser of Government security not liable for amount therof 9. Impression of signature on Government securities ISSUE OF DUPLICATE, RENEWED, CONVERTED, CONSOLIDATED OR SUB-DIVIDED SECURITIES 10. Issue of duplicate securities 11. Renewal of bearer bonds 12. Renewal of promissory notes 13. Renewal of promissory notes in case of dispute as to title 14. Renewal of other securities 15. Issue of converted, etc., securities 16. Liability in respect of promissory note renewed, etc. DISCHARGE 17. Immediate discharge in certain case 18. Discharge in other cases 18A. Discharge in respect of interest SUMMARY PROCEDURE IN CERTAIN CASES 19. Procedure on death of holder of securities SECURITIES HELD BY MINORS AND LUNATICS 20. Payment in case of securities held by minors and lunatics INDEMNITY 21. Indemnity INSPECTION OF REGISTERS, BOOKS AND DOCUMENTS 22. Inspection of documents PENALTY 23. Penalty RULES 24. Power to make rules 25. [Repealed.] 26. Provision as to Pakistan securities THE SECURITIES ACT, 1920 1ACT NO. X OF 1920 [11th March, 1920] An Act to consolidate and amend the law relating to Government securities. WHEREAS it is expedient to consolidate and amend the law relating to Government securities; It is hereby enacted as follows:- 1. Short title, extent and commencement.___(1) This Act may be called the 2* Securities Act, 1920; 3[(2) It extends to the whole of Pakistan]; and (3) It shall come into force on the first day of April, 1920. 2. Definitions. In this Act, unless there is anything repugnant in the subject or context,- (a) “Government security” means promissory notes (including treasury bills), stock-certificates, bearer bonds and all other securities issued by the 4[Federal Government] or by any 5[Provincial Government] in respect of any loan contracted either be or after the passing of this Act, but does not include currency note; and (b) “prescribed” means prescribed by rules made under this Act: 6[(c) “the Government ”or “Government” in relation to any loan or security, means the Government raising the loan or issuing the security.] 3. Notice of trust not receivable save as provided.___ (1) Save as otherwise provided in or under this Act, no notice of any trust in respect of any Government security shall be receivable by the Government. 1For Statement of Objects and Reasons, see Gazette of India, Extraordinary, dated the 29th October, 1919, p. 529; for Report of Select committee, see Gazette of India, 1920, Pt. V, p. 39; and for Proceedings in council, see ibid., 1920, Pt. VI, p. 734. This Act does not apply to Government securities to which the Public Debt (Central Government) Act, 1944 (18 of 1944) applies, and to all matters for which provision is made by that Act, see s. 29 of the said Act. It has been extended to the Leased Areas of Balochistan, see the Leased Areas (Laws) Order, 1950 (G.G.O 3 of 1950); and also applied in the Federated Areas of Balochistan, see Gazette of India, 1937, Pt. I, p. 1499. It has been extended to:- (i) the Balochistan States Union by the Balochistan States Union (Federal Laws) (Extension) Order, 1953 (G.G.O 4 of 1953), as amended; (ii) Khairpur State, by the Khairpur (Federal Laws) (Extension) Order, 1953 (G.G.O. 5 of 1953), as amended. The Act has been and shall be deemed to have been brought into force in Gwadur (with effect from the 8th September, 1958), by the Gwadur (Application of Central Laws) Ordinance, 1960 (37 of 1960) s. 2. 2The word “Indian” omitted by A.O., 1949. 3 Subs. by the Central Laws (Statue Reform) Ordinance, 1960 (21 of 1960), s. 3 and 2nd Sch. (with effect from the 14th October, 1955), for sub-section (2) as amended by A.O., 1949 and the Federal Laws (Revision and Declaration) Act, 1951 (26 of 1951), s. 8. 4Subs. by F.A.O., 1975, Art. 2 and Table, for “Central Government”, which was previously amended by A.O., 1937, for “G.G. in C.”. 5Subs. by A.O., 1937, for “L.G.,” 6Clause (c) ins., ibid. (2) The Government shall not be deemed to have received notice of any trust by reason only of the fact that it has recognised an endorsement on a Government security by an executor or administrator as such, nor shall it inquire into the terms of any will by which such executor or administrator may be bound, but, on being satisfied of the due appointment of such executor or administrator, it shall be entitled to treat him as the full owner of any Government security belonging to the estate of the person whom he represents. 4. Right of survivors of joint or several payees of Government securities.___(1) Notwithstanding anything in section 45 of the Contract Act, 1872 (IX of 1872),___ (a) when a Government security is payable to two or more persons jointly, and either or any of them dies, the security shall be payable to the survivor or survivors of those persons, and (b) when a Government security is payable to two or more persons severally, and either or any of them dies, the security shall be payable to the survivor or survivors of those persons, or to the representative of the deceased, or to any of them. (2) This section shall apply whether such death occurred or occurs before or after this Act comes into force. (3) Nothing herein contained shall affect any claim which any representatives of a deceased person may have against the survivor or survivors under or in respect of any security to which sub- section (1) applies. 1[(4) For the purposes of this section, a body incorporated under the Companies Act, 1913 (VII of 1913), or the Co-operative Societies Act, 1912 (II of 1912), or any other enactment for the time being in force whether within or without 2[Pakistan], relating to the incorporation of associations of individuals, shall be deemed to die when it is dissolved.] 5. Indorsements to be made on security itself. Notwithstanding anything in section 15 of the Negotiable Instruments Act, 1881 (XXVI of 1881), no indorsement of a Government promissory note shall be valid unless made by the signature of the holder inscribed on the back of the security itself. 6. Holding of Government securities by holders of public offices.___ (1) In the case of any public office to which the 3[Government] may, by 4notification in the 5[official Gazette], declare 6this sub-section to apply, a Government security may be made or indorsed payable to or to the order of the holder of the office by the name of the office. (2) When a Government security is made or indorsed as aforesaid, it shall be deemed to be transferred without any or further indorsement from each holder of the office to the succeeding holder of the office on and from the date on which the latter takes charge of the office. 1Sub-section (4) ins. by the Indian Securities (Amdt.) Act, 1928 (2 of 1928), s. 2. 2Subs. by the Central Laws (Statue Reform) Ordinance, 1960 (21 of 1960), s. 3 and 2nd Sch. (with effect from the 14th October, 1955), for “the Provinces and the Capital of the Federation” which had been subs. by A.O., 1949, for “British India”. 3Subs. by A.O., 1937, for “G.G. in C.”. 4For such notification in respect of, - (i) N.W.F.P., see N.W.F.P Government Gazette, 1952, Pt. I, pp. 300-302; (ii) Sind, see Sind Government Gazette, 1954, Pt. I. pp. 66-68. 5Subs. by A.O., 1937, for “Gazette of India”. 6For offices to which this sub-sectionn has been applied, see Gen. R. & O. (3) When the holder of the office indorses to a third party a Government security made or indorsed as aforesaid, he shall subscribe the indorsement with his name and the name of the office. (4) A writing on a Government security now or heretofore standing in the name of the holder of a public office, whereby the security has been or was made or indorsed payable to or to the order of the holder of the office by the name of the office, shall not be deemed to be or to have been invalid by reason only of the security having been so made or indorsed. (5) This section applies as well to an office of which there are two or more joint holders as to an office of which there is a single holder. 1[7. Issue of securities to rulers of Acceding States or non Acceding States].___Omitted by the Federal Laws (Revision and Declaration) Ordinance, 1981 (XXVll of 1981), s. 3 and Sch. II. 8. Indorser of Government security not liable for amount therof. Notwithstanding anything in the Negotiable Instruments Act, 1881 (XXVI of 1881), a person shall not, by reason only of his having indorsed a Government security, be liable to pay any money due, either as principal or as interest, thereunder. 9. Impression of signature on Government securities.___ (1) The signature of the person authorised to sign Government securities on behalf of the Government may be printed, engraved or lithographed, or impressed by such other mechanical process as the 2[Government] may direct, on the securities. (2) A signature so printed, engraved, lithographed or otherwise impressed shall be as valid as if it had been inscribed in the proper handwriting of the person so authorised. ISSUE OF DUPLICATE, RENEWED, CONVERTED, CONSOLIDATED OR SUB-DIVIDED SECURITIES. 10. Issue of duplicate securities.___ (1) When a Government security is alleged to have been lost, 3[stolen] or destroyed either wholly or in part, and a person claims to be the person to whom but for the loss, 3[theft] or destruction it would be payable, he may, on application to the prescribed 4[authority], and on producing proof to 5[its] satisfaction of the loss, 3[theft] or destruction and of the justice of the claim and on payment of the prescribed fee, if any, obtain from 6[it] an order for___ (a) the payment of interest in respect of the security said to be lost, 3[stolen] or destroyed pending the issue of a duplicate security ; and (b) the issue of a duplicate security payable to the applicant. (2) An order shall not be passed under sub-section (1) until after the issue of the prescribed notification of the loss, 3[theft] or destruction. (3) A list of the securities in respect of which an order is passed under sub-section (1) shall be published in the prescribed manner. 1This section was previously amended by various enactments from time to time. 2Subs. by A.O., 1937, for “G.G. in C.”. 3Ins. by the Indian Securities (Amdt.) Act, 1927 (21 of 1927), s. 2. 4Subs. by the Indian Securities (Amdt.) Act, 1937 (28 of 1937), s. 2, for “officer”. 5Subs. ibid., for “his”. 6Subs. ibid., for “him”. 1[(4) If at any time before the Government becomes discharged under the provisions of this Act from liability in respect of any security the whole of which is alleged to have been lost, stolen or destroyed, such security is found, any order passed in respect thereof under this section shall be cancelled.] 11. Renewal of bearer bonds. The holder of a bearer bond or other Government security payable to bearer may, on application to the prescribed 2[authority], on delivery of the bearer bond or other security and on payment of the prescribed fee, if any, obtain from such 2[authority] a renewed bearer bond or other security, as the case may be. 12. Renewal of promissory notes. Subject to the provisions of section 13, a person claiming to be entitled to a Government promissory note, may, on applying to the prescribed 2[authority], and on satisfying 3[it] of the justice of his claim and delivering the promissory note receipted in the prescribed manner, and paying the prescribed fee, if any, obtain from such 2[authority] a renewed promissory note payable to him: Provided that, when application is made for the renewal of a Government promissory note which appears to the prescribed 2[authority] to stand in the name of a deceased member of a Hindu undivided family governed by the Mitakshara law, a renewed promissory note shall not be issued to the applicant unless he furnishes a certificate signed by such authority and after such inquiry as may be prescribed to the effect that the deceased belonged to a Hindu undivided family governed by the Mitakshara law, that the promissory note formed part of the joint property of the family, and that the applicant is the managing or sole surviving male member of the family. 4* * * * * * * 13. Renewal of promissory notes in case of dispute as to title.___(1) Where there is a dispute as to the title to a Government promissory note in respect of which an application for renewal has been made, the prescribed 2[authority] may- (a) where any party to the dispute has obtained a final decision from a Court of competent jurisdiction declaring him to be entitled to such note, issue a renewed note in favour of such party, or (b) refuse to renew the note until such a decision has been obtained, or (c) after such inquiry as is hereinafter provided and consideration of the result thereof, declare by order in writing which of the parties is in 5[its] opinion entitled to such note and may, after the expiration of three months from the date of such declaration, issue a renewed note in favour of such party in accordance with the provisions of section 12, unless within that period 6[it] has received notice that proceedings have been instituted by any person in a Court of competent jurisdiction for the purpose of establishing a title to such note. Explanation.-For the purposes of this sub-section the expression “final decision” means a decision which is not appealable or a decision which is appealable but against which no appeal has been filed within the period of limitation allowed by law. 1Ins. by the Indian Securities (Amdt.) Act, 1927 (21 of 1927), s. 2. 2Subs. by the Indian Securities (Amdt.) Act, 1937 (28 of 1937), ss. 3, 4 and 5, for “officer”. 3Subs. ibid., s.4, for “him”. 4 Explanation to s. 12 rep. by the Federal Laws (Revision and Declaration) Act, 1951 (26 of 1951), s. 3 and Sch. II. 5 Subs. ibid., s. 5, for “his”. 6Subs. ibid., for “he”. (2) For the purpose of the inquiry referred to in sub-section (1), the prescribed 1[authority] may 2[direct one of its officers to] record, or may request the District Magistrate to record or to have recorded, the whole or any part of such evidence as the parties may produce. When such request has been made to the District Magistrate, such Magistrate may himself record or may direct any Magistrate of the first-class subordinate to him, or any Magistrate of the second-class subordinate to him and empowered by general or special order of the 3[Government] in this behalf, to record the evidence, and shall forward a copy thereof to the prescribed 1[authority]. Explanation.- For the purposes of this sub-section, the District Magistrate means the District Magistrate having jurisdiction in the place where interest on the promissory note is payable 4* * *. (3) 5[The officer of the prescribed authority] or any Magistrate acting under this section may, if he thinks fit, record evidence on oath. 14. Renewal of other securities. Government securities other than those mentioned in sections 11 and 12 may be renewed in such circumstances and in such manner as may be prescribed. 15. Issue of converted, etc., securities.___(1) The prescribed 1[authority] may, subject to such conditions as may be prescribed, on the application of a person claiming to be entitled to a Government security or securities, on being satisfied of the justice of the claim and on delivery of the security or securities receipted in the prescribed manner and on payment of the prescribed fee, if any, convert, consolidate or subdivide the security or securities, and issue to the applicant a new security or securities accordingly. (2) The conversion, consolidation or sub-division referred to in sub-section (1) may be into a security or securities of the same or different classes or of the same or different loans. 16. Liability in respect of promissory note renewed, etc.___(1) When a renewed Government promissory note has been issued under section 12, or a new Government promissory note has been issued upon conversion, consolidation or subdivision under section 15, in favour of any person, the note so issued shall be deemed to constitute a new contract between the Government and such person and all persons deriving title thereafter through him. (2) No such renewal, conversion, consolidation or sub-division shall affect the rights as against the Government of any other person to the security or securities so renewed, converted, consolidated or sub-divided. DISCHARGE 17. Immediate discharge in certain case. On payment by or on behalf of the Government to the holder of a bearer bond or other Government security payable to bearer of the amount expressed therein on or after the date when it becomes due, or on renewal of a bearer bond or other security payable to bearer under section 11, or on renewal of a Government promissory note under section 13, or on conversion, consolidation or sub-division of a bearer bond or other security payable to bearer under section 15, the Government shall be discharged in the same way and to the same extent as if such bearer bond, promissory note or other security were a promissory note payable to bearer: 1Subs. by the Indian Securities (Amdt.) Act, 1937 (28 of 1937), ss. 3, 4 and 5, for “officer”. 2Subs. ibid., for “himself”. 3Subs. by A.O., 1937, for “L.G.”. 4Certain words omitted by the Federal Laws (Revision and Declaration) Ordinance, 1981 (27 of 1981), s. 3 and Sch. II, which were previously amended by various enactments. 5Subs. by Act, 28 of 1937, s. 5, for “The Prescribed officer”. Provided that, in the case of a Government promissory note renewed under section 13, nothing in this section shall be deemed to bar a claim against the Government in respect of such note by any person who had no notice of the proceedings under that section, or who derives title through any such person. 18. Discharge in other cases. Save as otherwise provided in this Act___ (i) on payment of the amount due on a Government security on or after the date on which payment becomes due, or (ii) when a duplicate security has been issued under section 10, or (iii) when a renewed security has been issued under section 12 or section 13, or a new security or securities has or have been issued upon conversion, consolidation or sub-division under section 15, the Government shall be discharged from all liability in respect of the security or securities so paid or in place of which a duplicate, renewed, or new security or securities has or have been issued___ (a) in the case of payment-after the lapse of six years from the date on which payment was due ; (b) in the case of a duplicate security-after the lapse of six years from the date of the publication under subsection (3) of section 10 of the list in which the security is first mentioned, or from the date of the last payment of interest on the original security, whichever date is later ; (c) in the case of a renewed security or of a new security issued upon conversion, consolidation or sub-division after the lapse of six years from the date of the issue thereof. 1[18A. Discharge in respect of interest. Save as otherwise expressly provided in the terms of a Government security, no person shall be entitled to claim interest on any such security in respect of any period which has elapsed after the earliest date on which demand could have been made for the payment of the amount due on such security.] SUMMARY PROCEDURE IN CERTAIN CASES 19. Procedure on death of holder of securities 2* * *.___ (1) If within six months of the death of a person who was entitled to a Government security or securities (other than a security payable to bearer) the nominal or face value of which does not in the aggregate exceed five thousand rupees 3[or, in the case of Post Office Savings Certificates, twenty-five thousand rupees], probate of the will or letters of administration of the estate of such person or a certificate granted under the 4[Succession Act, 1925 (XXXIX of 1925)] is not produced to the prescribed 5[authority], such 5[authority] may, after inquiry in the manner provided in sub-sections (2) and (3) of section 13, determine who is the person entitled to the security or securities or to administer the estate of the deceased, and may- 1S. 18A ins. by the Indian Securities (Amdt.) Act, 1927 (21 of 1927), s. 3. 2The words “not exceeding an aggregate value of five thousand rupees” omitted by the Government Savings Bank and Securities Laws (Amdt.) Act, 1958 (42 of 1958), s. 2 and Sch. (with effect from the 1st March, 1960). 3Ins. ibid. (with effect from the 1st March, 1960). 4Subs. by the Federal Laws (Revision and Declaration) Ordinance, 1981 (27 of 1981), s. 3 and Sch., II. For “Succession Certificate Act, 1889”. 5Subs. by the Indian Securities (Amdt.) Act, 1937 (28 of 1937), s. 6, for “officer”. (a) in the case of any such security relating to a loan due for repayment, authorise payment of the amount due thereon to such person ; and (b) in the case of any such security relating to a loan not due for repayment, authorise, in the case of a promissory not, the renewal of such promissory note in favour of such person, or, in the case of stock, the registration of the name of such person in substitution for the name of the deceased. (2) Upon the payment or renewal of any promissory note in accordance with sub-section (1), the Government shall be discharged from all liability in respect of the note so paid or renewed ; and any substitution of names made in accordance with clause (b) of sub-section (1) shall, for the purposes of any claim against the Government, be deemed to have effected a valid transfer of the stock in respect of which it was made. (3) Any creditor or claimant against the estate of the deceased may recover his debt or claim out of money paid to any person under sub-section (1) and remaining in his hands unadministered in the same manner and to the same extent as if the said person had obtained letters of administration of the state of the deceased, and nothing in this section shall affect any claim of an executor or administrator or other representative of the deceased against such person other than a claim to recover amounts lawfully paid by him in due course of administration of the estate of the deceased. SECURITIES HELD BY MINORS AND LUNATICS 20. Payment in case of securities held by minors and lunatics. Where a Government security stands in the name of or is held by a minor or a person who is insane and incapable of managing his affairs, the interest accruing thereon, or the capital sum payable in respect thereof on the maturity or discharge of the loan, shall, where, in the case of interest payable, the nominal value of the security, or in other cases the sum payable, does not exceed five thousand rupees, be paid in such manner as may be prescribed, and on any payment being so made, the Government shall, notwithstanding any provision of any enactment to the contrary, be discharged from all liability in respect thereof. INDEMNITY 21. Indemnity. Notwithstanding anything in section 10, 12, 13 or 15, the prescribed 1[authority] may in any case arising under any of those sections- (i) Issue a duplicate or renewed security or convert, consolidate or sub divide a security or securities upon the applicant giving the prescribed indemnity against the claims of all persons claiming under the original security or under the security or securities so renewed ; converted, consolidated or sub-divided, as the case may be, or (ii) refuse to issue a duplicate or renewed security or to convert consolidate or sub- divide a security or securities unless such indemnity is given. INSPECTION OF REGISTERS, BOOKS AND DOCUMENTS 1Subs. by the Indian Securities (Amdt.) Act, 1937 (28 of 1937), s. 6, for “officer”. 22. Inspection of documents. No person shall be entitled to inspect, or to receive information derived from, any Government security in the possession of the Government or from any book, register or other document kept or maintained by or on behalf of Government in relation to Government securities or any Government security, save in such circumstances and manner and subject to such conditions as may be prescribed. PENALTY 23. Penalty.___(1) If any person, for the purpose of obtaining for himself or for any other person payment of interest or of the capital sum due in respect of any Government security, or the issue of a duplicate security, or the renewal, conversion, consolidation or sub-division of a Government security or securities, makes to any authority under this Act a statement which is false and which he either knows to be false or does not believe to be true, he shall be punishable with imprisonment for a term which may extend to six months, or with fine, or with both. (2) No Court shall take cognizance of any offence under subsection (1) save on the complaint of the authority to whom the false statement was made. RULES 24. Power to make rule.___(1) The 1[Government] may after previous publication make rules2 to carry out the purposes of this Act. (2) In particular and without prejudice to the generality of the foregoing power, such rules may provide for all or any of the following matters, namely:- (a) the manner in which payment of interest in respect of Government securities is to be made and acknowledged; (b) the circumstances in which Government securities must be renewed before further payment of interest thereon can be claimed; 3* * * * * * (d) the fees to be paid in respect of the issue of duplicate securities and of the renewal, conversion, consolidation and sub-division of Government securities ; (e) the proof which is to be produced by persons applying for duplicate securities; (f) the form and manner of publication of the notification mentioned in sub-section (2) of section 10 and the manner of publication of the list mentioned in subsection (3) of that section ; (g) the 4[authority which] is to exercise all or any of the powers and to perform all or any of the duties referred to in sections 10, 11, 12, 13, 15, 19 and 21; 1Subs. by A.O., 1937, for “G.G. in C.”. 2For such rules, see Gen. R. & O. 3Clause (c) omitted by the Federal Laws (Revision and Declaration) Ordinance, 1981 (27 of 1981), s. 3 and Sch., II., which was previously amended by A.O., 1949, for “States in India”. 4Subs. by the Indian Securities (Amdt.) Act, 1937 (28 of 1937), s. 7, for “officer who”. (h) the manner of making the inquiry mentioned in the proviso to section 12; (i) the circumstances and the manner in which securities other than securities payable to bearer or promissory notes are to be renewed ; (j) the form in which securities delivered for discharge, renewal, conversion, consolidation or sub-division are to be receipted ; (k) the conditions subject to which securities may be converted, consolidated or sub-divided ; (l) the person to whom and the manner in which payments are to be made in respect of Government securities standing in the name of, or held by, minors or persons who are insane and incapable of managing their affairs ; (m) the taking of indemnities against adverse claims of third parties from persons who receive payment of interest or of the capital sum due in respect of Government securities, or who obtain duplicate, renewed, converted, consolidated or sub-divided securities ; (n) the manner in which any document relating to Government securities or any indorsement on a Government promissory note may, on the demand of any person who from any cause is unable to write, be executed on his behalf ; (o) enabling holders of Government stock to be described in the registers of such stock as trustees, and either as trustees of any particular trust or as trustees without qualification, and for the recognition of powers of attorney granted by holders of stock so described ; (p) the holding of Government stock by the holders of offices other than public offices, and the manner in which and the conditions subject to which stock so held may be transferred ; (q) the mode of attestation of documents relating to Government stock ; (r) generally, all matters connected with the grant of duplicate, renewed, converted, consolidated and sub-divided securities ; and (s) the circumstances and the manner in which and the conditions subject to which inspection of securities, books, registers and other documents may be allowed or information therefrom may be given under section 22. (3) Nothing in any rule made under clauses (o) and (p) shall, as between any trustees or as between any trustees and the beneficiaries under a trust, be deemed to authorise the trustees to act otherwise than in accordance with the rules of law applying to the trust and the terms of the instrument constituting the trust ; and neither the Government nor any person holding or acquiring any interest in any Government stock shall by reason only of any entry in any register maintained by or on behalf of the Government in relation to any Government stock or any stockholder, or of anything in any document relating to Government stock, be affected with notice of any trust or of the fiduciary character of any stockholder or of any fiduciary obligation attaching to the holding of any Government Stock. (4) Rules made under this section shall be published in the 1[official Gazette], and shall thereupon have effect as if enacted in this Act. 25. [Repeals.] Rep. by the Repealing Act, 1927 (XII of 1927), s. 2 and Schedule. 2[26. Provision as to Pakistan securities. For the avoidance of doubt it is hereby declared that the rights of all persons in relation to 3[Pakistan] securities are to be determined, in connection with all such questions as are dealt with by this Act in relation to Government securities, by the law of 4[Pakistan].] ___________ Date: 11-09-2024 1Subs. by A.O., 1937, for “Gazette of India”. 2Section 26 ins. ibid. 3Subs. by A.O., 1949, for “Indian”. 4Subs. by the Central Laws (Statue Reform) Ordinance, 1960 (21 of 1960), s. 3 and 2nd Sch. (with effect from the 14th October, 1955), for “the Provinces and the Capital of the Federation” which had been subs. by A.O., 1949, for “British India"
}