{
  "file": "administratorbdccd7d3e7e218ad92ac90d69dee703a.pdf",
  "law_name": "The Corporate And Industrial Restructuring Corporation Ordinance, 2000",
  "text": "THE CORPORATE AND INDUSTRIAL RESTRUCTURING CORPORATION ORDINANCE, 2000 CONTENTS ___________ CHAPTER I PRELIMINARY SECTIONS: 1. Short title, extent and commencement. 2. Definitions. 3. Ordinance not to derogate from other laws. CHAPTER II ESTABLISHMENT OF THE CORPORATION AND THE BOARD 4. Establishment of the Corporation. 5. Board and its powers. 6. Composition of the Board. 7. Chairman of the Board. 8. Chief Executive of the Corporation. 9. Committees. 10. Verification Committees. 11. Guidelines for Corporation and the Governor State Bank. Updated till 7.10.2022 SECTIONS: 12. Administration Committee. 13. Members, officers and servants of the Corporation. 14. Meeting of the Board and the Administration Committee. 15. Qualifications and disqualifications of directors. 16. Employees of the Corporation to be public servants. 17. Indemnity of members, directors, officers or servants. CHAPTER III POWERS AND FUNCTIONS OF THE CORPORATION 18. Business which the Corporation can transact. 19. Corporation not to be a banking company. 20. Financial institutions to which the provisions of this Ordinance shall apply. 21. Consideration for transfer of non-performing assets. 22. Bonds issued by the Corporation. 23. Certain rights and remedies. 24. Powers of the Corporation to seek assistance. CHAPTER IV FINANCE 25. Corporation Fund. 26. Accounts and audit. 27. Reserve Fund. CHAPTER V BUDGET STATEMENT AND ANNUAL REPORT 28. Budget statement. 29. Annual report to the Federal Government. CHAPTER VI RULES AND REGULATIONS 30. Power of Federal Government to make rules. 31. Power of the Board to make regulations. CHAPTER VII RIGHTS AND REMEDIES OF CORPORATION SECTIONS: 32. Rights and remedies available to Corporation. 33. Rights and remedies not exhaustive. 34. Exemption from taxes. 35. Liquidation of the Corporation. CHAPTER VIII GENERAL 36. Limitation of liability.. 37. Right of recovery as arrears of land revenue. 38. Power to obtain information and documents etc. 39. Removal of difficulties. SCHEDULE. THE CORPORATE AND INDUSTRIAL RESTRUCTURING CORPORATION ORDINANCE, 2000 ORDINANCE NO. L OF 2000 22nd September, 2000 AN ORDINANCE to make provisions for the acquisition, restructuring, rehabilitation, management, disposition and realization of non-performing loans and other assets of various banks and financial institutions WHEREAS it is expedient, in the public interest, to deal with financial institutions and their assets, to assist the business sector by dealing with distressed enterprises and to promote the rehabilitation of the national economy by making provisions for the acquisition, restructuring, rehabilitation, management, disposition and realization of non-performing loans and other assets of various banks and financial institutions and for matters ancillary or incidental thereto; AND WHEREAS, the National Assembly and the Senate stand suspended in pursuance of the Proclamation of the Fourteenth day of October, 1999 and the Provisional Constitution Order No. 1 of 1999; AND WHEREAS, the President is satisfied that circumstances exist which render it necessary to take immediate action; NOW, THEREFORE, in pursuance of the Proclamation of Emergency of the fourteenth day of October, 1999, and Provisional Constitution Order No. 1 of 1999, as well as Order No. 9 of 1999, and in exercise of all powers enabling him in that behalf, the President of the Islamic Republic of Pakistan is pleased to make and promulgate the following Ordinance:— CHAPTER I. — PRELIMINARY 1. Short title, extent and commencement.—(1) This Ordinance may be called the Corporate and Industrial Restructuring Corporation Ordinance, 2000. (2) It extends to the whole of Pakistan. (3) It shall come into force at once. 2. Definitions.—In this Ordinance, unless there is anything repugnant in the subject or context,— (a) “Administration Committee” means the administration committee established under section 12; (b) “Board” means the Board of directors constituted under section 6; (c) “bonds” mean bonds, debentures, participation term certificates, term finance certificates, redeemable capital certificates or similar instruments providing for scheduled or contingent payment of debt obligations; (d) “book value” means the rupee amount, inclusive of principal and accrued profit, owed by any obligor in connection with any financial asset as reflected on the books and records of the financial institution, as of the transfer date; (e) “Chairman” means the chairman of the Board; (f) “Chief Executive” means the Chief Executive Officer of the Corporation; (g) “collateral” means any asset, property, right, claim, entitlement, share, undertaking, guarantee, agreement, document or instrument, security interest, charge, mortgage, lien, hypothecation, pledge or assignment in respect of or as security for any financial asset; (h) “Commission” means the Securities and Exchange Commission of Pakistan established under section 3 of the Securities and Exchange Commission of Pakistan Act, 1997 (XLII of 1997); (i) “Corporation” means the Corporate and Industrial Restructuring Corporation established under section 4; (j) “director” means a director of the Board; (k) “financial asset” means any short, medium or long term interest and non-interest bearing loan, finance, advance, lease, installment, term finance certificate, participation term certificate, musharaka, modaraba, profit and loss sharing agreement, redeemable capital, guarantee or contractual right to receive payment of money in respect of sums advanced or committed to an obligor by a financial institution including collateral pertaining thereto; 1[(l) “Financial Institution” means any bank or other financial institution operating in Pakistan wherein the Federal Government holds any equity.] (m) “Government entity” means any Ministry, Division, Department or office of the Federal Government or any corporation, company, trust, statutory body or other entity of which more than fifty per cent of the equity or beneficial interest is directly or indirectly owned or controlled by the Federal Government; (n) “non-performing asset” means any financial asset: (a) which is held as an asset on the books of a financial institution; (b) with respect to which the obligor has been in arrears on any payment obligation for a period more than three hundred and sixty-five days, including— _________________________________________________________________________________________________________________________ 1Subs. by the Corporate and Industrial Restructuring Corporation (Amdt.) Act, 2005 (3 of 2005) s. 2 for clause (1). (i) collateral with respect to any financial asset; and (ii) a whole or partial right or interest of a financial institution in any financial asset, that otherwise constitutes a non-performing asset including a financial asset with respect to which the financial institution has an ongoing funding obligation; and 1[(c) with respect to which the obligor’s outstanding payment obligation to any financial institution exceeds thirty million rupees: Provided that the Federal Government may, by notification in the official Gazette, alter, reduce or increase the said amount as and when it deems fit.] (o) “obligor” means any individual, proprietorship concern, company or other body corporate, trust, partnership or other entity that has, with respect to a non-performing asset, a contractual or legal obligation or duty to make payment, effect performance, provide security, or collateral with respect to any financial asset whether as principal, surety, guarantor or otherwise and whether such obligation is primary, secondary, matured or contingent; (p) “ outstanding amount” means the book value of a non-performing asset of the financial institution less, — (a) any amount on the books of the financial institution appearing as a specific reserve applicable to that non-performing asset; (b) any amount on the books of the financial institution appearing in a general loan loss and/or other reserve applicable to that non-performing asset; and if, in the opinion of the Board, the book value of the non-performing asset, as adjusted in sub-clauses (a) and (b), is higher than the estimated market price of the non-performing asset, the Board shall commission an independent evaluator to determine such market price and in the event that the market price as determined by the independent evaluator is lower than the book value as adjusted in sub-clauses (a) and (b), such market price shall be deemed to be the outstanding amount; (q) “regulations” means regulations made under this Ordinance; (r) “rules” means rules made under this Ordinance; (s) “Schedule” means the Schedule to this Ordinance; and (t) “State Bank” means the State Bank of Pakistan. ________________________________________________________________________________ 1Subs. by the Corporate and Industrial Restructuring Corporation (Amdt.) Ordinance, 2000 (57 of 2000) s. 2 for the original sub-clause (c). 3. Ordinance not to derogate from other laws.—The provisions of this Ordinance shall be in addition to and save as hereinafter provided, not in derogation of any other law for the time being in force. __________ CHAPTER II. — ESTABLISHMENT OF THE CORPORATION AND THE BOARD 4. Establishment of the Corporation.—(1) A corporation called the Corporate and Industrial Restructuring Corporation is hereby established for carrying out the purposes of this ordinance. (2) The Corporation shall be a body corporate having a common seal, with powers, subject to the provisions of the Ordinance, to hold and dispose of property and shall by its name sue and be sued. (3) The headquarters of the Corporation shall be at Islamabad or such other place as may be determined by the Board. 5. Board and its Powers.—(1) The overall direction, management, control and superintendence of the affairs of the Corporation shall vest in the Board which may exercise all such powers and do all such acts and things as may be exercised and done by the Corporation as set out in section 18. (2) In discharging its functions, the Board shall act with prudence and sound business and financial considerations for and on behalf of all persons who have beneficial interest as creditors or otherwise are beneficiaries, including the financial institutions and Government entity. 6. Composition of the Board.—(1) The Board shall consist of the following directors, namely:— (a) the Minister for Finance, Government of Pakistan; 1[(b) the Minister of Commerce, Government of Pakistan; (bb) the Minister of Industries, Government of Pakistan;] (c) the Governor, State Bank of Pakistan; (d) the Chairman, Privatization Commission of Pakistan; 1[(e) the Finance Secretary, Ministry of Finance;] (f) the Chief Executive as defined in clause (f) section 2; and _________________________________________________________________________________ 1Subs. by the Corporate and Industrial Restructuring Corporation (Amdt.) Act, 2005 (3 of 2005) s. 3 for clause (b) and (e) (g) a minimum of four and a maximum of eight persons of repute from the private sector and as far as possible from each Province, one of whom shall be from the banking sector. (2) The directors referred to in clauses (a) to (f) of sub-section (1) shall be ex officio directors. (3) The directors under clause (g) of sub-section (1) shall be appointed by the Federal Government, who shall hold office for a term of two years and shall be eligible for re-appointment for additional terms of two years each. (4) No act or proceedings of the Board shall be invalid merely on the ground of the existence of any vacancy in, or defect in the constitution of, the Board. (5) No director shall have any direct or indirect financial interest in, or have business connection with any obligor or financial institution whose non-performing assets are the subject of this Ordinance. Explanation. — For the purposes of this sub-section, any involvement of the spouse or any lineal ascendant or descendant of any director with any obligor or financial institution shall be considered as a direct financial interest or connection of the director with such obligor or financial institution. (6) The directors shall not, for two years after the expiry of their term of office, enter into the employment of or accept any advisory or consultancy relationship with any obligor or financial institution whose non-performing assets are the subject of this Ordinance. 7. Chairman of the Board. — The Minister for Finance shall be the Chairman of the Board. 8. Chief Executive of the Corporation.—(1) The Chief Executive shall be appointed by the Federal Government who shall be the whole-time chief executive officer of the Corporation. (2) The Chief Executive shall hold office for a term of two years and shall be eligible for re-appointment for additional terms of two years each. (3) Subject to its superintendence, direction and control, the Board may authorise in writing the Chief Executive to exercise and perform any or all of the following powers and functions as the Board deems fit, namely:— (a) to deal with, negotiate, enter into and sign agreements and contracts with any obligor or financial institution in respect of the non-performing assets or related collateral and to take any and all actions, in any manner, to advance the business of the Corporation as specified in section 18; (b) to institute, finance, manage, oversee and terminate rehabilitation plans and schemes for the non-performing assets or the obligor, as the case may be; (c) to pay the cost, charges and expenses for the day to day business of the Corporation; (d) to receive money or goods on behalf of the Corporation; (e) to sell, deal in and dispose of all articles and goods of the Corporation; (f) to engage, employ, fix and pay the remuneration and dismiss or discharge all managers, agents, secretaries, clerks, servants, workmen and other persons employed in, or in connection with, the Corporation’s business; (g) to appoint any person or persons to be attorney or attorneys of the Corporation for such purposes and with such powers, authorities and discretions and for such period and subject to such conditions as he may from time to time think fit; (h) to make and give receipt, release and discharge, all moneys payable to the Corporation or for the claims and demands of the Corporation; (i) to draw, accept, endorse and negotiate all such cheques, bills of exchange, promissory notes and Government and other securities as shall be necessary in or for carrying on the affairs of the Corporation whether the account may be overdrawn or not; (j) to institute, compromise, withdraw or abandon any legal proceedings by or against the Corporation or its officers or otherwise concerning the affairs of the Corporation; (k) to provide for the welfare of employees or ex-employees of the Corporation and the wives, widows or families or the dependents of such persons in such manner as he may think fit; (l) to open, maintain and operate accounts or letters of credit for any amount with any bank or banks and to give instructions for operation of such accounts; (m) to appear before any court law, civil, criminal, revenue, excise, income-tax including banking courts and tribunals established for recovery of bank dues and loans, whether original or appellate, High Courts and Supreme Court of Pakistan and other authorities for and on behalf of the Corporation and to institute, apply for transfer of suits and other proceedings, conduct, prosecute and defend suits and legal proceedings whatsoever including original, appellate or any other jurisdiction, sign power of attorney or other authorisation, statements, pleadings and petitions on behalf of the Corporation and to represent, defend and safeguard the interest of the Corporation; (n) to enter into all such negotiations and contracts and rescind or vary all such contracts and do all acts, deeds and things, in the name and on behalf of the Corporation as he may consider necessary, expedient or proper, or in relation to any of the matters aforesaid or otherwise, for the purposes of the Corporation; (o) to give effectual discharge for moneys payable to the Corporation and for its claims and demands; (p) to purchase or take on lease or otherwise acquire for the Corporation, land, buildings, rights and privileges for the purpose of offices or premises of the Corporation at such prices and generally on such terms as he may think necessary and expedient, to build, alter and furnish offices, houses or premises and let or sub-let any such houses or premises in portion or otherwise; (q) to demand and enforce payment, delivery, transfer of any dues for recovery and receive from all and every persons, body corporate or corporations, firm or companies whatsoever, all money, securities for money, debts and claims of all kinds and demand, enforce, deliver and receive and take possession of money, securities, shares, and goods produced and property of all kinds whether belonging to the Corporation as security or in trust or held by any person or company in trust or by way of security for the Corporation; (r) to deal with, make arrangements, sign contracts with Government, semi Government, autonomous bodies, corporations, local Government and other institutions; and (s) to appoint attorneys, agents, managers and authorise them to exercise any or all such powers and functions as are mentioned in clauses (a) to (r) above. (4) The Federal Government may, by notification in the official Gazette, remove the Chief Executive if, — (a) he refuses or fails to discharge or becomes in the opinion of the Federal Government, incapable of discharging his responsibilities under this Ordinance; or (b) he has been declared insolvent; or (c) he has been declared to be disqualified for employment in, or has been dismissed from the service of Pakistan, or has been convicted of an offence involving moral turpitude; or (d) he has knowingly acquired or continued to hold without the permission in writing of the Federal Government, directly or indirectly or through a partner, any share or interest in any obligor or financial institution. 9. Committees. — The Board may, for the purpose of obtaining advice and assistance in carrying out the purposes of this Ordinance, constitute one or more committees consisting of members of the Board and any other suitable persons as it may deem fit. Any committee so formed shall, in exercise of the powers delegated to it or conferred on it conform to any restrictions that may be imposed on it by the Board. 10. Verification Committees.—(1) For the purposes of this Ordinance and before taking any action thereunder, the Corporation shall, having regard to the facts and circumstances of a case, refer a question of bona fide dispute relating to liability of the obligor in respect of the non-performing assets or cases relating thereto, including the cases of fraud, misrepresentation, and breach of any provision of law, rule, regulation and circulars of the State Bank, regarding the calculation, existence and repayment of a financial obligation or outstanding loan, mark-up or interest claimed against an obligor, to the Governor State Bank for verification and correct determination and calculation by the Verification Committee as hereafter provided: Provided that the Corporation may in appropriate cases and having regard to the facts and circumstances of a case require the Governor State Bank to include one or more suitable persons including an expert or consultant to be member of the Verification Committee. (2) The verification, determination and calculation of matters referred to in sub-section (1) shall be made in accordance with the existing law, rules, regulations and circulars of the State Bank in the manner provided herein in regard to the principal amount of loan, mark up, interest and ancillary financial matters relating to the financial institutions as claimed by or against the financial institution or the Corporation, as the case may be, in respect of the non-performing assets and the liability of the obligor. (3) Save as provided in this Ordinance, the provisions of sub-sections (1) and (2) shall not affect the validity, continuance and enforcement of an order of winding up of a company under the Companies Ordinance, 1984, which has been made before the commencement of this Ordinance except for the purpose of calculating the payment of any financial obligation or verified claim to the creditor or contributory or liability of the guarantor or any other person. (4) Where a matter is referred to the Governor State Bank under sub-sections (1) and (2), he may constitute one or more Verification Committees for the purposes of this Ordinance. (5) The Verification Committee shall consist of a nominee of the Governor State Bank being a senior officer of the State Bank who shall be the Chairman of the Committee, two Chartered Accountants, to be nominated by the Governor State Bank and one Chartered Accountant to be nominated by the Council of the Institute of Chartered Accountants of Pakistan, Karachi, such nomination to be obtained by the Governor State Bank and such other person as the Corporation may require. (6) The Chairman of the Verification Committee shall convene the meetings, conduct proceedings of the Committee, maintain record including the evidence submitted before him by the parties and their statements and on their request supply authenticated copies of the record to them. (7) The Verification Committee after examination of the record of the concerned lending financial institution and the obligor and after due notice by courier service, fax, U.M.S. or any other effective mode to both parties and affording them reasonable opportunity to explain their position and hearing them in person and through their chartered accountants shall make correct determination, verification and calculation of liability and matters referred to in sub-sections (1), (2) and (3) in accordance with the law, rules, regulations and circulars of the State Bank. (8) Where a party after due notice under sub-section (7) does not appear in person or through chartered accountant before the Verification Committee, it may proceed ex-parte: Provided that nothing contained herein shall prevent such party from appearance before the Verification Committee before the conclusion of the proceedings. (9) The Verification Committee shall submit its finding and report with recommendations to the Governor State Bank within thirty days of the commencement of the proceedings or such extended period as the Governor State Bank may allow for reasons to be recorded in writing. (10) The Governor State Bank shall consider the findings and report and recommendations submitted to him by the Verification Committee under sub-section (9) and may accept or modify the same or may, for reasons to be recorded, make such other appropriate recommendations and findings in respect thereof as he may deem fit. (11) The Governor State Bank shall forward his recommendations and findings made under sub-section (10) alongwith the finding, report, recommendations and record of the Verification Committee to the Corporation and the parties will be entitled to obtain copies thereof from the Corporation. (12) The recommendations and findings of the Governor State Bank made on the basis of finding, report and recommendations of the Verification Committee in regard to calculation of liability of obligor shall be final and have presumption of truth unless found to contain manifest error or contrary to law, but the same shall be subject to orders of the High Court. (13) The Corporation after considering the recommendations and findings of the Governor State Bank forwarded to it under sub-section (11) will take appropriate action under this Ordinance having regard to the facts of each case. (14) In the event of failure either of the Verification Committee to conclude the reference within thirty days of the commencement of the proceedings or such extended period referred to in sub- section (9) or the failure of the obligor or the financial institution to accept the recommendations and findings of the Governor State Bank, the Corporation may proceed in respect of the non-performing asset under this Ordinance. (15) Notwithstanding anything contained in any other law for the time being in force, the final recommendations and findings by the Governor State Bank and the finding, report and the recommendations of the Verification Committee under sub-section (11) shall constitute admissible evidence for any legal proceedings. Explanation.— For the purpose of this Ordinance any instructions given by the State Bank to any bank or financial institution for writing off any debt for the purpose of accounting of any such bank or financial institution shall not be construed as satisfaction of any debt payable by the obligor. 11. Guidelines for Corporation and the Governor State Bank. — The Corporation, and where a matter is referred by it to Governor State Bank under sub-section (1) of section 10, the Governor State Bank, shall take into consideration inter-alia the following factors as the Corporation, or as the case may be, the Governor State Bank, may deem fit having regard to the facts of each case, namely: — (a) the practical possibilities of the non-performing asset; (b) the possibility of re-scheduling of financial assistance; (c) the adequacy of the subsisting securities and the willingness of the obligor to provide sufficient additional security; (d) such other preventive, ameliorative and remedial measures including amalgamation or merger, change in management whether partial or whole or such incidental, consequential or supplemental measures as may be necessary; (e) examine the possibility of keeping alive a running project by providing reasonable financial assistance through financial institutions keeping in view the interest of both borrower and lender and avoiding unemployment; (f) where the obligor can make financial arrangement on a joint venture basis with a third person on mutually agreed terms so as to provide sufficient security to the satisfaction of the Governor State Bank or the Board for repayment of the outstanding amount or liability of the non-performing asset to be determined in accordance with the State Bank’s circulars, instructions, rules, regulations and the law; and (g) any other, facts and circumstances having regard to public interest and the objectives of the Ordinance. 12. Administration Committee.—(1) The Administration Committee shall consist of the Chief Executive and four other members of the Corporation to be appointed from the fields of banking, law, finance, engineering, management or accountancy. (2) The minutes of every meeting of the Administration Committee shall be laid before the Board at its meeting next following the meeting of the Administration Committee. (3) Subject to the superintendence, direction and control of the Board, the Administration Committee may deal with any matter within the competence of the Board and may exercise such powers and perform such functions as may be assigned to it by the Board. 13. Members, officers and servants of the Corporation.—(1) The Board shall appoint four members of the Corporation in the fields of banking, law, finance, engineering, management or accountancy to assist the Corporation in the discharge of its function under this Ordinance. Each member shall receive such salary and allowances, be subject to such conditions of service and removal, as may be prescribed by the rules. (2) The Corporation may appoint such officers and servants as it considers necessary for the efficient discharge of its functions on such terms and conditions as the Board may decide. 14. Meeting of the Board and the Administration Committee.—(1) No business of the Board or of the Administration Committee shall be transacted except at a meeting at which a quorum of a majority of the directors then appointed in the case of the Board, and three members in the case of the Administration Committee, are present. (2) The meetings of the Board and of the Administration Committee shall be held at such times and at such places as the Federal Government may, by rules, prescribe. (3) All meetings of the Board shall be presided over by the Chairman of the Board and of the Administration Committee by the Chief Executive. In the absence of the Chairman of the Board at a Board meeting, the Chief Executive shall preside. In the absence of the Chief Executive at a meeting of the Administration Committee, the meeting shall be presided over by a member authorized in writing by the Chief Executive. (4) The decisions at the Board and the Administration Committee shall be taken by a majority provided that such majority includes the presiding officer as mentioned in sub-section (3). At a meeting of the Board or of the Administration Committee, each director or member, as the case may be, shall have one vote, and in the case of equality of votes, the presiding officer shall have a second or casting vote. (5) A resolution in writing signed by the majority of the Board and the Chairman of the Board or the Administration Committee and the Chief Executive or affirmed by them through facsimile, telex or telegram shall be as valid and effectual as if it had been passed at a meeting of the Board or the Administration Committee, as the case may be, duly convened and held. 15. Qualifications and disqualifications of directors. — No person shall be, or shall continue to be, a director who- (a) is or at any time has been adjudicated as insolvent; (b) is found to be a lunatic or becomes of unsound mind; (c) is or has at any time been convicted of any offence which, in the opinion of the Federal Government, is an offence involving moral turpitude; (d) absents himself from all the meetings of the Board, without leave of absence from the Board, for a continuous period of six months or, if less than three meetings are held within such period, from three consecutive meetings of the Board; and (e) is a salaried official of the Corporation other than the Chief Executive. 16. Employees of the Corporation to be public servants. — Every person in the service of the Corporation shall, when acting or purporting to act in pursuance of any of the provisions of this Ordinance, be deemed to be a public servant within the meaning of section 21 of the Pakistan Penal Code. 1860 (Act XLV of 1860). 17. Indemnity of members, directors, officers or servants.—(1) A director shall not be personally responsible for the acts of any other director or of any member or officer or servant of the Corporation or for any loss or expenditure of the Corporation by reason of the insufficiency or deficiency in value of or title to any property or security acquired or taken on behalf of the Corporation, or for anything done by him in good faith in the discharge of his duties. (2) No suit, prosecution or legal proceedings shall lie against the Corporation, the Chairman of the Board, the Chief Executive, the directors, members or officers and servants of the Corporation, in respect of anything done or intended, to be done in good faith under this Ordinance. ____________ CHAPTER III. — POWERS AND FUNCTIONS OF THE CORPORATION 18. Business which the Corporation can transact.— Without prejudice to the provisions of any other law for the time being in force and subject to the provisions of this Ordinance, the Corporation may exercise powers and functions as under: — (a) to acquire, purchase, hold, manage, restructure, rehabilitate, sell and dispose of non-performing assets; (b) to acquire, purchase, manage, restructure, rehabilitate, sell and dispose of any obligor being a corporation or a company; (c) to purchase, take over, own, hold, sell, lease, arrange finance for, manage, dispose of, re-organize, restructure, rehabilitate and otherwise, enter into any settlement or contract, realize, mortgage, hypothecate, control, manage any loan, finance, advance, commitment, lease installment, sale contract or other activity relating to a non-performing asset; (d) to purchase, take over, own, hold, sell, lease and otherwise dispose of, re-organize, restructure, rehabilitate and otherwise enter into any settlement or contract, realize, pledge, mortgage, hypothecate, control, manage and arrange finance for any asset, property, undertaking, collateral or security underlying or relating to or securing any financial asset or instrument, including any intellectual property, trade mark, equity, financial interest, legal and contractual right, asset, guarantee and other undertaking; (e) to initiate, take, continue, resist, implement and perform any and all activities for the recovery of non- performing assets including filing suits and appeals and to enter into settlements, through the courts or outside, in respect thereof; (f) to engage and enter into agreements with financial and other institutions, and financial, legal, accounting, valuation and other specialists, for the purposes of the business of the Corporation; (g) to purchase, amalgamate, enter into partnerships, form joint ventures, make profit sharing arrangements or co-operate or participate with any company or other entity for the business purposes of the Corporation; (h) to borrow money and secure or discharge any debt or obligation binding on the Corporation in such manner as may be thought fit, and in particular by mortgages of or charges upon all or any of the real and personal property, present and future, of the Corporation or by the creation and issue, on such terms as may be deemed expedient, of debentures, term finance certificates, participation term certificates, or other redeemable capital as defined in the Companies Ordinance, 1984 (XLVII of 1984) or other securities of any description; (i) to sell, improve, manage, develop, exchange, mortgage, let or rent (for profit or royalty or otherwise), grant licences, easements, options, servitudes and other rights over and in any other manner deal with or dispose the real and personal property, assets, rights and effects of the Corporation; (j) to open and maintain the Corporation’s accounts with banks and financial institutions and to draw, make, endorse, accept, discount, executive and issue promissory notes, bills of exchange, bills of lading, warrants, participation term certificates and other negotiable or transferable instruments; (k) to establish or promote, or concur or participate in establishing, any corporation or other entity whose objects shall include the acquisition of all or any of the property or liabilities of the Corporation, or the promotion of which may seem, directly or indirectly, calculated to benefit the Corporation; (l) to enter into any agreement with any authorities, Federal, Provincial, autonomous, semi- autonomous, municipal, local or otherwise that may seem conducive to the Corporation's objects or any of them, and to obtain from any such authority, rights, privileges and concessions which the Corporation may deem desirable to obtain and to carry out, exercise and comply with any such arrangements, rights, privileges and concessions; and (m) all powers enumerated in sub-section (3) of section 8 entrusted to the Chief Executive. 19. Corporation not to be a banking company. — Without prejudice to the provisions of section 32, the Corporation shall be deemed not to be engaged in the business of banking for purposes of the Banking Companies Ordinance, 1962 (LVII of 1962), or, as the case may be, the State Bank of Pakistan Act, 1956 (Act XXXII of 1956). 20. Financial Institutions to which the provisions of this Ordinance shall apply. — 1[The Federal Government may, by notification in the official Gazette include in the schedule the name of any financial institution as defined in sub-clause (1) of section 2.] 21. Consideration for transfer of non-performing assets. — The Corporation shall pay to the concerned financial institution the outstanding amount as consideration for the transfer of non-performing assets by mutual agreement upon such terms and conditions and in such manner as may be prescribed by rules to be notified in the official Gazette. 22. Bonds issued by the Corporation.—(1) The payment obligations in respect of any bonds issued by the Corporation pursuant to mutual agreement between the Corporation and the financial institution shall bear the full faith and credit of the Islamic Republic of Pakistan. Recourse for payment of such bonds, in accordance with their respective terms, may be against the Corporation or directly against the Federal Government without the necessity of notice to or prior demand on the Corporation. The tenure of the bonds shall not exceed five years from the date of issuance. (2) At the request of the Corporation, the appropriate representatives of the Federal Government shall execute and deliver, on behalf of the Federal Government, any bonds presented to them by the Corporation to evidence the full faith and credit obligation of the Federal Government. (3) Any bond issued by the Corporation to a financial institution shall also constitute an approved investment for purposes of the liquidity and reserve requirements under the Banking Companies Ordinance, 1962 (LVII of 1962). ______________________________________________________________________________ 1Subs. by the Corporate and Industrial Restructuring Corporation (Amdt.) Act, 2005 (3 of 2005) s. 4 for section 20. 23. Certain rights and remedies.—(1) In addition to the provisions of this Ordinance or any other law for the time being in force, the Corporation shall, for the rehabilitation, management and restructuring of the obligor in respect of whom any non-performing assets and collateral are held by it or on its behalf, have the following powers, rights and remedies, each of which shall be independent and in addition to the others, namely: — (a) the Corporation may request the Commission as provided in section 295 of the Companies Ordinance, 1984 (XLVII of 1984) to take action under section 295 of the said Ordinance if it is of the opinion that the condition of the obligor warrants such action. The Commission may in pursuance of the said section and after complying with its requirements and giving the obligor an opportunity to be heard, appoint the Chief Executive or his nominee as an Administrator, hereinafter referred to as the Administrator, to manage the affairs of the obligor; (b) all the provisions of section 295 of the Companies Ordinance, 1984 (XLVII of 1984) shall apply, as far as possible, to the functioning of the Administrator as stated herein; and (c) the Corporation shall be entitled to apply to the Commission to avail the benefits of section 296 of the Companies Ordinance, 1984 (XLVII of 1984). 24. Powers of the Corporation to seek assistance.—(1) The Corporation shall have the power to seek assistance and information from any department of the Federal Government or a Provincial Government, local authority, financial institution, law enforcement agencies including the police and the Federal Investigation Agency, patwari, mukhtiarkar, registrar of assurances and the Commission and it shall be the duty of such department, local authority, financial institution, law enforcement agency, registrar of assurances and the Commission to render such assistance or furnish such information as it may reasonably require. (2) Any information required under sub-section (1) shall only be used for the purpose of the Corporation and shall not be divulged to any other person. _________ CHAPTER IV. —FINANCE 25. Corporation Fund.—(1) There shall be a fund to be known as the “Restructuring Corporation Fund” vested in the Corporation which shall be utilised by the Corporation to meet charges in connection with its functions under this Ordinance including the payment of salaries and other remunerations to the Chief Executive and members of the Corporation and to its officers and servants. (2) The Corporation fund shall consist of,— (a) funds provided by the Federal Government; (b) allocations made by the Federal Government from the Federal Consolidated Fund or any other source available with the Federal Government; (c) loans obtained from the Federal Government; (d) loans obtained by the Corporation with the special or general sanction of the Federal Government; (e) foreign aid and loans obtained with the sanction of, and on such terms and conditions as may be approved by the Federal Government; (f) recovery fees collected by the Corporation from financial institutions; and (g) all other sums received by the Corporation including income from investments. 26. Accounts and audit.—(1) The financial year of account of the Corporation shall be the year commencing the first day of July and ending the last day of June. (2) Subject to sub-section (1), the Corporation shall maintain its accounts in such manner as the Federal Government may, in consultation with the Auditor General of Pakistan, prescribe. (3) The accounts of the Corporation shall be audited by one or more auditors who are chartered accountants within the meaning of the Chartered Accountants Ordinance, 1961(X of 1961), appointed by the Corporation. 27. Reserve fund. — The Corporation shall establish a reserve fund to which shall be credited its annual recoveries. _________ CHAPTER V. — BUDGET STATEMENT AND ANNUAL REPORT 28. Budget Statement.—(1) The Corporation shall, in respect of each financial year, prepare its own budget and submit to the Federal Government three months before the commencement of every financial year for allocation of funds required before the commencement of every financial year. (2) The budget statement shall specifically state the estimated receipts and expenditure and the sums which are likely to be required by the Corporation from the Federal Government for the relevant financial year. (3) Any surplus of receipts over the actual expenditure in a year shall be remitted to the Federal Consolidated Fund and any deficit from the actual expenditure shall be made up by the Federal Government. (4) Notwithstanding the provisions of sub-section (1) the Corporation may apply to the Federal Government for a supplementary grant during the financial year for sufficient reason. 29. Annual report to the Federal Government. — Within one hundred and eighty days of the end of each financial year of the Corporation, the Board shall prepare a presentation to the Federal Government with respect to the financial performance and results of operations of the Corporation for the preceding financial year and the overall policies and goals of the Corporation. ___________ CHAPTER VI. — RULES AND REGULATIONS 30. Power of Federal Government to m a k e rules. — The Fe d er al Governm en t may, b y notification in the official Gazette, make rules for carrying out the purposes of this Ordinance. 31. Power of the Board to make regulations.—(1) The Board may make regulations not inconsistent with the provisions of this Ordinance and the rules made hereunder to provide for all matters for which provision is necessary or expedient for carrying out the purposes of this Ordinance. (2) In particular and without prejudice to the generality of the foregoing power, such regulations may provide for,— (a) the manner and terms of issue and redemption of bonds and debentures by the Corporation; (b) the form of returns and statements required to be prepared under this Ordinance; (c) the duties and conduct of officers and servants and agents of the Corporation; the recruitment of officers and staff of the Corporation, the terms and conditions of their service, the constitution and management of provident or other funds for the officers and staff of the Corporation connected with any of these things; (d) the disclosure of interest, direct or indirect of any director or any member of the Administration Committee in any financial institution or obligor; (e) the manner in which the handing over of all original documents and files from the financial institution to the Corporation will take place; and (f) generally for the efficient conduct of the affairs of the Corporation. __________ CHAPTER VII. — RIGHTS AND REMEDIES OF CORPORATION 32. Rights and remedies available to Corporation.—(1) In respect of any non-performing asset held by the Corporation and any collateral, the Corporation shall be entitled to exercise and shall have all rights and remedies available to a banking company under the Code of Civil Procedure (Act V of 1908), Banking Companies Ordinance, 1962 (LVII of 1962), the Offences in Respect of Banks (Special Courts) Ordinance, 1984 (IX of 1984), and the Banking Courts (Recovery of Loans, Advances, Credits and Finances) Act, 1997 (Act XV of 1997) and shall also have the rights and remedies available under the Companies Ordinance, 1984 (XLVII of 1984, XLVII of 1984), and further all recoveries by the Corporation in pursuance of this Ordinance shall be made in accordance with the aforesaid laws. (2) It is declared that the Corporation shall be entitled to the the rights, title, interest, benefits, privileges of a financial institution as specified in the Schedule subject to the terms of mutual agreement between the Corporation and the Financial Institutions specified in the Schedule and likewise the Corporation shall be subject to the legal liability, if any, of the Financial Institutions. (3) All acts pursuant to and in exercise of the powers under this Ordinance and rights and remedies thereunder shall be done performed and pursued in accordance with the provisions of the prevailing law inter-alia as set out in sub-section (1). 33. Rights and remedies not exhaustive. —The rights and remedies provided to the Corporation under this Ordinance may be exercised separately or concurrently by the Corporation and are in addition to, and not in lieu or derogation of, any other rights or remedies the Corporation or any other person may legally have in respect of any non-performing assets of the obligor and any related collateral. 34. Exemption from taxes. —Notwithstanding anything contained in any other law for the time being in force, the Federal Government may exempt Corporation from the payment of, all or any other taxes, duties, levies, charges and fees payable under or pursuant to any Federal law, on its investment, income, assets or wealth. 35. Liquidation of the Corporation.—(1) The Corporation shall have a life of six years from the date of commencement of this Ordinance which may be extended further by the Federal Government by law. The Corporation may be wound up by order of the Federal Government in such manner as it may direct, or under the orders of the competent court. (2) Notwithstanding anything contained in sub-section (1) or any other provision of this Ordinance or the agreement between the Corporation and the Financial institutions concerned and further in case the Corporation is wound up at any time prior to the expiry of the third year of its existence, all non-performing assets at that time shall be deemed transferred, assigned, sold and conveyed back hereunder to the financial institution by the Corporation with immediate effect and without the necessity of any further action or instrument. (3) On the winding up of the Corporation, the bonds issued by the Corporation, if any under section 21, shall be deemed to be bonds as if they were issued directly by the Federal Government and the winding up of the Corporation shall in no way affect the ability of the holder of the bond to receive full payment in terms of the bond. ______________ CHAPTER VIII . — GENERAL 36. Limitation of liability. — The Corporation shall not have any liability to any financial institution save in accordance with law. 37. Right of recovery as arrears of land revenue. — The Corporation shall be entitled to recover all outstanding amounts, subject to law, on the basis of and under any non-performing assets held by the Corporation as if they are arrears of land revenue under the Land Revenue Act, 1967. (West Pakistan Act XVII of 1967). 38. Power to obtain information and documents etc.—(1) The Corporation may call upon any person, authority, agency, bank or financial institution to furnish any information, documents, papers and accounts it may require for the purposes of this Ordinance. (2) Any person who does not or fails to furnish the information, documents, papers and accounts required by the Corporation under sub-section (1) shall be punishable with imprisonment of either description for a term which may extend to one year, or with fine or, with both. 39. Removal of difficulties. — If any difficulty arises in giving effect to any provision of this Ordinance, the Federal Government may, by order published in the official Gazette, make such provisions not inconsistent with the provisions of this Ordinance as may appear to it to be necessary for the purpose of removing such difficulty. ________ SCHEDULE (See section 2(1) and section 20) Name of the Financial Institution (1) Extent of Shares/Equity of the Federal Government (2) 1. Habib Bank Limited. 100% 2. United Bank Limited. 100% 3. National Bank of Pakistan. 100% 4. National Development Finance Corporation. 100% 5. Industrial Development Bank of Pakistan. 93% 6. Agriculture Development Bank of Pakistan. 99.7% ________________________________________________________________________________"
}