{
  "file": "administrator442aefd1739c1b07adb01e9b03e2e99f.pdf",
  "law_name": "THE CORPORATION EMPLOYEES (SPECIAL POWERS) ORDINANCE, 1978 ORDINANCE",
  "text": "THE CORPORATION EMPLOYEES (SPECIAL POWERS) ORDINANCE, 1978 ORDINANCE XIII OF 1978 CONTENTS 1. Short title and commencement 2. Definitions 3. Certain persons to be liable to removal or reversion 4. Representation 5. Service of corporation to be service of Pakistan, etc. THE CORPORATION EMPLOYEES (SPECIAL POWERS) ORDINANCE, 1978 ORDINANCE XIII OF 1978 [19th March, 1978] An ordinance to invest the President with certain powers in respect of persons in Corporation service; WHEREAS it is expedient to invest the President with certain powers in respect of persons in Corporation service; AND WHEREAS the President is satisfied that circumstances exist which render it necessary to take immediate action; NOW, THEREFORE, in pursuance of the Proclamation of the fifth day of July 1977, read with the Laws (Continuance in Force) Order, 1977 (C. M. L. A. Order No. 1 of 1977), and in exercise of all powers enabling him in that behalf, the President is pleased to make and promulgate the following Ordinance :― 1. Short title and commencement.―(1) This Ordinance may be called the Corporation Employees (Special Powers) Ordinance, 1978. (2) It shall come into force at once. 2. Definitions. In this Ordinance, unless there is anything repugnant in the subject or context, “person in Corporation service” means every person who is in the employment of a corporation or an institution set up established, managed or controlled by the Federal Government, and includes the Chairman and the Managing Director of, and the holder of any other office in, such corporation or institution. 3. Certain persons to be liable to removal or reversion. Notwithstanding anything contained in any law for the time being in force, or in the terms and conditions of service a, person in corporation service appointed or promoted during the period from the first day of January 1972, to the fifth day of July, 1977, may be removed from service or reverted to his lower post or grade, as the case may be, without notice, by the President, or a person authorised by him in this behalf, on such date as the President, or as the case may be, the person so authorised may, in the public interest, direct. 4. Representation. A person who is removed from service or reverted to a lower post or grade under section 3 may, within fifteen days from the date of receipt of order of removal or reversion prefer a representation to the President ; Provided that, where the order of removal or reversion has been made by the President, such person may, within the time aforesaid, submit to the President a petition for review of the order. 5. Service of corporation to be service of Pakistan etc. Service of a corporation is hereby declared to be service of Pakistan and every person in corporation service who is removed from service, or reverted to a lower post or grade, under this Ordinance, not being a person who is on deputation to a corporation from any Province, shall be deemed to be a civil servant for the purposes of the Service Tribunals Act, 1973 (LXX of 1973)."
}