{
  "file": "administratorc365e8638885be5dccf22e98c9e69d0b.pdf",
  "law_name": "THE EXCLUSIVE FISHERY ZONE (REGULATION OF FISHING) ACT,",
  "text": "THE EXCLUSIVE FISHERY ZONE (REGULATION OF FISHING) ACT, 1975. CONTENTS 1. Short title extent application and commencement 2. Definition 3. Fishing without licence prohibited 4. Fishing craft subject to navigational regulations 5. Dynamiting and poisoning prohibited 6. Closed season and prohibited area 7. Power to search 8. Seizure and disposal 9. Penalty and Procedure 10. False statement 11. Burden of proof 12. Liability of the owner etc 13. Indemnity 14. Delegation of powers 15. Jurisdiction of courts 16. Power to make rules THE EXCLUSIVE FISHERY ZONE (REGULATION OF FISHING) ACT, 1975. 1ACT No. XXXII OF 1975 [1st March, 1975] An Act to provide for the regulation of fishing within the exclusive fishery zone of Pakistan. WHEREAS it is expedient to provide for the regulation of fishing within the exclusive fishery zone of Pakistan and for matters ancillary thereto; It is hereby enacted as follows:— 1. Short title, extent, application and commencement.— (1) This Act may be called the Exclusive Fishery Zone (Regulation of Fishing) Act, 1975. 2[(2) It extends to the whole of Pakistan and to waters within the zone]. (3) It applies to all fishing crafts within the Zone and to all persons on board such fishing crafts. (4) It shall come into force at once. 2. Definitions. In this Act, unless there is anything repugnant in the subject or context,— (a) \"fish\" includes molluscs, crustaceans, kelp and other marine animals; (b) \"Fishery Officer\" means any person who is authorised by the Federal Government, by notification in the official Gazette, to exercise or perform any of the powers or functions of Fishery Officer under this Act; (c) \"fishing\" means taking or catching of fish within the Zone by any means; (d) \"fishing craft\" includes every vessel of whatever description and size and in whatever way propelled or moved which is used in fishing or the transport or processing thereof; (e) \"fishing gear\" includes all appliances used for fishing; (f) \"licencing authority\" means any person authorized by the Federal Government, by notification in the official Gazette, to issue licenses under this Act; (g) \"prescribed\" means prescribed by rules; 3* (h) \"rules\" means rules made under this Act 4[; and]. 1For Statement of Objects and Reasons, see Gaz. of P., 1974, Ext., Pt. III, p. 600. 2Subs. by the Exclusive Fishery Zone (Regulation of Fishing) (Amdt.) Ordinance. 1983(29 of 1983), s. 2. 3Omitted by the Exclusive Fishery Zone (Regulation of Fishing) (Amdt.) Ordinance, 1983 (29 of 1983) s. 3. 4Subs. ibid.. 1[(i) \"Zone\" means the Exclusive Economic Zone specified in section 6 of the Territorial Waters and Maritime Zones Act, 1976 (LXXXII OF 1976)]. 3. Fishing without licence prohibited. No person shall, for the purpose of fishing, operate a fishing craft or use any kind of fishing gear within the Zone except under the authority of a licence granted by the licencing authority nor otherwise than in accordance with the terms and conditions of such licence. 4. Fishing craft subject to navigational regulations.— (1) Every fishing craft shall be subject to any law relating to navigation for the time being in force. (2) The location of nets and traps set by a fishing craft shall be prominently displayed by such means as may be prescribed. (3) Every fishing gear shall be clear of the navigation channel and specified routes of commercial vessels. 5. Dynamiting and poisoning prohibited. No person shall use dynamite or any other explosive substance or poison, lime or noxious material for fishing or destroying fish in the Zone. 6. Closed season and prohibited area. Notwithstanding anything contained in this Act, the Federal Government may, by notification in the official Gazette, declare any period to be period during which, and any area to be an area within which, fishing of all or any specified description of fish shall be prohibited in the Zone. 7. Power to search. Any Fishery Officer may search any fishing craft or landing ground in or on which he has reason to believe to be concealed any fish caught or taken, or anything used, in contravention of any provision of this Act or the rules. 8. Seizure and disposal.—(1) If any Fishery Officer has reason to believe that any fish has been caught or taken in contravention of any provision of this Act or the rules, or that any fishing craft and fishing gear has been used for such fishing, he may arrest without warrant the owner or the person in charge of the vessel and seize such fish. (2) Every officer making an arrest under sub-section (1) shall, without unnecessary delay, take or send the person arrested before a Magistrate having jurisdiction in the case or before the officer in charge of the nearest police­station; and thereupon the provisions of the Code of Criminal Procedure, 1898 (Act V of 1898) applicable in respect of a person who, having been arrested without warrant, has been taken or sent before a Magistrate or an officer in charge of a police-station shall apply to him. (3) Any fish seized under sub-section (1) shall be disposed of in accordance with the decision of the court before which the owner or person in charge of the fishing craft is prosecuted under sub- section (2): Provided that, if the fish seized is such as is likely to perish unless preserved or processed without delay, it may be sold or otherwise disposed of and, if it is sold, its value shall be treated as seized property for the purpose of this sub-section. 1Added by the Exclusive Fishery Zone (Regulation of Fishing) (Amdt.) Ordinance, 1983 (29 of 1983),s.3. 9. Penalty 1[and procedure].— (1) Whoever contravenes any provision of this Act or the rules shall be punishable with 2[rigorous imprisonment for a term which may extend to five years, or with fine which may extend to ten million rupees, or with both]. (2) Any court convicting any person under sub-section (1) may order that any fish caught or taken 3[and any fishing craft and fishing gear used,] in contravention of the provisions of this Act or the rules, shall be forfeited to the Federal Government. (3) Where the person contravening any provision of this Act or the rules is a company or other body corporate, every director, manager, secretary or other officer or agent thereof shall, unless he proves that the contravention was committed without his knowledge or that he exercised all due diligence to prevent such contravention, be deemed to be guilty of such contravention. (4) Whoever, attempts to contravene, or abets the contravention of, any provision of this Act or the rules shall be deemed to have contravened the provisions of this Act or the rules. 4[(5) No court inferior to that of a Magistrate of the first class shall try any offence punishable under this Act. (6) Notwithstanding anything contained in the Code of Criminal Procedure, 1898 (Act V of 1898) it shall be lawful for any Magistrate of the first class specially empowered by the Provincial Government in this behalf to pass any sentence authorised by this Act or by any of the laws extended under this Act.]. 10. False statement. Whoever, upon being so required by a police officer not below the rank of Sub-Inspector or a Fishery Officer, makes any statement or furnishes any information which is false in any material particulars and which he knows or has reason to believe to be false, or does not believe to be true, or makes any such statement as aforesaid in any book, account, record, declaration, or any document which he is required to maintain, shall be punishable with imprisonment for a term which may extend to one month, or with fine which may extend to five thousand rupees, or with both. 11. Burden of proof. Where any person is prosecuted for doing any act or being in possession of anything without lawful authority or licence, the burden of proving that he has such authority or licence shall lie on that person. 12. Liability of the owner etc. The owner or the person in charge of any fishing craft carrying anything in contravention of any provision of this Act or the rules shall be deemed to have contravened the provisions of this Act or the rules, as the case may be, if__ (i) such carriage is part of the transaction involving the contravention; and (ii) if the owner or person in charge knew or had reason to believe that a contravention was being committed; and shall be punishable under section 9. 1Added by the Exclusive Fishery Zone (Regulation of Fishing) (Amdt.) Act,1993 (5 of 1993), s. 2. 2Subs, by the Exclusive Fishery Zone (Regulation of Fishing) (Amdt.) Ordinance, 1983 (29 of 1983), s. 4. 3ins. ibid.. 4Added by the Exclusive Fishery Zone (Regulation of Fishing) (Amdt.) Act, 1993 (5 of 1993), s. 2 13. Indemnity. No suit or other legal proceeding shall lie against the Federal Government or any Fishery Officer for anything in good faith done or intended to be done under this Act or any rule. 14. Delegation of Powers. The Federal Government may, by notification in the official Gazette, delegate all or any of its powers under this Act or the rules to any officer. 15. Jurisdiction of courts. For the purpose of giving jurisdiction to courts under this Act, a fishing craft shall be deemed to be a ship within the meaning of any enactment for the time being in force relating to offences committed on board a ship, and every court shall have the same jurisdiction over a foreign fishing craft within the Zone and persons belonging to such fishing craft as such court would have if such fishing craft were a Pakistan fishing craft. 16. Power to make rules.— (1) The Federal Government may, by notification in the official Gazette, make rules for carrying out the purposes of this Act. (2) In particular and without prejudice to the generality of the foregoing power, such rules may provide for all or any of the following matters, namely:— (a) the sizes of meshes and the sizes and types of nets; (b) the size and the quantity of fish which may be caught by any fishing gear or processed at any time; (c) the terms and conditions to which licences for fishing shall be subject; (d) the registration of fishing craft and fishing gear; (e) the regulation of operations of fishing craft; (f) registration fee, licence fee and royalties on catches, and other dues of the Federal Government; (g) specification of the area for landing of fish taken or caught in the Zone; and (h) regulation of landing and inspection of fish taken or caught in the Zone."
}