{
  "file": "administratord8815b237f5842a0cef72b22d5a68ee4.pdf",
  "law_name": "The Allama Iqbal Open University Act, 1974",
  "text": "THE ALLAMA IQBAL OPEN UNIVERSITY ACT, 1974 CONTENTS 1. Short title and commencement 2. Definitions CHAPTER II THE UNIVERSITY 3. Establishment and incorporation of the University 4. Powers and functions of the University 5. University open to all classes, creeds, etc. 6. Teaching in the University CHAPTER III OFFICERS OF THE UNIVERSITY 7. Officers of the University 8. Chancellor 9. Pro-Chancellor 10. Visitation, etc. 11. Vice-Chancellor 12. Powers and duties of the Vice-Chancellor 13. Registrar 14. Treasurer 15. Controller of Examinations 16. University Auditor CHAPTER IV AUTHORITIES OF THE UNIVERSITY 17. Authorities 18. The Executive Council 19. Powers and duties of Executive Council 20. The Academic Council 21. Powers and duties of the Academic Council 22. Constitution, functions and powers of other Authorities 23. Appointment of Committees by the Authorities CHAPTER V STATUTES, REGULATIONS AND RULES 24. Statutes 25. Regulations 26. Amendment and repeal of Statutes and Regulations 27. Rules CHAPTER VI UNIVERSITY FUND 28. University Fund 29. Audit and Accounts CHAPTER VII GENERAL PROVISIONS 30. Opportunity to show Cause 31. Appeal to and review by the Executive Council 32. Pension, group insurance, gratuity, provident fund and benevolent fund 33. Commencement of term of office of members of Authorities 33A. Members of an Authority to cease to be members in certain circumstances 34. Filling of casual vacancies in Authorities 35. Filling of vacancies in Authorities in certain circumstances 36. Disputes about membership of Authorities 37. Proceedings of Authorities not invalidated by vacancies 38. First Statutes 39. Removal of difficulties 40. Tripartite mobility THE SCHEDULE (See section 38) THE FIRST STATUTES THE ALLAMA IQBAL OPEN UNIVERSITY ACT, 1974. 1ACT NO. XXXIX OF 1974 [21st May, 1974] An Act to provide for the establishment of an Allama lqbal Open University at Islamabad. WHEREAS it is expedient to provide for the establishment of an Allama lqbal Open University at Islamabad and for matters ancillary thereto; It is hereby enacted as follows:— 1. Short title and commencement.—(1) This Act may be called the 2[Allama lqbal Open University Act, 1974.] (2) It shall come into force at once. 2. Definitions. In this Act, unless there is anything repugnant in the subject or context,— (a) “Academic Council” means the Academic Council of the University; (b) “Audience level regional centre” means an audience level regional centre maintained and administered by the University; (c) “Authority” means an Authority of the University specified in section 17; (d) “Chancellor” means the Chancellor of the University; (e) “Committee of Courses” means the Committee of Courses in a Faculty; (f) “Dean” means the Dean of a Faculty; (g) “Department” means a department maintained and administered or' recognised by the University; (h) “Executive Council” means the Executive Council of the University; (i) “Faculty” means a Faculty of the University; (j) “Government” means the Federal Government; 3[(jj) “Institute” means an institute maintained and administered by the University] (k) “Prescribed” means prescribed by Statutes, Regulations or Rules; (1) “Pro-Chancellor” means the Pro-Chancellor of the University; 1 For Statement of Objects and Reasons, see Gaz. of P., 1974, Ext., Pt. Ill, p. 427. 2 Subs. by the People’s Open University (Amdt.) Ordinance, 1977 (43A of 1977), s. 2, for “People's Open University Act, 1974”. 3 Ins. by the Allama lqbal Open University (Amdt.) Ordinance, 1981 (8 of 1981),S.2. (m) “Registered Graduate” means a graduate of the University who has his name entered in the register maintained in the University for the purpose; (n) “Statutes”, “Regulations” and “Rules” means the Statutes, Regulations and Rules made under this Act; (o) “Teachers” includes Professors, Associate Professors, Senior Instructors, Assistant Professors, Instructors and Lecturers engaged whole-time by the University or such other persons as may be recognised as Teachers by the Academic Council; 1[(p) “University” means the Allama lqbal Open University as renamed under this Act;] (q) “University Teacher” means a whole-time Teacher appointed and paid by the University, or recognized by the Academic Council as such; and (r) “Vice-Chancellor” means the Vice-Chancellor of the University. ___________ CHAPTER II THE UNIVERSITY 3. Establishment and incorporation of the University.—(1) There shall be established a University to be called the People's Open University as a specialised educational institution with its principal seat at Islamabad for purposes of teaching, holding of examinations and tests, establishment of audience level regional centers for guidance and examinations at the post-matric, graduate, post- graduate and research levels in accordance with the provisions of this Act. 2[(1A) The People's Open University established in accordance with the provisions of this Act shall, on and the commencement of the People's Open University (Amendment) Ordinance, 1977, be renamed as the Allama Iqbal Open University.] (2) The University shall consist of— (i) the Chancellor, the Pro-Chancellor, the Vice-Chancellor, the Deans, the Chairman of Teaching Departments, the 3[Directors of the Institutes, the Director of the Regional Tutorial Services], the Registrar, the Treasurer, the Auditor, the Controller of Examinations, the Librarian, and such other officers as may be prescribed; [ (ii) members of the Executive Council, the Academic Council and other Authorities; (iii) all University Teachers; and (iv) Professors Emeritus. 1Subs. by the People's Open University (Amdt.) Ordinance, 1977 (43A of 1977), s. 3 for cl. (p). 2Sub-section (1A) ins. by the People's Open University (Amdt.) Ordinance,1977 (43A of 1977) s. 4. 3Subs. by the Allama Iqbal Open University (Amdt.) Ordinance, 1981 (8 of 1981), s. 3. (3) The University shall be a body corporate by the name of the 1[Allama Iqbal Open University] and shall have perpetual succession and a common seal, and shall by the said name sue and be sued. (4) The University shall be competent to acquire and hold property, both movable and immovable, and to lease, sell or otherwise transfer any movable and immovable property which may have become vested in or been acquired by it. 4. Powers and functions of the University. The University shall have the powers— (a) to provide educational facilities to people who cannot leave their homes and jobs in such manner as it may determine; (b) to provide such facilities to masses for their educational uplift as it may determine; (c) to provide facilities for the training of teachers in such manner as it may determine; (d) to provide for instruction in such branches of learning technology or vocations as it may deem fit, and to make provision for research and for the advancement and dissemination of knowledge in such manner as it may determine; (e) to prescribe courses of studies to be conducted by it; (f) to hold examinations and to award and confer degrees, diplomas, certificates and other academic distinctions to and on persons who have been admitted to and have passed its examinations under the prescribed conditions; (g) to confer in the manner prescribed honorary degrees or other distinctions on persons approved for the purpose; (h) to provide for such instruction for persons not being students of the University as it may determine, and to grant certificates and diplomas to such persons; (i) to confer degrees on persons who have carried on independent research under prescribed conditions; (j) to accept the examinations passed by students of the University at other universities and places of learning as equivalent to such examinations of the University as it may determine; (k) to co-operate with other universities and other authorities in such manner and for such purposes as it may determine; 1 Subs. by Ord. 43A of 1977 s. 2, for “People's Open University”. (l) to institute Professorships, Senior Instructorships, Associate Professorships, Instructorships, Assistant Professorships, Lecturerships , Counsellorships and any other posts and to appoint persons thereto: (m) to create posts for teaching, research, extension services, administration and other related purposes and to appoint persons thereto; (n) to recognize as University Teachers such persons as it may deem fit; (o) to institute and award fellowships, scholarships, exhibitions, bursaries, medals and prices under prescribed conditions; (p) to establish teaching departments, 1[institutes] faculties, laboratories, workshops, audience level regional centres and other centres of learning for the development of teaching and research and educational technology and to make such arrangements for their maintenance, management and administration as it may determine; (q) to supervise and control the discipline of the students of the University and to promote the extra-curricular and recreational activities of such students, and to make arrangements for promoting their conduct, health and general welfare; (r) to demand and receive such fees and other charges as it may determine; (s) to make provision for research and development of educational technology and advisory services and with these objects to enter into arrangements with other institutions or with public bodies under prescribed conditions; (t) to provide for making of films and cassettes and other audio-visual material and enter into arrangements with Broadcasting Corporation of Pakistan, the Television Corporation of Pakistan and such other organizations as it may deem fit; (u) to enter into, carry out, vary or cancel contracts; (v) to receive and manage property transferred and grants, bequests, trusts, gifts, donations, endowments and other contributions made to the University and to invest any fund representing such property, grants, bequests, trusts, gifts, donations, endowments or contributions and to convert one kind of property into another, in such manner at it may deem fit; (w) to provide for the printing and publication of courses and teaching material and other works; and (x) to do all such other acts and things, whether incidental to the powers aforesaid or not, as may be requisite in order to further the objects of the University as a centre of education, learning and research. 1 Ins. by the Allama lqbal Open University (Amdt.) Ordinance, 1981 (8 of 1981), s. 4. Explanation.—In this section “Counsellorship” means a post the person appointed to which, whether on whole-time or part-time basis is in direct instructional contact with the students. 5. University open to all classes, creeds, etc. The University shall be open to all persons of either sex of whatever religion, race, creed, class or colour and no citizen of Pakistan shall be denied the privileges of the University on the ground only of sex, religion, race, caste, creed, class, colour or domicile. 6. Teaching in the University.—(1) All recognized teaching in various courses shall be conducted by the University in the prescribed manner and may include correspondence packages, films, cassettes, telecasts, broadcasts, lectures, tutorials, discussions, seminars, demonstrations as well as practical work in the laboratories, workshops and farms and other media of instruction and practice in teaching or practical training. (2) The authority responsible for organizing recognised teaching shall be such as may be prescribed. (3) The courses and the curricula shall be such as may be prescribed. 1[(4) A discipline to be call “Islamic and Pakistan Studies” shall be offered, as a compulsory subject at the Bachelor's level in all arts, science, professional and other faculties provided that non- muslim students may opt for “Ethics and Pakistan Studies”. (5) A degree shall not be awarded to a student unless he has passed the examination in the discipline referred to in sub-section (4).] CHAPTER III OFFICERS OF THE UNIVERSITY 7. Officers of the University. The following shall be the officers of the University namely:— (i) the Chancellor; (ii) the Pro-Chancellor; (iii) the Vice-Chancellor; (iv) the Deans; (v) the Chairman of the Teaching Departments; 2[(va) the Directors of the Institutes] 3[(vi) the Director of the Regional Tutorial Services] (vii) the Registrar; 1 Added by the Allama Iqbal Open University (Amdt.) Ordinance, 1981 (2 of 1981), s. 2. 2 Ins. by the Allama Iqbal Open University (Amdt.) Ordinance, 1981 (8 of 1981), s. 5. 3 Subs. ibid., (viii) the Treasurer; (ix) the Auditor; (x) the Controller of Examinations; (xi) the Librarian; and (xii) such other persons as may be prescribed by Regulations to be the officers of the University. 8. Chancellor. —(1) The President of the Islamic Republic of Pakistan shall be the Chancellor of the University. (2) The Chancellor shall, when present, preside at the convocations of the University. (3) Every proposal to confer an honorary degree shall be subject to confirmation by the Chancellor. 9. Pro-Chancellor. —(1) The Federal Minister incharge of the Ministry of Education shall be the Pro-Chancellor of the University. (2) In the absence of the Chancellor, the Pro-Chancellor shall, when present, preside at the convocations of the University. (3) If the Pro-Chancellor is satisfied that the proceedings of any Authority or the orders of any officer are not in accordance with the provisions of this Act, the Statutes, the Regulations or the Rules, he may, after calling upon such Authority or officer to show cause why such proceedings or orders should not be annualled, by order in writing, annual such proceedings or orders. (4) The Pro-Chancellor shall have the power to assent to such Statutes as are required to be submitted to him or withhold assent or refer them back to the Executive Council for re- consideration. (5) The Pro-Chancellor may remove any persons from the membership of any Authority, if such as person— (i) has become of unsound mind; or (ii) has become subject to an incapacity which prevents him from functioning as a member of such Authority; or (iii) has been convicted by a court of law of an offence involving moral turpitude. 10. Visitation, etc. —(1) The Pro-Chancellor may cause a visitation or an inspection or inquiry to be made in respect of any matter connected with the affairs of the University and shall, from time to time, appoint such person or persons as he may deem fit for the purpose of carrying out inspection of— (i) the University, its buildings, laboratories, libraries, workshops and other establishments and equipment; (ii) any institution or audience level regional centre of the University; (iii) the teaching and other work conducted by the University; and (iv) the conduct of examinations held by the University. (2) The Pro-Chancellor shall give notice to the Executive Council of his intention to cause a visitation or an inspection or inquiry to be made under sub-section (1), and the Executive Council shall be entitled to be represented thereat. (3) The Pro-Chancellor shall communicate to the Executive Council his views with regard to the results of a visitation or an inspection or inquiry made under sub-section (1) and shall, after ascertaining the views of the Executive Council thereon, advise the Executive Council on the action to be taken by it. (4) The Executive Council shall, within such time as may be specified by the Pro- Chancellor, communicate to him such action, if any, as has been taken or may be proposed to be taken upon the results of a visitation or an inspection or inquiry communicated to it under sub- section (3). (5) Where the Executive Council does not, within the time specified by the Pro- Chancellor, take action to the satisfaction of the Pro-Chancellor, he may, after consideration of any explanation furnished or representation made by the Executive Council, issue such directions as he thinks fit, and the Vice-Chancellor shall comply with such directions. 11. Vice-Chancellor.—(1) The Vice-Chancellor shall be appointed by the Chancellor on such terms and conditions as the Chancellor may determine for a term not exceeding four years. (2) At any time when the office of the Vice-Chancellor is vacant, or the Vice- Chancellor is absent or is unable to perform the functions of his office due to illness or some other cause, the Pro- Chancellor shall make such arrangement for the performance of the duties of Vice-Chancellor as he may deem fit. 12. Powers and duties of the Vice-Chancellor. —(1) The Vice-Chancellor shall be the principal executive and academic officer of the University, shall ensure that the provisions of this Act, the Statutes, the Regulations and the Rules are faithfully observed in order to promote the general efficiency and good order of the University, and shall have all powers necessary for this purpose, including administrative control over all officers, Teachers and other employees of the University. (2) The Vice-Chancellor shall, in the absence of the Chancellor, and Pro-Chancellor, preside at a convocation of the University and at the meetings of the Authorities of which he is the Chairman and be entitled to attend and preside at any meeting of any other Authority or body of the University at his discretion. (3) The Vice-Chancellor may, with the approval of the Pro-Chancellor, in an emergency which requires immediate action, take such action as he may consider necessary and shall, as soon thereafter as possible, seek approval of his action from the Authority or other body which in the ordinary course would have dealt with the matter, but shall not exercise powers otherwise vested exclusively in the Chancellor or the Pro-Chancellor under this Act. (4) The Vice-Chancellor shall also have the powers— (i) to create temporary posts for a period not exceeding six months subject to availability of funds and advice of the Finance Committee and fill them on adhoc basis in consultation with the head of the department or section of the office; (ii) to sanction all expenditure provided for in the approved budget, and to re- appropriate funds within the same major head of expenditure; (iii) to sanction by re-appropriation an amount not exceeding five thousand rupees for an unforeseen item not provided for in the budget, and report it to the Executive Council at the next meeting; (iv) to appoint course editors, consultants, course assessors, paper setters and examiners for all examinations and courses of the University after receiving panels of names from the relevant Authorities, the assessors and consultants for various courses shall be appointed in consultation with the Dean concerned, on such terms as the Vice-Chancellor may deem suitable; (v) to make such arrangements for the scrutiny of papers, marks and results as he may consider necessary; (vi) to direct Teachers, officers and other employees of the University to take up such assignments in connection with teaching, research, examination and administration, and such other activities in the University as he may consider necessary for the purpose of the University; (vii) to delegate, subject to such conditions, if any, as may be prescribed any of his powers under this Act to an officer or other employee of the University; (viii) to appoint employees on an initial monthly pay which is below four hundred and fifty rupees; (ix) to relax Regulations in favour of a student in a case of real hardship subject to the approval of the Academic Council; and (x) to exercise and perform such other powers and functions as may be prescribed. 13. Registrar. —(1) The Registrar shall be a whole-time officer of the University and shall be appointed by the Executive Council on such terms and conditions as it may determine. (2) The Registrar shall— (a) be the custodian of the Common Seal and the academic records of the University; (b) maintain Registers of students and Registered Graduates of the University in the prescribed form ; (c) conduct elections of members to the various Authorities in the prescribed manner; (d) act as the Secretary of the Executive Council, Academic Council and the Selection Board and as the co-ordinator of administration under the general directions and supervision of the Vice-Chancellor; and (e) perform such other duties as may be assigned to him by the Executive Council. 14. Treasurer. —(1) The Treasurer shall be a whole-time officer of the University and shall be appointed by the Pro-Chancellor on such terms and conditions as the Pro- Chancellor may determine. (2) The Treasurer shall— (a) manage the property, the finances and the investments of the University; (b) prepare the annual and revised budget estimates of the University and present them to the Finance Committee and the Executive Council; (c) ensure that the funds of the University are expanded for the purposes for which they are provided; and (d) perform such other duties as may be assigned to him by the Executive Council. 15. Controller of Examinations. —(1) The Controller of Examinations shall be a whole- time officer of the University and shall be appointed by the Executive Council on such terms and conditions as it may determine. (2) The Controller of Examinations shall be responsible for all matters connected with evaluation and assessment records and the conduct of examinations and perform such other duties as may be assigned to him by the Executive Council. 16. University Auditor. —(1) There shall be a University Auditor who shall be an officer in the service of the Federal Government whose services have been lent to the University. (2) The duties of the University Auditor shall include pre-audit of all bills and demands for payment submitted to the University. CHAPTER IV AUTHORITIES OF THE UNIVERSITY 17. Authorities. The following shall be the Authorities of the University, namely:— (i) the Executive Council; (ii) the Academic Council; (iii) the Faculties; (iv) the Committees of Courses; (v) the Selection Board; (vi) the Committee for Research and Educational Technology; (vii) the Finance Committee; (viii) the Academic Planning and Development Committee; and (ix) such other authorities as may be prescribed by Statutes. 18. The Executive Council. —l[(l) The Executive Council shall consist of:— (i) the Vice-Chancellor, who shall be its Chairman; (ii) one member of the National Assembly to be nominated by the Speaker of the Assembly; (iii) the Chief Justice of Pakistan or his nominee; (iv) the Secretary, Ministry of Education, Government of Pakistan; (v) one nominee of the University Grants Commission; (vi) one Dean to be nominated by the Chancellor on the recommendation of the Vice- Chancellor; 2[(vii) one Professor, one Associate Professor, one Assistant Professor and one Lecturer of the University to be elected by the Professor, Associate Professors, Assistant Professors and Lecturers of the University, as the case may be, from amongst themselves: Provided that a Lecturer shall be eligible for election if he has completed a minimum of two years' service in the University;] (viii) three persons of eminence to be nominated by the Chancellor; (ix) the Managing Director of the Pakistan Television Corporation; (x) the Director General of the Pakistan Broadcasting Corporation.]; 2[(xi) one Aalim to be nominated by the Chancellor; (xii) one woman to be nominated by the Chancellor;] (2) The members of the Executive Council, other than 2[ex-officio] members, shall hold office for 2[three] years. (3) The quorum for a meeting of the Executive Council shall be one third of the total number of members, a fraction being counted as one. 1 Subs. by the Allama Iqbal Open University (Amdt.) Ordinance, 1981 (2 of 1981), s. 3. 2 Subs. and ins. by the Allama Iqbal Open University (Amdt.) Ordinance, 1981 (8 of 1981), s. 6. 19. Powers and duties of Executive Council.—(1) The Executive Council shall be the executive body of the University and shall, subject to the provisions of this Act and the Statutes, Regulations and Rules, exercise general supervision over the affairs and management of the property of the University. (2) In particular and without prejudice to the generality of the foregoing provisions, the Executive Council shall have the power— (a) to hold, control and administer the property and funds of the University; (b) to govern and regulate, with due regard to the advice of the Finance and Academic Planning and Development Committees in this behalf, the finances, accounts and investments of the University and, for that purpose, to appoint such agents as it may think fit; (c) to consider the annual report and the annual revised budget estimates and to re-appropriate funds from one major head of expenditure to another on the recommendations of the Finance Committee; (d) to transfer and accept transfer of movable or immovable property on behalf of the University; (e) to enter into, vary, carry out and cancel contracts on behalf of the University; (f) to cause proper books of accounts to be kept for all sums of money received and expended by the University and for the assets and liabilities of the University; (g) to invest any money belonging to the University, including any unapplied income, in any of the securities described in section 20 of the Trusts Act, 1882 (11 of 1882), or in the purchase of immovable property or in such other manner as it may determine, with the like power of varying such investment; (h) to receive and manage any property transferred and grants, bequests, trusts, gifts, donations, endowments and other contributions made to the University, and to administer any funds placed at the disposal of the University for specified purposes; (i) to determine the form, provide for the custody and regulate the use of the Common Seal of the University; (j) to provide the buildings, libraries, premises, furniture, apparatus equipment and other means required for the purposes of the University; (k) to arrange for the inspection of the Departments and audience level regional centres; (1) to institute Professorships, Associate Professorships, Assistant Professorships, Lecturerships, and other teaching posts, or to suspend or abolish such posts; (m) to create, suspend or abolish such administrative, research, extension or other posts as may be necessary; (n) to appoint University Teachers and other officers on the recommendations of the Selection Board for Teaching and other posts on an initial monthly pay which is not below four hundred and fifty rupees; (o) to appoint Professors Emeritus on such terms and conditions as may be prescribed under Statutes; (p) to confer, with the prior approval of the Chancellor, honorary degrees in accordance with the conditions prescribed; (q) to prescribe the duties of officers, Teachers and other employees of the University; (r) to suspend, punish and remove from service in the prescribed manner officers (other than the Vice-Chancellor, the Auditor and the Treasurer), Teachers and other employees whom it is empowered to appoint; (s) to appoint members to the various Authorities in accordance with the provisions of this Act; (t) to propose drafts of Statutes for submission to the Pro-Chancellor; (u) to consider, and deal in the manner- prescribed, the Regulations made by the Academic Council; (v) to regulate, determine and administer all other matters concerning the University and to this end exercise all necessary powers not specifically mentioned in this Act and the Statutes; (w) to delegate any of its powers to an Authority or officer or a Committee or sub- committee; and (x) to perform such other functions as have been assigned to it by the other provisions of this Act or may be assigned to it by the Statutes. 20. —(1) The Academic Council shall consist of— (i) the Vice-Chancellor; (ii) four members of the Executive Council to be elected by the Executive Council; (iii) the Deans; (iv) the University Professors, Senior Instructors and Professors Emeritus; (v) the Chairmen of the Departments; 1[(va) the Directors of the Institutes;] (vi) five University Teachers to be elected by all the University Teachers; (vii) two Registered Graduates to be elected, after the first graduation, by all such Graduates; (viii) three persons eminent in the arts, the sciences, and the professions, one from each category to be nominated by the Pro-Chancellor; (ix) the Registrar; (x) the Treasurer; (xi) the Controller of Examinations; and (xii) the Librarian. (2) The Vice-Chancellor shall be the Chairman of the Academic Council and shall preside over its meetings. (3) The Registrar shall be the Secretary to the Academic Council. (4) The members of the Academic Council, other than nominated members, shall hold office for three years. (5) The quorum for a meeting of the Academic Council shall be one-third of the total number of members, a fraction being counted as one. 21. Powers and duties of the Academic Council.—(1) The Academic Council shall be the highest academic body of the University and shall, subject to the provisions of this Act and the Statutes, have the power to lay down proper standards of instruction, research and examinations and to regulate and promote the academic life of the University and the audience level regional centres. It shall also propagate the ideology of Pakistan and shall also endeavour to inculcate and build national character in the students. (2) In particular and without prejudice to the generality of the foregoing provisions, the Academic Council shall have the power— s (a) to advise the Executive Council on all academic matters; (b) to regulate the conduct of teaching, research and examinations; (c) to regulate the admission of students to the courses of study and examinations in the University; (d) to regulate the conduct and discipline of the students of the University; (e) to propose to the Executive Council schemes for the constitution and organisation of Faculties, Departments and Committees of Courses; 1 Ins. by the Allama Iqbal Open University (Amdt.) Ordinance, 1981 (8 of 1981), s. 7. (f) to consider and formulate proposals for the planning and development of various media of teaching and research in educational technology in the University; (g) to make Regulations, on the recommendations of Academic Planning and Development Committee, Committee for Research and Educational Technology or the Faculties and approve the recommendations of the Committees of Courses and Faculties prescribing the courses of study and the syllabi for all University examinations: Provided that, if the recommendations of a Faculty or a Committee of Courses are not received by the prescribed date, the Academic Council may continue for the next year the courses of study already prescribed for an examination; (h) to recognise the examinations of other universities or examining bodies as equivalent to the corresponding examinations of the University; (i) to regulate the award of studentships, scholarships, exhibitions, medals and prizes; (j) to frame Regulations for submission to the Executive Council; (k) to appoint members to the various Authorities in accordance with the provisions of this Act; and (1) to perform such other functions as may be prescribed by Statutes. 22. Constitution, functions and powers of other Authorities. Subject to the provisions of this Act, the constitution, functions and powers of the Authorities for which no specific provision, or insufficient provision, has been made in this Act shall be such as may be prescribed by Statutes. 23. Appointment of Committees by the Authorities. The Executive council, the Academic Council and any other Authority may, from time to time, appoint such standing, special or advisory committees as it may deem fit, and may appoint to such committees persons who are not its members. CHAPTER V STATUTES, REGULATIONS AND RULES 24. Statutes. —(1) Subject to the provisions of this Act, Statutes may be made to regulate or prescribe all or any of the following matters, namely:— (a) the constitution of pension, group insurance, gratuity, provident fund and benevolent fund for University employees; (b) the scales of pay and other terms and conditions of service of officers, Teachers and other employees of the University; (c) the maintenance of the Register of Students and Register of Registered Graduates; (d) the conduct of elections for membership of the Authorities and related matters; (e) the establishment of Faculties, audience level regional centres and other academic divisions; (f) the powers and duties of Officers and Teachers; (g) the conditions under which the University may enter into arrangements with other institutions or with public bodies for purposes of research and advisory services and production of courses through various media; (h) the conditions for appointment of Professor Emeritus and award of honorary degrees; (i) efficiency and discipline of University employees; and (j) all other matters which are to be or may be prescribed or regulated by Statutes. (2) The draft of Statutes shall be proposed by the Executive Council to the Pro-Chancellor who may approve it, or pass it with such modifications as he may think fit, or may refer it back to the Executive Council for reconsideration: Provided that the Executive Council shall not propose a draft of Statutes affecting the constitution or powers of any Authority, until such Authority has been given an opportunity of expressing an opinion in writing upon the proposals: Provided further that the draft of Statutes, after the Executive Council has approved it, be forwarded to the Pro-Chancellor and shall not be effective until it has been approved by the Pro- Chancellor. 25. Regulations.___(1) Subject to the provisions of this Act and the Statutes, Regulations may be made for all or any of the following matters, namely— (a) the general scheme of studies and the courses of study for degrees, diplomas and certificates of the University; (b) the manner in which the recognised teaching shall be organised and conducted; (c) the admission of students to the University; (d) the conditions under which students shall be admitted to the courses and the examinations of the University and shall become eligible for the award of degrees, diplomas and certificates; (e) the assessment and evaluation system and the conduct of examinations; (f) fees and other charges to be paid by the students for admission to the courses of study and the examinations of the University and for the remission of such fees, etc., in suitable cases; (g) the conduct and discipline of students of the University ; (h) the conditions under which a person shall carry on independent research to entitle him to a degree; (i) the institution of fellowships, scholarships exhibitions, medals and prizes; (j) the institution of stipends; (k) the academic costume; (1) the use of the Library; (m) the formation of departments and Committees of Courses; and (n) all other matters which are to be or may be prescribed by Regulations. (2) The draft of Regulations shall be prepared by the Academic Council and shall be submitted to the Executive Council which may approve or withhold approval or refer it back to the Academic Council for reconsideration: Provided that the Executive Council may frame a Regulation as its own initiative and approve it after calling for the advice of the Academic council. (3) No Regulation shall be valid unless it has been approved by the Executive Council. 26. Amendment and repeal of Statutes and Regulations. The procedure for adding to, amending or repealing the Statutes and the Regulations shall be the same as that provided respectively for the framing or making of Statutes and Regulations. 27. Rules__(1) The Authorities and the other bodies of the University may make rules consistent with this Act, the Statutes and the Regulations to regulate the conduct of their business and the time and place of meetings and related matters: Provided that the Executive council may direct the amendment or the annulment of any rules made by another Authority or body under this section: Provided further that, if such other Authority or body is dissatisfied with such direction, it may apply for review to the Executive Council whose decision in the matter shall be final. (2) The Executive Council may make rules to regulate any matter relating to the affairs of the University, which by this Act are not specifically required to be provided for by Statutes or Regulations. CHAPTER VI UNIVERSITY FUND 28. University Fund. The University shall have a fund to which shall be credited its income from fees, donations, trusts, bequests, endowments contributions, grants, property and all other sources. 29. Audit and accounts.___(1) The accounts of the University shall be maintained in such from and in such manner as may be prescribed . (2) No expenditure shall be made from the funds of the University 1[if it is not included in the approved budget of the university nor] unless a bill for its payment has been audited by the University Auditor in conformity with the Statutes, the Regulations and the Rules. (3) The annual statement of the accounts of the University, signed by the Treasurer and the University Auditor, shall be submitted to the Government within six months of the closing of the financial year. (4) The accounts of the University shall be audited once a year by an auditor appointed by the Government for the purpose. (5) The observations of the Government auditor, together with such annotations, as the Treasurer may make, shall be presented to the Executive Council. CHAPTER VII GENERAL PROVISIONS 30. Opportunity to show cause. Except as otherwise provided, no officer, Teacher or other employee of the University holding a permanent post shall be reduced in rank, removed, suspended or compulsorily retied from service, unless he has been given a reasonable opportunity of showing cause against the action proposed to be taken. 31. Appeal to and review by the Executive Council.___(1). Where an order is passed punishing any officer (other then vice-Chancellor), Teacher or other employees of the University or altering or interpreting to his disadvantage the prescribed terms and conditions of his service, he shall, where the order is passed by the Vice-Chancellor or any other officer or Teacher of the University, have the right to appeal to the Executive Council against the order, and, where the order is made by the Executive Council, have the right to apply to that Authority for review of that order or appeal to the Pro-Chancellor. (2) The appeal or application for review shall be submitted to the Vice-Chancellor who shall lay it before the Executive Council or, as the case may be, Pro-chancellor or with his comments. 1[(3) No order on an appeal or application for review shall be passed with our affording to the appellant or applicant, as the case may be, an opportunity of being heard.] 32. Pension, group insurance, gratuity, provident fund and benevolent fund. (1) The University may constitute for the benefit of its officers, Teachers and other employees in such manner and subject to such conditions as may be prescribed, such pension, group insurance, gratuity, provident fund and benevolent fund schemes as it may deem fit. (2) Where any provident fund is constituted under this Act, the provisions of the Provident Funds Act, 1925 (XIX of 1925), shall apply to such fund as if it were a Government Provident Fund and the University were the Government. 1Ins. by the Allama Iqbal Open University (Amdt.) Ordinance 1981 (2 of 1981), s.4 2Added by the Allama Iqbal Open University (Amdt.) Ordinance, 1984 ( 23 of 1984), s. 2. 33. Commencement of term of office of members of authorities. Where a member of a newly constituted Authority is elected, appointed or nominated, his term of office, as fixed under this Act, shall commence from such date as may be prescribed. 1[33A. Members of an Authority to cease to be members in certain circumstances. An elected, appointed or nominated member of any Authority shall cease to be a member if he___ (a) absents himself, without the leave of such Authority, from three consecutive meetings thereof; of (b) accepts any assignment which involves his absence from the University for a period of six months or more.] 34. Filling of casual vacancies in Authorities. Any casual vacancy among the elected, appointed or nominated members of any Authority shall be filled, as soon as may be, any the person or persons or the body who elected, appointed or nominated the member whose place has become vacant and the person elected, appointed or nominated to vacancy shall be a member of such Authority for the residue of the term for which the person whose place he fills would have been a member. 35. Filling of vacancies in Authorities in certain circumstances. Where a vacancy in the membership of an Authority cannot be filled because of— (a) the office the holder whereof was to be a member of the Authority ex-officio having ceased to exist; (b) the organization, institution or other body, other than the University, having ceased either to exist or to function; (b) the occurrence of other circumstances in which it has become impracticable to fill the vacancy, the vacancy shall be filled in such manner as the Pro-Chancellor may direct. 36. Disputes about membership of Authorities. If a question arises whether any person is entitled to be a member of any Authority, the matter shall be referred to a committee consisting of the Vice-Chancellor, the Judge of the Supreme Court of Pakistan who is a member of the Executive Council and the most senior of the Deans who are members of the Executive Council and the decision of this committee shall be final and binding. 37. Proceeding of Authorities not invalidated by vacancies. No act, proceeding, resolution or decision of any Authority shall be invalid by reason only of any vacancy in, or any defect in the constitution of, or in the election, appointment or nomination of any member of, the Authority. 38. First Statutes. Notwithstanding anything to the contrary contained in this Act, until Statutes are framed, amended or replaced by new Statutes framed in accordance with this Act,— 1Ins by the Allama Iqbal Open University (Amdt.) Ordinance, 1981 (8 of 1981), S.8. (i) the Statutes set out in the Schedule shall be deemed to be Statutes framed under section 24; and (ii) the Statutes made under the 1[Quaid-e-Azam University] Act, 1973, (XXVVII of 1973) in respect of the terms and conditions of service of officers, Teachers and other employees shall apply to the officers, Teachers and other employees of the University. 39. Removal of difficulties. If any difficulty arises as to the first constitution of any Authority or otherwise in giving effect to the provisions of this Act, the Pro-Chancellor may, on the recommendation of the Vice-Chancellor, give appropriate directions to remove such difficulty. 2[40. Tripartite mobility.—(1) Any officer, teacher or other employee of the University shall, as the Chancellor may direct, serve in a Government department or an educational or research institution in the public interest: Provided that the terms and conditions offered to him shall not be less favourable than those admissible to him in the University and that full benefit of his previous service shall be allowed to him: Provided further that, in the case of a teacher, such direction shall be made after consulting the Syndicate. (2) The Chancellor may place the services of an employee of the Government or any other University or an educational or research institution at the disposal of the University in the public interest: Provided that the terms and conditions offered to him shall not be less favourable than those enjoyed by him immediately before his services are placed at the disposal of the University and that full benefit of his previous service shall be allowed to him: Provided further that, in the case of a teacher, the Chancellor may consult the Selection Board of the University before placing his services at the disposal of the University.]. THE SCHEDULE (See section 38) THE FIRST STATUTES 1. The Faculties.__ (1) The University shall include the following Faculties and such other Faculties as may be prescribed by Statutes, namely :__ (i) Faculty of Arabic and Islamic Studies : 1 Subs., by the Federal Laws (Revision and Declaration) Ordinance, 1981 (27 of 1981), s.3 and Sch.II. 2 The original section 40 which was ins. by Ord. 2 of 1981, s. 5. have been subs. by the Allama Iqbal Open University (Amdt.) Ordinance, 1981 (8 of 1981), s. 9. (ii) Faculty of sciences; (iii) Faculty of Social Sciences and Humanities; (iv) Faculty of Pedagogy, Continuing Education and Adult Literacy; (v) Faculty of Technical and Vocational Education; (vi) Faculty of Home Economics. (2) There shall be a Board of each Faculty which shall consist of— (i) the Dean of the Faculty to be 1[appointed] in the manner prescribed in paragraph (2) of Statute 2; (ii) the Professors, Associate Professors, Assistant Professors, Lecturers 1[, The Chairman of the Teaching Departments and the Directors of the Institutes] comprised in the Faculty ; (iii) two members of each Committee of Courses comprised in the faculty, to be nominated by the Committee concerned; and (iv) three specialists or Teachers to be nominated by the Academic Council by reason of their specialised knowledge of the subjects which, though not assigned to the Faculty, have, in the opinion of the Academic Council, important bearing on the subjects assigned to the Faculty. (3) The term of members mentioned in clauses (iii) and (iv) of paragraph (2) shall be three years. (4) The quorum for a meeting of the Board of a Faculty shall be one-third of the total number of members, a fraction being counted as one. (5) The Board of each Faculty shall, subject to the general control of the Academic Council and the Executive Council, have the power— (a) to coordinate the teaching and development of courses in various media of communication and research work in the subjects assigned to the Faculty in consultation with the Committee for Research and Educational Technology. (b) to scrutinize the recommendations of the Committee of Courses comprised in the Faculty in regard to the appointment of editors, consultants, course assessors, paper setters and examiners, except for research examiners, and to forward the panels of suitable editors, paper setters and examiners for each course and examination to the Vice­Chancellor; 1 Subs. by the Allama lqbal Open University (Amdt.) Ordinance, 1981 (8 of 1981), s. 10. (c) to consider any other academic recommendations of the Committee of Course and to report thereon to the Academic Council in consultation with the Committee for Research and Educational Technology; (d) to consider and give advice on any matter referred to it by any Authority or body of the University for advice; and (e) to perform such other functions as may be prescribed by Statutes. 2. Dean.___(1) There shall be a Dean of each Faculty who shall be the Chairman and convener of the Board of the Faculty. 1[(2) The Dean of each Faculty shall be appointed by the Chancellor from amongst the three most senior Professors in the Faculty for a period of three years.] (3) The Dean shall hold office for 2[three] years. (4) The Dean shall present candidates for admission to degrees (except honorary degrees) in the courses falling within the purview of the Faculty. (5) The Dean shall be the executive and academic head of the Faculty and supervise and control the heads of departments in the Faculty. (6) The Dean shall exercise such other powers and perform such other duties as may be assigned to him by the Vice-Chancellor. 1[3. Teaching Departments and Institutes, etc.—(1) There shall be a Teaching Department or an Institute for each subject or group or subjects, as may be approved by the Executive Council, and each Teaching Department shall be headed by a Chairman and an Institute by a Director. (2) The Chairman of a Teaching Department or the Director or an institute shall be appointed by the Syndicate on the recommendation of the Vice-Chancellor from amongst the three most senior Professors and Associate Professors of the Department or, as the case may be, the Institute for a period of three years: Provided that in Departments or Institutes in which there is no professor or Associate Professors, the Department or, as the case may be, the Institute shall be looked after by the Dean of the Faculty with the help and assistance of the most senior teacher of the Department or the Institute. (3) The Chairman of a Teaching Department and the Director of an Institute shall plan, organize and supervise the work of the Department and the Institute, respectively, and shall be responsible to the Dean for the work of his Department and the Institute, respectively.] 4. Committee of Courses.—(1) There shall be a separate Committee of Courses for each subject or group of subjects, as may be approved by the Vice-Chancellor. 1 Subs. by the Allama lqbal Open University (Amdt.) Ordinance, 1981 (8 of 1981) s. 10. 2 Subs. ibid., for \"two\". (2) Each Committee of Courses shall consist of— (i) the Chairman of the Department 1[or the Director of an Institute] concerned; (ii) all Professors, Associate Professors, Assistant Professors and Lecturers in the Department 1[or the Institute] concerned; (iii) three Teachers of at least five years standing, other than University Teachers, to be appointed by the Executive Council; and (iv) one expert to be appointed by the Vice-Chancellor. (3) The term of office of members of the Committee of Courses other than ex-officio members shall be three years. (4) The quorum for a meeting of the Committee of Courses shall be one third of the number of members, a fraction being counted as one. (5) The Chairman of the University Department 1[or the Director of Institute] concerned shall be the Chairman and convener of the Committee of Courses. Where in respect of a subject there is no University Teaching Department 1[or Institute], the Chairman of the Committee of courses shall be appointed by the Vice-Chancellor. (6) The functions of the Committee of Courses shall be— (a) to advise the Authorities on all academic matters connected with instruction, research and examination in the subject or subjects concerned; (b) to propose curricula and syllabi for all degree, diploma and certificate courses in the subject or subjects concerned and produce correspondence packages, television and broadcast scripts for approval by the Faculty after seeking clearance from the Committee for Research and Educational Technology; (c) to suggest a panel of names of paper setters and examiners in the subject or subjects concerned; and (d) to perform such other functions as may be prescribed by Regulations. 5. Committee for Research and Educational Technology.— (1) The committee for Research and Educational Technology shall consist of— (i) the Vice-Chancellor who shall be its Chairman; (ii) the Dean; (iii) Chairman of Departments 2[or the Directors of Institutes]; 1 Ins, by the Allama lqbal Open University (Arndt.) Ordinance, 1981 (8 of 1981), S. 10. 2 Added ibid., (iv) six Teachers of other Universities having research qualifications and experience, to be appointed by the Academic Council; (v) four Educational Media Advisers, one each for Correspondence Courses, Radio, Television and Films Divisions; (vi) one nominee each of the chief executives of the Pakistan Television and Broadcasting Corporations; and (vii) the Registrar and Treasurer as non-voting members. (2) The term of office of the members of the Committee for Research and Educational Technology other than ex-officio members shall be three years. (3) The quorum for a meeting of the Committee for Research and Educational Technology shall be one half of the total number of members, a fraction being counted as one. (4) The functions of the Committee for Research and Educational Technology shall be— (i) to advise the Authorities on all matters connected with the promotion of various types of courses as recommended by the Committee of Courses; (ii) to consider and report to the Authorities on the proposals for production of films and broadcast scripts; (iii) to appoint supervisors for research in Educational Technology and contents of courses and to determine the terms of reference; (iv) to recommend panels of names of assessors and consultants in various techniques for approval of the Vice-Chancellor; (v) to advise the Faculties in proposing courses of study and supporting radio and television programmes ; (vi) to advise the University authorities on such matters as are referred to it; and (vii) to perform such other functions as may be assigned to it by the Vice-Chancellor. 6. Selection Board.—(1) The Selection Board shall consist of— (i) the Vice-Chancellor who shall be its Chairman; (ii) one member of the Federal Public Service Commission to be nominated by the Chairman of the Commission; (iii) a nominee of the Ministry of Education not below the rank of a Joint Educational Adviser; (iv) the Dean of the Faculty concerned; (v) the Chairman of the Department 1[or the Director of the Institute] concerned; and (vi) one member of the Executive Council and two other persons of eminence, to be nominated by the Pro-Chancellor provided that none of the three is an employee of the University. (2) The term of members mentioned in clauses (ii) and (vi) of paragraph (1) shall be two years. (3) The quorum for a meeting of the Selection Board shall be three. (4) No Member who is a candidate for the post to which appointment is to be made shall take part in the proceedings of the Board. (5) In selecting candidates for the post of Professors, Senior Instructors, Associate Professors, Instructors and other Technical staff required for production of teaching material, the Selection Board shall coopt or consult three experts in the subject concerned and, in selecting candidates for other teaching posts, two experts in the subject concerned, to be nominated by the Vice-Chancellor from a standing list of experts for each subject approved by the Executive Council on the recommendation of the Selection Board and revised from time to time. 7. Functions of Selection Board.—(1) These Selection Board shall consider the applications received in response to an advertisement and recommend to the Executive Council the names of suitable candidates for appointment to such posts. (2) The Selection Board may recommend to the Executive Council the grant of a higher initial pay in a suitable case for reasons to be recorded. (3) The Selection Board may recommend to the Executive Council the appointment of an eminently qualified person to a Professorship in the University on terms and conditions which differ in any particular from those prescribed. (4) In the event of an unresolved difference of opinion between the Selection Board and the Executive Council the matter shall be referred to the Pro-Chancellor whose decision shall be final. 8. Finance Committee.—(1) The Finance Committee shall consist of— (i) the Vice­Chancellor, who shall be its Chairman; (ii) two members of the Executive Council, to be appointed by the Executive Council; (iii) two members of the academic council to be appointed by the Academic Council ; (iv) one member to be nominated by the Pro­Chancellor; (v) one member to be nominated by the Ministry of Finance; 1 Ins. by the Allama Iqbal Open University (Arndt.) Ordinance, 1981 (8 of 1980, s. 10. (vi) the Registrar; and (vii) the Treasurer who shall act as Secretary of the Committee. (2) The terms of office of the members other than the ex-officio members shall be three years. (3) The quorum for a meeting of the Finance Committee shall be three. 9. Functions of the Finance Committee.—(1) The functions of the Finance Committee shall be____ (i) to consider the annual statement of accounts, the annual revised budget estimates and advise the Executive Council, thereon; (ii) to review periodically the financial position of the University; (iii) to advise the Executive Council on all matters relating to physical planning, development, finance, investments and accounts of the University and proposals having any immediate or consequential financial involvements or such other matters as may be referred to it by the Executive Council; and (iv) to perform such other functions as may be prescribed by Statutes. 10. The Academic, Planning and Development Committee. —(1) The Committee shall consist of___ (i) the Vice-Chancellor who shall be its Chairman; (ii) the Deans; 1[(iii) the Chairmen of Teaching Departments or the Directors of Institutes;] (iv) one nominee each of the chief executives of the Pakistan Television and Broadcasting Corporations; (v) the Treasurer; and (vi) the Registrar, who shall act as the Secretary of the Committee. (2) The term of office of the members mentioned in clause (iv) of paragraph (I) shall be three years. (3) The quorum for the meetings of the Academic Planning and Development Committee shall be five. 1 Subs. by the Allama Iqbal Open University (Amdt.) Ordinance, 1981 (8 of 1981), s. 10. 11. The functions of the Academic, planning and Development Committee. The functions of the Academic, Planning and Development Committee shall be___ (i) to review periodically the courses of study in the various media of communication with a view to improving them; (ii) to make recommendations to the Committee for Research and Technology and Committee of Courses for changes or modifications in courses in the light of experience and research studies; (iii) to prepare proposals for introduction of new courses at the various levels for consideration of Committee for Research and Educational Technology, Committee of the Courses and Faculties ; (iv) to advise the Executive and Academic Councils on all matters related to academic, planning and development of academic programmes and facilities; (v) to prepare proposals for the implementation of the recommendations of the Committee for Research and Educational Technology; and (vi) to advise on such other matters as are referred to it by the Vice-Chancellor."
}