{
  "file": "administratordbbced85c2a2e033ef5ef0acced5dc89.pdf",
  "law_name": "The National University Of Computer And Emerging Sciences Ordinance, 2000",
  "text": "THE NATIONAL UNIVERSITY OF COMPUTER AND EMERGING SCIENCES ORDINANCE, 2000 CONTENTS 1. Short title and commencement 2. Definitions 3. Establishment and incorporation of the University 4. Powers and functions of the University 5. University open to all 6. Teaching and examinations 7. Authorities of the University 8. Officers of the University 9. Patron 10. Visitation 11. Rector 12. Board of Trustees 13. Powers and functions of the Board of Trustees 14. Board of Governors 15. Powers and functions of the Board 16. Meetings of the Board 17. Academic and administrative staff 18. University fund, audit and accounts 19. Academic Council 20. Powers and duties of the Academic Council 21. Constitution, functions and powers of authorities 22. Appointment of Committees by certain authorities 23. Statutes 24. Indemnity and bar of jurisdiction 25. Removal of difficulties THE SCHEDULE 1. Faculties 2. Board of Faculty 3. Functions of the Board of Faculty 4. Dean 5. Academic Departments and Head of Department 6. Board of Advanced Studies and Research 7. Functions of Board of Advanced Studies and Research 8. Selection Board 9. Functions of the Selection Board 10. Finance and Planning Committee 11. Functions of the Finance and Planning Committee THE NATIONAL UNIVERSITY OF COMPUTER AND EMERGING SCIENCES ORDINANCE, 2000 ORDINANCE No. XXIII OF 2000 [1st July,2000] An Ordinance to provide for the establishment of a National University of Computer and Emerging Sciences WHEREAS it is in the interest of the country to establish centres of excellence in the emerging disciplines of science and technology to provide a strong base for economic growth and human development and to provide quality education to talented students; AND WHEREAS it is expedient to provide for the establishment of a National University of Computer and Emerging Sciences, and for matters ancillary thereto; AND WHEREAS the National Assembly and the Senate stand suspended in pursuance of the Proclamation of Emergency of the fourteenth day of October, 1999, and the Provisional Constitution Order No. I of 1999; AND WHEREAS the President is satisfied that circumstances exist which render it necessary to take immediate action; NOW, THEREFORE, in pursuance of Proclamation of the Fourteenth day of October, 1999, and Provisional Constitution Order No. 1 of 1999, as well as Order No. 9 of 1999, and in exercise of all powers enabling him in that behalf, the President of the Islamic Republic of Pakistan is pleased to make and promulgate the following Ordinance:— 1. Short title and commencement.___ (1) This Ordinance may be called the National University of Computer and Emerging Sciences Ordinance, 2000. (2) It shall come into force at once. 2. Definitions.___ In this Ordinance, unless there is anything repugnant in the subject or context,— (a) “Academic Council” means the Academic Council of the University; (b) “Authority” means any of the authorities of the University specified in section 7; (c) “Board” means the Board of Governors of the University; (d) “Board of Trustees” means the Board of Trustees of the University: (e) “Chancellor” means the Chancellor of the University; (f) “Dean” means the Dean of a Faculty of the University; (g) “Faculty” means the Faculty of the University; (h) “Foundation” means Foundation for Advancement of Science and Technology (FAST) registered under the Societies Registration Act, 1860 (XXI of 1860) ; (i) “Head” means Head of a teaching department of the University; (j) “Patron” means the Patron of the University; (k) “prescribed” means prescribed by Statutes, Regulations or Rules; (l) “Rector” means the Rector of the University; (m) “Registrar” means the Registrar of the University; (n) “Statutes”, “Regulations and Rules” means the Statutes, the Regulations and the Rules made, or deemed to have been made, under this Ordinance; (o) “teachers” includes the Professors, Associate Professors, Assistant Professors, Lecturers and research staff engaged by the University for teaching graduate or post graduate classes and such other persons as may be declared as “Teachers” by the Board; (p) “teaching department” means a teaching department established and maintained by the University; and (q) “University” means the National University of Computer and Emerging Sciences. 3. Establishment and incorporation of the University.___ (1) There shall be established at Islamabad a University to be called the National University of Computer and Emerging Sciences consisting of— (a) the Patron, the Chancellor, the Rector, the Deans and the members of the Board of Trustees and the Board of Governors; (b) the members of such councils, committees and other bodies as the respective Boards may establish; (c) the teachers and students of the University and its constituent units; and (d) such other officers and members of the staff as may, from time to time, be specified by the respective Board. (2) The University shall be a body corporate by the name of the National University of Computer and Emerging Sciences having perpetual succession and a common seal, with power, among others, to acquire, hold and dispose of any property or investments and shall by the said name sue and be sued. (3) The University will be a multi-campus university with its principal seat at Islamabad and in addition to Foundation's existing institutes at Islamabad, Lahore and Karachi, may set up any number of campuses, colleges and Institutes at such places in Pakistan as the board may determine. (4) The University shall receive and abide by the directives issued by the Foundation from time to time in furtherance of the Foundation's objectives. 4. Powers and functions of the University.— The University shall have the powers— (a) to provide for instruction and training in computer and emerging sciences and in such allied branches of learning as it may deem fit; and to make provision for research, demonstrations and other services, and for the advancement and dissemination of knowledge in such manner as it may determine; (b) to admit and examine students; (c) to hold examinations and confer or award degrees, diplomas, certificates and other academic distinctions on and to persons who have passed its examinations under prescribed conditions; (d) to select and promote faculties; (e) to confer honorary degrees; (f) to prescribe courses of studies in computer and emerging sciences and such other branches of learning as the University may determine; (g) to pursue research; (h) to establish and support other facilities for education, training and research; (i) to decide teaching methods and strategies in order to ensure the most effective educational and training programmes; (j) to use its financial and other resources to the fullest extent for the execution of its programmes; (k) to enter into agreements, contracts and arrangements with organizations, institutions, bodies and individuals for carrying out its functions and activities; (l) to affiliate or associate itself with other institutions for effective discharge of its functions and responsibilities; (m) to provide for the teaching of specified courses and training for persons not being the students of the University and grant certificates and diplomas to such persons; (n) to establish, administer and maintain halls of residence and approve any place as hostel or lodging for students; (o) to recognise the examinations passed or the period of study spent at other universities or places of learning as equivalent to examinations or periods of study in the University or to withdraw such recognition; and (p) to do all such other acts and things as may be required to further its objectives. 5. University open to all.___ The University shall be open to persons of either sex of whatever religion, race, creed, colour or domicile who are academically qualified for admission to the courses of study offered by the University and no such person shall be denied the privileges of the University on the ground only of sex, religion, creed, race, class, colour or domicile. 6. Teaching and examinations.___ (1) The academic programmes of the University shall be conducted in the prescribed manner. (2) The University may associate external examiners for the conduct of examinations. (3) No degree shall be granted unless a students has passed an examination in Islamic and Pakistan Studies at the Bachelor's degree level or, in the case of a non-Muslim student, in Ethics and Pakistan Studies at his option. 7. Authorities of the University.____ The authorities of the University shall consist of— (i) Academic Council; (ii) Advanced Studies and Research Board; (iii) Board of Governors; (iv) Board of Trustees; (v) Finance and Planning Committee; (vi) Selection Board; and (vii) such other authority as may be specified by regulations to be the authority. 8. Officers of the University. The following shall be the officers of the University namely:— (a) the Chancellor who shall be appointed by the Patron on the recommendation of the Foundation; (b) the Rector; (c) the Deans; (d) the Heads of teaching departments; (e) the Registrar; and (f) such other persons as may be specified by regulations to be officers. 9. Patron.___ (1) The President of the Islamic Republic Of Pakistan shall be the Patron of the University. (2) The Patron, or in his absence, the Chancellor shall preside at the convocation of the University. (3) Every proposal to confer an honorary degree shall be subject to confirmation by the Patron. 10. Visitation.___ (1) The Chancellor may cause an inspection or inquiry to be made in respect of any matter connected with the affairs of the University and shall, from time to time, direct any person or persons to enquire into or carry out inspection of— (i) the University, its buildings, laboratories, libraries, and other facilities; (ii) any institution, department, school, college or hostel maintained by the University; (iii) the adequacy of financial and human resources; (iv) the teaching, research, curriculum, examinations and other matter of the University; and (v) such other matters as may be specified by him. (2) The Chancellor shall communicate to the Board his views with regard to the result of visitation and shall, after ascertaining the views of the Board, advise the Board on the action to be taken by it. . (3) The Board shall, within such time as may be specified by the Chancellor, communicate to him such action, if any, as has been taken or may be proposed to be taken upon the results of visitation. (4) Where the Board, within the time specified, does not take action to the satisfaction of the Chancellor, the Chancellor may issue such directions as he thinks fit and the Board shall comply with all such directions. 11. Rector.___ (1) The Chancellor shall, on the recommendation of the Board of Trustees appoint an eminent scholar and an educationist of distinction as Rector for a period of four years and on such terms and conditions as he may determine. (2) The Rector shall be the chief academic and administrative officer of the University and shall be responsible for the implementation of the decisions of the Board and for the execution of the programmes of the University in accordance with the guidelines and policies formulated by the Board and shall be responsible for implementing the decisions of the Board of Trustees. (3) The Rector shall— (a) submit plans of work and budget estimates of the University for the consideration of the Board; (b) direct the activities connected with the execution of programmes for instruction, training, research, demonstration, services to community, etc; (c) authorise expenditure provided for in the approved budget; (d) re-appropriate funds within the approved budget and report it to the Board in the next meeting; (e) appoint, with the approval of the Board, teachers, officers and members of the staff of the University and such other persons as may be necessary in accordance with policies and procedures approved by the Board so as to ensure the highest intellectual and moral qualities in the persons appointed; (f) submit to the Board, in accordance with the rules of procedure made by it, reports on the activities of the University and the execution of the plans of work; (g) create and fill temporary posts for a period not exceeding six months; and (h) undertake any work assigned by the Board of Trustees. 12. Board of Trustees.___ (1) There shall be a Board of Trustees consisting of the following, namely:— (i) The Chancellor who shall be its Chairperson; (ii) Chairman, University Grants Commission or his nominee not below the rank of an officer of Basic Pay Scale 20; (iii) a retired judge of the Supreme Court of Pakistan or a High Court; (iv) a retired vice-chancellor or an eminent scholar; (v) two eminent scientists; (vi) two nominees of the Foundation; (vii) Rector; (viii) one nominee of the Board; and (ix) Secretary, Ministry of Education. (2) Members of the Board of Trustees referred to in clauses (iii), (iv) and (v) shall be nominated by the Foundation. (3) Members of Board of Trustees, other than ex-officio members, shall hold office for three years. (4) The quorum for the meeting of the Board of Trustees shall be one half of total number of the members, a fraction being counted as one. (5) The Chairperson may nominate any member of the Board of Trustees to act as Chairperson in his absence. (6) The Board of Trustees shall meet at least twice in a year on dates to be fixed by the Chairperson. 13. Powers and functions of the Board of Trustees.___ The Board of Trustees shall exercise the powers and perform the following functions, namely:— (a) To hold, control and administer the property, funds and resources of the University and borrow or raise funds for the purposes of the University upon such security as may be required; (b) to undertake responsibility for the financial viability of the University including responsibility for ensuring effectiveness of its operations, their continuity and preservation of the autonomy of the University; (c) to approve the draft statutes proposed by the Board of Governors; (d) to consider and pass the resolutions of the annual report, plan of work, statement of accounts and the annual budget estimates as recommended by the Board of Governors; (e) to appoint members of the Board and other authorities in accordance with the provision of this Ordinance; (f) to delegate powers to an authority or officer or a committee; and (g) to approve arrangements through which other institutions may become affiliated or associated with the University. 14. Board of Governors.___ (1) The general supervision and control of administrative, academic and financial affairs and the power to lay down the policies of the University shall vest in a Board of Governors consisting of the following members, namely:— (a) Rector who shall be the Chairperson of the Board; (b) one retired judge of the Supreme Court of Pakistan or a High Court, to be nominated by the Foundation; (c) Chairman, University Grants Commission, or his nominee not below the rank of an officer of Basic Pay Scale 20; (d) one vice-chancellor of a University to be nominated by the Foundation; (e) Secretary, Ministry of Education, or his nominee not below the rank of an officer of Basic Pay Scale 20; (f) one Dean to be nominated by the Board of Trustees in consultation with the Rector; (g) three persons, prominent in the field of their specialisation because of their experience and achievements, to be nominated by the Board of Trustees; and (h) Registrar of the University shall act as Secretary of the Board. (2) A nominated member of the Board shall hold office for a term of three years and shall be eligible for re-nomination on the expiry of his term unless the Board of trustees, for reason to be recorded, terminates his membership earlier. (3) The office of a nominated member of the Board shall become vacant if he resigns or fails to attend three consecutive meetings of the Board without sufficient cause or leave of absence. (4) A casual vacancy in the office of a member of the Board shall be filled by a person nominated by the authority which nominated the member whose vacancy is to be filled. (5) No act or proceedings of the Board shall be invalid by reason only of the existence of a vacancy in, or any defect in the constitution of, the Board. 15. Powers and functions of the Board.___ (1) The Board shall exercise the powers and perform the following functions, namely:— (a) to formulate or approve the principles, policies and plans governing the activities and operations of the University so as to facilitate research, teaching and other academic work; (b) to make rules and regulations; (c) to prepare or have prepared and revised from time to time rules and regulations for the efficient and effective operation of the University; (d) to create a component of the University such as faculties, departments, schools, colleges and institutions under its jurisdiction and to constitute such standing committees, councils and other administrative or academic advisory bodies, as it deems necessary, and review their work; (e) to consider plans of work and annual budget of the University for the approval of Board of Trustees; (f) to call for and consider reports relating to the activities of the University and the execution of the plans of work and to direct the Rector to furnish information relating to any matter specified by the Board; (g) to create such academic or administrative posts as it may deem necessary and to approve appointments to such posts as it may specify; (h) to appoint from amongst its members, committees or sub-committees as it may deem necessary; (i) to take all such initiatives as it may consider necessary or desirable for the efficient and effective management and functioning of the University; and (j) to lay down its own rules of procedure. (2) The Board may delegate any of its powers to the Rector subject to such conditions as it may deem fit to impose. 16. Meetings of the Board.___ (1) The Board shall meet at least twice in a year on dates to be fixed by the Rector. (2) A special meeting may be called at any time by the Patron, Chancellor or Rector or on a request by not less than five members of the Board to consider any matter of urgent nature. (3) In the case of a special meeting not less than ten clear days' notice shall be given to the members of the Board and the agenda of the meeting shall be restricted to the matter for which the special meeting is called. (4) The quorum for a meeting of the Board shall be one half of its members, a fraction being counted as one. (5) The decisions of the Board shall be expressed in terms of the views of the majority of the members present and voting and, if the members are equally divided, the Chairperson of the Board shall have, and exercise, a casting vote. 17. Academic and administrative staff.___ (1) The academic and administrative staff of the University shall be selected with a view to achieving its stated objectives and the basic criteria for their selection shall be the highest standards of competence, integrity and efficiency. (2) In the case of academic staff, academic qualification and fringe benefits shall not be less than those duly approved by the University Grants Commission for such appointments. 18. University fund, audit and accounts.___ (1) The University shall have a Fund to which shall be credited income from fees, donations, trusts, bequests, endowments, grants, contributions and any other sources. (2) No contribution, donation or grant which may directly or indirectly involve any immediate or subsequent financial liability of the University, or which may involve an activity not included in its programmes for the time being, shall be accepted without the prior approval of the Board of Trustees. (3) The accounts of the University shall be maintained in such form and in such manner as may be prescribed by rules. (4) The accounts of the University shall be audited each year within four months or the closing of the financial year of the University by a Chartered Accountant appointed by the Board of Trustees. (5) The accounts, together with the report of the auditor thereon, shall be submitted to the Board of Trustees for approval. (6) The auditor's report shall certify that the auditor has complied with the standards of audit and certification laid down by the Institute of Chartered Accountants of Pakistan. 19. Academic Council.___ (1) The Academic Council shall consist of— (i) the Rector who shall be its Chairperson; (ii) all the Deans; (iii) all the Heads of the teaching departments and institutes; (iv) all professors and Associate Professors of the University; (v) two Assistant Professors and two Lecturers to be nominated by the Board; (vi) three eminent persons, one each from the field of arts, sciences and engineering to be nominated by the Board; (vii) nominee of the University Grants Commission; and (viii) the Registrar as Secretary. (2) Members appointed by nomination shall hold office for three years. (3) The quorum for a meeting of the Academic Council shall be one-third of the total number of members, a fraction being counted as one. 20. Powers and duties of the Academic Council .___ (1) The Academic Council shall be the academic body of the University and shall, subject to the provisions of this Ordinance and the Statutes, have the powers to lay down proper standards of instructions, research, publications and examinations and to regulate and promote the academic life of the University. (2) In particular and without prejudice to the generality of the foregoing provisions, and subject to the provisions of this Ordinance and the Statutes, the Academic Council shall have the powers— (a) to advise the Board on academic matters; (b) to regulate the conduct of teaching, research, publications and examinations; (c) to regulate the admission of students to the courses of studies and examination in the University; (d) to regulate the conduct and discipline of the students of the University; (e) to propose to the Board schemes for the constitution and organisation of faculties and teaching departments; (f) to consider or formulate proposals for the planning and development of teaching and research in the University; (g) to make regulations prescribing the courses of studies; the syllabi and the outlines of tests for all University examinations subject to the approval of the Board; (h) to regulate the award of fellowships, scholarships, stipends, bursaries, exhibitions, medals and prizes; (i) to frame regulations for submission to the Board; (j) to appoint or nominate members to the various authorities in accordance with the provisions of this Ordinance; and (k) to perform such other functions as may be prescribed by Statutes. . 21. Constitution, function and powers of authorities.___ Subject to the provisions of this Ordinance, the constitution, functions and the powers of the authorities for which no specific provision has been made in this Ordinance shall be such as may be prescribed by Statutes. 22. Appointment of Committees by certain authorities.___ The Board of Trustees, the Board, the Academic Council and any other authorities may from time to time, appoint such standing, special or advisory committees as they may deem fit and may appoint such persons on these committees who are not members of the authorities appointing the committees. 23. Statutes.___ (1) Subject to the provisions of this Ordinance, Statutes may be made to regulate or prescribe all or any of the following matters, namely::— (a) creation of institutes and faculties; (b) service, pension and fringe benefits for University employees and terms and conditions of their service; (c) efficiency and discipline of the University employees;and (d) all matters required to be regulated under the statutes. (2) The Board shall propose draft of the Statutes for approval by the Board of Trustees which may approve them, or refer them back for reconsideration, and no Statute shall be valid until the Board of Trustees has approved it. (3) Notwithstanding anything contained in sub-section (2), the Statutes set out in the Schedule to this Ordinance shall be deemed to be the Statutes framed under this section and shall remain in force until they are rescinded or replaced by new Statutes framed in accordance with this Ordinance. 24. Indemnity and bar of jurisdiction.___ (1) No suit, prosecution or other proceeding shall lie against any person or authority for anything which is in good faith done or intended to be done under this Ordinance. (2) No decision taken, or act or thing done, by the Chancellor or the Board shall be called in question before any court or other authority. 25. Removal of difficulties.___ (1) If any difficulty arises in giving effect to any of the provisions of this Ordinance, the Chancellor may make such order, not inconsistent with the provisions of this Ordinance, as may appear to him to be necessary for removing the difficulty. (2) Where this Ordinance makes any provision for anything to be done, but no provision or no sufficient provision has been made as respects the authority of whom, or the time at which, or the manner in which, it should be done, then it shall be done by such authority, at such time, or in such manner as the Chancellor may direct. THE SCHEDULE [See section 23 (3)] 1. Faculties.___ There shall be a faculty for a teaching department or a group of teaching departments. The University shall include the following faculties and such other faculties as may be prescribed by the Board of Trustees: (a) Faculty of Computer Science and Software Engineering; (b) Faculty of Engineering Sciences; (c) Faculty of Economics, Business Management and Environmental Sciences; and (d) Faculty of New and Emerging Sciences. 2. Board of Faculty.___ (1) There shall be a Board of each Faculty which shall consist of— (a) the Dean of the Faculty; (b) the Professors and the Head of the teaching departments in the Faculty; (c) one member other than Professors and Head of each teaching department to be nominated by the Head of Department; (d) two teachers to be nominated by the Academic Council by reason of their specialized knowledge of the subjects which, though not assigned to the Faculty, have in the opinion of the Academic Council, important bearing on the subjects assigned to the Faculty; (e) two experts in the field from outside the University to be appointed by the Board; and (f) one member to be nominated by the Rector. (2) The members, other than ex-officio members, shall hold office for three years. (3) The quorum for a meeting of the Board of a Faculty shall be one-half of the total number of members, a fraction being counted as one. 3. Functions of the Board of Faculty.___ The Board of each Faculty shall, subject to the general control of the Academic Council and the Board, have the powers to — (a) co-ordinate the teaching, and research work in the subjects assigned to the Faculty; (b) scrutinise the recommendations of the Board of Studies comprising the Faculty with regard to the appointment or paper-setters and examiners for graduate and post graduate examinations and to forward the panels of suitable paper-setters and examiners for each examination to the Rector; (c) consider any other academic matter relating to the Faculty and report thereon to the Academic Council; (d) prepare a comprehensive annual report regarding the performance of each department, comprising the Faculty for presentation to the Academic Council; and (e) perform such other functions as may be prescribed by Statutes. 4. Dean.___ (1) There shall be a Dean of each Faculty who shall be the Chairperson and convener of the Board of Faculty. (2) The Dean shall be appointed by the Board from amongst the three most senior Professors of the Faculty on the recommendation of the Rector and shall hold office for a period up to three years and shall be eligible for re-appointment. (3) The Dean shall present candidates for admission to degree (except honorary degrees) in the courses falling within the purview of the Faculty. (4) The Dean shall have such powers and duties as may be prescribed by the Board on the recommendations of the Rector. 5. Academic Departments and Head of Department.___ (1) There shall be an academic department for each subject or a group of subjects as may be prescribed by Regulations and a head of department shall head each academic department. (2) The Head of an academic department shall be appointed by the Board on the recommendations of the Rector from amongst three senior most Professors other than any Professor already working as Dean for a period of three years and shall be eligible for re-appointment: Provided that in a department where there are less than three Professors, the appointment shall be made from amongst the three senior most Professors and Associate Professors of the department: Provided further that in a department in which there is no Professor or Associate Professor, no such appointment shall be made and the department shall be looked after by the Dean of the Faculty with the assistance of the senior most teacher of the department. (3) The Head of department shall plan, organise and supervise the work of the department and shall be responsible to the Dean for the work of his department. (4) The Head of department shall, under the general supervision of the Rector and the Dean, exercise all administrative, financial and academic powers and such other duties or powers as may be delegated to him. (5) The Head of department shall prepare a comprehensive annual report regarding the performance of department at the graduate and postgraduate levels. Faculty research and development and submit this report to the Dean of the Faculty for his evaluation. 6. Board of Advanced Studies and Research.___ (1) The Board of Advanced Studies and Research shall consist of— (a) Board Advanced Studies and Research the Rector who shall be its Chairperson; (b) all the Deans; (c) one University professor from each faculty other than Professors having experience in research in relevant field to be appointed by the Academic Council; (d) one University professor from each faculty other than Dean to be appointed by the Board; (e) one member to be nominated by the Rector; (f) three members from the relevant field Research Organisations and government departments to be nominated by the Board; and (g) the Registrar as Secretary. (2) The term of office of the members of the Board of Advanced Studies and Research, other than ex-officio members, shall be three years. (3) The quorum for a meeting of the Board of Advanced Studies and Research, shall be one- half of the total number of members, a fraction being counted as one. 7. Functions of Board of Advanced Studies and Research.___ The functions of the Board of Advanced Studies and Research shall be to— (a) advise the Authorities on all matters connected with the promotion of advanced studies and research publication in the University; (b) consider and report to the Authorities on the institution of research degrees in the University; (c) propose regulations regarding the award of research degrees; (d) appoint supervisors for postgraduate research students and to approve titles and synopses of their theses or dissertations; (e) recommend panels of names of examiners for evaluation of their other research examinations; and (f) perform such other functions as may be prescribed by Statutes. 8. Selection Board.— (1) The Selection Board shall consist of— (a) the Rector who shall be its Chairperson; (b) the Dean of the Faculty concerned; (c) the Head of the teaching department concerned; (d) one member of the Board to be nominated by the Board; (e) one eminent scientist or scholar to be nominated by the Board of Trustees; and (f) one expert in the subject to be nominated by the University Grants Commission. (2) The Registrar shall be the Secretary of the Selection Board. (3) The members, other than ex-officio members, shall hold office for three years. (4) The quorum for a meeting of the Selection Board shall be four. (5) No member who is a candidate for the post to which appointment is to be made shall take part in the proceedings of the Selection Board. (6) The selection of candidate for the posts of Professors and Associate Professors, the Selection Board shall co-opt or consult three experts in the subject concerned and in selecting candidates for other teaching posts two experts in the subject concerned, to be nominated by the Rector, from a standing list of experts for each subject approved by the Board on the recommendations of the Selection Board and revised from time to time. 9. Functions of the Selection Board. The functions of the Selection Board shall be— (a) to consider the applications and recommend to the Board the names of suitable candidates for appointment to teaching and other posts, as the case may be, and recommend suitable salary for the person concerned; (b) to consider all cases of promotion or selection of officers of the University and recommend the names of suitable candidates for such promotion or selection to the Board; (c) in the event of an unresolved difference of opinion between the Selection Board and the Board the matter shall be referred to the Board of Trustees whose decision shall be final. 10. Finance and Planning Committee.___ (1) The Finance and Planning Committee shall consist of— (a) the Rector who shall be its Chairperson; (b) all the Deans; (c) one member of the Board to be nominated by the Board; (d) one member of the Academic Council to be nominated by the Academic Council; (e) one nominee of the University Grants Commission; (f) the Registrar; and (g) one nominee of the Board of Trustees. (2) The term of office of the nominated members shall be three years. (3) The quorum for a meeting of the Finance and Planning Committee shall be four. 11. Functions of the Finance and Planning Committee.___ The functions of the Finance and Planning Committee Fund shall be to— (a) prepare the annuals statement of accounts and propose annual budget estimates and advise the Board thereon; (b) review periodically the financial position of the University: (c) advise the Board and Board of Trustees on all matters relating to finance, investments and accounts of the University; and (d) perform such other functions as may be prescribed by Statutes."
}