{
  "file": "administrator2fdb5ccd9d442238fd84fbcf1b8bafb8.pdf",
  "law_name": "The Dourine Act, 1910",
  "text": "THE DOURINE ACT, 1910 CONTENTS 1. Short title and extent 2. Definitions 3. Registration of horses 4. Appointment of inspectors and veterinary practitioners 5. Powers of inspector 6. Duties of inspector 7. Inspection of horses 8. Powers of veterinary practitioner 9. Compensation for horse destroyed, etc. 10. Settlement of compensation 11. Committees for hearing appeals 12. Appeals 13. Vexatious entries and searches 14. Rules 15. Penalties 16. Protection to persons acting under Act THE DOURINE ACT, 1910 lACT No. V OF 1910 [25th February, 1910] An Act to provide for the prevention of the spread of Dourine WHEREAS it is expedient to provide for the prevention of the spread of dourine; It is hereby enacted as follows:___ 1. Short title and extent.___(1) This Act may be called the , 1910. (2) This section extends to 2[the whole of Pakistan]: the rest of this Act extends only to such areas as the 3[Provincial Government] may, by notification in the 4[official Gazette], direct. 2. Definition.___ (1) In this Act, the expressions “inspector” and “veterinary practitioner” mean, respectively, the officers appointed as such under this Act, acting within the local limits for which they are so appointed. (2) The provisions of this Act in so far as they relate to entire horses shall, if the 3[Provincial Government], by notification as aforesaid, so directs, apply also to entire asses used for mule-breeding purposes. 3. Registration of horses.___ The 3[Provincial Government] may, by notification as aforesaid, make such orders as it thinks fit directing and regulating the registration of entire horses maintained for breeding purposes. 4. Appointment of inspectors and veterinary practitioners.___(1) The 3[Provincial Government] may, by notification as aforesaid, appoint any persons it thinks fit to be inspectors, and any qualified veterinary surgeons to be veterinary practitioners, under this Act, and to exercise and perform, within any area prescribed by the notification, the powers conferred and duties imposed by this Act upon such officers respectively. (2) Every person so appointed shall be deemed to be a public servant within the meaning of the Pakistan Penal Code (XLV of 1860). 5. Powers of inspector.___ An inspector may, subject to such rules as the 3[Provincial Government] may make in this behalf,– 1For Statement of Objects and Reasons, see Gazette of India, 1909, Pt. V, p. 96; for Report of Select Committee, see ibid., 1910, Pt. V, p. 27; and for Proceedings in Council, see ibid., 1909, Pt. VI, p. 157, and ibid., 1910, Pt. VI, pp. 13, 90 and 121, dated the 5th February, 1910, the 26th February 1910, and the 12th March, 1910, respectively. This Act has been extended to Baluchistan by notification under the Scheduled Districts Act, 1874, (14 of 1874), s. 5, see Gazette of India, 1916 Pt. II, p. 211. It has also been extended to the Leased Areas of Baluchistan, see G.G.O. 3 of 1950, and applied in the Federated Areas of Baluchistan, see Gaz. of India, 1937, Pt. I, p. 1499. 2Subs. by the Central Laws (Statute Reform) Ordinance, 1960 (21 of 1960), s. 3 and 2nd Sch. (with effect from the 14th October, 1955), for “all the Provinces and the Capital of the Federation” which had been subs. by A.O., 1949, for “the whole of British India”. 3Subs. by A.O., 1937, for “L.G.”. 4Subs. ibid., for “local Gazette”. (a) enter and search any building, field or other place for the purpose of ascertaining whether there is therein any horse which is affected with dourine; 1* (b) prohibit, by order in writing, the owner or keeper of any horse, which in his opinion is affected with dourine, from using such horse for breeding purposes, pending examination by the veterinary practitioner ; 2[(c) direct, by order in writing, the owner or keeper of any horse which, in the opinion of the inspectors, is affected with dourine to remove it or permit it to be removed for the purpose of segregation to a place specified in the order, and such direction shall be sufficient authority for the detention of the horse in that place for that purpose.] 6. Duties of inspector.___ An inspector issuing an order under section 5, 3* * shall forthwith forward a copy of such order to the veterinary practitioner. 7. Inspection of horses.___ A veterinary practitioner receiving a copy of an order forwarded under section 6 shall, as soon as possible after receipt of such copy, examine the horse mentioned therein, and may for such purpose enter any building, field or other place. 8. Powers of veterinary practitioner.___ A veterinary practitioner may– (a) cancel any order issued under section 5 4* *; or (b) if on microscopical examination 5[ or by other scientific test] he finds that any horse is affected with dourine,___ (i) in the case of an entire horse, cause it to be castrated, 6(ii) in the case of a mare, with the previous sanction of such authority as the 7[Provincial Government] may appoint in this behalf, or, if so empowered by the 7[Provincial Government], without such sanction, cause it to be destroyed.] 9. Compensation for horse destroyed, etc.___ When any horse is castrated or destroyed under section 8, the market-value of such horse immediately before it became affected with dourine shall be ascertained; and the 7[Provincial Government] shall pay as compensation to the owner thereof___ (a) in the case of a mare which has been destroyed, or of an entire horse which has died in consequence of castration, such market-value, and, (b) in the case of an entire horse which survives castration, half the amount by which such value has been diminished owing to infection with dourine and castration. 1The words “and” omitted by the Dourine (Amdt.) Act, 1920 (8 of 1920), section 2. 2Clause (c) ins. ibid. 3The word, brackets and letter “clause (b)” omitted by the Dourine (Amdt.) Act, 1920 (8 of 1920), s.3. 4The word, brackets and letter “clause (b)” omitted ibid., s. 4. 5Ins. ibid., s. 4. 6Subs. ibid., for the original sub clause (ii). 7Subs. by A.O., 1937, for “L.G.”. 10. Settlement of compensation.___(1) A veterinary practitioner may award, as compensation to be paid under section 9 in respect of each horse castrated or destroyed under section 8, a sum not exceeding two hundred and fifty rupees. (2) If, in the opinion of the veterinary practitioner, the amount which should be paid as such compensation exceeds two hundred and fifty rupees, he shall report accordingly to the Collector, who shall decide the amount to be so paid. 11. Committees for hearing appeals.___ (1) The l[Provincial Government] shall, by rules published in the 2[official Gazette], make provision for the constitution of a committee or committees for the hearing of appeals from decisions under section 10. (2) Such rules shall provide that not less than one member of any committee constituted thereunder shall be a person not in the 3[service of the Government] or of a local authority. 12. Appeals.___ Any owner may, within two months from the date of a decision under section 10, appeal against such decision to the committee constituted in that behalf by rules made under section 11, and the decision of such committee shall be final. 13. Vexatious entries and searches.___ (1) Whoever, being an inspector appointed under this Act, vexatiously and unnecessarily enters or searches any field, building or other place, shall be punishable with imprisonment for a term which may extend to six months, or with fine which may extend to five hundred rupees, or with both. (2) No prosecution under this section shall be instituted after the expiry of three months from the date on which the offence has been committed. 14. Rules.___ (1) The l[Provincial Government] may make rules for the purpose of carrying into effect the provisions of this Act. (2) In particular, and without prejudice to the generality of the foregoing power such rules as aforesaid may___ 4[(a) regulate the exercise of the powers conferred on Inspectors under section 5;] (b) regulate the action to be taken by veterinary practitioners under section 8; 5* 5* * * * * * * (3) All such rules shall be published in the 6[official Gazette], and, on such publication, shall have effect as if enacted in this Act. (4) In making any rule under this section the 7[Provincial Government] may direct that a breach of it shall be punishable with fine which may extend to fifty rupees. 1Subs. by A.O., 1937, for “L. G.”. 2Subs. ibid., for “local official Gazette”. 3The original words “employ of Government” were first subs., by A.O., 1937, and then amended by A.O., 1961 Art. 2 (with effect from the 23rd March, 1956), to read as above. 4Subs. by the Dourine (Amdt.) Act, 1920 (8 of 1920), s. 5, for the original clause (a). 5The word “and” at the end of cl. (b), and cl. (c) omitted, ibid. 6Subs. by A.O., 1937, for “local official Gazette”. 7Subs. ibid., for “L, G.”. 15. Penalties.___ Whoever uses or permits to be used for breeding purposes– (a) any horse which has not been registered in accordance with the requirements of a notification under section 3. or 1[(b) any horse in respect of which an order under clause (b) or clause (c) of section 5 is in force,] shall be punishable with fine which may amount, in the case of a first conviction, to fifty rupees, or, in the case of a second or subsequent conviction, to one hundred rupees. 16. Protection to persons acting under Act.___ No suit, prosecution or other legal proceeding shall lie against any person for anything which is, in good faith, done or intended to be done under this Act. ___________ Date: 11-09-2024 1Subs. by the Dourine (Amdt.) Act, 1920 (8 of 1920), s. 6, for the original clauses (b) and (c)."
}