{
  "file": "administrator3713d47e24390ce8d2af2f60f121a670.pdf",
  "law_name": "Repealing And Amending Ordinance, 1961",
  "text": "THE PUBLIC ORDER (MEETINGS) ORDINANCE, 1958 CONTENTS 1. Short title, extent and commencement 2. Definitions 3. Disorderly conduct at public meeting 4. Carrying of offensive weapons 5. Insulting language and incitement 6. Offences to be cognizable and non-bailable 7. Penalty THE PUBLIC ORDER (MEETINGS) ORDINANCE, 1958 ORDINANCE NO. IX OF 1958 [1st July, 1958] An Ordinance to make provision for the preservation of public order on the occasion of public meetings and to prevent disturbance thereat. WHEREAS it is expedient to make provision for the preservation of public order on the occasion of public meetings and to prevent disturbance thereat; AND WHEREAS the National Assemble is not in session and the President is satisfied that circumstances exist which render immediate action necessary; NOW, THEREFORE, in exercise of the powers conferred by Article 69 of the Constitution and of all other powers enabling him in that behalf, the President is pleased to make and promulgate the following Ordinance, namely:___ 1. Short title, extent and commencement.___ (1) This Ordinance may be called the Public Order (Meetings) Ordinance, 1958. (2) It extends to the 1[Karachi Division]. (3) It shall come into force at once. 2. Definitions.___ In this Ordinance,___ (a) “meeting” means a meeting held for the purpose of the discussion of matters of public interest or for the purpose of the expression of views on such matters; (b) “public meeting” includes any meeting in a public place and any meeting which the public or any section thereof are permitted to attend, whether on payment or otherwise; (c) “public place” means any highway, public park or garden, any sea beach, and any public bridge, road, lane, footway, square, court, alley or passage, whether a thoroughfare or not; and includes any open space to which, for the time being, the public have or are permitted to have access, whether on payment or otherwise; (d) “public servant” has the same meaning as assigned to it in section 21 of the Pakistan Penal Code (Act XLV of 1860). 1 Subs. by A.O., 1964, Art. 2 and Sch., for “Federal Territory of Karachi” which had been subs. by the Repealing and Amending Ordinance, 1961 Ordinance No. I of 1961), s. 3 and 2nd Sch., for “Federal Capital”. 3. Disorderly conduct at public meeting.___(1) Any person who at a public meeting acts in a disorderly manner for the purpose of preventing the transaction of the business for which the meeting was called together shall be guilty of an offence. (2) Any person who incites others to commit an offence under this section shall be guilty of a like offence. 4. Carrying of offensive weapons.___ Any person, not being a public servant acting in his capacity as such, who, while present in a public meeting, has with him any offensive weapon shall be guilty of an offence. 5. Insulting language and incitement.___ Any person who in any public place or at any public meeting uses threatening, abusive or insulting words or behaviour with intent to provoke a breach of the peace or whereby a breach of the peace is likely to be occasioned shall be guilty of an offence under this Ordinance. 6. Offences to be cognizable and non-bailable.___ Notwithstanding anything in the Code of Criminal Procedure, 1898 (Act V of 1898), an offence under this Ordinance shall be cognizable and non-bailable. 7. Penalty.___ An offence under this Ordinance shall be punishable with rigorous imprisonment which may extend to two years, or with fine, or with both. _____________ Date: 23-12-2024"
}