{
  "file": "administrator96adf8fa0f924275586ee1a77b062568.pdf",
  "law_name": "THE RAILWAYS (TRANSPORT OF GOODS) ACT, 1947 CONTENTS",
  "text": "THE RAILWAYS (TRANSPORT OF GOODS) ACT, 1947 CONTENTS . 1 Short title, extent, commencement and duration. 2 Interpretation. 3 Power to give directions in regard to the transport of goods by railways. 4 Directions to be complied with. 5 Protection of action taken. 6 Power to amend Schedule. THE SCHEDULE See section 3 THE RAILWAYS (TRANSPORT OF GOODS) ACT, 1947 1ACT No. XII OF 1947 [17th March, 1947] An Act to confer for a limited period special powers for regulating the transport of goods on railways. WHEREAS it is expedient to confer for a limited period special powers for regulating the transport of goods on railways; It is hereby enacted as follows:‑ 1. Short title, extent, commencement and duration.__ (1) This Act may be called the Railways (Transport of Goods) Act, 1947. (2) It extends to 2[the whole of Pakistan]. (3) It shall come into force on the 25th day of March 1947, and shall remain in force for 3[ 4[thirty­one] years] only. 1For Statement of Objects and Reasons, see Gazette of India, 1947, Pt. V, p.16. This Act has been applied to Baluchistan with certain modification, see Gazette of India, 1947, Pt. I, p. 576. It has been extended to— (a) the Leased Areas of Baluchistan, see the Leased Areas (Laws) Order, 1950 (G. G. O. 3 of 1950); and (b) the Baluchistan States Union by the Baluchistan States Union (Federal Laws) (Extension) Order, 1953 (G. G. O. 4 of 1953), as amended. The Act has been and shall be deemed to have been brought into force in Gwadur with effect from the 8th September, 1958, by the Gwadur (Appli cation of Central Laws) Ordinance, 1960 (37 of 1960), s. 2. This Act has been further amended in its application to the Province of West Pakistan by the West Pakistan Act 14 of 1963 (with effect from the 19th July, 1963); and also by the West Pakistan Ordinance 4 of 1965, s. 2 (with effect from the 18th March, 1965). This Act has been amended on its application to the Province of W.P by W.P. Ordinance 4 of 1967. 2Subs. by the Railways (Transport of Goods) Act, 1957 (9 of 1957), s. 2, for “all the Provinces and the Capital of the Federation” which had been subs. by A. O., 1949, for “the whole of British India”. 3The original words “one year” have successively been amended by the Railways (Transport of Goods) (Amdt.) Act, 1948 (2 of 1948), the Railways (Transport of Goods) (Amdt.) Act, 1949 (2 of 1949), the Railways (Transport of Goods) (Revival and Continuance) Act, 1950 (34 of 1950), the Railways (Transport of Goods) (Continuance) Act, 1950 (81 of 1950), the Railways (Transport of Goods) (Continuance) Act, 1953 (21 of 1953), Act 9 of 1957, and the Railways (Transport of Goods) (Amdt.) Ordinance, 1960 (9 of 1960), to read as above. 4Subs. by the Railways (Transport of Goods) (Amdt.) Act, 1973 (46 of 1973),s.2 for “twenty­six”, which was previously amended by various enactments. 2. Interpretation. (1) In this Act,__ 1* * * * * * * (b) “grains and pulses” means bajree, barley, beans, black gram, chowlee seeds, chuni, dry cow‑peas, dhall, gram parched gram, horse gram Indian corn jowari, kara mony, khesari, moong, mussoor, mutt, oats, oorid, paddy, peas, raggi, rajgeera, rice (including beaten or pounded rice), common sago, sun‑dried tapioca, toor and wheat; (c) “railway administration” has the meaning assigned to it in the Railways Act, 1890 (IX of 1890). (2) For the purposes of this Act the transport of goods shall be deemed to be sponsored only if such transport__ (a) is required on the written demand of, or (b) is in accordance with any programme of transport drawn up in writing by, or (c) is certified in this behalf on the consignment note relating to the goods by __ the 2[Federal Government], a Provincial Government 3* * * or the Government of an 4[Acceding State], or any person au thorised in writing in this behalf by any such Government as aforesaid 5* * *. 3. Power to give directions in regard to the transport of goods by railways. The 6[Federal Government] or any person authorised in this behalf by the 6[Federal Government] by notification in the official Gazette may, by general or special order, direct any railway administration__ 7[(a) to give, subject to such conditions or restrictions as the 6[FederalGovernment] or the person so authorised may impose, special facilities or preference__ 1Clause (a) as amended by the Railways (Transport of Goods) (Amdt.) Act, 1957 (9 of 1957), omitted by A. O., 1964, Art. 2 and Sch. 2Subs. by the Railways (Transport of Goods) (Amdt.) Act, 1973 (46 of 1973),s.3, for “Central Government”. 3The words “the Chief Commissioner” which were subs. by Act 9 of 1957, for “a Chief Commissioner” omitted by A. O., 1964, Art. 2 and Sch. 4Subs. by the Federal Laws (Revision and Declaration) Act, 1951 (26 of 1951), s. 4 and 3rd Sch., for “Indian State”. 5The words “or by the Chief Commissioner”, as amended by Act 9 of 1957, omitted by A. O.. 1964. Art. 2 and Sch. 6Subs. by Act 46 of 1973, s.3, for “Provincial Government” which had been subs. by A. O., 1964, Art. 2 and Sch., for “Central Government”. 7Subs. by the Railways (Transport of Goods) (Amdt.) Act, 1949 (2 of 1949), s. 3, for the original clause (a). (i) for the transport of the goods specified in the second column of the Schedule, on compliance with the conditions, if any set out in the corresponding entry in the third column thereof, or (ii) if the 1[Federal Government] or the person so authorized deems it necessary for reasons of urgent public interest, for the transport of any goods or classes of goods not so specified, or] (b) to refuse to carry such goods or classes of goods as may be specified in the order, either absolutely or between places so specified. 4. Directions to be complied with. Notwithstanding anything to the contrary contained in the Railways Act, 1890 (IX of 1890), every railway administration shall be bound to comply with any direction given to it under section 3. 5. Protection of action taken. No suit or other legal proceedings shall lie against the 2[State] or any railway administration or any person for any damage caused or likely to be caused in consequence of any direc tion issued under section 3 or of the compliance of any railway administration therewith, nor shall any railway administration have any liability, whether under the Railways Act, 1890 (IX of 1890), or otherwise, by reason only of its compliance with any such direction. 6. Power to amend Schedule. The 1[Federal Government] may from time to time by notification in the official Gazette amend the Schedule so as to include therein goods of other descriptions or exclude therefrom goods of any description or vary in respect of any description of goods the conditions set out in the third column of the Schedule and thereupon the Schedule shall have effect as if it had been so enacted. _______ 1Subs. by the Railways (Transport of Goods) (Amendment) Act, 1973 (46 of 1973),s.4, for “Provincial Government”, which was previously amended by A.O., 1964, Art.2 and Sch.for “ Central Government”. 2Subs. by the Railways (Transport of Goods) (Amdt.) Ordinance, 1960 (9 of 1960),s.3, for “Crown”. 1[THE SCHEDULE (See section 3) Sl. No. (1) Description of goods (2) Condition for special transport facilities or preference. (3) 1. Stores (including medical stores) for relief in time of famine, rehabilitation of refugees, or other emergency. When transport is sponsored. 2. Arms, ammunitions, stores and equipment of Military and police, and stores and equipment of other Government Departments. Do. 3. Railway coal, materials, stores and equipment and coal for Port Trust. Nil. 4. Material and Stores of the Posts and Telegraphs Department. Nil. 5. Foods stuffs (tinned, canned, bottled, processed or packed), including fish, vegetables, condiments used in cooking and other perishables, all grains and pulses, wheat products and flour of other grains and pulses, ghee, butter, cooking fats, edible vegetable oils, salt (other than hide salt), sugar, gur, Jagree, and molasses. Nil. 6. Petroleum and all petroleum products, insecticides, water proofing compounds, explosives, arms and ammunitions. When consigned by Oil Companies or dealers and importers of explosives, petroleum products, arms and ammunitions. 1Subs. by the Railways (Transport of Goods) (Amdt.) Act, 1949 (2 of 1949),s.4,for the existing Schedule. Sl. No. (1) Description of goods (2) Condition for special transport facilities or preference. (3) 7. Medical stores, hospital equipment, Pharmaceutical goods and chemicals. Nil. 8. Empty gunnies and other containers for food, petroleum and petroleum products, and other industrial products. 9. Fuels such as coal (other than Railway coal), coke, firewood and char­coal. Nil. 10. Cotton, silk, woollen piece goods, blankets, twist yarn and cotton waste. Nil. 11. Cattle food and cattle fodder, manners and seeds. Nil. 12. Live Stock .. .. .. Nil. 13. Plant, materials and stores for maintenance and construction of buildings and roads and for industrial and agricultural development projects including the “grow more food” campaign, water­works, irrigation, Hydro­ electric and Sewage disposal schemes. Nil. 14. Plant, stores and raw materials for and finished products of the following:__ A. Factories:__ Ordnance, cement, fertilizers, jute pressing, match, non­ferrous and alloy, paper, chemical, cotton ginning and pressing, ice, bobbin, cigarettes, cigars and tobacco, Sl. No. (1) Description of goods (2) Condition for special transport facilities or preference. (3) glass and ceramic, paint and varnish, refractory, bricks, rubber, soap, starch, tanneries and leather boot and shoe, biscuits and confectionery, asbestos and asbestos cement, glue, jam, preserve and squash, mill board and straw board, aluminum, veneer and plywood, button, carpet, resin, machine and tools, hume pipe, opium and gas. b. Mills:__ Rice and flour, sugar, textile, vegetable ghee and vegetable oil and bone. C. Other Industrial Works:__ Iron and steel, collieries, distilleries, mineral oil production, electric and electric supply undertakings, printing presses (including security presses and mints), mining, breweries and potteries. 15. Raw materials such as cotton, silk, jute, wool, hides (including hide salts), pelts and skins, tea, coffee, timber, bamboos, tobacco, hair, hemp and lac. Nil. 16. Fruits (fresh and dry) including dates, coconuts ad ground nuts. Nil. 17. Air crafts, motor vehicles including tractors, motor cycles, cycles and their parts (including tyres and tubes). Nil. 18. Imported goods such as iron and steel, paper including newsprints, Nil. Sl. No. (1) Description of goods (2) Condition for special transport facilities or preference. (3) mica, and manganese, cigarettes and cigars, electrical appliances, equipments and fittings, including batteries and electrodes, kyanite, resin and rosins, pipe, books, stationery and school requirements and other consumer goods. 19. Aluminum, brass, copper, bronze, bell metal, zinc, antimony, lead and tin, nickel sheets, slabs, ingots, and finished products and scrap thereof. Nil. 20. Personal and household effects, furniture and motor cars of Government servants and senior business officials on transfer or retirement, and also household effects of others and records and stores of Government offices. Nil. 21. Wagons required for direct loading or unloading of ships in the port areas. Nil. 22. Other miscellaneous goods such as__ 1. Betel nuts. 2. Bidi and bidi leaves. 3. Grinding stone and grinding wheels. 4. Shooks and staves. 5. Samai. 6. Soap stone. 7. Varagu. 8. Canes. 9. Crucibles. 10. Myrabolams. 11. 1[100 Chrome Ore].] Nil. 1Added by the Ministry of Communications Notification No.1301­T., dated the 28th June, 1948, see Gaz. of P., 1948., Pt.I, p.316."
}