{
  "file": "administrator14909d11f691ce6528aa55ab6c9aa891.pdf",
  "law_name": "The Discontinuance Of Medical Reimbursement Act, 1972",
  "text": "THE DISCONTINUANCE OF MEDICAL REIMBURSEMENT ACT, 1972 CONTENTS 1. Short title, extent and commencement 2. Discontinuance of reimbursement of medical expenses 3. Supply of medicines under certain conditions 4. [Omitted] THE DISCONTINUANCE OF MEDICAL REIMBURSEMENT ACT, 1972 ACT No. XXV OF 1972 [25th September, 1972] An Act for the discontinuance of reimbursement of medical expenses incurred by Government servants and certain other employees WHEREAS it is expedient to discontinue reimbursement of medical expenses incurred by Government servants and employees of other bodies in the manner hereinafter appearing; AND WHEREAS the Proclamation of Emergency referred to in clause (8) of Article 139 of the Interim Constitution of the Islamic Republic of Pakistan is in force; It is hereby enacted as follows:― 1. Short title, extent and commencement.—(1) This Act may be called the Discontinuance of Medical Reimbursement Act, 1972. (2) It extends to the whole of Pakistan. (3) It shall come into force at once and shall be deemed to have taken effect on the 1st day of July, 1972. (4) It shall apply to— (i) all employees of the Federal and Provincial Governments whether serving in connection with affairs of the Federation or of a Province or on deputation to public corporations or statutory bodies; and (ii) all other employees of public corporations and statutory bodies. 2. Discontinuance of reimbursement of medical expenses. Notwithstanding anything contained in any law, rule, order or any instrument or contract, but subject to the provisions of section 3, no employee to whom this Act applies shall be entitled to claim reimbursement for any medicine purchased by him for the treatment of himself or any member of his family, whether the medicines are prescribed by the authorised medical attendant or other medical authority. 3. Supply of medicines under certain conditions. An employee to whom this Act applies may be allowed to get medicines prescribed for him or any member of his family by the authorised medical attendant in accordance with any rules or orders made by his employer and within the limits of the funds allocated for the purpose in the budget of the department or body under which he is employed. 4. 1[Omitted] RGN Date:-23.04.2024 1Omitted by the Federal Laws (Revision and Declaration) Ordinance, 1981 (XXVII of 1981), s. 3 and Sch., II."
}