{
  "file": "administrator48b083e7f2c44e28f6eb0a73477e8297.pdf",
  "law_name": "The Majority Act, 1875",
  "text": "THE MAJORITY ACT, 1875 CONTENTS Preamble 1. Short title Local extent Commencement and operation 2. Savings 3. Age of majority of persons domiciled in Pakistan 4. Age of majority how computed THE MAJORITY ACT, 1875 1ACT No. IX OF 1875 [2nd March, 1875] An Act to amend the Law respecting the age of majority Preamble. WHEREAS, in the case of person domiciled in 2[Pakistan], it is expedient to prolong the period of nonage, and to attain more uniformity and certainty respecting the age of majority than now, exists; It is hereby enacted as follows:— 1. Short title.—This Act may be called the 3* Majority Act, 1875. Local extent. 4[It extends to the whole of Pakistan; Commencement and operation. and it shall come into force and have effect only on the expiration of three months from the passing thereof. 2. Savings. Nothing herein contained shall affect— (a) the capacity of any person to act in the following matters (namely), marriage, dower, divorce and adoption; (b) the religion or religious rites and usages of any class of 5[citizens of] 6[Pakistan]; or 7* * * * * * * 3. Age of majority of persons domiciled in Pakistan. Subject as aforesaid, 8[every minor of whose person or property or both a guardian, other than a guardian for a suit within the meaning of 9[Order XXXII of the First Schedule to the Code of Civil Procedure, 1908 (Act V of 1908)], has been or shall be appointed or declared by any Court of Justice before the minor has attained the age of eighteen years, and every minor of whose property the superintendence has been or shall be assumed by any Court of Wards before the minor has attained that age] shall, notwithstanding anything contained in. the 10[Succession Act, 1925 (XXXIX of 1925)] or in any other enactment, be deemed to have attained his majority when he shall have completed his age of twenty-one years and not before. 1For the Statement of Objects and Reasons, see Gazette of India. 1874. Pt. V, p. 153; for Proceedings in Council, see ibid., Supplement, p. 668, and Extra Supplement, dated 12th May, 1874, p.4, and ibid., 1875, Supplement. p.333. It has been applied to Phulera in the Excluded Area of Upper Tanawal to the extent the Act is applicable in the N.W.F.P., subject to certain modifications, see N.W.F.P. (Upper Tanawal) (Excluded Area) Laws Regulation, 1950. It has been extended to the Excluded Area of Upper Tanawal other than (N.W.F.P.) Phulera by the N.W.F.P. (Upper Tanawal) (Excluded Area) Laws Regulation, 1950 and declared to be in force in that area with effect from 1st June, 1951, see N.W.F.P. Gazette, Extraordinary, dated 1st June. 1951. This Act has been declared to be in force in Balochistan, by the British Balochistan Laws Regulation, 1913 (2 of 1913). It has been extended to the Leased Areas of Balochistan. see the Leased Areas (Laws) Order, 1950 (G.G.O. 3 of 1950); and also applied in the Federated Areas of Balochistan see Gazette of India, 1937, Pt. I, p. 1499. 2Subs. by the Central Laws (Statute Reform) Ordinance, 1960 (21 of 1960), s. 3 and 2nd sch., (with effect from the 14th October, 1955), for “the Provinces and the Capital of the Federation” which had been subs. by A.O., 1949, Arts. 3(2) and 4, for “British India”. 3The word “Indian” omitted by A.O., 1949, Sch. 4Tbe original para. as amended by A.O. 1937, A.O., 1949. Arts. 3(2) and 4, and the Federal Laws (Revision and Declaration) Act, 1951 (26 of 1951), s. 4 and III Sch., has been subs. by Ord. 21 of 1960. s. 3 and 2nd Sch. (with effect from the 14th October. 1951) to read as above. 5Subs by A.O., 1961, Art. 2 and Sch: for “Her Majesty’s subject in” (with effect from the 23rd March. 1956). 6Subs by A.O., 1949, Sch., for “India”. 7C1ause (c) omitted by the Federal Laws (Revision and Declaration) Ordinance, 1981 (27 of 1981), s. 3 and IInd Sch. 8Subs by the Guardians and Wards Act,1890 (8 of 1890), s. 52, for “every minor of whose person or property a guardian has been or shall be appointed by any Court of Justice, and every minor under the jurisdiction of any Court of Wards”. 9Subs. by Ord. 27 of 1981, s.3 and 2nd Sch., for “Chapter XXXI of the Code of Civil Procedure”. 10Subs. ibid. for “Indian Succession Act (No. X of 1865)”. Subject as aforesaid, every other person domiciled 1[Pakistan] shall be deemed to have attained his majority when he shall have completed his age of eighteen years and not before. 4. Age of majority how computed. In computing the age of any person, the day on which he was born is to be included as a whole day, and he shall be deemed to have attained majority, if he falls within the first paragraph of section 3, at the beginning of the twenty-first anniversary of that day, and if he falls within the second paragraph of section 3, at the beginning of the eighteenth anniversary of that day. Illustrations (a) Z is born in 2[Pakistan] on the first day of January 3[1949], and has a 4[Pakistan] domicile. A guardian of his person is appointed by a Court of Justice. Z attains majority at the first moment of the first day of January 5[1970]. (b) Z is born in 6[Pakistan] on the twenty-ninth day of February 7[1948] and has a 8[Pakistan] domicile. A guardian of his property is appointed by a Court of Justice, Z attains majority at the first moment of the twenty eighth day of February 9[1969]. (c) Z is born on the first day of January 10[1948]. He acquires a domicile in 6[Pakistan]. No guardian is appointed of his person or property by any Court of Justice, nor is he under the Jurisdiction or any Court of Wards. Z attains majority at the first moment of the first day of January 11[1966]. __________ Date: 16-09-2024 1Subs. by the Central Laws (Statute Reform) Ordinance, 1960 (21 of 1960), s. 3 and 2nd Sch. (with effect from the 14th October, 1955), for “the Provinces and the Capital of the Federation”, which had been subs. by A.O. 1949. Arts 3(2) and 4 for “British India”. 2Subs. by Ord. 27 of 1981 s. 3 and 2nd Sch., for “the provinces” which was subs. by A.O. 1949, Sch., for “British India”. 3Subs. by the Federal Laws (Revision and Declaration) Act. 1951 (26 of 1951), s. 4 and III Sch., for “1850”. 4Subs. ibid., for “British Indian”. 5Subs. ibid., for”1871”. 6Subs. by the Federal Laws (Revision and Declaration) Ordinance, 1981 (27 of 1981), s. 3 and IInd Sch., for “the Provinces” which was subs. by A. O., 1949, Sch., for “British India”. 7Subs. by the Federal Laws (Revision and Declaration) Act, 1951 (26 of 1951), s. 4 and III Sch., for “1852)”. 8Subs. ibid., for “British India”. 9Subs. ibid., for “1873”. 10Subs. ibid., for “1850”. 11Subs. ibid., for “1868”."
}